title: Account Password Reset Remotely
id: 2820c9c2-bcd7-4d6e-9eba-faf3891ba450
status: stable
level: medium
description: 'Identifies an attempt to reset a potentially privileged account password
  remotely. Adversaries may manipulate account

  passwords to maintain access or evade password duration policies and preserve compromised
  credentials.'
author: Elastic (converted by SIEMLess)
date: '2021-10-18'
modified: '2025-11-14'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by winlog.computer_name with maxspan=1m\n  [authentication\
      \ where host.os.type == \"windows\" and event.action == \"logged-in\" and\n\
      \    /* event 4624 need to be logged */\n    winlog.logon.type : \"Network\"\
      \ and event.outcome == \"success\" and source.ip != null and\n    source.ip\
      \ != \"127.0.0.1\" and source.ip != \"::1\" and\n    not winlog.event_data.TargetUserName\
      \ : (\"svc*\", \"PIM_*\", \"_*_\", \"*-*-*\", \"*$\")] by winlog.event_data.TargetLogonId\n\
      \   /* event 4724 need to be logged */\n  [iam where host.os.type == \"windows\"\
      \ and event.action == \"reset-password\" and\n   (\n    /*\n       This rule\
      \ is very noisy if not scoped to privileged accounts, duplicate the\n      \
      \ rule and add your own naming convention and accounts of interest here.\n \
      \    */\n    winlog.event_data.TargetUserName: (\"*Admin*\", \"*super*\", \"\
      *SVC*\", \"*DC0*\", \"*service*\", \"*DMZ*\", \"*ADM*\") or\n    winlog.event_data.TargetSid\
      \ : (\"S-1-5-21-*-500\", \"S-1-12-1-*-500\")\n    )\n  ] by winlog.event_data.SubjectLogonId"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.impact
- attack.persistence
- attack.t1098
- attack.t1531
references:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4724
- https://stealthbits.com/blog/manipulating-user-passwords-with-mimikatz/
- https://github.com/sbousseaden/EVTX-ATTACK-SAMPLES/blob/master/Credential%20Access/remote_pwd_reset_rpc_mimikatz_postzerologon_target_DC.evtx
- https://www.elastic.co/security-labs/detect-credential-access
falsepositives:
- Legitimate remote account administration.
