title: Active Directory Discovery using AdExplorer
id: ff46eb26-0684-4da3-9dd6-21032c9878e1
status: stable
level: low
description: 'This rule detects the use of ADExplorer utility. Active Directory Explorer
  (AD Explorer) is an advanced Active Directory (AD)

  viewer and editor. AD Explorer also includes the ability to save snapshots of an
  AD database for off-line viewing and comparisons.

  Adversaries may abuse this utility to perform domain reconnaissance.'
author: Elastic (converted by SIEMLess)
date: '2025-09-01'
modified: '2025-09-01'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_pe_original_file_name: AdExp
  condition: selection
tags:
- attack.discovery
- attack.t1069.002
- attack.t1018
- attack.t1069
- attack.t1482
- attack.t1087.002
- attack.t1087
- attack.t1016
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/adexplorer
