title: Active Directory Group Modification by SYSTEM
id: 6f024bde-7085-489b-8250-5957efdf1caf
status: stable
level: medium
description: 'Identifies a user being added to an active directory group by the SYSTEM
  (S-1-5-18) user. This behavior can indicate

  that the attacker has achieved SYSTEM privileges in a domain controller, which attackers
  can obtain by exploiting

  vulnerabilities or abusing default group privileges (e.g., Server Operators), and
  is attempting to pivot to a domain

  account.'
author: Elastic (converted by SIEMLess)
date: '2024-06-26'
modified: '2025-04-23'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_code: '4728'
  condition: selection
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1098
