title: Adding Hidden File Attribute via Attrib
id: 4630d948-40d4-4cef-ac69-4002e29bc3db
status: stable
level: low
description: Adversaries can add the 'hidden' attribute to files to hide them from
  the user in an attempt to evade detection.
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_pe_original_file_name: ATTRIB.EXE
    process_command_line|contains:
    - '*drawio.bkp*'
    - '*drawio.dtmp*'
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1222.001
- attack.t1564
- attack.t1564.001
- attack.t1222
