title: AdFind Command Activity
id: eda499b8-a073-4e35-9733-22ec71f57f3a
status: stable
level: low
description: 'This rule detects the Active Directory query tool, AdFind.exe. AdFind
  has legitimate purposes, but it is frequently

  leveraged by threat actors to perform post-exploitation Active Directory reconnaissance.
  The AdFind tool has been

  observed in Trickbot, Ryuk, Maze, and FIN6 campaigns. For Winlogbeat, this rule
  requires Sysmon.'
author: Elastic (converted by SIEMLess)
date: '2020-10-19'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_pe_original_file_name: AdFind.exe
    process_args|contains: objectcategory=computer
  condition: selection
tags:
- attack.discovery
- attack.t1069.002
- attack.t1018
- attack.t1069
- attack.t1482
- attack.t1087.002
- attack.t1087
- attack.t1016
references:
- http://www.joeware.net/freetools/tools/adfind/
- https://thedfirreport.com/2020/05/08/adfind-recon/
- https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html
- https://www.cybereason.com/blog/dropping-anchor-from-a-trickbot-infection-to-the-discovery-of-the-anchor-malware
- https://www.fireeye.com/blog/threat-research/2019/04/pick-six-intercepting-a-fin6-intrusion.html
- https://usa.visa.com/dam/VCOM/global/support-legal/documents/fin6-cybercrime-group-expands-threat-To-ecommerce-merchants.pdf
