title: Adversary Behavior - Detected - Elastic Endgame
id: 77a3c3df-8ec4-4da4-b758-878f551dee69
status: stable
level: medium
description: 'Elastic Endgame detected an Adversary Behavior. Click the Elastic Endgame
  icon in the event.module column or the link in

  the rule.reference column for additional information.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-03-21'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_kind: alert
    event_module: endgame
    event_action: behavior_protection_event
    endgame_event_subtype_full: behavior_protection_event)
  condition: selection
