title: Alternate Data Stream Creation/Execution at Volume Root Directory
id: ff6cf8b9-b76c-4cc1-ac1b-4935164d1029
status: stable
level: medium
description: 'Identifies the creation of an Alternate Data Stream (ADS) at a volume
  root directory, which can indicate the attempt to

  hide tools and malware, as ADSs created in this directory are not displayed by system
  utilities.'
author: Elastic (converted by SIEMLess)
date: '2024-03-14'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
  condition: selection
tags:
- attack.defense_evasion
- attack.t1564.004
- attack.t1564
references:
- https://www.crowdstrike.com/blog/anatomy-of-alpha-spider-ransomware/
