title: Apple Scripting Execution with Administrator Privileges
id: 827f8d8f-4117-4ae4-b551-f56d54b9da6b
status: stable
level: medium
description: 'Identifies execution of the Apple script interpreter (osascript) without
  a password prompt and with administrator

  privileges.'
author: Elastic (converted by SIEMLess)
date: '2020-12-27'
modified: '2025-03-18'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
    process_name: osascript
  condition: selection
tags:
- attack.execution
- attack.privilege_escalation
- attack.t1059
- attack.t1078
references:
- https://discussions.apple.com/thread/2266150
