title: At Job Created or Modified
id: 84755a05-78c8-4430-8681-89cd6c857d71
status: stable
level: medium
description: 'This rule monitors for at jobs being created or renamed. Linux at jobs
  are scheduled tasks that can be leveraged by

  system administrators to set up scheduled tasks, but may be abused by malicious
  actors for persistence, privilege

  escalation and command execution. By creating or modifying cron job configurations,
  attackers can execute malicious

  commands or scripts at predefined intervals, ensuring their continued presence and
  enabling unauthorized activities.'
author: Elastic (converted by SIEMLess)
date: '2024-05-31'
modified: '2025-01-15'
logsource:
  product: linux
  category: file_event
detection:
  selection:
    host_os_type: linux
    file_Ext_original_extension: dpkg-new
    process_name: perl
    process_executable|contains:
    - /nix/store/*
    - /var/lib/dpkg/*
    - /tmp/vmis.*
    - /snap/*
    - /dev/fd/*
  condition: selection
tags:
- attack.execution
- attack.persistence
- attack.privilege_escalation
- attack.t1053
- attack.t1053.002
references:
- https://www.elastic.co/security-labs/primer-on-persistence-mechanisms
