title: Attempt to Install Root Certificate
id: bc1eeacf-2972-434f-b782-3a532b100d67
status: stable
level: medium
description: 'Adversaries may install a root certificate on a compromised system to
  avoid warnings when connecting to their command

  and control servers. Root certificates are used in public key cryptography to identify
  a root certificate authority

  (CA). When a root certificate is installed, the system or application will trust
  certificates in the root''s chain of

  trust that have been signed by the root certificate.'
author: Elastic (converted by SIEMLess)
date: '2021-01-13'
modified: '2025-03-18'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
    process_name: security
  condition: selection
tags:
- attack.defense_evasion
- attack.t1553
- attack.t1553.004
references:
- https://ss64.com/osx/security-cert.html
falsepositives:
- Certain applications may install root certificates for the purpose of inspecting
  SSL traffic.
