title: Attempt to Install Kali Linux via WSL
id: dd34b062-b9e3-4a6b-8c0c-6c8ca6dd450e
status: stable
level: high
description: 'Detects attempts to install or use Kali Linux via Windows Subsystem
  for Linux. Adversaries may enable and use WSL for

  Linux to avoid detection.'
author: Elastic (converted by SIEMLess)
date: '2023-01-12'
modified: '2025-08-28'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_args|contains:
    - -d
    - --distribution
    - -i
    - --install
    process_executable|contains:
    - ?:\\Users\\*\\AppData\\Local\\packages\\kalilinux*
    - ?:\\Users\\*\\AppData\\Local\\Microsoft\\WindowsApps\\kali.exe
    - ?:\\Program Files*\\WindowsApps\\KaliLinux.*\\kali.exe
    - \\Device\\HarddiskVolume*\\Users\\*\\AppData\\Local\\packages\\kalilinux*
    - \\Device\\HarddiskVolume*\\Users\\*\\AppData\\Local\\Microsoft\\WindowsApps\\kali.exe
    - \\Device\\HarddiskVolume*\\Program Files*\\WindowsApps\\KaliLinux.*\\kali.exe
  condition: selection
tags:
- attack.defense_evasion
- attack.t1202
references:
- https://learn.microsoft.com/en-us/windows/wsl/wsl-config
