title: Attempt to Reset MFA Factors for an Okta User Account
id: 729aa18d-06a6-41c7-b175-b65b739b1181
status: stable
level: low
description: 'Detects attempts to reset an Okta user''s enrolled multi-factor authentication
  (MFA) factors. An adversary may attempt to

  reset the MFA factors for an Okta user''s account in order to register new MFA factors
  and abuse the account to blend in

  with normal activity in the victim''s environment.'
author: Elastic (converted by SIEMLess)
date: '2020-05-21'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: okta.system
    event_action: user.mfa.factor.reset_all
  condition: selection
tags:
- attack.persistence
- attack.t1098
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
- https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy
- https://www.elastic.co/security-labs/monitoring-okta-threats-with-elastic-security
- https://www.elastic.co/security-labs/starter-guide-to-understanding-okta
- https://www.elastic.co/security-labs/okta-and-lapsus-what-you-need-to-know
falsepositives:
- "    Consider adding exceptions to this rule to filter false positives if the MFA\
  \ factors for Okta user accounts are\n    regularly reset in your organization.\n\
  \    "
