title: Attempt to Deactivate an Okta Policy Rule
id: cc92c835-da92-45c9-9f29-b4992ad621a0
status: stable
level: medium
description: 'Detects attempts to deactivate a rule within an Okta policy. An adversary
  may attempt to deactivate a rule within an

  Okta policy in order to remove or weaken an organization''s security controls.'
author: Elastic (converted by SIEMLess)
date: '2020-05-21'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: okta.system
    event_action: policy.rule.deactivate
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562.007
- attack.t1562
references:
- https://help.okta.com/en/prod/Content/Topics/Security/Security_Policies.htm
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
- https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy
- https://www.elastic.co/security-labs/monitoring-okta-threats-with-elastic-security
- https://www.elastic.co/security-labs/starter-guide-to-understanding-okta
falsepositives:
- "    Consider adding exceptions to this rule to filter false positives if Okta MFA\
  \ rules are regularly deactivated in\n    your organization.\n    "
