title: Attempt to Delete an Okta Application
id: d48e1c13-4aca-4d1f-a7b1-a9161c0ad86f
status: stable
level: low
description: 'Detects attempts to delete an Okta application. An adversary may attempt
  to modify, deactivate, or delete an Okta

  application in order to weaken an organization''s security controls or disrupt their
  business operations.'
author: Elastic (converted by SIEMLess)
date: '2020-11-06'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: okta.system
    event_action: application.lifecycle.delete
  condition: selection
tags:
- attack.impact
- attack.t1489
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
- https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy
- https://www.elastic.co/security-labs/monitoring-okta-threats-with-elastic-security
- https://www.elastic.co/security-labs/starter-guide-to-understanding-okta
falsepositives:
- "    Consider adding exceptions to this rule to filter false positives if your organization's\
  \ Okta applications are\n    regularly deleted and the behavior is expected.\n \
  \   "
