title: Attempt to Revoke Okta API Token
id: 676cff2b-450b-4cf1-8ed2-c0c58a4a2dd7
status: stable
level: low
description: 'Identifies attempts to revoke an Okta API token. An adversary may attempt
  to revoke or delete an Okta API token to

  disrupt an organization''s business operations.'
author: Elastic (converted by SIEMLess)
date: '2020-05-21'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: okta.system
    event_action: system.api_token.revoke
  condition: selection
tags:
- attack.impact
- attack.t1531
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
- https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy
- https://www.elastic.co/security-labs/monitoring-okta-threats-with-elastic-security
- https://www.elastic.co/security-labs/starter-guide-to-understanding-okta
falsepositives:
- "    If the behavior of revoking Okta API tokens is expected, consider adding exceptions\
  \ to this rule to filter false\n    positives.\n    "
