title: Attempt to Unload Elastic Endpoint Security Kernel Extension
id: 70fa1af4-27fd-4f26-bd03-50b6af6b9e24
status: stable
level: high
description: Identifies attempts to unload the Elastic Endpoint Security kernel extension
  via the kextunload command.
author: Elastic (converted by SIEMLess)
date: '2020-01-05'
modified: '2025-03-18'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
    process_name: kextunload
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1547
- attack.t1562
- attack.t1562.001
- attack.t1547.006
