title: Attempt to Delete an Okta Policy Rule
id: d5d86bf5-cf0c-4c06-b688-53fdc072fdfd
status: stable
level: low
description: 'Detects attempts to delete a rule within an Okta policy. An adversary
  may attempt to delete an Okta policy rule in order

  to weaken an organization''s security controls.'
author: Elastic (converted by SIEMLess)
date: '2020-11-06'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: okta.system
    event_action: policy.rule.delete
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562.007
- attack.t1562
references:
- https://help.okta.com/en/prod/Content/Topics/Security/Security_Policies.htm
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
- https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy
- https://www.elastic.co/security-labs/monitoring-okta-threats-with-elastic-security
- https://www.elastic.co/security-labs/starter-guide-to-understanding-okta
falsepositives:
- "    Consider adding exceptions to this rule to filter false positives if Okta MFA\
  \ rules are regularly modified in your\n    organization.\n    "
