title: Attempt to Disable Gatekeeper
id: 4da13d6e-904f-4636-81d8-6ab14b4e6ae9
status: stable
level: medium
description: 'Detects attempts to disable Gatekeeper on macOS. Gatekeeper is a security
  feature that''s designed to ensure that only

  trusted software is run. Adversaries may attempt to disable Gatekeeper before executing
  malicious code.'
author: Elastic (converted by SIEMLess)
date: '2021-01-11'
modified: '2025-03-18'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
    process_name: spctl
  condition: selection
tags:
- attack.defense_evasion
- attack.t1553
references:
- https://support.apple.com/en-us/HT202491
- https://community.carbonblack.com/t5/Threat-Advisories-Documents/TAU-TIN-Shlayer-OSX/ta-p/68397
