title: Attempt to Create Okta API Token
id: 96b9f4ea-0e8c-435b-8d53-2096e75fcac5
status: stable
level: medium
description: 'Detects attempts to create an Okta API token. An adversary may create
  an Okta API token to maintain access to an

  organization''s network while they work to achieve their objectives. An attacker
  may abuse an API token to execute

  techniques such as creating user accounts or disabling security rules or policies.'
author: Elastic (converted by SIEMLess)
date: '2020-05-21'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: okta.system
    event_action: system.api_token.create
  condition: selection
tags:
- attack.persistence
- attack.t1136
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
- https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy
- https://www.elastic.co/security-labs/monitoring-okta-threats-with-elastic-security
- https://www.elastic.co/security-labs/starter-guide-to-understanding-okta
falsepositives:
- "    If the behavior of creating Okta API tokens is expected, consider adding exceptions\
  \ to this rule to filter false\n    positives.\n    "
