title: AWS GuardDuty Detector Deletion
id: 523116c0-d89d-4d7c-82c2-39e6845a78ef
status: stable
level: high
description: 'Identifies the deletion of an Amazon GuardDuty detector. Upon deletion,
  GuardDuty stops monitoring the environment and

  all existing findings are lost.'
author: Elastic (converted by SIEMLess)
date: '2020-05-28'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: aws.cloudtrail
    event_provider: guardduty.amazonaws.com
    event_action: DeleteDetector
    event_outcome: success
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562
- attack.t1562.001
references:
- https://awscli.amazonaws.com/v2/documentation/api/latest/reference/guardduty/delete-detector.html
- https://docs.aws.amazon.com/guardduty/latest/APIReference/API_DeleteDetector.html
falsepositives:
- "    The GuardDuty detector may be deleted by a system or network administrator.\
  \ Verify whether the user identity, user\n    agent, and/or hostname should be making\
  \ changes in your environment. Detector deletions by unfamiliar users or hosts\n\
  \    should be investigated. If known behavior is causing false positives, it can\
  \ be exempted from the rule.\n    "
