title: AWS EC2 Network Access Control List Creation
id: 39144f38-5284-4f8e-a2ae-e3fd628d90b0
status: stable
level: low
description: Identifies the creation of an AWS EC2 network access control list (ACL)
  or an entry in a network ACL with a specified rule number. Adversaries may exploit
  ACLs to establish persistence or exfiltrate data by creating permissive rules.
author: Elastic (converted by SIEMLess)
date: '2020-06-04'
modified: '2025-06-05'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: aws.cloudtrail
    event_provider: ec2.amazonaws.com
    event_action: (CreateNetworkAcl
    event_outcome: success
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1562.007
- attack.t1562
- attack.t1133
references:
- https://awscli.amazonaws.com/v2/documentation/api/latest/reference/ec2/create-network-acl.html
- https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_CreateNetworkAcl.html
- https://awscli.amazonaws.com/v2/documentation/api/latest/reference/ec2/create-network-acl-entry.html
- https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_CreateNetworkAclEntry.html
falsepositives:
- "    Network ACL's may be created by a network administrator. Verify whether the\
  \ user identity should be making changes in your environment. Network ACL creations\
  \ by unfamiliar users should be investigated. If known behavior is causing false\
  \ positives, it can be exempted from the rule.\n    "
