title: AWS Sign-In Root Password Recovery Requested
id: 69c420e8-6c9e-4d28-86c0-8a2be2d1e78c
status: stable
level: high
description: "Identifies a password recovery request for the AWS account root user.\n\
  In AWS, the PasswordRecoveryRequested event from signin.amazonaws.com applies to\
  \ the root user’s “Forgot your password?” flow. Other identity types, like IAM and\
  \ federated users, do not generate this event. \nThis alert indicates that someone\
  \ initiated the root password reset workflow for this account. Verify whether this\
  \ was an expected action and review identity provider notifications/email to confirm\
  \ legitimacy."
author: Elastic (converted by SIEMLess)
date: '2020-07-02'
modified: '2025-10-13'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: aws.cloudtrail
    event_provider: signin.amazonaws.com
    event_action: PasswordRecoveryRequested
    event_outcome: success
  condition: selection
tags:
- attack.initial_access
- attack.t1078
references:
- https://web.archive.org/web/20230930161727/https://www.cadosecurity.com/an-ongoing-aws-phishing-campaign/
