title: AWS IAM User Addition to Group
id: 333de828-8190-4cf5-8d7c-7575846f6fe0
status: stable
level: low
description: 'Identifies the addition of a user to a specified group in AWS Identity
  and Access Management (IAM). Any user added to a

  group automatically gains the permissions that are assigned to the group. If the
  target group carries elevated or admin

  privileges, this action can instantly grant high-risk permissions useful for credential
  misuse, lateral movement, or

  privilege escalation.'
author: Elastic (converted by SIEMLess)
date: '2020-06-04'
modified: '2025-10-30'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: aws.cloudtrail
    event_provider: iam.amazonaws.com
    event_action: AddUserToGroup
    event_outcome: success
  condition: selection
tags:
- attack.persistence
- attack.credential_access
- attack.t1098
references:
- https://docs.aws.amazon.com/IAM/latest/APIReference/API_AddUserToGroup.html
falsepositives:
- "    Legitimate operations such as new user onboarding, role changes, or service\
  \ account updates may trigger this event.\n    Verify whether the user identity,\
  \ user agent, and/or hostname should be making changes in your environment. User\n\
  \    additions from unfamiliar users or hosts should be investigated. If known behavior\
  \ is causing false positives, it\n    can be exempted from the rule.\n    "
