title: AWS EC2 Instance Console Login via Assumed Role
id: d1e5e410-3e34-412e-9b1f-dd500b3b55cd
status: stable
level: high
description: 'Detects successful AWS Management Console or federation login activity
  performed using an EC2 instance’s assumed role

  credentials. EC2 instances typically use temporary credentials to make API calls,
  not to authenticate interactively via

  the console. A successful "ConsoleLogin" or "GetSigninToken" event using a session
  pattern that includes "i-" (the EC2

  instance ID) is highly anomalous and may indicate that an adversary obtained the
  instance’s temporary credentials from

  the instance metadata service (IMDS) and used them to access the console. Such activity
  can enable lateral movement,

  privilege escalation, or persistence within the AWS account.'
author: Elastic (converted by SIEMLess)
date: '2024-07-24'
modified: '2025-11-05'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: aws.cloudtrail
    event_provider: signin.amazonaws.com
    event_outcome: success
    aws_cloudtrail_user_identity_type: AssumedRole
  condition: selection
tags:
- attack.persistence
- attack.lateral_movement
- attack.credential_access
- attack.t1021
- attack.t1550.001
- attack.t1552
- attack.t1550
- attack.t1078
- attack.t1078.004
- attack.t1552.005
- attack.t1021.007
references:
- https://redcanary.com/blog/aws-sts/
- https://docs.aws.amazon.com/IAM/latest/UserGuide/id_roles_providers_enable-console-custom-url.html/
falsepositives:
- "    This is very uncommon behavior and should result in minimal false positives,\
  \ ensure validity of the triggered event\n    and include exceptions where necessary.\n\
  \    "
