title: AWS CloudWatch Alarm Deletion
id: f772ec8a-e182-483c-91d2-72058f76a44c
status: stable
level: medium
description: Identifies the deletion of an AWS CloudWatch alarm. An adversary may
  delete alarms in an attempt to evade defenses.
author: Elastic (converted by SIEMLess)
date: '2020-06-15'
modified: '2024-05-21'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: aws.cloudtrail
    event_provider: monitoring.amazonaws.com
    event_action: DeleteAlarms
    event_outcome: success
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562
- attack.t1562.001
references:
- https://awscli.amazonaws.com/v2/documentation/api/latest/reference/cloudwatch/delete-alarms.html
- https://docs.aws.amazon.com/AmazonCloudWatch/latest/APIReference/API_DeleteAlarms.html
falsepositives:
- "    Verify whether the user identity, user agent, and/or hostname should be making\
  \ changes in your environment. Alarm\n    deletions by unfamiliar users or hosts\
  \ should be investigated. If known behavior is causing false positives, it can\n\
  \    be exempted from the rule.\n    "
