title: AWS CLI with Kali Linux Fingerprint Identified
id: f80ea920-f6f5-4c8a-9761-84ac97ec0cb2
status: stable
level: medium
description: 'Identifies the usage of the AWS CLI with a user agent string containing
  `distrib#kali`, which suggests the request

  was made from a Kali Linux distribution. This may indicate offensive security tooling
  or unauthorized use of the AWS CLI

  from a potentially adversarial environment.'
author: Elastic (converted by SIEMLess)
date: '2025-04-11'
modified: '2025-04-16'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: aws.cloudtrail
    user_agent_original: (aws-cli*distrib#kali*
  condition: selection
tags:
- attack.initial_access
- attack.t1078.004
- attack.t1078
references:
- https://docs.aws.amazon.com/awscloudtrail/latest/userguide/cloudtrail-event-reference-user-identity.html
- https://www.sygnia.co/blog/sygnia-investigation-bybit-hack/
falsepositives:
- "    While rare, legitimate users or red teamers may use Kali Linux for security\
  \ assessments. Confirm the identity of the\n    user, their purpose, and whether\
  \ the activity was authorized.\n    "
