title: AWS EC2 Network Access Control List Deletion
id: 8623535c-1e17-44e1-aa97-7a0699c3037d
status: stable
level: medium
description: Identifies the deletion of an Amazon Elastic Compute Cloud (EC2) network
  access control list (ACL) or one of its ingress/egress entries.
author: Elastic (converted by SIEMLess)
date: '2020-05-26'
modified: '2025-06-05'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: aws.cloudtrail
    event_provider: ec2.amazonaws.com
    event_action: (DeleteNetworkAcl
    event_outcome: success
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562.007
- attack.t1562
references:
- https://awscli.amazonaws.com/v2/documentation/api/latest/reference/ec2/delete-network-acl.html
- https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_DeleteNetworkAcl.html
- https://awscli.amazonaws.com/v2/documentation/api/latest/reference/ec2/delete-network-acl-entry.html
- https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_DeleteNetworkAclEntry.html
falsepositives:
- "    Network ACL's may be deleted by a network administrator. Verify whether the\
  \ user identity, user agent, and/or hostname should be making changes in your environment.\
  \ Network ACL deletions by unfamiliar users or hosts should be investigated. If\
  \ known behavior is causing false positives, it can be exempted from the rule.\n\
  \    "
