title: AWS EC2 Deprecated AMI Discovery
id: 264c641e-c202-11ef-993e-f661ea17fbce
status: stable
level: low
description: Identifies when a user has queried for deprecated Amazon Machine Images
  (AMIs) in AWS. This may indicate an adversary looking for outdated AMIs that may
  be vulnerable to exploitation. While deprecated AMIs are not inherently malicious
  or indicative of a breach, they may be more susceptible to vulnerabilities and should
  be investigated for potential security risks.
author: Elastic (converted by SIEMLess)
date: '2024-12-24'
modified: '2025-07-09'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: aws.cloudtrail
    event_provider: ec2.amazonaws.com
    event_action: DescribeImages
    event_outcome: success
    aws_cloudtrail_flattened_request_parameters_includeDeprecated: 'true'
  condition: selection
tags:
- attack.discovery
- attack.t1580
references:
- https://hackingthe.cloud/aws/exploitation/Misconfigured_Resource-Based_Policies/exploting_public_resources_attack_playbook/
falsepositives:
- Legitimate use of deprecated AMIs for testing or development purposes.
- Automated tools or scripts that query for deprecated AMIs as part of a security
  assessment.
- Misconfigured applications or services that rely on deprecated AMIs for compatibility
  reasons.
- Administrators or developers who are unaware of the deprecation status of AMIs they
  are using.
