title: AWS Management Console Root Login
id: e2a67480-3b79-403d-96e3-fdd2992c50ef
status: stable
level: medium
description: Identifies a successful login to the AWS Management Console by the Root
  user.
author: Elastic (converted by SIEMLess)
date: '2020-06-11'
modified: '2025-10-10'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: aws.cloudtrail
    event_provider: signin.amazonaws.com
    event_action: ConsoleLogin
    aws_cloudtrail_user_identity_type: Root
    event_outcome: success
  condition: selection
tags:
- attack.initial_access
- attack.privilege_escalation
- attack.t1078.004
- attack.t1078
references:
- https://docs.aws.amazon.com/IAM/latest/UserGuide/id_root-user.html
falsepositives:
- "    It's strongly recommended that the root user is not used for everyday tasks,\
  \ including the administrative ones.\n    Verify whether the IP address, location,\
  \ and/or hostname should be logging in as root in your environment.\n    Unfamiliar\
  \ root logins should be investigated immediately. If known behavior is causing false\
  \ positives, it can be exempted from the rule.\n    "
