title: AWS EC2 Export Task
id: deee5856-25ba-438d-ae53-09d66f41b127
status: stable
level: medium
description: 'Identifies successful export tasks of EC2 instances via the APIs CreateInstanceExportTask,
  ExportImage, or

  CreateStoreImageTask. These exports can be used by administrators for legitimate
  VM migration or backup workflows

  however, an attacker with access to an EC2 instance or AWS credentials can export
  a VM or its image and then transfer it

  off-account for exfiltration of data.'
author: Elastic (converted by SIEMLess)
date: '2025-10-23'
modified: '2025-10-23'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: aws.cloudtrail
    event_provider: ec2.amazonaws.com
    event_action: ("CreateInstanceExportTask
    event_outcome: success
  condition: selection
tags:
- attack.exfiltration
- attack.collection
- attack.t1119
- attack.t1530
- attack.t1005
- attack.t1537
references:
- https://docs.aws.amazon.com/vm-import/latest/userguide/vmexport.html
- https://docs.aws.amazon.com/vm-import/latest/userguide/vmexport_image.html
- https://cloud.hacktricks.wiki/en/pentesting-cloud/aws-security/aws-post-exploitation/aws-ec2-ebs-ssm-and-vpc-post-exploitation/aws-ami-store-s3-exfiltration.html,
falsepositives:
- "    VM export and EC2 image creation may be done by system administrators, DevOps\
  \ or migration teams as part of planned\n    maintenance, disaster-recovery or known\
  \ backup methods. Verify whether the user identity, user agent, and/or\n    hostname\
  \ should be making changes in your environment. Exports from unfamiliar users or\
  \ hosts should be\n    investigated. If known behavior is causing false positives,\
  \ it can be exempted from the rule.\n    "
