title: AWS IAM Brute Force of Assume Role Policy
id: ea248a02-bc47-4043-8e94-2885b19b2636
status: stable
level: medium
description: 'Identifies a high number of failed attempts to assume an AWS Identity
  and Access Management (IAM) role. IAM roles are

  used to delegate access to users or services. An adversary may attempt to enumerate
  IAM roles in order to determine if a

  role exists before attempting to assume or hijack the discovered role.'
author: Elastic (converted by SIEMLess)
date: '2020-07-16'
modified: '2024-05-21'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: aws.cloudtrail
    event_provider: iam.amazonaws.com
    event_action: UpdateAssumeRolePolicy
    aws_cloudtrail_error_code: MalformedPolicyDocumentException
    event_outcome: failure
  condition: selection
tags:
- attack.credential_access
- attack.t1110
references:
- https://www.praetorian.com/blog/aws-iam-assume-role-vulnerabilities
- https://rhinosecuritylabs.com/aws/assume-worst-aws-assume-role-enumeration/
