title: AWS RDS DB Instance or Cluster Password Modified
id: f2015527-7c46-4bb9-80db-051657ddfb69
status: stable
level: medium
description: Identifies the modification of the master password for an AWS RDS DB
  instance or cluster. DB instances may contain sensitive data that can be abused
  if accessed by unauthorized actors. Amazon RDS API operations never return the password,
  so this operation provides a means to regain access if the password is lost. Adversaries
  with the proper permissions can take advantage of this to evade defenses and gain
  unauthorized access to a DB instance or cluster to support persistence mechanisms
  or privilege escalation.
author: Elastic (converted by SIEMLess)
date: '2024-06-27'
modified: '2025-01-10'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: aws.cloudtrail
    event_provider: rds.amazonaws.com
    event_outcome: success
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.t1098
- attack.t1098.001
references:
- https://docs.aws.amazon.com/AmazonRDS/latest/APIReference/API_ModifyDBInstance.html
- https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/Overview.DBInstance.Modifying.html
- https://cloud.hacktricks.xyz/pentesting-cloud/aws-security/aws-privilege-escalation/aws-rds-privesc#rds-modifydbinstance
falsepositives:
- "    Master password change is a legitimate means to regain access to a DB instance\
  \ in the case of a lost password. Ensure that the instance should not be modified\
  \ in this way before taking action.\n    "
