title: AWS Credentials Searched For Inside A Container
id: 5749282b-7524-4c9d-af9a-e2b3e814e5d4
status: stable
level: medium
description: 'This rule detects the use of system search utilities like grep and find
  to search for AWS credentials inside a

  container. Unauthorized access to these sensitive files could lead to further compromise
  of the container environment or

  facilitate a container breakout to the underlying cloud environment.'
author: Elastic (converted by SIEMLess)
date: '2025-03-12'
modified: '2025-03-12'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    event_action: exec
    process_entry_leader_entry_meta_type: container
  condition: selection
tags:
- attack.credential_access
- attack.t1552
- attack.t1552.001
references:
- https://sysdig.com/blog/threat-detection-aws-cloud-containers/
