title: AWS EC2 AMI Shared with Another Account
id: 6a309864-fc3f-11ee-b8cc-f661ea17fbce
status: stable
level: medium
description: Identifies an AWS Amazon Machine Image (AMI) being shared with another
  AWS account. Adversaries with access may share an AMI with an external AWS account
  as a means of data exfiltration. AMIs can contain secrets, bash histories, code
  artifacts, and other sensitive data that adversaries may abuse if shared with unauthorized
  accounts. AMIs can be made publicly available accidentally as well.
author: Elastic (converted by SIEMLess)
date: '2024-04-16'
modified: '2025-07-16'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: aws.cloudtrail
    event_provider: ec2.amazonaws.com
    event_action: ModifyImageAttribute
    event_outcome: success
    aws_cloudtrail_request_parameters: '*add=*'
    aws_cloudtrail_user_identity_invoked_by: assets.marketplace.amazonaws.com
  condition: selection
tags:
- attack.exfiltration
- attack.t1537
references:
- https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/AMIs.html
- https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/sharingamis-explicit.html
- https://stratus-red-team.cloud/attack-techniques/AWS/aws.exfiltration.ec2-share-ami/
falsepositives:
- "    AMI sharing is a common practice in AWS environments. Ensure that the sharing\
  \ is authorized before taking action.\n    AWS Marketplace subscriptions automatically\
  \ result in assets.marketplace.amazonaws.com invoking ModifyImageAttribute to share\
  \ the AMI with your account. This rule excludes Marketplace-invoked sharing by design.\
  \ Other AWS services like workspaces.amazonaws.com and backup.amazonaws.com may\
  \ invoke this action when users configure sharing through WorkSpaces or Backup plans.\
  \ Review such service-invoked events to confirm they match legitimate and intended\
  \ sharing configurations.\n    "
