title: AWS RDS Security Group Creation
id: 378f9024-8a0c-46a5-aa08-ce147ac73a4e
status: stable
level: low
description: Identifies the creation of an Amazon Relational Database Service (RDS)
  Security group.
author: Elastic (converted by SIEMLess)
date: '2021-06-05'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: aws.cloudtrail
    event_provider: rds.amazonaws.com
    event_action: CreateDBSecurityGroup
    event_outcome: success
  condition: selection
tags:
- attack.persistence
- attack.t1136
- attack.t1136.003
references:
- https://docs.aws.amazon.com/AmazonRDS/latest/APIReference/API_CreateDBSecurityGroup.html
falsepositives:
- "    An RDS security group may be created by a system or network administrator.\
  \ Verify whether the user identity, user\n    agent, and/or hostname should be making\
  \ changes in your environment. Security group creations by unfamiliar users or\n\
  \    hosts should be investigated. If known behavior is causing false positives,\
  \ it can be exempted from the rule.\n    "
