title: Azure Alert Suppression Rule Created or Modified
id: f0bc081a-2346-4744-a6a4-81514817e888
status: stable
level: low
description: 'Identifies the creation of suppression rules in Azure. Suppression rules
  are a mechanism used to suppress alerts

  previously identified as false positives or too noisy to be in production. This
  mechanism can be abused or mistakenly

  configured, resulting in defense evasions and loss of security visibility.'
author: Elastic (converted by SIEMLess)
date: '2021-08-27'
modified: '2025-09-26'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: azure.activitylogs
    azure_activitylogs_operation_name: MICROSOFT.SECURITY/ALERTSSUPPRESSIONRULES/WRITE
    event_outcome: success
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562
references:
- https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
- https://docs.microsoft.com/en-us/rest/api/securitycenter/alerts-suppression-rules/update
falsepositives:
- "    Suppression Rules can be created legitimately by a system administrator. Verify\
  \ whether the user identity, user\n    agent, and/or hostname should be making changes\
  \ in your environment. Suppression Rules created by unfamiliar users\n    should\
  \ be investigated. If known behavior is causing false positives, it can be exempted\
  \ from the rule.\n    "
