title: Azure RBAC Built-In Administrator Roles Assigned
id: 1a1046f4-9257-11f0-9a42-f661ea17fbce
status: stable
level: high
description: Identifies when a user is assigned a built-in administrator role in Azure
  RBAC (Role-Based Access Control). These roles provide significant privileges and
  can be abused by attackers for lateral movement, persistence, or privilege escalation.
  The privileged built-in administrator roles include Owner, Contributor, User Access
  Administrator, Azure File Sync Administrator, Reservations Administrator, and Role
  Based Access Control Administrator.
author: Elastic (converted by SIEMLess)
date: '2025-09-15'
modified: '2025-09-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: azure.activitylogs
    event_action: MICROSOFT.AUTHORIZATION/ROLEASSIGNMENTS/WRITE
    azure_activitylogs_properties_requestbody_properties_roleDefinitionId: (
  condition: selection
tags:
- attack.privilege_escalation
- attack.t1098
- attack.t1098.003
references:
- https://learn.microsoft.com/en-us/azure/role-based-access-control/built-in-roles
- https://orca.security/resources/research-pod/azure-identity-access-management-iam-active-directory-ad/
- https://www.microsoft.com/en-us/security/blog/2025/08/27/storm-0501s-evolving-techniques-lead-to-cloud-based-ransomware/
