title: Azure Full Network Packet Capture Detected
id: 3ad77ed4-4dcf-4c51-8bfc-e3f7ce316b2f
status: stable
level: medium
description: 'Identifies potential full network packet capture in Azure. Packet Capture
  is an Azure Network Watcher feature that can

  be used to inspect network traffic. This feature can potentially be abused to read
  sensitive data from unencrypted

  internal traffic.'
author: Elastic (converted by SIEMLess)
date: '2021-08-12'
modified: '2025-09-26'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: azure.activitylogs
    azure_activitylogs_operation_name: (
    event_outcome: (Success
  condition: selection
tags:
- attack.credential_access
- attack.t1040
references:
- https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
falsepositives:
- "    Full Network Packet Capture may be done by a system or network administrator.\
  \ Verify whether the user identity, user\n    agent, and/or hostname should be making\
  \ changes in your environment. Full Network Packet Capture from unfamiliar\n   \
  \ users or hosts should be investigated. If known behavior is causing false positives,\
  \ it can be exempted from the\n    rule.\n    "
