title: Azure Automation Webhook Created
id: e9ff9c1c-fe36-4d0d-b3fd-9e0bf4853a62
status: stable
level: low
description: 'Identifies when an Azure Automation webhook is created. Azure Automation
  runbooks can be configured to execute via a

  webhook. A webhook uses a custom URL passed to Azure Automation along with a data
  payload specific to the runbook. An

  adversary may create a webhook in order to trigger a runbook that contains malicious
  code.'
author: Elastic (converted by SIEMLess)
date: '2020-08-18'
modified: '2025-09-30'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: azure.activitylogs
    azure_activitylogs_operation_name: (
    event_outcome: (Success
  condition: selection
tags:
- attack.persistence
- attack.resource_development
- attack.t1608
- attack.t1546
references:
- https://powerzure.readthedocs.io/en/latest/Functions/operational.html#create-backdoor
- https://github.com/hausec/PowerZure
- https://posts.specterops.io/attacking-azure-azure-ad-and-introducing-powerzure-ca70b330511a
- https://www.ciraltos.com/webhooks-and-azure-automation-runbooks/
