title: Azure Automation Runbook Deleted
id: 8ddab73b-3d15-4e5d-9413-47f05553c1d7
status: stable
level: low
description: 'Identifies when an Azure Automation runbook is deleted. An adversary
  may delete an Azure Automation runbook in order to

  disrupt their target''s automated business operations or to remove a malicious runbook
  for defense evasion.'
author: Elastic (converted by SIEMLess)
date: '2020-09-01'
modified: '2025-09-26'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: azure.activitylogs
    azure_activitylogs_operation_name: MICROSOFT.AUTOMATION/AUTOMATIONACCOUNTS/RUNBOOKS/DELETE
    event_outcome: (Success
  condition: selection
tags:
- attack.defense_evasion
references:
- https://powerzure.readthedocs.io/en/latest/Functions/operational.html#create-backdoor
- https://github.com/hausec/PowerZure
- https://posts.specterops.io/attacking-azure-azure-ad-and-introducing-powerzure-ca70b330511a
- https://azure.microsoft.com/en-in/blog/azure-automation-runbook-management/
