title: Azure Blob Permissions Modification
id: d79c4b2a-6134-4edd-86e6-564a92a933f9
status: stable
level: medium
description: 'Identifies when the Azure role-based access control (Azure RBAC) permissions
  are modified for an Azure Blob. An

  adversary may modify the permissions on a blob to weaken their target''s security
  controls or an administrator may

  inadvertently modify the permissions, which could lead to data exposure or loss.'
author: Elastic (converted by SIEMLess)
date: '2021-09-22'
modified: '2025-09-26'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: azure.activitylogs
    azure_activitylogs_operation_name: (
    event_outcome: (Success
  condition: selection
tags:
- attack.defense_evasion
- attack.t1222
references:
- https://docs.microsoft.com/en-us/azure/role-based-access-control/built-in-roles
falsepositives:
- "    Blob permissions may be modified by system administrators. Verify that the\
  \ configuration change was expected.\n    Exceptions can be added to this rule to\
  \ filter expected behavior.\n    "
