title: Azure Automation Account Created
id: df26fd74-1baa-4479-b42e-48da84642330
status: stable
level: low
description: 'Identifies when an Azure Automation account is created. Azure Automation
  accounts can be used to automate management

  tasks and orchestrate actions across systems. An adversary may create an Automation
  account in order to maintain

  persistence in their target''s environment.'
author: Elastic (converted by SIEMLess)
date: '2020-08-18'
modified: '2025-09-26'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: azure.activitylogs
    azure_activitylogs_operation_name: MICROSOFT.AUTOMATION/AUTOMATIONACCOUNTS/WRITE
    event_outcome: (Success
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1078
references:
- https://powerzure.readthedocs.io/en/latest/Functions/operational.html#create-backdoor
- https://github.com/hausec/PowerZure
- https://posts.specterops.io/attacking-azure-azure-ad-and-introducing-powerzure-ca70b330511a
- https://azure.microsoft.com/en-in/blog/azure-automation-runbook-management/
