title: Base16 or Base32 Encoding/Decoding Activity
id: debff20a-46bc-4a4d-bae5-5cdd14222795
status: stable
level: low
description: Adversaries may encode/decode data in an attempt to evade detection by
  host- or network-based security controls.
author: Elastic (converted by SIEMLess)
date: '2020-04-17'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
  condition: selection
tags:
- attack.defense_evasion
- attack.t1027
- attack.t1140
falsepositives:
- "    Automated tools such as Jenkins may encode or decode files as part of their\
  \ normal behavior. These events can be\n    filtered by the process executable or\
  \ username values.\n    "
