title: Behavior - Detected - Elastic Defend
id: 0f615fe4-eaa2-11ee-ae33-f661ea17fbce
status: stable
level: medium
description: 'Generates a detection alert each time an Elastic Defend alert for malicious
  behavior is received. Enabling this rule

  allows you to immediately begin investigating your Endpoint behavior alerts. This
  rule identifies Elastic Defend

  behavior detections only, and does not include prevention alerts.'
author: Elastic (converted by SIEMLess)
date: '2024-03-24'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_kind: alert
    event_code: behavior
    event_type: denied
    event_outcome: failure))
  condition: selection
references:
- https://github.com/elastic/protections-artifacts/tree/main/behavior
- https://docs.elastic.co/en/integrations/endpoint
