title: Binary Executed from Shared Memory Directory
id: 3f3f9fe2-d095-11ec-95dc-f661ea17fbce
status: stable
level: high
description: 'Identifies the execution of a binary by root in Linux shared memory
  directories: (/dev/shm/, /run/shm/, /var/run/,

  /var/lock/). This activity is to be considered highly abnormal and should be investigated.
  Threat actors have placed

  executables used for persistence on high-uptime servers in these directories as
  system backdoors.'
author: Elastic (converted by SIEMLess)
date: '2022-05-10'
modified: '2025-02-04'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    user_id: '0'
    process_executable|contains:
    - /var/run/docker/*
    - /var/run/utsns/*
    - /var/run/s6/*
    - /var/run/cloudera-scm-agent/*
    - /var/run/argo/argoexec
  condition: selection
tags:
- attack.execution
- attack.t1059
references:
- https://linuxsecurity.com/features/fileless-malware-on-linux
- https://twitter.com/GossiTheDog/status/1522964028284411907
- https://www.elastic.co/security-labs/a-peek-behind-the-bpfdoor
falsepositives:
- "    Directories /dev/shm and /run/shm are temporary file storage directories in\
  \ Linux. They are intended to appear as a\n    mounted file system, but uses virtual\
  \ memory instead of a persistent storage device and thus are used for mounting\n\
  \    file systems in legitimate purposes.\n    "
