title: Boot File Copy
id: 5bda8597-69a6-4b9e-87a2-69a7c963ea83
status: stable
level: low
description: 'This rule detects the process of copying or moving files from or to
  the `/boot` directory on Linux systems. The `/boot`

  directory contains files that are essential for the system to boot, such as the
  kernel and initramfs images. Attackers

  may copy or move files to the `/boot` directory to modify the boot process, which
  can be leveraged to maintain access to

  the system.'
author: Elastic (converted by SIEMLess)
date: '2025-01-16'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.execution
- attack.t1574
- attack.t1059
- attack.t1542
- attack.t1059.004
- attack.t1543
