title: Clearing Windows Console History
id: b5877334-677f-4fb9-86d5-a9721274223b
status: stable
level: medium
description: 'Identifies when a user attempts to clear console history. An adversary
  may clear the command history of a compromised

  account to conceal the actions undertaken during an intrusion.'
author: Elastic (converted by SIEMLess)
date: '2021-11-22'
modified: '2025-09-12'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - powershell.exe
    - pwsh.exe
    - powershell_ise.exe
    process_args|contains: '*ConsoleHost_history.txt*'
    process_args|endswith: SaveNothing*
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.t1070.003
- attack.t1059
- attack.t1059.001
- attack.t1070
references:
- https://stefanos.cloud/kb/how-to-clear-the-powershell-command-history/
- https://www.shellhacks.com/clear-history-powershell/
- https://community.sophos.com/sophos-labs/b/blog/posts/powershell-command-history-forensics
