title: Code Signing Policy Modification Through Registry
id: da7733b1-fe08-487e-b536-0a04c6d8b0cd
status: stable
level: medium
description: 'Identifies attempts to disable the code signing policy through the registry.
  Code signing provides authenticity on a

  program, and grants the user with the ability to check whether the program has been
  tampered with. By allowing the

  execution of unsigned or self-signed code, threat actors can craft and execute malicious
  code.'
author: Elastic (converted by SIEMLess)
date: '2023-01-31'
modified: '2025-08-26'
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    host_os_type: windows
    event_type: change
    registry_data_strings|contains:
    - '0'
    - '0x00000000'
    - '1'
    - '0x00000001'
    process_executable|contains:
    - ?:\\Windows\\System32\\svchost.exe
    - ?:\\Windows\\CCM\\CcmExec.exe
    - \\Device\\HarddiskVolume*\\Windows\\system32\\svchost.exe
    - \\Device\\HarddiskVolume*\\Windows\\CCM\\CcmExec.exe
  condition: selection
tags:
- attack.defense_evasion
- attack.t1553
- attack.t1112
- attack.t1553.006
