title: Command and Scripting Interpreter via Windows Scripts
id: 2d62889e-e758-4c5e-b57e-c735914ee32a
status: stable
level: high
description: Identifies PowerShell.exe or Cmd.exe execution spawning from Windows
  Script Host processes Wscript.exe.
author: Elastic (converted by SIEMLess)
date: '2024-09-09'
modified: '2025-09-11'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - powershell.exe
    - pwsh.exe
    - powershell_ise.exe
    - cmd.exe
    process_pe_original_file_name|contains:
    - powershell.exe
    - pwsh.dll
    - powershell_ise.exe
    - Cmd.Exe
    process_parent_name|contains:
    - wscript.exe
    - mshta.exe
  condition: selection
tags:
- attack.execution
- attack.t1059
- attack.t1059.001
- attack.t1059.005
- attack.t1059.003
