title: Command Obfuscation via Unicode Modifier Letters
id: 37148ae6-c6ec-4fe4-88b1-02f40aed93a9
status: stable
level: high
description: 'Identifies the presence of unicode modifier letters in the process command_line.
  Adversaries sometimes replace ASCII characters

  with visually similar Unicode modifier letters or combining marks to evade simple
  string-based detections.'
author: Elastic (converted by SIEMLess)
date: '2025-11-13'
modified: '2025-11-13'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - reg.exe
    - net.exe
    - net1.exe
    - certutil.exe
    - MSHTA.EXE
    - msiexec.exe
    - bitsadmin.exe
    - CertReq.exe
    - PrintBrm.exe
    - MSBuild.exe
    - wuauclt.exe
    - curl.exe
    - wget.exe
    - ssh.exe
    - Cmd.Exe
    - PowerShell.EX
    - CONHOST.EXE
    - wscript.exe
    - cscript.exe
    - REGSVR32.EXE
    - RUNDLL32.EXE
    - procdump.exe
    - ntdsutil.exe
    - diskshadow.exe
    - schtasks.exe
    - sc.exe
    - wmic.exe
    - VSSADMIN.EXE
    - WBADMIN.EXE
    - iCACLS.EXE
    - sftp.exe
    - scp.exe
    - esentutl.exe
    - InstallUtil.exe
    - wevtutil.exe
  condition: selection
tags:
- attack.defense_evasion
- attack.t1027
- attack.t1027.010
references:
- https://www.wietzebeukema.nl/blog/windows-command-line-obfuscation
