title: Command Execution via ForFiles
id: 3f7bd5ac-9711-44b4-82c1-fa246d829f15
status: stable
level: medium
description: 'Detects attempts to execute a command via the forfiles Windows utility.
  Adversaries may use this utility to proxy

  execution via a trusted parent process.'
author: Elastic (converted by SIEMLess)
date: '2025-02-03'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_pe_original_file_name: forfiles.exe
    process_args|contains:
    - /c
    - -c
  condition: selection
tags:
- attack.defense_evasion
- attack.t1202
references:
- https://lolbas-project.github.io/lolbas/Binaries/Forfiles/
