title: Command Prompt Network Connection
id: 89f9a4b0-9f8f-4ee0-8823-c4751a6d6696
status: stable
level: low
description: 'Identifies cmd.exe making a network connection. Adversaries could abuse
  cmd.exe to download or execute malware from a

  remote URL.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-08-26'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by process.entity_id\n  [process where host.os.type ==\
      \ \"windows\" and process.name : \"cmd.exe\" and event.type == \"start\"]\n\
      \  [network where host.os.type == \"windows\" and process.name : \"cmd.exe\"\
      \ and\n     not cidrmatch(destination.ip, \"10.0.0.0/8\", \"127.0.0.0/8\", \"\
      169.254.0.0/16\", \"172.16.0.0/12\", \"192.0.0.0/24\",\n                   \
      \               \"192.0.0.0/29\", \"192.0.0.8/32\", \"192.0.0.9/32\", \"192.0.0.10/32\"\
      , \"192.0.0.170/32\",\n                                  \"192.0.0.171/32\"\
      , \"192.0.2.0/24\", \"192.31.196.0/24\", \"192.52.193.0/24\",\n            \
      \                      \"192.168.0.0/16\", \"192.88.99.0/24\", \"224.0.0.0/4\"\
      , \"100.64.0.0/10\", \"192.175.48.0/24\",\n                                \
      \  \"198.18.0.0/15\", \"198.51.100.0/24\", \"203.0.113.0/24\", \"240.0.0.0/4\"\
      , \"::1\",\n                                  \"FE80::/10\", \"FF00::/8\") and\n\
      \    not dns.question.name : (\n          \"wpad\", \"localhost\", \"ocsp.comodoca.com\"\
      , \"ocsp.digicert.com\", \"ocsp.sectigo.com\", \"crl.comodoca.com\"\n    )]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.execution
- attack.command_and_control
- attack.t1059
- attack.t1105
references:
- https://www.iana.org/assignments/iana-ipv4-special-registry/iana-ipv4-special-registry.xhtml
falsepositives:
- "    Administrators may use the command prompt for regular administrative tasks.\
  \ It's important to baseline your\n    environment for network connections being\
  \ made from the command prompt to determine any abnormal use of this tool.\n    "
