title: Command Shell Activity Started via RunDLL32
id: 9ccf3ce0-0057-440a-91f5-870c6ad39093
status: stable
level: low
description: Identifies command shell activity started via RunDLL32, which is commonly
  abused by attackers to host malicious code.
author: Elastic (converted by SIEMLess)
date: '2020-10-19'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - cmd.exe
    - powershell.exe
    process_parent_args|contains:
    - C:\\Windows\\System32\\SHELL32.dll,RunAsNewUser_RunDLL
    - C:\\WINDOWS\\*.tmp,zzzzInvokeManagedCustomActionOutOfProc
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.credential_access
- attack.t1059.003
- attack.t1059
- attack.t1552
- attack.t1218.011
- attack.t1218
- attack.t1059.001
falsepositives:
- Microsoft Windows installers leveraging RunDLL32 for installation.
