title: Command Execution via SolarWinds Process
id: d72e33fc-6e91-42ff-ac8b-e573268c5a87
status: stable
level: medium
description: A suspicious SolarWinds child process (Cmd.exe or Powershell.exe) was
  detected.
author: Elastic (converted by SIEMLess)
date: '2020-12-14'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - cmd.exe
    - powershell.exe
    process_parent_name|contains:
    - ConfigurationWizard*.exe
    - NetflowDatabaseMaintenance*.exe
    - NetFlowService*.exe
    - SolarWinds.Administration*.exe
    - SolarWinds.Collector.Service*.exe
    - SolarwindsDiagnostics*.exe
  condition: selection
tags:
- attack.initial_access
- attack.execution
- attack.t1059.003
- attack.t1059
- attack.t1195.002
- attack.t1059.001
- attack.t1195
references:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://github.com/mandiant/sunburst_countermeasures/blob/main/rules/SUNBURST/hxioc/SUNBURST%20SUSPICIOUS%20FILEWRITES%20(METHODOLOGY).ioc
falsepositives:
- Trusted SolarWinds child processes. Verify process details such as network connections
  and file writes.
