title: Component Object Model Hijacking
id: 16a52c14-7883-47af-8745-9357803f0d4c
status: stable
level: low
description: 'Identifies Component Object Model (COM) hijacking via registry modification.
  Adversaries may establish persistence by

  executing malicious content triggered by hijacked references to COM objects.'
author: Elastic (converted by SIEMLess)
date: '2020-11-18'
modified: '2024-09-05'
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    host_os_type: windows
    event_type: change
    registry_data_strings|contains:
    - '{4813071a-41ad-44a2-9835-886d2f63ca30}'
    - '{A56A841F-E974-45C1-8001-7E3F8A085917}'
    - '{4ED3A719-CEA8-4BD9-910D-E252F997AFC2}'
    - '{BFEC0C93-0B7D-4F2C-B09C-AFFFC4BDAE78}'
    registry_path|contains:
    - HKEY_USERS\\*\\InprocServer32\\
    - HKEY_USERS\\*\\LocalServer32\\
    - HKEY_USERS\\*\\DelegateExecute
    - HKEY_USERS\\*\\TreatAs\\
    - HKEY_USERS\\*\\ScriptletURL*
    process_name|contains:
    - OneDrive.exe
    - OneDriveSetup.exe
    - FileSyncConfig.exe
    - Teams.exe
    - MicrosoftEdgeUpdate.exe
    - msrdcw.exe
    - MicrosoftEdgeUpdateComRegisterShell64.exe
    - setup.exe
    process_executable|contains: ?:\\$WINDOWS.~BT\\Sources\\SetupHost.exe
    registry_path|endswith: \\{06290BD*-48AA-11D2-8432-006008C3FBFC}\\*
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.t1112
- attack.t1546.015
- attack.t1546
references:
- https://bohops.com/2018/08/18/abusing-the-com-registry-structure-part-2-loading-techniques-for-evasion-and-persistence/
