title: Connection to Commonly Abused Free SSL Certificate Providers
id: e3cf38fa-d5b8-46cc-87f9-4a7513e4281d
status: stable
level: low
description: 'Identifies unusual processes connecting to domains using known free
  SSL certificates. Adversaries may employ a known

  encryption algorithm to conceal command and control traffic.'
author: Elastic (converted by SIEMLess)
date: '2020-11-04'
modified: '2025-03-20'
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    host_os_type: windows
    network_protocol: dns
    dns_question_name|contains:
    - '*letsencrypt.org'
    - '*.sslforfree.com'
    - '*.zerossl.com'
    - '*.freessl.org'
    process_executable|contains:
    - C:\\Windows\\System32\\*.exe
    - C:\\Windows\\System\\*.exe
    - C:\\Windows\\SysWOW64\\*.exe
    - C:\\Windows\\Microsoft.NET\\Framework*\\*.exe
    - C:\\Windows\\explorer.exe
    - C:\\Windows\\notepad.exe
    process_name|contains:
    - svchost.exe
    - MicrosoftEdge*.exe
    - msedge.exe
  condition: selection
tags:
- attack.command_and_control
- attack.t1573
