title: Container Management Utility Run Inside A Container
id: 4b74d3b0-416e-4099-b432-677e1cd098cc
status: stable
level: low
description: 'This rule detects when a container management binary is run from inside
  a container. These binaries are critical

  components of many containerized environments, and their presence and execution
  in unauthorized containers could

  indicate compromise or a misconfiguration.'
author: Elastic (converted by SIEMLess)
date: '2025-03-12'
modified: '2025-06-17'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    event_action: exec
    process_entry_leader_entry_meta_type: container
  condition: selection
tags:
- attack.execution
- attack.t1609
falsepositives:
- "    There is a potential for false positives if the container is used for legitimate\
  \ administrative tasks that require\n    the use of container management utilities,\
  \ such as deploying, scaling, or updating containerized applications. It is\n  \
  \  important to investigate any alerts generated by this rule to determine if they\
  \ are indicative of malicious activity\n    or part of legitimate container activity.\n\
  \    "
