title: Creation of Hidden Login Item via Apple Script
id: f24bcae1-8980-4b30-b5dd-f851b055c9e7
status: stable
level: medium
description: 'Identifies the execution of osascript to create a hidden login item.
  This may indicate an attempt to persist a malicious

  program while concealing its presence.'
author: Elastic (converted by SIEMLess)
date: '2020-01-05'
modified: '2025-03-18'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
    process_name: osascript
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.execution
- attack.t1059
- attack.t1547
- attack.t1059.002
- attack.t1647
