title: Creation of Hidden Launch Agent or Daemon
id: 092b068f-84ac-485d-8a55-7dd9e006715f
status: stable
level: medium
description: 'Identifies the creation of a hidden launch agent or daemon. An adversary
  may establish persistence by installing a new

  launch agent or daemon which executes at login.'
author: Elastic (converted by SIEMLess)
date: '2020-01-05'
modified: '2025-03-18'
logsource:
  product: macos
  category: file_event
detection:
  selection:
    host_os_type: macos
    event_action: launch_daemon
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1564
- attack.t1564.001
- attack.t1543.001
- attack.t1543
references:
- https://developer.apple.com/library/archive/documentation/MacOSX/Conceptual/BPSystemStartup/Chapters/CreatingLaunchdJobs.html
