title: Creation of Hidden Files and Directories via CommandLine
id: b9666521-4742-49ce-9ddc-b8e84c35acae
status: stable
level: medium
description: 'Users can mark specific files as hidden simply by putting a "." as the
  first character in the file or folder name.

  Adversaries can use this to their advantage to hide files and folders on the system
  for persistence and defense evasion.

  This rule looks for hidden files or folders in common writable directories.'
author: Elastic (converted by SIEMLess)
date: '2020-04-29'
modified: '2025-02-04'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    event_action: exec
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1564
- attack.t1564.001
falsepositives:
- "    Certain tools may create hidden temporary files or directories upon installation\
  \ or as part of their normal\n    behavior. These events can be filtered by the\
  \ process arguments, username, or process name values.\n    "
