title: Credential Acquisition via Registry Hive Dumping
id: a7e7bfa3-088e-4f13-b29e-3986e0e756b8
status: stable
level: high
description: Identifies attempts to export a registry hive which may contain credentials
  using the Windows reg.exe tool.
author: Elastic (converted by SIEMLess)
date: '2020-11-23'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_pe_original_file_name: reg.exe
    process_args|contains:
    - hklm\\sam
    - hklm\\security
  condition: selection
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.004
- attack.t1003.002
references:
- https://medium.com/threatpunter/detecting-attempts-to-steal-passwords-from-the-registry-7512674487f8
- https://www.elastic.co/security-labs/detect-credential-access
