title: Credential Access via TruffleHog Execution
id: 47595dea-452b-4d37-b82d-6dd691325139
status: stable
level: low
description: 'This rule detects the execution of TruffleHog, a tool used to search
  for high-entropy strings and secrets

  in code repositories, which may indicate an attempt to access credentials. This
  tool was abused by the Shai-Hulud

  worm to search for credentials in code repositories.'
author: Elastic (converted by SIEMLess)
date: '2025-09-18'
modified: '2025-10-06'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    event_type: start
    process_args: filesystem
    process_name|contains:
    - trufflehog.exe
    - trufflehog
  condition: selection
tags:
- attack.credential_access
- attack.t1003
- attack.t1555
references:
- https://www.elastic.co/blog/shai-hulud-worm-npm-supply-chain-compromise
falsepositives:
- "    Trufflehog is a legitimate open-source tool used by security professionals\
  \ and developers to search for sensitive\n    information, such as passwords, API\
  \ keys, and other secrets, within code repositories. It is commonly employed\n \
  \   during security assessments and code reviews to identify potential vulnerabilities.\n\
  \    "
