title: Credential Manipulation - Prevented - Elastic Endgame
id: c9e38e64-3f4c-4bf3-ad48-0e61a60ea1fa
status: stable
level: medium
description: 'Elastic Endgame prevented Credential Manipulation. Click the Elastic
  Endgame icon in the event.module column or the link

  in the rule.reference column for additional information.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-03-21'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_kind: alert
    event_module: endgame
    endgame_metadata_type: prevention
    event_action: token_manipulation_event
    endgame_event_subtype_full: token_manipulation_event)
  condition: selection
tags:
- attack.privilege_escalation
- attack.t1134
