title: Credential Dumping - Prevented - Elastic Endgame
id: db8c33a8-03cd-4988-9e2c-d0a4863adb13
status: stable
level: medium
description: 'Elastic Endgame prevented Credential Dumping. Click the Elastic Endgame
  icon in the event.module column or the link in

  the rule.reference column for additional information.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-03-21'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_kind: alert
    event_module: endgame
    endgame_metadata_type: prevention
    event_action: cred_theft_event
    endgame_event_subtype_full: cred_theft_event)
  condition: selection
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.001
