title: CrowdStrike External Alerts
id: aeebe561-c338-4118-9924-8cb4e478aa58
status: stable
level: medium
description: 'Generates a detection alert for each CrowdStrike alert written to the
  configured indices. Enabling this rule allows you

  to immediately begin investigating CrowdStrike alerts in the app.'
author: Elastic (converted by SIEMLess)
date: '2025-07-31'
modified: '2025-10-17'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_kind: alert
    data_stream_dataset: crowdstrike.alert
  condition: selection
references:
- https://docs.elastic.co/en/integrations/crowdstrike
