title: Curl SOCKS Proxy Activity from Unusual Parent
id: 734239fe-eda8-48c0-bca8-9e3dafd81a88
status: stable
level: low
description: 'This rule detects the use of the `curl` command-line tool with SOCKS
  proxy options, launched from an unusual parent

  process. Attackers may use `curl` to establish a SOCKS proxy connection to bypass
  network restrictions and exfiltrate

  data or communicate with C2 servers.'
author: Elastic (converted by SIEMLess)
date: '2024-11-04'
modified: '2025-02-04'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    event_action: exec
    process_name: curl
    process_args: -x
  condition: selection
tags:
- attack.command_and_control
- attack.t1572
