title: D-Bus Service Created
id: 952c92af-d67f-4f01-8a9c-725efefa7e07
status: stable
level: low
description: 'This rule detects the creation of D-Bus service files on Linux systems.
  D-Bus is a message bus system that provides a

  way for applications to talk to one another. D-Bus services are defined in service
  files that are typically located in

  default directories. The rule looks for the creation of service files that are not
  associated with known package

  managers or system services. Attackers may create malicious D-Bus services to establish
  persistence or escalate

  privileges on a system.'
author: Elastic (converted by SIEMLess)
date: '2025-01-16'
modified: '2025-09-09'
logsource:
  product: linux
  category: file_event
detection:
  selection:
    host_os_type: linux
    event_type: creation
    process_name: perl
    process_executable|contains:
    - /nix/store/*
    - /var/lib/dpkg/*
    - /tmp/vmis.*
    - /snap/*
    - /dev/fd/*
    - /usr/lib/virtualbox/*
  condition: selection
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1543
