title: Default Cobalt Strike Team Server Certificate
id: e7075e8d-a966-458e-a183-85cd331af255
status: stable
level: high
description: 'This rule detects the use of the default Cobalt Strike Team Server TLS
  certificate. Cobalt Strike is software for

  Adversary Simulations and Red Team Operations which are security assessments that
  replicate the tactics and techniques

  of an advanced adversary in a network. Modifications to the Packetbeat configuration
  can be made to include MD5 and

  SHA256 hashing algorithms (the default is SHA1). See the References section for
  additional information on module

  configuration.'
author: Elastic (converted by SIEMLess)
date: '2020-10-05'
modified: '2025-04-22'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: network_traffic.tls
    event_category: (network
    tls_server_hash_md5: 950098276A495286EB2A2556FBAB6D83
    tls_server_hash_sha1: 6ECE5ECE4192683D2D84E25B0BA7E04F9CB7EB7C
    tls_server_hash_sha256: 87F2085C32B6A2CC709B365F55873E207A9CAA10BFFECF2FD16D3CF9D94D390C)
  condition: selection
tags:
- attack.command_and_control
- attack.t1071.001
- attack.t1071
references:
- https://attack.mitre.org/software/S0154/
- https://www.cobaltstrike.com/help-setup-collaboration
- https://www.elastic.co/guide/en/beats/packetbeat/current/configuration-tls.html
- https://www.elastic.co/guide/en/beats/filebeat/7.9/filebeat-module-suricata.html
- https://www.elastic.co/guide/en/beats/filebeat/7.9/filebeat-module-zeek.html
- https://www.elastic.co/security-labs/collecting-cobalt-strike-beacons-with-the-elastic-stack
