title: Delayed Execution via Ping
id: e00b8d49-632f-4dc6-94a5-76153a481915
status: stable
level: low
description: 'Identifies the execution of commonly abused Windows utilities via a
  delayed Ping execution. This behavior is often

  observed during malware installation and is consistent with an attacker attempting
  to evade detection.'
author: Elastic (converted by SIEMLess)
date: '2023-09-25'
modified: '2025-11-11'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by process.parent.entity_id with maxspan=1m\n  [process\
      \ where host.os.type == \"windows\" and event.action == \"start\" and process.name\
      \ : \"ping.exe\" and\n   process.args : \"-n\" and process.parent.name : \"\
      cmd.exe\" and not user.id : \"S-1-5-18\"]\n  [process where host.os.type ==\
      \ \"windows\" and event.action == \"start\" and\n   process.parent.name : \"\
      cmd.exe\" and\n   (\n        process.name : (\n            \"rundll32.exe\"\
      , \"powershell.exe\",\n            \"mshta.exe\", \"msbuild.exe\",\n       \
      \     \"certutil.exe\", \"regsvr32.exe\",\n            \"powershell.exe\", \"\
      cscript.exe\",\n            \"wscript.exe\", \"wmic.exe\",\n            \"installutil.exe\"\
      , \"msxsl.exe\",\n            \"Microsoft.Workflow.Compiler.exe\",\n       \
      \     \"ieexec.exe\", \"iexpress.exe\",\n            \"RegAsm.exe\", \"installutil.exe\"\
      ,\n            \"RegSvcs.exe\", \"RegAsm.exe\"\n        ) or\n        (process.executable\
      \ : \"?:\\\\Users\\\\*\\\\AppData\\\\*.exe\" and not process.code_signature.trusted\
      \ == true)\n    ) and\n\n    not process.args : (\"?:\\\\Program Files\\\\*\"\
      , \"?:\\\\Program Files (x86)\\\\*\") and\n    not (process.name : (\"openssl.exe\"\
      , \"httpcfg.exe\", \"certutil.exe\") and process.parent.command_line : \"*ScreenConnectConfigurator.cmd*\"\
      ) and\n    not (process.pe.original_file_name : \"DPInst.exe\" and process.command_line\
      \ : \"driver\\\\DPInst_x64  /f \") and\n    not (process.name : \"powershell.exe\"\
      \ and process.args : \"Write-Host ======*\") and\n    not (process.name : \"\
      wscript.exe\" and process.args : \"launchquiet_args.vbs\" and process.parent.args\
      \ : \"?:\\\\Windows\\\\TempInst\\\\7z*\") and\n    not (process.name : \"regsvr32.exe\"\
      \ and process.args : (\"?:\\\\windows\\\\syswow64\\\\msxml?.dll\", \"msxml?.dll\"\
      , \"?:\\\\Windows\\\\SysWOW64\\\\mschrt20.ocx\")) and\n    not (process.name\
      \ : \"wscript.exe\" and\n         process.working_directory :\n            \
      \        (\"?:\\\\Windows\\\\TempInst\\\\*\",\n                     \"?:\\\\\
      Users\\\\*\\\\AppData\\\\Local\\\\Temp\\\\BackupBootstrapper\\\\Logs\\\\\",\n\
      \                     \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Temp\\\\QBTools\\\
      \\\"))\n    ]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.defense_evasion
- attack.execution
- attack.t1216
- attack.t1218.004
- attack.t1059
- attack.t1059.005
- attack.t1218.009
- attack.t1218.010
- attack.t1497.003
- attack.t1218.003
- attack.t1218.005
- attack.t1497
- attack.t1220
- attack.t1218.011
- attack.t1218
- attack.t1059.001
