title: Delete Volume USN Journal with Fsutil
id: f675872f-6d85-40a3-b502-c0d2ef101e92
status: stable
level: low
description: 'Identifies use of the fsutil.exe to delete the volume USNJRNL. This
  technique is used by attackers to eliminate evidence

  of files created during post-exploitation activities.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_pe_original_file_name: fsutil.exe
  condition: selection
tags:
- attack.defense_evasion
- attack.t1070.004
- attack.t1070
