title: Deprecated - LaunchDaemon Creation or Modification and Immediate Loading
id: 9d19ece6-c20e-481a-90c5-ccca596537de
status: stable
level: low
description: 'Indicates the creation or modification of a launch daemon, which adversaries
  may use to repeatedly execute malicious

  payloads as part of persistence.'
author: Elastic (converted by SIEMLess)
date: '2020-12-07'
modified: '2025-04-21'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by host.id with maxspan=1m\n [file where host.os.type\
      \ == \"macos\" and event.type != \"deletion\" and file.path : (\"/System/Library/LaunchDaemons/*\"\
      , \"/Library/LaunchDaemons/*\")]\n [process where host.os.type == \"macos\"\
      \ and event.type in (\"start\", \"process_started\") and process.name == \"\
      launchctl\" and process.args == \"load\"]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.persistence
- attack.t1543
references:
- https://developer.apple.com/library/archive/documentation/MacOSX/Conceptual/BPSystemStartup/Chapters/CreatingLaunchdJobs.html
falsepositives:
- Trusted applications persisting via LaunchDaemons
