title: Deprecated - Execution of File Written or Modified by PDF Reader
id: 1defdd62-cd8d-426e-a246-81a37751bb2b
status: stable
level: low
description: 'Identifies a suspicious file that was written by a PDF reader application
  and subsequently executed. These processes are

  often launched via exploitation of PDF applications.'
author: Elastic (converted by SIEMLess)
date: '2020-09-02'
modified: '2025-09-12'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "sequence with maxspan=2h\n  [file where host.os.type == \"windows\"\
      \ and event.type != \"deletion\" and file.extension : \"exe\" and\n     (process.name\
      \ : \"AcroRd32.exe\" or\n      process.name : \"rdrcef.exe\" or\n      process.name\
      \ : \"FoxitPhantomPDF.exe\" or\n      process.name : \"FoxitReader.exe\") and\n\
      \     not (file.name : \"FoxitPhantomPDF.exe\" or\n          file.name : \"\
      FoxitPhantomPDFUpdater.exe\" or\n          file.name : \"FoxitReader.exe\" or\n\
      \          file.name : \"FoxitReaderUpdater.exe\" or\n          file.name :\
      \ \"AcroRd32.exe\" or\n          file.name : \"rdrcef.exe\")\n  ] by host.id,\
      \ file.path\n  [process where host.os.type == \"windows\" and event.type ==\
      \ \"start\"] by host.id, process.executable"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.initial_access
- attack.execution
- attack.t1566
- attack.t1566.001
- attack.t1566.002
