title: Disable Windows Firewall Rules via Netsh
id: 4b438734-3793-4fda-bd42-ceeada0be8f9
status: stable
level: medium
description: 'Identifies use of the netsh.exe to disable or weaken the local firewall.
  Attackers will use this command line tool to

  disable the firewall during troubleshooting or to enable network mobility.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562.004
- attack.t1562
