title: Disabling Lsa Protection via Registry Modification
id: 37cb6756-8892-4af3-a6bd-ddc56db0069d
status: stable
level: high
description: 'LSA protecton is provided to prevent nonprotected processes from reading
  memory and injecting code. This feature provides added security for the credentials
  that LSA stores and manages.

  Adversaries may modify the RunAsPPL registry and wait or initiate a system restart
  to enable Lsass credentials access.'
author: Elastic (converted by SIEMLess)
date: '2025-05-27'
modified: '2025-10-07'
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    host_os_type: windows
    event_type: change
    registry_data_strings|contains:
    - '1'
    - '0x00000001'
    - '2'
    - '0x00000002'
    registry_path|endswith: \\SYSTEM\\*ControlSet*\\Control\\Lsa\\RunAsPPL
  condition: selection
tags:
- attack.defense_evasion
- attack.t1112
- attack.t1562.001
- attack.t1562
references:
- https://learn.microsoft.com/en-us/windows-server/security/credentials-protection-and-management/configuring-additional-lsa-protection
