title: Disable Windows Event and Security Logs Using Built-in Tools
id: 4de76544-f0e5-486a-8f84-eae0b6063cdc
status: stable
level: low
description: 'Identifies attempts to disable EventLog via the logman Windows utility,
  PowerShell, or auditpol. This is often done by

  attackers in an attempt to evade detection on a system.'
author: Elastic (converted by SIEMLess)
date: '2021-05-06'
modified: '2025-09-12'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_pe_original_file_name: AUDITPOL.EXE
    process_args|contains:
    - stop
    - delete
    process_name|contains:
    - pwsh.exe
    - powershell.exe
    - powershell_ise.exe
  condition: selection
tags:
- attack.defense_evasion
- attack.t1070.001
- attack.t1070
- attack.t1562
- attack.t1562.006
- attack.t1562.002
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/logman
- https://medium.com/palantir/tampering-with-windows-event-tracing-background-offense-and-defense-4be7ac62ac63
