title: DNF Package Manager Plugin File Creation
id: 3fe4e20c-a600-4a86-9d98-3ecb1ef23550
status: stable
level: low
description: 'Detects file creation events in the plugin directories for the Yum package
  manager. In Linux, DNF (Dandified YUM) is a

  command-line utility used for handling packages on Fedora-based systems, providing
  functions for installing, updating,

  upgrading, and removing software along with managing package repositories. Attackers
  can backdoor DNF to gain

  persistence by injecting malicious code into plugins that DNF runs, thereby ensuring
  continued unauthorized access or

  control each time DNF is used for package management.'
author: Elastic (converted by SIEMLess)
date: '2024-06-25'
modified: '2025-03-20'
logsource:
  product: linux
  category: file_event
detection:
  selection:
    host_os_type: linux
    process_name: perl
    file_path|contains:
    - /usr/lib/python*/site-packages/dnf-plugins/*
    - /etc/dnf/plugins/*
    process_executable|contains:
    - /nix/store/*
    - /var/lib/dpkg/*
    - /tmp/vmis.*
    - /snap/*
    - /dev/fd/*
    - /usr/lib/*
    - /usr/libexec/*
    - /etc/kernel/*
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1574
- attack.t1546.016
- attack.t1546
- attack.t1543
references:
- https://pwnshift.github.io/2020/10/01/persistence.html
- https://www.elastic.co/security-labs/sequel-on-persistence-mechanisms
