title: DNS-over-HTTPS Enabled via Registry
id: a22a09c2-2162-4df0-a356-9aacbeb56a04
status: stable
level: low
description: 'Identifies when a user enables DNS-over-HTTPS. This can be used to hide
  internet activity or the process of exfiltrating

  data. With this enabled, an organization will lose visibility into data such as
  query type, response, and originating

  IP, which are used to determine bad actors.'
author: Elastic (converted by SIEMLess)
date: '2021-07-22'
modified: '2025-08-26'
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    host_os_type: windows
    event_type: change
    registry_data_strings|contains:
    - '1'
    - '0x00000001'
    registry_path|endswith: \\SOFTWARE\\Policies\\Mozilla\\Firefox\\DNSOverHTTPS
  condition: selection
tags:
- attack.defense_evasion
- attack.t1112
- attack.t1562
references:
- https://www.tenforums.com/tutorials/151318-how-enable-disable-dns-over-https-doh-microsoft-edge.html
- https://chromeenterprise.google/policies/?policy=DnsOverHttpsMode
