title: Docker Socket Enumeration
id: dd983e79-22e8-44d1-9173-d57dba514cac
status: stable
level: low
description: 'This rule detects potential Docker socket enumeration activity by monitoring
  processes that attempt to interact with the

  Docker socket file (/var/run/docker.sock). Docker socket enumeration is a common
  technique used by attackers to interact

  with the Docker daemon and perform various operations, such as creating, starting,
  stopping, and removing containers.

  Attackers may abuse Docker socket enumeration to gain unauthorized access to the
  host system, escalate privileges, or

  move laterally within the environment.'
author: Elastic (converted by SIEMLess)
date: '2025-03-04'
modified: '2025-04-07'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
  condition: selection
tags:
- attack.discovery
- attack.t1613
