title: Domain Added to Google Workspace Trusted Domains
id: cf549724-c577-4fd6-8f9b-d1b8ec519ec0
status: stable
level: high
description: 'Detects when a domain is added to the list of trusted Google Workspace
  domains. An adversary may add a trusted domain in

  order to collect and exfiltrate data from their target’s organization with less
  restrictive security controls.'
author: Elastic (converted by SIEMLess)
date: '2020-11-17'
modified: '2024-09-23'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: google_workspace.admin
    event_provider: admin
    event_category: iam
    event_action: ADD_TRUSTED_DOMAINS
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562.007
- attack.t1562
references:
- https://support.google.com/a/answer/6160020?hl=en
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-one
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-two
falsepositives:
- "    Trusted domains may be added by system administrators. Verify that the configuration\
  \ change was expected. Exceptions\n    can be added to this rule to filter expected\
  \ behavior.\n    "
