title: Downloaded Shortcut Files
id: 39157d52-4035-44a8-9d1a-6f8c5f580a07
status: stable
level: medium
description: 'Identifies .lnk shortcut file downloaded from outside the local network.
  These shortcut files are commonly used in

  phishing campaigns.'
author: Elastic (converted by SIEMLess)
date: '2020-09-02'
modified: '2025-01-15'
logsource:
  product: windows
  category: file_event
detection:
  selection:
    host_os_type: windows
    event_type: creation
    file_extension: lnk
  condition: selection
tags:
- attack.initial_access
- attack.execution
- attack.t1566
- attack.t1204
- attack.t1566.001
- attack.t1204.002
- attack.t1566.002
