title: Downloaded URL Files
id: cd82e3d6-1346-4afd-8f22-38388bbf34cb
status: stable
level: medium
description: 'Identifies .url shortcut files downloaded from outside the local network.
  These shortcut files are commonly used in

  phishing campaigns.'
author: Elastic (converted by SIEMLess)
date: '2020-09-02'
modified: '2025-06-11'
logsource:
  product: windows
  category: file_event
detection:
  selection:
    host_os_type: windows
    event_type: creation
    file_extension: url
  condition: selection
tags:
- attack.initial_access
- attack.execution
- attack.t1566
- attack.t1566.001
- attack.t1204
- attack.t1566.002
