title: Dumping of Keychain Content via Security Command
id: 565d6ca5-75ba-4c82-9b13-add25353471c
status: stable
level: high
description: 'Adversaries may dump the content of the keychain storage data from a
  system to acquire credentials. Keychains are the

  built-in way for macOS to keep track of users'' passwords and credentials for many
  services and features, including Wi-Fi

  and website passwords, secure notes, certificates, and Kerberos.'
author: Elastic (converted by SIEMLess)
date: '2021-01-04'
modified: '2025-03-18'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
    process_args: -d
  condition: selection
tags:
- attack.credential_access
- attack.t1555.001
- attack.t1555
references:
- https://ss64.com/osx/security.html
