title: Egress Connection from Entrypoint in Container
id: c75d0c86-38d6-4821-98a1-465cff8ff4c8
status: stable
level: medium
description: 'This rule identifies a sequence of events where a process named `entrypoint.sh`
  is started in a container, followed by a

  network connection attempt. This sequence indicates a potential egress connection
  from an entrypoint in a container. An

  entrypoint is a command or script specified in the Dockerfile and executed when
  the container starts. Attackers can use

  this technique to establish a foothold in the environment, escape from a container
  to the host, or establish persistence.'
author: Elastic (converted by SIEMLess)
date: '2024-07-10'
modified: '2025-02-04'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by host.id with maxspan=3s\n  [process where host.os.type\
      \ == \"linux\" and event.type == \"start\" and event.action == \"exec\" and\n\
      \   process.entry_leader.entry_meta.type == \"container\" and process.name ==\
      \ \"entrypoint.sh\"] by process.entity_id\n  [network where event.type == \"\
      start\" and event.action == \"connection_attempted\" and not (\n     destination.ip\
      \ == null or destination.ip == \"0.0.0.0\" or cidrmatch(\n       destination.ip,\
      \ \"10.0.0.0/8\", \"127.0.0.0/8\", \"169.254.0.0/16\", \"172.16.0.0/12\", \"\
      192.0.0.0/24\", \"192.0.0.0/29\",\n       \"192.0.0.8/32\", \"192.0.0.9/32\"\
      , \"192.0.0.10/32\", \"192.0.0.170/32\", \"192.0.0.171/32\", \"192.0.2.0/24\"\
      ,\n       \"192.31.196.0/24\", \"192.52.193.0/24\", \"192.168.0.0/16\", \"192.88.99.0/24\"\
      , \"224.0.0.0/4\", \"100.64.0.0/10\",\n       \"192.175.48.0/24\",\"198.18.0.0/15\"\
      , \"198.51.100.0/24\", \"203.0.113.0/24\", \"240.0.0.0/4\", \"::1\", \"FE80::/10\"\
      ,\n       \"FF00::/8\", \"172.31.0.0/16\"\n       )\n    )] by process.parent.entity_id"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.privilege_escalation
- attack.execution
- attack.t1059
- attack.t1059.004
- attack.t1611
