title: Elastic Agent Service Terminated
id: b627cd12-dac4-11ec-9582-f661ea17fbcd
status: stable
level: medium
description: 'Identifies the Elastic endpoint agent has stopped and is no longer running
  on the host. Adversaries may attempt to

  disable security monitoring tools in an attempt to evade detection or prevention
  capabilities during an intrusion. This

  may also indicate an issue with the agent itself and should be addressed to ensure
  defensive measures are back in a

  stable state.'
author: Elastic (converted by SIEMLess)
date: '2022-05-23'
modified: '2025-11-04'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    event_type: end
    process_name|contains:
    - net.exe
    - sc.exe
    - wmic.exe
    - powershell.exe
    - taskkill.exe
    - PsKill.exe
    - ProcessHacker.exe
    process_args|contains:
    - stop
    - disable
    - remove
    - 'off'
    - kill
    - mask
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562
- attack.t1562.001
