title: Elastic Security External Alerts
id: 720fc1aa-e195-4a1d-81d8-04edfe5313ed
status: stable
level: medium
description: 'Generates a detection alert for each Elastic Security alert written
  to the configured indices. Enabling this rule allows

  you to immediately begin investigating Elastic Security alerts in the app.'
author: Elastic (converted by SIEMLess)
date: '2025-07-31'
modified: '2025-10-17'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_kind: alert
    data_stream_dataset: elastic_security.alert
  condition: selection
references:
- https://docs.elastic.co/en/integrations/elastic_security
