title: Emond Rules Creation or Modification
id: a6bf4dd4-743e-4da8-8c03-3ebd753a6c90
status: stable
level: medium
description: 'Identifies the creation or modification of the Event Monitor Daemon
  (emond) rules. Adversaries may abuse this service by

  writing a rule to execute commands when a defined event occurs, such as system start
  up or user authentication.'
author: Elastic (converted by SIEMLess)
date: '2021-01-11'
modified: '2025-03-18'
logsource:
  product: macos
  category: file_event
detection:
  selection:
    host_os_type: macos
    event_action: modification
  condition: selection
tags:
- attack.persistence
- attack.t1546.014
- attack.t1546
references:
- https://www.xorrior.com/emond-persistence/
- https://www.sentinelone.com/blog/how-malware-persists-on-macos/
