title: Enable Host Network Discovery via Netsh
id: 8b4f0816-6a65-4630-86a6-c21c179c0d09
status: stable
level: medium
description: 'Identifies use of the netsh.exe program to enable host discovery via
  the network. Attackers can use this command-line

  tool to weaken the host firewall settings.'
author: Elastic (converted by SIEMLess)
date: '2021-07-07'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_args|contains:
    - firewall
    - advfirewall
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562.004
- attack.t1562
falsepositives:
- Host Windows Firewall planned system administration changes.
