title: Encoded Executable Stored in the Registry
id: 93c1ce76-494c-4f01-8167-35edfb52f7b1
status: stable
level: medium
description: 'Identifies registry write modifications to hide an encoded portable
  executable. This could be indicative of adversary

  defense evasion by avoiding the storing of malicious content directly on disk.'
author: Elastic (converted by SIEMLess)
date: '2020-11-25'
modified: '2025-08-26'
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    host_os_type: windows
  condition: selection
tags:
- attack.defense_evasion
- attack.t1112
- attack.t1140
