title: Encrypting Files with WinRar or 7z
id: 45d273fb-1dca-457d-9855-bcb302180c21
status: stable
level: medium
description: 'Identifies use of WinRar or 7z to create an encrypted files. Adversaries
  will often compress and encrypt data in

  preparation for exfiltration.'
author: Elastic (converted by SIEMLess)
date: '2020-12-04'
modified: '2025-09-12'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_code_signature_subject_name: win.rar GmbH
    process_pe_original_file_name: WinRAR.exe
    process_args: a
    process_name|contains:
    - 7z.exe
    - 7za.exe
    process_args|contains:
    - -hp*
    - -p*
    - /hp*
    - /p*
    process_parent_executable|contains: C:\\Program Files\\*.exe
  condition: selection
tags:
- attack.collection
- attack.t1560.001
- attack.t1005
- attack.t1560
references:
- https://www.welivesecurity.com/2020/12/02/turla-crutch-keeping-back-door-open/
- https://www.elastic.co/security-labs/siestagraph-new-implant-uncovered-in-asean-member-foreign-ministry
