title: Endpoint Security (Elastic Defend)
id: 9a1a2dae-0b5f-4c3d-8305-a268d404c306
status: stable
level: medium
description: 'Generates a detection alert each time an Elastic Defend alert is received.
  Enabling this rule allows you to immediately

  begin investigating your Endpoint alerts.'
author: Elastic (converted by SIEMLess)
date: '2020-07-08'
modified: '2025-03-21'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_kind: alert
    event_module: (endpoint
  condition: selection
