title: Entra ID MFA Disabled for User
id: dafa3235-76dc-40e2-9f71-1773b96d24cf
status: stable
level: medium
description: 'Identifies when multi-factor authentication (MFA) is disabled for an
  Entra ID user account. An adversary may disable MFA

  for a user account in order to weaken the authentication requirements for the account.'
author: Elastic (converted by SIEMLess)
date: '2020-08-20'
modified: '2025-09-08'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: azure.auditlogs
    azure_auditlogs_operation_name: User
    azure_auditlogs_properties_additional_details_key: AuthenticationMethod
    event_outcome: (Success
  condition: selection
tags:
- attack.persistence
- attack.t1556.006
- attack.t1556
