title: Entra ID Global Administrator Role Assigned
id: 04c5a96f-19c5-44fd-9571-a0b033f9086f
status: stable
level: high
description: 'In Microsoft Entra ID, permissions to manage resources are assigned
  using roles. The Global Administrator

  is a role that enables users to have access to all administrative features in Microsoft
  Entra ID and services that use Microsoft Entra ID

  identities like the Microsoft 365 Defender portal, the Microsoft 365 compliance
  center, Exchange, SharePoint Online, and

  Skype for Business Online. Attackers can add users as Global Administrators to maintain
  access and manage all

  subscriptions and their settings and resources. They can also elevate privilege
  to User Access Administrator to pivot into Azure resources.'
author: Elastic (converted by SIEMLess)
date: '2022-01-06'
modified: '2025-09-26'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: azure.auditlogs
    azure_auditlogs_properties_category: RoleManagement
    azure_auditlogs_operation_name: Add
    new_value: \"Global
  condition: selection
tags:
- attack.persistence
- attack.t1098
- attack.t1098.003
references:
- https://securitylabs.datadoghq.com/articles/i-spy-escalating-to-entra-id-global-admin/
- https://docs.microsoft.com/en-us/azure/active-directory/roles/permissions-reference#global-administrator
- https://www.microsoft.com/en-us/security/blog/2025/08/27/storm-0501s-evolving-techniques-lead-to-cloud-based-ransomware/
