title: Enumeration of Users or Groups via Built-in Commands
id: 6e9b351e-a531-4bdc-b73e-7034d6eed7ff
status: stable
level: low
description: 'Identifies the execution of macOS built-in commands related to account
  or group enumeration. Adversaries may use account

  and group information to orient themselves before deciding how to act.'
author: Elastic (converted by SIEMLess)
date: '2021-01-12'
modified: '2025-03-18'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
    process_name: dscl
  condition: selection
tags:
- attack.discovery
- attack.t1087.001
- attack.t1069.001
- attack.t1069
- attack.t1087
