title: Enumeration Command Spawned via WMIPrvSE
id: 770e0c4d-b998-41e5-a62e-c7901fd7f470
status: stable
level: low
description: 'Identifies native Windows host and network enumeration commands spawned
  by the Windows Management Instrumentation

  Provider Service (WMIPrvSE).'
author: Elastic (converted by SIEMLess)
date: '2021-01-19'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - arp.exe
    - dsquery.exe
    - dsget.exe
    - gpresult.exe
    - hostname.exe
    - ipconfig.exe
    - nbtstat.exe
    - net.exe
    - net1.exe
    - netsh.exe
    - netstat.exe
    - nltest.exe
    - ping.exe
    - qprocess.exe
    - quser.exe
    - qwinsta.exe
    - reg.exe
    - sc.exe
    - systeminfo.exe
    - tasklist.exe
    - tracert.exe
    - whoami.exe
    process_args|contains:
    - demand
    - disabled
  condition: selection
tags:
- attack.discovery
- attack.execution
- attack.t1018
- attack.t1087
- attack.t1016.001
- attack.t1057
- attack.t1047
- attack.t1518
- attack.t1016
