title: Enumeration of Administrator Accounts
id: 871ea072-1b71-4def-b016-6278b505138d
status: stable
level: low
description: 'Identifies instances of lower privilege accounts enumerating Administrator
  accounts or groups using built-in Windows

  tools.'
author: Elastic (converted by SIEMLess)
date: '2020-12-04'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_pe_original_file_name: wmic.exe
    process_args|contains:
    - group
    - useraccount
    user_id|contains:
    - S-1-5-18
    - S-1-5-19
    - S-1-5-20
  condition: selection
tags:
- attack.discovery
- attack.t1069.002
- attack.t1087.001
- attack.t1069
- attack.t1087.002
- attack.t1069.001
- attack.t1087
