title: Enumerating Domain Trusts via DSQUERY.EXE
id: 06a7a03c-c735-47a6-a313-51c354aef6c3
status: stable
level: low
description: 'Identifies the use of dsquery.exe for domain trust discovery purposes.
  Adversaries may use this command-line utility to

  enumerate trust relationships that may be used for Lateral Movement opportunities
  in Windows multi-domain forest

  environments.'
author: Elastic (converted by SIEMLess)
date: '2023-01-27'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_args|endswith: objectClass=trustedDomain*
  condition: selection
tags:
- attack.discovery
- attack.t1482
- attack.t1018
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc732952(v=ws.11)
- https://posts.specterops.io/a-guide-to-attacking-domain-trusts-971e52cb2944
falsepositives:
- Domain administrators may use this command-line utility for legitimate information
  gathering purposes.
