title: ESXI Timestomping using Touch Command
id: 30bfddd7-2954-4c9d-bbc6-19a99ca47e23
status: stable
level: medium
description: 'Identifies instances where the ''touch'' command is executed on a Linux
  system with the "-r" flag, which is used to modify

  the timestamp of a file based on another file''s timestamp. The rule targets specific
  VM-related paths, such as

  "/etc/vmware/", "/usr/lib/vmware/", or "/vmfs/*". These paths are associated with
  VMware virtualization software, and

  their presence in the touch command arguments may indicate that a threat actor is
  attempting to tamper with timestamps

  of VM-related files and configurations on the system.'
author: Elastic (converted by SIEMLess)
date: '2023-04-11'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: touch
    process_args: -r
    process_args|contains:
    - /etc/vmware/*
    - /usr/lib/vmware/*
    - /vmfs/*
  condition: selection
tags:
- attack.defense_evasion
- attack.t1070.006
- attack.t1070
references:
- https://www.bleepingcomputer.com/news/security/massive-esxiargs-ransomware-attack-targets-vmware-esxi-servers-worldwide/
