title: ESXI Discovery via Find
id: 33a6752b-da5e-45f8-b13a-5f094c09522f
status: stable
level: medium
description: 'Identifies instances where the ''find'' command is started on a Linux
  system with arguments targeting specific VM-related

  paths, such as "/etc/vmware/", "/usr/lib/vmware/", or "/vmfs/*". These paths are
  associated with VMware virtualization

  software, and their presence in the find command arguments may indicate that a threat
  actor is attempting to search for,

  analyze, or manipulate VM-related files and configurations on the system.'
author: Elastic (converted by SIEMLess)
date: '2023-04-11'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: find
    process_parent_executable: /usr/lib/vmware/viewagent/bin/uninstall_viewagent.sh
    process_args|contains:
    - /etc/vmware/*
    - /usr/lib/vmware/*
    - /vmfs/*
  condition: selection
tags:
- attack.discovery
- attack.t1518
references:
- https://www.bleepingcomputer.com/news/security/massive-esxiargs-ransomware-attack-targets-vmware-esxi-servers-worldwide/
