title: Execution from Unusual Directory - Command Line
id: cff92c41-2225-4763-b4ce-6f71e5bda5e6
status: stable
level: medium
description: 'Identifies process execution from suspicious default Windows directories.
  This may be abused by adversaries to hide

  malware in trusted paths.'
author: Elastic (converted by SIEMLess)
date: '2020-10-30'
modified: '2025-05-05'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - wscript.exe
    - cscript.exe
    - rundll32.exe
    - regsvr32.exe
    - cmstp.exe
    - RegAsm.exe
    - installutil.exe
    - mshta.exe
    - RegSvcs.exe
    - powershell.exe
    - pwsh.exe
    - cmd.exe
    process_args|contains:
    - uxtheme.dll,#64
    - PRINTUI.DLL,PrintUIEntry
    - ?:\\Windows\\System32\\FirewallControlPanel.dll,ShowNotificationDialog
    - ?:\\WINDOWS\\system32\\Speech\\SpeechUX\\sapi.cpl
    - ?:\\Windows\\system32\\shell32.dll,OpenAs_RunDLL
    process_parent_executable|contains: ?:\\Windows\\System32\\oobe\\windeploy.exe
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.t1059
- attack.t1036.005
- attack.t1059.003
- attack.t1036
references:
- https://www.elastic.co/security-labs/elastic-protects-against-data-wiper-malware-targeting-ukraine-hermeticwiper
- https://www.elastic.co/security-labs/hunting-for-lateral-movement-using-event-query-language
