title: Execution with Explicit Credentials via Scripting
id: f0eb70e9-71e9-40cd-813f-bf8e8c812cb1
status: stable
level: medium
description: 'Identifies execution of the security_authtrampoline process via a scripting
  interpreter. This occurs when programs use

  AuthorizationExecute-WithPrivileges from the Security.framework to run another program
  with root privileges. It should

  not be run by itself, as this is a sign of execution with explicit logon credentials.'
author: Elastic (converted by SIEMLess)
date: '2020-12-07'
modified: '2025-03-18'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
    process_name: security_authtrampoline
  condition: selection
tags:
- attack.execution
- attack.privilege_escalation
- attack.t1059
- attack.t1548.004
- attack.t1078
- attack.t1548
references:
- https://objectivebythesea.com/v2/talks/OBTS_v2_Thomas.pdf
- https://www.manpagez.com/man/8/security_authtrampoline/
