title: Execution via TSClient Mountpoint
id: 4fe9d835-40e1-452d-8230-17c147cafad8
status: stable
level: high
description: 'Identifies execution from the Remote Desktop Protocol (RDP) shared mountpoint
  tsclient on the target host. This may

  indicate a lateral movement attempt.'
author: Elastic (converted by SIEMLess)
date: '2020-11-11'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
  condition: selection
tags:
- attack.lateral_movement
- attack.t1021.001
- attack.t1021
references:
- https://posts.specterops.io/revisiting-remote-desktop-lateral-movement-8fb905cb46c3
- https://www.elastic.co/security-labs/hunting-for-lateral-movement-using-event-query-language
