title: Execution via Electron Child Process Node.js Module
id: 35330ba2-c859-4c98-8b7f-c19159ea0e58
status: stable
level: medium
description: 'Identifies attempts to execute a child process from within the context
  of an Electron application using the

  child_process Node.js module. Adversaries may abuse this technique to inherit permissions
  from parent processes.'
author: Elastic (converted by SIEMLess)
date: '2020-01-07'
modified: '2025-03-18'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
    process_args: -e
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.t1059
- attack.t1548
references:
- https://www.matthewslipper.com/2019/09/22/everything-you-wanted-electron-child-process.html
- https://www.trustedsec.com/blog/macos-injection-via-third-party-frameworks/
- https://nodejs.org/api/child_process.html
