title: Executable Bit Set for Potential Persistence Script
id: 94418745-529f-4259-8d25-a713a6feb6ae
status: stable
level: low
description: 'This rule monitors for the addition of an executable bit for scripts
  that are located in directories which are commonly

  abused for persistence. An alert of this rule is an indicator that a persistence
  mechanism is being set up within your

  environment. Adversaries may create these scripts to execute malicious code at start-up,
  or at a set interval to gain

  persistence onto the system.'
author: Elastic (converted by SIEMLess)
date: '2024-06-03'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: install
    process_args|contains:
    - 7*
    - 5*
    - 3*
    - 1*
  condition: selection
tags:
- attack.persistence
- attack.t1053
- attack.t1053.003
- attack.t1547.013
- attack.t1037.004
- attack.t1037
- attack.t1547
references:
- https://www.intezer.com/blog/malware-analysis/hiddenwasp-malware-targeting-linux-systems/
- https://pberba.github.io/security/2022/02/06/linux-threat-hunting-for-persistence-initialization-scripts-and-shell-configuration/#8-boot-or-logon-initialization-scripts-rc-scripts
- https://www.cyberciti.biz/faq/how-to-enable-rc-local-shell-script-on-systemd-while-booting-linux-system/
- https://www.elastic.co/security-labs/sequel-on-persistence-mechanisms
