title: Execution of COM object via Xwizard
id: 1a6075b0-7479-450e-8fe7-b8b8438ac570
status: stable
level: medium
description: 'Windows Component Object Model (COM) is an inter-process communication
  (IPC) component of the native Windows application

  programming interface (API) that enables interaction between software objects or
  executable code. Xwizard can be used to

  run a COM object created in registry to evade defensive counter measures.'
author: Elastic (converted by SIEMLess)
date: '2021-01-20'
modified: '2025-08-28'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_executable|contains:
    - C:\\Windows\\SysWOW64\\xwizard.exe
    - C:\\Windows\\System32\\xwizard.exe
    - \\Device\\HarddiskVolume*\\Windows\\SysWOW64\\xwizard.exe
    - \\Device\\HarddiskVolume*\\Windows\\System32\\xwizard.exe
  condition: selection
tags:
- attack.execution
- attack.t1559
- attack.t1559.001
references:
- https://lolbas-project.github.io/lolbas/Binaries/Xwizard/
- http://www.hexacorn.com/blog/2017/07/31/the-wizard-of-x-oppa-plugx-style/
