title: Exporting Exchange Mailbox via PowerShell
id: 6aace640-e631-4870-ba8e-5fdda09325db
status: stable
level: medium
description: 'Identifies the use of the Exchange PowerShell cmdlet, New-MailBoxExportRequest,
  to export the contents of a primary

  mailbox or archive to a .pst file. Adversaries may target user email to collect
  sensitive information.'
author: Elastic (converted by SIEMLess)
date: '2020-12-15'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - powershell.exe
    - pwsh.exe
    - powershell_ise.exe
    process_command_line|contains:
    - '*MailboxExportRequest*'
    - '*-Mailbox*-ContentFilter*'
  condition: selection
tags:
- attack.execution
- attack.collection
- attack.t1114.002
- attack.t1059
- attack.t1005
- attack.t1059.001
- attack.t1114
references:
- https://www.volexity.com/blog/2020/12/14/dark-halo-leverages-solarwinds-compromise-to-breach-organizations/
- https://docs.microsoft.com/en-us/powershell/module/exchange/new-mailboxexportrequest?view=exchange-ps
- https://www.elastic.co/security-labs/siestagraph-new-implant-uncovered-in-asean-member-foreign-ministry
falsepositives:
- Legitimate exchange system administration activity.
