title: External Alerts
id: eb079c62-4481-4d6e-9643-3ca499df7aaa
status: stable
level: medium
description: 'Generates a detection alert for each external alert written to the configured
  indices. Enabling this rule allows you to

  immediately begin investigating external alerts in the app.'
author: Elastic (converted by SIEMLess)
date: '2020-07-08'
modified: '2025-03-21'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_kind: alert
    event_module: (endgame
  condition: selection
