title: File System Debugger Launched Inside a Container
id: 35c029c3-090e-4a25-b613-0b8099970fc1
status: stable
level: medium
description: 'This rule detects the use of the built-in Linux DebugFS utility from
  inside a container. DebugFS is a special

  file system debugging utility which supports reading and writing directly from a
  hard drive device. When launched inside

  a privileged container, a container deployed with all the capabilities of the host
  machine, an attacker can access

  sensitive host level files which could be used for further privilege escalation
  and container escapes to the host

  machine.'
author: Elastic (converted by SIEMLess)
date: '2025-03-12'
modified: '2025-03-12'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    event_action: exec
    process_entry_leader_entry_meta_type: container
    process_name: debugfs
    process_args: -R
  condition: selection
tags:
- attack.privilege_escalation
- attack.t1611
references:
- https://cyberark.wistia.com/medias/ygbzkzx93q?wvideo=ygbzkzx93q
- https://book.hacktricks.xyz/linux-hardening/privilege-escalation/docker-security/docker-breakout-privilege-escalation#privileged
