title: File made Immutable by Chattr
id: 968ccab9-da51-4a87-9ce2-d3c9782fd759
status: stable
level: medium
description: 'Detects a file being made immutable using the chattr binary. Making
  a file immutable means it cannot be deleted or

  renamed, no link can be created to this file, most of the file''s metadata can not
  be modified, and the file can not be

  opened in write mode. Threat actors will commonly utilize this to prevent tampering
  or modification of their malicious

  files or any system files they have modified for purposes of persistence (e.g .ssh,
  /etc/passwd, etc.).'
author: Elastic (converted by SIEMLess)
date: '2022-07-22'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_args|contains:
    - -*i*
    - +*i*
    process_parent_executable|contains:
    - /lib/systemd/systemd
    - /usr/local/uems_agent/bin/*
    - /usr/lib/systemd/systemd
  condition: selection
tags:
- attack.defense_evasion
- attack.t1222.002
- attack.t1222
