title: Full User-Mode Dumps Enabled System-Wide
id: 220be143-5c67-4fdb-b6ce-dd6826d024fd
status: stable
level: medium
description: 'Identifies the enable of the full user-mode dumps feature system-wide.
  This feature allows Windows Error Reporting (WER)

  to collect data after an application crashes. This setting is a requirement for
  the LSASS Shtinkering attack, which

  fakes the communication of a crash on LSASS, generating a dump of the process memory,
  which gives the attacker access to

  the credentials present on the system without having to bring malware to the system.
  This setting is not enabled by

  default, and applications must create their registry subkeys to hold settings that
  enable them to collect dumps.'
author: Elastic (converted by SIEMLess)
date: '2022-08-28'
modified: '2025-03-20'
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    host_os_type: windows
    registry_path|contains:
    - HKLM\\SOFTWARE\\Microsoft\\Windows\\Windows Error Reporting\\LocalDumps\\DumpType
    - \\REGISTRY\\MACHINE\\SOFTWARE\\Microsoft\\Windows\\Windows Error Reporting\\LocalDumps\\DumpType
    registry_data_strings|contains:
    - '2'
    - '0x00000002'
    user_id|contains:
    - S-1-5-18
    - S-1-5-19
    - S-1-5-20
  condition: selection
tags:
- attack.defense_evasion
- attack.credential_access
- attack.t1003
- attack.t1112
- attack.t1003.001
references:
- https://docs.microsoft.com/en-us/windows/win32/wer/collecting-user-mode-dumps
- https://github.com/deepinstinct/Lsass-Shtinkering
- https://media.defcon.org/DEF%20CON%2030/DEF%20CON%2030%20presentations/Asaf%20Gilboa%20-%20LSASS%20Shtinkering%20Abusing%20Windows%20Error%20Reporting%20to%20Dump%20LSASS.pdf
