title: GCP Service Account Creation
id: 7ceb2216-47dd-4e64-9433-cddc99727623
status: stable
level: low
description: 'Identifies when a new service account is created in Google Cloud Platform
  (GCP). A service account is a special type of

  account used by an application or a virtual machine (VM) instance, not a person.
  Applications use service accounts to

  make authorized API calls, authorized as either the service account itself, or as
  G Suite or Cloud Identity users

  through domain-wide delegation. If service accounts are not tracked and managed
  properly, they can present a security

  risk. An adversary may create a new service account to use during their operations
  in order to avoid using a standard

  user account and attempt to evade detection.'
author: Elastic (converted by SIEMLess)
date: '2020-09-22'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: gcp.audit
    event_action: google.iam.admin.v*.CreateServiceAccount
    event_outcome: success
  condition: selection
tags:
- attack.persistence
- attack.t1136
references:
- https://cloud.google.com/iam/docs/service-accounts
falsepositives:
- "    Service accounts can be created by system administrators. Verify that the behavior\
  \ was expected. Exceptions can be\n    added to this rule to filter expected behavior.\n\
  \    "
