title: GCP Logging Sink Deletion
id: 51859fa0-d86b-4214-bf48-ebb30ed91305
status: stable
level: medium
description: 'Identifies a Logging sink deletion in Google Cloud Platform (GCP). Every
  time a log entry arrives, Logging compares the

  log entry to the sinks in that resource. Each sink whose filter matches the log
  entry writes a copy of the log entry to

  the sink''s export destination. An adversary may delete a Logging sink to evade
  detection.'
author: Elastic (converted by SIEMLess)
date: '2020-09-18'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: gcp.audit
    event_action: google.logging.v*.ConfigServiceV*.DeleteSink
    event_outcome: success
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562
references:
- https://cloud.google.com/logging/docs/export
falsepositives:
- "    Logging sink deletions may be done by a system or network administrator. Verify\
  \ whether the user email, resource\n    name, and/or hostname should be making changes\
  \ in your environment. Logging sink deletions by unfamiliar users or\n    hosts\
  \ should be investigated. If known behavior is causing false positives, it can be\
  \ exempted from the rule.\n    "
