title: GCP Firewall Rule Modification
id: 2783d84f-5091-4d7d-9319-9fceda8fa71b
status: stable
level: medium
description: 'Identifies when a firewall rule is modified in Google Cloud Platform
  (GCP) for Virtual Private Cloud (VPC) or App

  Engine. These firewall rules can be modified to allow or deny connections to or
  from virtual machine (VM) instances or

  specific applications. An adversary may modify an existing firewall rule in order
  to weaken their target''s security

  controls and allow more permissive ingress or egress traffic flows for their benefit.'
author: Elastic (converted by SIEMLess)
date: '2020-09-21'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: gcp.audit
    event_action: (*.compute.firewalls.patch
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562
references:
- https://cloud.google.com/vpc/docs/firewalls
- https://cloud.google.com/appengine/docs/standard/python/understanding-firewalls
falsepositives:
- "    Firewall rules may be modified by system administrators. Verify that the firewall\
  \ configuration change was expected.\n    Exceptions can be added to this rule to\
  \ filter expected behavior.\n    "
