title: GCP Service Account Key Creation
id: 0e5acaae-6a64-4bbc-adb8-27649c03f7e1
status: stable
level: low
description: 'Identifies when a new key is created for a service account in Google
  Cloud Platform (GCP). A service account is a

  special type of account used by an application or a virtual machine (VM) instance,
  not a person. Applications use

  service accounts to make authorized API calls, authorized as either the service
  account itself, or as G Suite or Cloud

  Identity users through domain-wide delegation. If private keys are not tracked and
  managed properly, they can present a

  security risk. An adversary may create a new key for a service account in order
  to attempt to abuse the permissions

  assigned to that account and evade detection.'
author: Elastic (converted by SIEMLess)
date: '2020-09-21'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: gcp.audit
    event_action: google.iam.admin.v*.CreateServiceAccountKey
    event_outcome: success
  condition: selection
tags:
- attack.persistence
- attack.t1098
references:
- https://cloud.google.com/iam/docs/service-accounts
- https://cloud.google.com/iam/docs/creating-managing-service-account-keys
falsepositives:
- "    Service account keys may be created by system administrators. Verify that the\
  \ configuration change was expected.\n    Exceptions can be added to this rule to\
  \ filter expected behavior.\n    "
