title: GCP Firewall Rule Deletion
id: ff9b571e-61d6-4f6c-9561-eb4cca3bafe1
status: stable
level: medium
description: 'Identifies when a firewall rule is deleted in Google Cloud Platform
  (GCP) for Virtual Private Cloud (VPC) or App Engine.

  These firewall rules can be configured to allow or deny connections to or from virtual
  machine (VM) instances or

  specific applications. An adversary may delete a firewall rule in order to weaken
  their target''s security controls.'
author: Elastic (converted by SIEMLess)
date: '2020-09-21'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: gcp.audit
    event_action: (*.compute.firewalls.delete
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562
references:
- https://cloud.google.com/vpc/docs/firewalls
- https://cloud.google.com/appengine/docs/standard/python/understanding-firewalls
falsepositives:
- "    Firewall rules may be deleted by system administrators. Verify that the firewall\
  \ configuration change was expected.\n    Exceptions can be added to this rule to\
  \ filter expected behavior.\n    "
