title: GCP Pub/Sub Subscription Creation
id: d62b64a8-a7c9-43e5-aee3-15a725a794e7
status: stable
level: low
description: 'Identifies the creation of a subscription in Google Cloud Platform (GCP).
  In GCP, the publisher-subscriber relationship

  (Pub/Sub) is an asynchronous messaging service that decouples event-producing and
  event-processing services. A

  subscription is a named resource representing the stream of messages to be delivered
  to the subscribing application.'
author: Elastic (converted by SIEMLess)
date: '2020-09-23'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: gcp.audit
    event_action: google.pubsub.v*.Subscriber.CreateSubscription
    event_outcome: success
  condition: selection
tags:
- attack.collection
- attack.t1530
references:
- https://cloud.google.com/pubsub/docs/overview
falsepositives:
- "    Subscription creations may be done by a system or network administrator. Verify\
  \ whether the user email, resource\n    name, and/or hostname should be making changes\
  \ in your environment. Subscription creations by unfamiliar users or\n    hosts\
  \ should be investigated. If known behavior is causing false positives, it can be\
  \ exempted from the rule.\n    "
