title: GCP Service Account Deletion
id: 8fb75dda-c47a-4e34-8ecd-34facf7aad13
status: stable
level: medium
description: 'Identifies when a service account is deleted in Google Cloud Platform
  (GCP). A service account is a special type of

  account used by an application or a virtual machine (VM) instance, not a person.
  Applications use service accounts to

  make authorized API calls, authorized as either the service account itself, or as
  G Suite or Cloud Identity users

  through domain-wide delegation. An adversary may delete a service account in order
  to disrupt their target''s business

  operations.'
author: Elastic (converted by SIEMLess)
date: '2020-09-22'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: gcp.audit
    event_action: google.iam.admin.v*.DeleteServiceAccount
    event_outcome: success
  condition: selection
tags:
- attack.impact
- attack.t1531
references:
- https://cloud.google.com/iam/docs/service-accounts
falsepositives:
- "    Service accounts may be deleted by system administrators. Verify that the behavior\
  \ was expected. Exceptions can be\n    added to this rule to filter expected behavior.\n\
  \    "
