title: GCP Service Account Disabled
id: bca7d28e-4a48-47b1-adb7-5074310e9a61
status: stable
level: medium
description: 'Identifies when a service account is disabled in Google Cloud Platform
  (GCP). A service account is a special type of

  account used by an application or a virtual machine (VM) instance, not a person.
  Applications use service accounts to

  make authorized API calls, authorized as either the service account itself, or as
  G Suite or Cloud Identity users

  through domain-wide delegation. An adversary may disable a service account in order
  to disrupt to disrupt their target''s

  business operations.'
author: Elastic (converted by SIEMLess)
date: '2020-09-22'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: gcp.audit
    event_action: google.iam.admin.v*.DisableServiceAccount
    event_outcome: success
  condition: selection
tags:
- attack.impact
- attack.t1531
references:
- https://cloud.google.com/iam/docs/service-accounts
falsepositives:
- "    Service accounts may be disabled by system administrators. Verify that the\
  \ behavior was expected. Exceptions can be\n    added to this rule to filter expected\
  \ behavior.\n    "
