title: GCP Virtual Private Cloud Route Creation
id: 9180ffdf-f3d0-4db3-bf66-7a14bcff71b8
status: stable
level: low
description: 'Identifies when a virtual private cloud (VPC) route is created in Google
  Cloud Platform (GCP). Google Cloud routes

  define the paths that network traffic takes from a virtual machine (VM) instance
  to other destinations. These

  destinations can be inside a Google VPC network or outside it. An adversary may
  create a route in order to impact the

  flow of network traffic in their target''s cloud environment.'
author: Elastic (converted by SIEMLess)
date: '2020-09-22'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: gcp.audit
    event_action: (v*.compute.routes.insert
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562.007
- attack.t1562
references:
- https://cloud.google.com/vpc/docs/routes
- https://cloud.google.com/vpc/docs/using-routes
falsepositives:
- "    Virtual Private Cloud routes may be created by system administrators. Verify\
  \ that the configuration change was\n    expected. Exceptions can be added to this\
  \ rule to filter expected behavior.\n    "
