title: GCP Pub/Sub Subscription Deletion
id: cc89312d-6f47-48e4-a87c-4977bd4633c3
status: stable
level: low
description: 'Identifies the deletion of a subscription in Google Cloud Platform (GCP).
  In GCP, the publisher-subscriber relationship

  (Pub/Sub) is an asynchronous messaging service that decouples event-producing and
  event-processing services. A

  subscription is a named resource representing the stream of messages to be delivered
  to the subscribing application.'
author: Elastic (converted by SIEMLess)
date: '2020-09-23'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: gcp.audit
    event_action: google.pubsub.v*.Subscriber.DeleteSubscription
    event_outcome: success
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562
references:
- https://cloud.google.com/pubsub/docs/overview
falsepositives:
- "    Subscription deletions may be done by a system or network administrator. Verify\
  \ whether the user email, resource\n    name, and/or hostname should be making changes\
  \ in your environment. Subscription deletions by unfamiliar users or\n    hosts\
  \ should be investigated. If known behavior is causing false positives, it can be\
  \ exempted from the rule.\n    "
