title: GCP Logging Sink Modification
id: 184dfe52-2999-42d9-b9d1-d1ca54495a61
status: stable
level: low
description: 'Identifies a modification to a Logging sink in Google Cloud Platform
  (GCP). Logging compares the log entry to the sinks

  in that resource. Each sink whose filter matches the log entry writes a copy of
  the log entry to the sink''s export

  destination. An adversary may update a Logging sink to exfiltrate logs to a different
  export destination.'
author: Elastic (converted by SIEMLess)
date: '2020-09-22'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: gcp.audit
    event_action: google.logging.v*.ConfigServiceV*.UpdateSink
    event_outcome: success
  condition: selection
tags:
- attack.exfiltration
- attack.t1537
references:
- https://cloud.google.com/logging/docs/export#how_sinks_work
falsepositives:
- "    Logging sink modifications may be done by a system or network administrator.\
  \ Verify whether the user email, resource\n    name, and/or hostname should be making\
  \ changes in your environment. Sink modifications from unfamiliar users or\n   \
  \ hosts should be investigated. If known behavior is causing false positives, it\
  \ can be exempted from the rule.\n    "
