title: GCP Virtual Private Cloud Network Deletion
id: c58c3081-2e1d-4497-8491-e73a45d1a6d6
status: stable
level: medium
description: 'Identifies when a Virtual Private Cloud (VPC) network is deleted in
  Google Cloud Platform (GCP). A VPC network is a

  virtual version of a physical network within a GCP project. Each VPC network has
  its own subnets, routes, and firewall,

  as well as other elements. An adversary may delete a VPC network in order to disrupt
  their target''s network and business

  operations.'
author: Elastic (converted by SIEMLess)
date: '2020-09-22'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: gcp.audit
    event_action: v*.compute.networks.delete
    event_outcome: success
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562.007
- attack.t1562
references:
- https://cloud.google.com/vpc/docs/vpc
falsepositives:
- "    Virtual Private Cloud networks may be deleted by system administrators. Verify\
  \ that the configuration change was\n    expected. Exceptions can be added to this\
  \ rule to filter expected behavior.\n    "
