title: GCP Logging Bucket Deletion
id: 5663b693-0dea-4f2e-8275-f1ae5ff2de8e
status: stable
level: medium
description: 'Identifies a Logging bucket deletion in Google Cloud Platform (GCP).
  Log buckets are containers that store and organize

  log data. A deleted bucket stays in a pending state for 7 days, and Logging continues
  to route logs to the bucket during

  that time. To stop routing logs to a deleted bucket, you can delete the log sinks
  that have the bucket as their

  destination, or modify the filter for the sinks to stop it from routing logs to
  the deleted bucket. An adversary may

  delete a log bucket to evade detection.'
author: Elastic (converted by SIEMLess)
date: '2020-09-21'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: gcp.audit
    event_action: google.logging.v*.ConfigServiceV*.DeleteBucket
    event_outcome: success
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562
references:
- https://cloud.google.com/logging/docs/buckets
- https://cloud.google.com/logging/docs/storage
falsepositives:
- "    Logging bucket deletions may be done by a system or network administrator.\
  \ Verify whether the user email, resource\n    name, and/or hostname should be making\
  \ changes in your environment. Logging bucket deletions by unfamiliar users or\n\
  \    hosts should be investigated. If known behavior is causing false positives,\
  \ it can be exempted from the rule.\n    "
