title: GCP Virtual Private Cloud Route Deletion
id: a17bcc91-297b-459b-b5ce-bc7460d8f82a
status: stable
level: medium
description: 'Identifies when a Virtual Private Cloud (VPC) route is deleted in Google
  Cloud Platform (GCP). Google Cloud routes

  define the paths that network traffic takes from a virtual machine (VM) instance
  to other destinations. These

  destinations can be inside a Google VPC network or outside it. An adversary may
  delete a route in order to impact the

  flow of network traffic in their target''s cloud environment.'
author: Elastic (converted by SIEMLess)
date: '2020-09-22'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: gcp.audit
    event_action: v*.compute.routes.delete
    event_outcome: success
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562.007
- attack.t1562
references:
- https://cloud.google.com/vpc/docs/routes
- https://cloud.google.com/vpc/docs/using-routes
falsepositives:
- "    Virtual Private Cloud routes may be deleted by system administrators. Verify\
  \ that the configuration change was\n    expected. Exceptions can be added to this\
  \ rule to filter expected behavior.\n    "
