title: Git Hook Child Process
id: 7ce5e1c7-6a49-45e6-a101-0720d185667f
status: stable
level: low
description: 'This rule detects child processes spawned by Git hooks. Git hooks are
  scripts that Git executes before or after events

  such as commit, push, and receive. The rule identifies child processes spawned by
  Git hooks that are not typically

  spawned by the Git process itself. This behavior may indicate an attacker attempting
  to hide malicious activity by

  leveraging the legitimate Git process to execute unauthorized commands.'
author: Elastic (converted by SIEMLess)
date: '2024-06-26'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name|contains:
    - php*
    - perl*
    - ruby*
    - lua*
    process_executable|contains:
    - /boot/*
    - /dev/shm/*
    - /etc/cron.*/*
    - /etc/init.d/*
    - /etc/update-motd.d/*
    - /run/*
    - /srv/*
    - /tmp/*
    - /var/tmp/*
    - /var/log/*
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.execution
- attack.t1574
- attack.t1059.004
- attack.t1059
- attack.t1543
references:
- https://git-scm.com/docs/githooks/2.26.0
- https://www.elastic.co/security-labs/sequel-on-persistence-mechanisms
