title: GitHub Authentication Token Access via Node.js
id: e5d69377-f8cf-4e8f-8328-690822cd012a
status: stable
level: medium
description: 'This rule detects when the Node.js runtime spawns a shell to execute
  the GitHub CLI (gh) command to retrieve

  a GitHub authentication token. The GitHub CLI is a command-line tool that allows
  users to interact with

  GitHub from the terminal. The "gh auth token" command is used to retrieve an authentication
  token for

  GitHub, which can be used to authenticate API requests and perform actions on behalf
  of the user. Adversaries

  may use this technique to access GitHub repositories and potentially exfiltrate
  sensitive information or

  perform malicious actions. This activity was observed in the wild as part of the
  Shai-Hulud worm.'
author: Elastic (converted by SIEMLess)
date: '2025-09-18'
modified: '2025-10-17'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_parent_name: node
    process_args: gh auth token
  condition: selection
tags:
- attack.discovery
- attack.credential_access
- attack.t1528
- attack.t1613
- attack.t1552
references:
- https://www.elastic.co/blog/shai-hulud-worm-npm-supply-chain-compromise
