title: GitHub UEBA - Multiple Alerts from a GitHub Account
id: 929223b4-fba3-4a1c-a943-ec4716ad23ec
status: stable
level: medium
description: 'This rule is part of the "GitHub UEBA - Unusual Activity from Account
  Pack", and leverages alert data to determine when

  multiple alerts are executed by the same user in a timespan of one hour. Analysts
  can use this to prioritize triage and

  response, as these alerts are a higher indicator of compromised user accounts or
  PATs.'
author: Elastic (converted by SIEMLess)
date: '2023-12-14'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    signal_rule_tags: ("Use
    Case: UEBA
    Source: Github")
    kibana_alert_workflow_status: open
  condition: selection
tags:
- attack.execution
