title: GitHub Owner Role Granted To User
id: 9b343b62-d173-4cfd-bd8b-e6379f964ca4
status: stable
level: medium
description: 'This rule detects when a member is granted the organization owner role
  of a GitHub organization. This role provides

  admin level privileges. Any new owner role should be investigated to determine its
  validity. Unauthorized owner roles

  could indicate compromise within your organization and provide unlimited access
  to data and settings.'
author: Elastic (converted by SIEMLess)
date: '2023-09-11'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: github.audit
    event_action: org.update_member
    github_permission: admin
  condition: selection
tags:
- attack.persistence
- attack.t1098
- attack.t1098.003
