title: Google Workspace Password Policy Modified
id: a99f82f5-8e77-4f8b-b3ce-10c0f6afbc73
status: stable
level: medium
description: 'Detects when a Google Workspace password policy is modified. An adversary
  may attempt to modify a password policy in

  order to weaken an organization’s security controls.'
author: Elastic (converted by SIEMLess)
date: '2020-11-17'
modified: '2024-09-23'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: google_workspace.admin
    event_provider: admin
    event_category: iam
    event_action: (CHANGE_APPLICATION_SETTING
    google_workspace_admin_setting_name: (
  condition: selection
tags:
- attack.persistence
- attack.t1098
references:
- https://support.google.com/a/answer/7061566
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-one
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-two
falsepositives:
- "    Password policies may be modified by system administrators. Verify that the\
  \ configuration change was expected.\n    Exceptions can be added to this rule to\
  \ filter expected behavior.\n    "
