title: Google Workspace API Access Granted via Domain-Wide Delegation
id: acbc8bb9-2486-49a8-8779-45fb5f9a93ee
status: stable
level: medium
description: 'Detects when a domain-wide delegation of authority is granted to a service
  account. Domain-wide delegation can be

  configured to grant third-party and internal applications to access the data of
  Google Workspace users. An adversary may

  configure domain-wide delegation to maintain access to their target’s data.'
author: Elastic (converted by SIEMLess)
date: '2020-11-12'
modified: '2024-09-23'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: google_workspace.admin
    event_provider: admin
    event_category: iam
    event_action: AUTHORIZE_API_CLIENT_ACCESS
    event_outcome: success
  condition: selection
tags:
- attack.persistence
- attack.t1098
references:
- https://developers.google.com/admin-sdk/directory/v1/guides/delegation
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-one
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-two
falsepositives:
- "    Domain-wide delegation of authority may be granted to service accounts by system\
  \ administrators. Verify that the\n    configuration change was expected. Exceptions\
  \ can be added to this rule to filter expected behavior.\n    "
