title: Google Workspace User Organizational Unit Changed
id: cc6a8a20-2df2-11ed-8378-f661ea17fbce
status: stable
level: low
description: 'Users in Google Workspace are typically assigned a specific organizational
  unit that grants them permissions to certain

  services and roles that are inherited from this organizational unit. Adversaries
  may compromise a valid account and

  change which organizational account the user belongs to which then could allow them
  to inherit permissions to

  applications and resources inaccessible prior to.'
author: Elastic (converted by SIEMLess)
date: '2022-09-06'
modified: '2024-09-23'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: google_workspace.admin
    event_type: change
    event_category: iam
    google_workspace_event_type: USER_SETTINGS
    event_action: MOVE_USER_TO_ORG_UNIT
  condition: selection
tags:
- attack.persistence
- attack.t1098
- attack.t1098.003
references:
- https://support.google.com/a/answer/6328701?hl=en#
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-one
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-two
falsepositives:
- "    Google Workspace administrators may adjust change which organizational unit\
  \ a user belongs to as a result of\n    internal role adjustments.\n    "
