title: Google Workspace Drive Encryption Key(s) Accessed from Anonymous User
id: 980b70a0-c820-11ed-8799-f661ea17fbcc
status: stable
level: high
description: 'Detects when an external (anonymous) user has viewed, copied or downloaded
  an encryption key file from a Google

  Workspace drive. Adversaries may gain access to encryption keys stored in private
  drives from rogue access links that do

  not have an expiration. Access to encryption keys may allow adversaries to access
  sensitive data or authenticate on

  behalf of users.'
author: Elastic (converted by SIEMLess)
date: '2023-03-21'
modified: '2025-01-15'
logsource:
  product: windows
  category: file_event
detection:
  selection:
    event_dataset: google_workspace.drive
    event_action|contains:
    - copy
    - view
    - download
    file_extension|contains:
    - token
    - assig
    - pssc
    - keystore
    - pub
    - pgp.asc
    - ps1xml
    - pem
    - gpg.sig
    - der
    - key
    - p7r
    - p12
    - asc
    - jks
    - p7b
    - signature
    - gpg
    - pgp.sig
    - sst
    - pgp
    - gpgz
    - pfx
    - crt
    - p8
    - sig
    - pkcs7
    - jceks
    - pkcs8
    - psc1
    - p7c
    - csr
    - cer
    - spc
    - ps2xml
  condition: selection
tags:
- attack.credential_access
- attack.t1552
- attack.t1552.004
references:
- https://support.google.com/drive/answer/2494822
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-one
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-two
falsepositives:
- "    A user may generate a shared access link to encryption key files to share with\
  \ others. It is unlikely that the\n    intended recipient is an external or anonymous\
  \ user.\n    "
