title: Google Workspace Admin Role Assigned to a User
id: 68994a6c-c7ba-4e82-b476-26a26877adf6
status: stable
level: high
description: 'Assigning the administrative role to a user will grant them access to
  the Google Admin console and grant them

  administrator privileges which allow them to access and manage various resources
  and applications. An adversary may

  create a new administrator account for persistence or apply the admin role to an
  existing user to carry out further

  intrusion efforts. Users with super-admin privileges can bypass single-sign on if
  enabled in Google Workspace.'
author: Elastic (converted by SIEMLess)
date: '2020-11-17'
modified: '2024-09-23'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: google_workspace.admin
    event_category: iam
    event_action: ASSIGN_ROLE
    google_workspace_event_type: DELEGATED_ADMIN_SETTINGS
    google_workspace_admin_role_name: '*_ADMIN_ROLE'
  condition: selection
tags:
- attack.persistence
- attack.t1098
- attack.t1098.003
references:
- https://support.google.com/a/answer/172176?hl=en
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-one
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-two
falsepositives:
- "    Google Workspace admin role assignments may be modified by system administrators.\
  \ Verify that the configuration\n    change was expected. Exceptions can be added\
  \ to this rule to filter expected behavior.\n    "
