title: Google Workspace Custom Admin Role Created
id: ad3f2807-2b3e-47d7-b282-f84acbbe14be
status: stable
level: medium
description: 'Detects when a custom admin role is created in Google Workspace. An
  adversary may create a custom admin role in order to

  elevate the permissions of other user accounts and persist in their target’s environment.'
author: Elastic (converted by SIEMLess)
date: '2020-11-17'
modified: '2024-09-23'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: google_workspace.admin
    event_provider: admin
    event_category: iam
    event_action: CREATE_ROLE
  condition: selection
tags:
- attack.persistence
- attack.t1098
references:
- https://support.google.com/a/answer/2406043?hl=en
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-one
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-two
falsepositives:
- "    Custom Google Workspace admin roles may be created by system administrators.\
  \ Verify that the configuration change\n    was expected. Exceptions can be added\
  \ to this rule to filter expected behavior.\n    "
