title: Google Workspace Restrictions for Marketplace Modified to Allow Any App
id: a2795334-2499-11ed-9e1a-f661ea17fbce
status: stable
level: medium
description: 'Detects when the Google Marketplace restrictions are changed to allow
  any application for users in Google Workspace.

  Malicious APKs created by adversaries may be uploaded to the Google marketplace
  but not installed on devices managed

  within Google Workspace. Administrators should set restrictions to not allow any
  application from the marketplace for

  security reasons. Adversaries may enable any app to be installed and executed on
  mobile devices within a Google

  Workspace environment prior to distributing the malicious APK to the end user.'
author: Elastic (converted by SIEMLess)
date: '2022-08-25'
modified: '2024-09-23'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: google_workspace.admin
    event_action: CHANGE_APPLICATION_SETTING
    event_category: (iam
    google_workspace_event_type: APPLICATION_SETTINGS
    google_workspace_admin_application_name: Google
    google_workspace_admin_setting_name: Apps
    google_workspace_admin_new_value: ALLOW_ALL
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562
- attack.t1562.001
references:
- https://support.google.com/a/answer/6089179?hl=en
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-one
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-two
falsepositives:
- "    Applications can be added and removed from blocklists by Google Workspace administrators,\
  \ but they can all be\n    explicitly allowed for users. Verify that the configuration\
  \ change was expected. Exceptions can be added to this\n    rule to filter expected\
  \ behavior.\n    "
