title: Google SecOps External Alerts
id: 70558fd5-6448-4c65-804a-8567ce02c3a2
status: stable
level: medium
description: 'Generates a detection alert for each Google SecOps alert written to
  the configured indices. Enabling this rule allows

  you to immediately begin investigating Google SecOps alerts in the app.'
author: Elastic (converted by SIEMLess)
date: '2025-07-31'
modified: '2025-10-17'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_kind: alert
    data_stream_dataset: google_secops.alert
  condition: selection
references:
- https://docs.elastic.co/en/integrations/google_secops
