title: Google Workspace Admin Role Deletion
id: 93e63c3e-4154-4fc6-9f86-b411e0987bbf
status: stable
level: medium
description: 'Detects when a custom admin role is deleted. An adversary may delete
  a custom admin role in order to impact the

  permissions or capabilities of system administrators.'
author: Elastic (converted by SIEMLess)
date: '2020-11-17'
modified: '2024-09-23'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: google_workspace.admin
    event_provider: admin
    event_category: iam
    event_action: DELETE_ROLE
  condition: selection
tags:
- attack.impact
- attack.t1531
references:
- https://support.google.com/a/answer/2406043?hl=en
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-one
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-two
falsepositives:
- "    Google Workspace admin roles may be deleted by system administrators. Verify\
  \ that the configuration change was\n    expected. Exceptions can be added to this\
  \ rule to filter expected behavior.\n    "
