title: Group Policy Abuse for Privilege Addition
id: b9554892-5e0e-424b-83a0-5aef95aa43bf
status: stable
level: high
description: 'Detects the first occurrence of a modification to Group Policy Object
  Attributes to add privileges to user accounts or

  use them to add users as local admins.'
author: Elastic (converted by SIEMLess)
date: '2021-11-08'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    winlog_event_data_AttributeValue|endswith: 803E14A0-B4FB-11D0-A0D0-00A0C90F574B*
  condition: selection
tags:
- attack.privilege_escalation
- attack.t1484.001
- attack.t1484
references:
- https://github.com/atc-project/atc-data/blob/master/docs/Logging_Policies/LP_0025_windows_audit_directory_service_changes.md
- https://labs.f-secure.com/tools/sharpgpoabuse
