title: Group Policy Discovery via Microsoft GPResult Utility
id: 94a401ba-4fa2-455c-b7ae-b6e037afc0b7
status: stable
level: low
description: 'Detects the usage of gpresult.exe to query group policy objects. Attackers
  may query group policy objects during the

  reconnaissance phase after compromising a system to gain a better understanding
  of the active directory environment and

  possible methods to escalate privileges or move laterally.'
author: Elastic (converted by SIEMLess)
date: '2023-01-18'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_pe_original_file_name: gprslt.exe
    process_args|contains:
    - /z
    - /v
    - /r
    - /x
  condition: selection
tags:
- attack.discovery
- attack.t1615
