title: Halfbaked Command and Control Beacon
id: 2e580225-2a58-48ef-938b-572933be06fe
status: stable
level: high
description: 'Halfbaked is a malware family used to establish persistence in a contested
  network. This rule detects a network activity

  algorithm leveraged by Halfbaked implant beacons for command and control.'
author: Elastic (converted by SIEMLess)
date: '2020-07-06'
modified: '2025-01-15'
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    event_dataset: (network_traffic.tls
    event_category: (network
    network_protocol: http))
    network_transport: tcp
    url_full: /http:\/\/[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}\/cd/
    destination_port: (53
  condition: selection
tags:
- attack.command_and_control
- attack.t1568.002
- attack.t1071
- attack.t1568
references:
- https://www.fireeye.com/blog/threat-research/2017/04/fin7-phishing-lnk.html
- https://attack.mitre.org/software/S0151/
falsepositives:
- "    This rule should be tailored to exclude systems, either as sources or destinations,\
  \ in which this behavior is\n    expected.\n    "
