title: Hidden Files and Directories via Hidden Flag
id: 5124e65f-df97-4471-8dcb-8e3953b3ea97
status: stable
level: low
description: 'Identify activity related where adversaries can add the ''hidden'' flag
  to files to hide them from the user in an attempt

  to evade detection.'
author: Elastic (converted by SIEMLess)
date: '2023-08-23'
modified: '2025-03-20'
logsource:
  product: linux
  category: file_event
detection:
  selection:
    host_os_type: linux
    event_type: creation
    process_name: chflags
  condition: selection
tags:
- attack.defense_evasion
- attack.t1564
- attack.t1564.001
