title: High Number of Okta User Password Reset or Unlock Attempts
id: e90ee3af-45fc-432e-a850-4a58cf14a457
status: stable
level: medium
description: 'Identifies a high number of Okta user password reset or account unlock
  attempts. An adversary may attempt to obtain

  unauthorized access to Okta user accounts using these methods and attempt to blend
  in with normal activity in their

  target''s environment and evade detection.'
author: Elastic (converted by SIEMLess)
date: '2020-08-19'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: okta.system
    event_action: (system.email.account_unlock.sent_message
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.initial_access
- attack.t1078
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
- https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy
- https://www.elastic.co/security-labs/monitoring-okta-threats-with-elastic-security
- https://www.elastic.co/security-labs/starter-guide-to-understanding-okta
falsepositives:
- "    The number of Okta user password reset or account unlock attempts will likely\
  \ vary between organizations. To fit\n    this rule to their organization, users\
  \ can duplicate this rule and edit the schedule and threshold values in the new\n\
  \    rule.\n    "
