title: Hping Process Activity
id: 90169566-2260-4824-b8e4-8615c3b4ed52
status: stable
level: medium
description: 'Hping ran on a Linux host. Hping is a FOSS command-line packet analyzer
  and has the ability to construct network packets

  for a wide variety of network security testing applications, including scanning
  and firewall auditing.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
  condition: selection
tags:
- attack.discovery
- attack.t1082
references:
- https://en.wikipedia.org/wiki/Hping
falsepositives:
- "    Normal use of hping is uncommon apart from security testing and research. Use\
  \ by non-security engineers is very\n    uncommon.\n    "
