title: Image File Execution Options Injection
id: 6839c821-011d-43bd-bd5b-acff00257226
status: stable
level: medium
description: 'The Debugger and SilentProcessExit registry keys can allow an adversary
  to intercept the execution of files, causing a

  different process to be executed. This functionality can be abused by an adversary
  to establish persistence.'
author: Elastic (converted by SIEMLess)
date: '2020-11-17'
modified: '2025-08-26'
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    host_os_type: windows
    event_type: change
    registry_value|contains:
    - Debugger
    - MonitorProcess
    registry_path|contains:
    - HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution
      Options\\*.exe\\Debugger
    - HKLM\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows NT\\CurrentVersion\\Image File
      Execution Options\\*\\Debugger
    - HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\SilentProcessExit\\*\\MonitorProcess
    - HKLM\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows NT\\CurrentVersion\\SilentProcessExit\\*\\MonitorProcess
    - \\REGISTRY\\MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image
      File Execution Options\\*.exe\\Debugger
    - \\REGISTRY\\MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows NT\\CurrentVersion\\Image
      File Execution Options\\*\\Debugger
    - \\REGISTRY\\MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\SilentProcessExit\\*\\MonitorProcess
    - \\REGISTRY\\MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows NT\\CurrentVersion\\SilentProcessExit\\*\\MonitorProcess
    - MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution
      Options\\*.exe\\Debugger
    - MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows NT\\CurrentVersion\\Image
      File Execution Options\\*\\Debugger
    - MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\SilentProcessExit\\*\\MonitorProcess
    - MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows NT\\CurrentVersion\\SilentProcessExit\\*\\MonitorProcess
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1546.012
- attack.t1112
- attack.t1546
references:
- https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/
