title: Inbound Connection to an Unsecure Elasticsearch Node
id: 31295df3-277b-4c56-a1fb-84e31b4222a9
status: stable
level: medium
description: 'Identifies Elasticsearch nodes that do not have Transport Layer Security
  (TLS), and/or lack authentication, and are

  accepting inbound network connections over the default Elasticsearch port.'
author: Elastic (converted by SIEMLess)
date: '2020-08-11'
modified: '2025-01-15'
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    event_dataset: network_traffic.http
    event_category: network_traffic
    network_protocol: http))
    status: OK
    destination_port: '9200'
    network_direction: inbound
    type: image/x-icon
    _exists_: http.request.headers.authorization
  condition: selection
tags:
- attack.initial_access
- attack.t1190
references:
- https://www.elastic.co/guide/en/elasticsearch/reference/current/configuring-security.html
- https://www.elastic.co/guide/en/beats/packetbeat/current/packetbeat-http-options.html#_send_all_headers
falsepositives:
- "    If you have front-facing proxies that provide authentication and TLS, this\
  \ rule would need to be tuned to eliminate\n    the source IP address of your reverse-proxy.\n\
  \    "
