title: InstallUtil Process Making Network Connections
id: a13167f1-eec2-4015-9631-1fee60406dcf
status: stable
level: medium
description: 'Identifies InstallUtil.exe making outbound network connections. This
  may indicate adversarial activity as InstallUtil is

  often leveraged by adversaries to execute code and evade detection.'
author: Elastic (converted by SIEMLess)
date: '2020-09-02'
modified: '2025-08-26'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "/* the benefit of doing this as an eql sequence vs kql is this\
      \ will limit to alerting only on the first network connection */\n\nsequence\
      \ by process.entity_id\n  [process where host.os.type == \"windows\" and event.type\
      \ == \"start\" and process.name : \"installutil.exe\"]\n  [network where host.os.type\
      \ == \"windows\" and process.name : \"installutil.exe\" and network.direction\
      \ : (\"outgoing\", \"egress\")]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.defense_evasion
- attack.t1218
- attack.t1218.004
