title: Interactive Terminal Spawned via Perl
id: 05e5a668-7b51-4a67-93ab-e9af405c9ef3
status: stable
level: high
description: 'Identifies when a terminal (tty) is spawned via Perl. Attackers may
  upgrade a simple reverse shell to a fully

  interactive tty after obtaining initial access to a host.'
author: Elastic (converted by SIEMLess)
date: '2020-04-16'
modified: '2025-10-17'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    event_category: process
    host_os_type: linux
    event_type: (start
    process_name: perl
    process_args: ("exec
  condition: selection
tags:
- attack.execution
- attack.t1059
