title: IPSEC NAT Traversal Port Activity
id: a9cb3641-ff4b-4cdc-a063-b4b8d02a67c7
status: stable
level: low
description: 'This rule detects events that could be describing IPSEC NAT Traversal
  traffic. IPSEC is a VPN technology that allows one

  system to talk to another using encrypted tunnels. NAT Traversal enables these tunnels
  to communicate over the Internet

  where one of the sides is behind a NAT router gateway. This may be common on your
  network, but this technique is also

  used by threat actors to avoid detection.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-01-15'
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    event_dataset: network_traffic.flow
    event_category: (network
    network_transport: udp
    destination_port: '4500'
  condition: selection
tags:
- attack.command_and_control
falsepositives:
- "    Some networks may utilize these protocols but usage that is unfamiliar to local\
  \ network administrators can be\n    unexpected and suspicious. Because this port\
  \ is in the ephemeral range, this rule may false under certain\n    conditions,\
  \ such as when an application server with a public IP address replies to a client\
  \ which has used a UDP\n    port in the range by coincidence. This is uncommon but\
  \ such servers can be excluded.\n    "
