title: Kerberos Cached Credentials Dumping
id: ad88231f-e2ab-491c-8fc6-64746da26cfe
status: stable
level: high
description: 'Identifies the use of the Kerberos credential cache (kcc) utility to
  dump locally cached Kerberos tickets. Adversaries

  may attempt to dump credential material in the form of tickets that can be leveraged
  for lateral movement.'
author: Elastic (converted by SIEMLess)
date: '2020-08-14'
modified: '2025-03-18'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
    process_name: kcc
  condition: selection
tags:
- attack.credential_access
- attack.t1003
- attack.t1558
- attack.t1558.003
references:
- https://github.com/EmpireProject/EmPyre/blob/master/lib/modules/collection/osx/kerberosdump.py
- https://opensource.apple.com/source/Heimdal/Heimdal-323.12/kuser/kcc-commands.in.auto.html
