title: Kernel Module Removal
id: cd66a5af-e34b-4bb0-8931-57d0a043f2ef
status: stable
level: medium
description: 'Kernel modules are pieces of code that can be loaded and unloaded into
  the kernel upon demand. They extend the

  functionality of the kernel without the need to reboot the system. This rule identifies
  attempts to remove a kernel

  module.'
author: Elastic (converted by SIEMLess)
date: '2020-04-24'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: modprobe
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1547
- attack.t1562
- attack.t1562.001
- attack.t1547.006
references:
- http://man7.org/linux/man-pages/man8/modprobe.8.html
falsepositives:
- "    There is usually no reason to remove modules, but some buggy modules require\
  \ it. These can be exempted by username.\n    Note that some Linux distributions\
  \ are not built to support the removal of modules at all.\n    "
