title: Kernel Seeking Activity
id: 3c9f7901-01d8-465d-8dc0-5d46671035fa
status: stable
level: low
description: 'This rule detects kernel seeking activity through several built-in Linux
  utilities. Attackers may use these utilities

  to search the Linux kernel for available symbols, functions, and other information
  that can be used to exploit the

  kernel.'
author: Elastic (converted by SIEMLess)
date: '2025-01-07'
modified: '2025-02-04'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    event_action: exec
    process_name: dd
    process_args: -s
  condition: selection
tags:
- attack.defense_evasion
- attack.discovery
- attack.t1082
- attack.t1014
references:
- https://www.elastic.co/security-labs/declawing-pumakit
