title: Keychain Password Retrieval via Command Line
id: 9092cd6c-650f-4fa3-8a8a-28256c7489c9
status: stable
level: high
description: 'Adversaries may collect keychain storage data from a system to in order
  to acquire credentials. Keychains are the

  built-in way for macOS to keep track of users'' passwords and credentials for many
  services and features, including Wi-Fi

  and website passwords, secure notes, certificates, and Kerberos.'
author: Elastic (converted by SIEMLess)
date: '2020-01-06'
modified: '2025-03-18'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
    event_action: exec
    process_name: security
    process_command_line|contains:
    - '*Chrome*'
    - '*Chromium*'
    - '*Opera*'
    - '*Safari*'
    - '*Brave*'
    - '*Microsoft Edge*'
    - '*Firefox*'
  condition: selection
tags:
- attack.credential_access
- attack.t1555.003
- attack.t1555.001
- attack.t1555
references:
- https://www.netmeister.org/blog/keychain-passwords.html
- https://github.com/priyankchheda/chrome_password_grabber/blob/master/chrome.py
- https://ss64.com/osx/security.html
- https://www.intezer.com/blog/research/operation-electrorat-attacker-creates-fake-companies-to-drain-your-crypto-wallets/
falsepositives:
- Applications for password management.
