title: Keychain CommandLine Interaction via Unsigned or Untrusted Process
id: 96e90768-c3b7-4df6-b5d9-6237f8bc36a8
status: stable
level: high
description: 'Adversaries may collect the keychain storage data from a system to acquire
  credentials. Keychains are the built-in way

  for macOS to keep track of users'' passwords and credentials for many services and
  features such as WiFi passwords,

  websites, secure notes and certificates.'
author: Elastic (converted by SIEMLess)
date: '2020-08-14'
modified: '2025-04-21'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
    event_action: exec
  condition: selection
tags:
- attack.credential_access
- attack.t1555.001
- attack.t1555
references:
- https://objective-see.com/blog/blog_0x25.html
- https://securelist.com/calisto-trojan-for-macos/86543/
