title: Kubernetes User Exec into Pod
id: 14de811c-d60f-11ec-9fd7-f661ea17fbce
status: stable
level: medium
description: 'This rule detects a user attempt to establish a shell session into a
  pod using the ''exec'' command. Using the ''exec''

  command in a pod allows a user to establish a temporary shell session and execute
  any process/commands in the pod. An

  adversary may call bash to gain a persistent interactive shell which will allow
  access to any data the pod has

  permissions to, including secrets.'
author: Elastic (converted by SIEMLess)
date: '2022-05-17'
modified: '2025-06-18'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_dataset: kubernetes.audit_logs
    kubernetes_audit_objectRef_subresource: exec
    kubernetes_audit_stage: ResponseComplete
  condition: selection
tags:
- attack.execution
- attack.t1609
references:
- https://kubernetes.io/docs/tasks/debug/debug-application/debug-running-pod/
- https://kubernetes.io/docs/tasks/debug/debug-application/get-shell-running-container/
falsepositives:
- "    An administrator may need to exec into a pod for a legitimate reason like debugging\
  \ purposes. Containers built from\n    Linux and Windows OS images, tend to include\
  \ debugging utilities. In this case, an admin may choose to run commands\n    inside\
  \ a specific container with kubectl exec ${POD_NAME} -c ${CONTAINER_NAME} -- ${CMD}\
  \ ${ARG1} ${ARG2} ...\n    ${ARGN}. For example, the following command can be used\
  \ to look at logs from a running Cassandra pod: kubectl exec\n    cassandra --cat\
  \ /var/log/cassandra/system.log . Additionally, the -i and -t arguments might be\
  \ used to run a shell\n    connected to the terminal: kubectl exec -i -t cassandra\
  \ -- sh\n    "
