title: Kubernetes Denied Service Account Request
id: 63c056a0-339a-11ed-a261-0242ac120002
status: stable
level: medium
description: 'This rule detects when a service account makes an unauthorized request
  for resources from the API server. Service

  accounts follow a very predictable pattern of behavior. A service account should
  never send an unauthorized request to

  the API server. This behavior is likely an indicator of compromise or of a problem
  within the cluster. An adversary may

  have gained access to credentials/tokens and this could be an attempt to access
  or create resources to facilitate

  further movement or execution within the cluster.'
author: Elastic (converted by SIEMLess)
date: '2022-09-13'
modified: '2025-06-18'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: kubernetes.audit_logs
    kubernetes_audit_user_username: system\:serviceaccount\:*
    decision: forbid
  condition: selection
tags:
- attack.discovery
- attack.t1613
references:
- https://research.nccgroup.com/2021/11/10/detection-engineering-for-kubernetes-clusters/#part3-kubernetes-detections
- https://kubernetes.io/docs/reference/access-authn-authz/authentication/#service-account-tokens
falsepositives:
- "    Unauthorized requests from service accounts are highly abnormal and more indicative\
  \ of human behavior or a serious\n    problem within the cluster. This behavior\
  \ should be investigated further.\n    "
