title: Kubernetes Pod Created With HostIPC
id: 764c8437-a581-4537-8060-1fdb0e92c92d
status: stable
level: medium
description: 'This rule detects an attempt to create or modify a pod using the host
  IPC namespace. This gives access to data used by

  any pod that also use the hosts IPC namespace. If any process on the host or any
  processes in a pod uses the hosts

  inter-process communication mechanisms (shared memory, semaphore arrays, message
  queues, etc.), an attacker can

  read/write to those same mechanisms. They may look for files in /dev/shm or use
  ipcs to check for any IPC facilities

  being used.'
author: Elastic (converted by SIEMLess)
date: '2022-07-05'
modified: '2025-06-18'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: kubernetes.audit_logs
    decision: allow
    kubernetes_audit_objectRef_resource: pods
    kubernetes_audit_verb: ("create
    kubernetes_audit_requestObject_spec_hostIPC: 'true'
    kubernetes_audit_requestObject_spec_containers_image: ("docker.elastic.co/beats/elastic-agent:8.4.0")
  condition: selection
tags:
- attack.execution
- attack.privilege_escalation
- attack.t1610
- attack.t1611
references:
- https://research.nccgroup.com/2021/11/10/detection-engineering-for-kubernetes-clusters/#part3-kubernetes-detections
- https://kubernetes.io/docs/concepts/security/pod-security-policy/#host-namespaces
- https://bishopfox.com/blog/kubernetes-pod-privilege-escalation
falsepositives:
- "    An administrator or developer may want to use a pod that runs as root and shares\
  \ the host's IPC, Network, and PID\n    namespaces for debugging purposes. If something\
  \ is going wrong in the cluster and there is no easy way to SSH onto\n    the host\
  \ nodes directly, a privileged pod of this nature can be useful for viewing things\
  \ like iptable rules and\n    network namespaces from the host's perspective. Add\
  \ exceptions for trusted container images using the query field\n    \"kubernetes.audit.requestObject.spec.container.image\"\
  \n    "
