title: Kubernetes Direct API Request via Curl or Wget
id: b53f1d73-150d-484d-8f02-222abeb5d5fa
status: stable
level: medium
description: 'This rule monitors for the execution of curl or wget commands that directly
  access Kubernetes API endpoints,

  which may indicate an attempt to interact with Kubernetes resources in a potentially
  unauthorized manner. This

  technique is often used by adversaries to gather information about the Kubernetes
  environment, such as secrets,

  config maps, and other sensitive data, without using the official Kubernetes client
  tools such as "kubectl".'
author: Elastic (converted by SIEMLess)
date: '2025-06-23'
modified: '2025-07-07'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
  condition: selection
tags:
- attack.discovery
- attack.execution
- attack.t1613
- attack.t1059
- attack.t1059.004
