title: Kubernetes Exposed Service Created With Type NodePort
id: 65f9bccd-510b-40df-8263-334f03174fed
status: stable
level: medium
description: 'This rule detects an attempt to create or modify a service as type NodePort.
  The NodePort service allows a user to

  externally expose a set of labeled pods to the internet. This creates an open port
  on every worker node in the cluster

  that has a pod for that service. When external traffic is received on that open
  port, it directs it to the specific pod

  through the service representing it. A malicious user can configure a service as
  type Nodeport in order to intercept

  traffic from other pods or nodes, bypassing firewalls and other network security
  measures configured for load balancers

  within a cluster. This creates a direct method of communication between the cluster
  and the outside world, which could

  be used for more malicious behavior and certainly widens the attack surface of your
  cluster.'
author: Elastic (converted by SIEMLess)
date: '2022-07-05'
modified: '2025-06-18'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: kubernetes.audit_logs
    decision: allow
    kubernetes_audit_objectRef_resource: services
    kubernetes_audit_verb: ("create
    kubernetes_audit_requestObject_spec_type: NodePort
  condition: selection
tags:
- attack.persistence
- attack.t1133
references:
- https://kubernetes.io/docs/concepts/services-networking/service/#publishing-services-service-types
- https://kubernetes.io/docs/concepts/services-networking/service/#type-nodeport
- https://www.tigera.io/blog/new-vulnerability-exposes-kubernetes-to-man-in-the-middle-attacks-heres-how-to-mitigate/
falsepositives:
- "    Developers may have a legitimate use for NodePorts. For frontend parts of an\
  \ application you may want to expose a\n    Service onto an external IP address\
  \ without using cloud specific Loadbalancers. NodePort can be used to expose the\n\
  \    Service on each Node's IP at a static port (the NodePort). You'll be able to\
  \ contact the NodePort Service from\n    outside the cluster, by requesting <NodeIP>:<NodePort>.\
  \ NodePort unlike Loadbalancers, allow the freedom to set up\n    your own load\
  \ balancing solution, configure environments that aren't fully supported by Kubernetes,\
  \ or even to\n    expose one or more node's IPs directly.\n    "
