title: Kubernetes Pod Created With HostPID
id: df7fda76-c92b-4943-bc68-04460a5ea5ba
status: stable
level: medium
description: 'This rule detects an attempt to create or modify a pod attached to the
  host PID namespace. HostPID allows a pod to

  access all the processes running on the host and could allow an attacker to take
  malicious action. When paired with

  ptrace this can be used to escalate privileges outside of the container. When paired
  with a privileged container, the

  pod can see all of the processes on the host. An attacker can enter the init system
  (PID 1) on the host. From there,

  they could execute a shell and continue to escalate privileges to root.'
author: Elastic (converted by SIEMLess)
date: '2022-07-05'
modified: '2025-06-18'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: kubernetes.audit_logs
    decision: allow
    kubernetes_audit_objectRef_resource: pods
    kubernetes_audit_verb: ("create
    kubernetes_audit_requestObject_spec_hostPID: 'true'
    kubernetes_audit_requestObject_spec_containers_image: ("docker.elastic.co/beats/elastic-agent:8.4.0")
  condition: selection
tags:
- attack.execution
- attack.privilege_escalation
- attack.t1610
- attack.t1611
references:
- https://research.nccgroup.com/2021/11/10/detection-engineering-for-kubernetes-clusters/#part3-kubernetes-detections
- https://kubernetes.io/docs/concepts/security/pod-security-policy/#host-namespaces
- https://bishopfox.com/blog/kubernetes-pod-privilege-escalation
falsepositives:
- "    An administrator or developer may want to use a pod that runs as root and shares\
  \ the hosts IPC, Network, and PID\n    namespaces for debugging purposes. If something\
  \ is going wrong in the cluster and there is no easy way to SSH onto\n    the host\
  \ nodes directly, a privileged pod of this nature can be useful for viewing things\
  \ like iptable rules and\n    network namespaces from the host's perspective. Add\
  \ exceptions for trusted container images using the query field\n    \"kubernetes.audit.requestObject.spec.container.image\"\
  \n    "
