title: Kubernetes Pod created with a Sensitive hostPath Volume
id: 2abda169-416b-4bb3-9a6b-f8d239fd78ba
status: stable
level: medium
description: 'This rule detects when a pod is created with a sensitive volume of type
  hostPath. A hostPath volume type mounts a

  sensitive file or folder from the node to the container. If the container gets compromised,
  the attacker can use this

  mount for gaining access to the node. There are many ways a container with unrestricted
  access to the host filesystem

  can escalate privileges, including reading data from other containers, and accessing
  tokens of more privileged pods.'
author: Elastic (converted by SIEMLess)
date: '2022-07-11'
modified: '2025-06-18'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: kubernetes.audit_logs
    decision: allow
    kubernetes_audit_objectRef_resource: pods
    kubernetes_audit_verb: ("create
    kubernetes_audit_requestObject_spec_volumes_hostPath_path: ("/
    kubernetes_audit_requestObject_spec_containers_image: ("docker.elastic.co/beats/elastic-agent:8.4.0")
  condition: selection
tags:
- attack.execution
- attack.privilege_escalation
- attack.t1610
- attack.t1611
references:
- https://blog.appsecco.com/kubernetes-namespace-breakout-using-insecure-host-path-volume-part-1-b382f2a6e216
- https://kubernetes.io/docs/concepts/storage/volumes/#hostpath
falsepositives:
- "    An administrator may need to attach a hostPath volume for a legitimate reason.\
  \ This alert should be investigated for\n    legitimacy by determining if the kuberenetes.audit.requestObject.spec.volumes.hostPath.path\
  \ triggered is one needed\n    by its target container/pod. For example, when the\
  \ fleet managed elastic agent is deployed as a daemonset it creates\n    several\
  \ hostPath volume mounts, some of which are sensitive host directories like /proc,\
  \ /etc/kubernetes, and\n    /var/log. Add exceptions for trusted container images\
  \ using the query field\n    \"kubernetes.audit.requestObject.spec.container.image\"\
  \n    "
