title: Kubernetes Suspicious Assignment of Controller Service Account
id: 63c05204-339a-11ed-a261-0242ac120002
status: stable
level: medium
description: 'This rule detects a request to attach a controller service account to
  an existing or new pod running in the kube-system

  namespace. By default, controllers running as part of the API Server utilize admin-equivalent
  service accounts hosted in

  the kube-system namespace. Controller service accounts aren''t normally assigned
  to running pods and could indicate

  adversary behavior within the cluster. An attacker that can create or modify pods
  or pod controllers in the kube-system

  namespace, can assign one of these admin-equivalent service accounts to a pod and
  abuse their powerful token to escalate

  privileges and gain complete cluster control.'
author: Elastic (converted by SIEMLess)
date: '2022-09-13'
modified: '2025-06-18'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: kubernetes.audit_logs
    decision: allow
    kubernetes_audit_verb: create
    kubernetes_audit_objectRef_resource: pods
    kubernetes_audit_objectRef_namespace: kube-system
    kubernetes_audit_requestObject_spec_serviceAccountName: '*controller'
  condition: selection
tags:
- attack.privilege_escalation
- attack.t1078.001
- attack.t1078
references:
- https://www.paloaltonetworks.com/apps/pan/public/downloadResource?pagePath=/content/pan/en_US/resources/whitepapers/kubernetes-privilege-escalation-excessive-permissions-in-popular-platforms
falsepositives:
- "    Controller service accounts aren't normally assigned to running pods, this\
  \ is abnormal behavior with very few\n    legitimate use-cases and should result\
  \ in very few false positives.\n    "
