title: Kubernetes Service Account Secret Access
id: ce73954b-a0a4-4f05-b67b-294c500dac77
status: stable
level: medium
description: 'This rule detects when a process accesses Kubernetes service account
  secrets. Kubernetes service

  account secrets are files that contain sensitive information used by applications
  running in Kubernetes

  clusters to authenticate and authorize access to the cluster. These secrets are
  typically mounted into

  pods at runtime, allowing applications to access them securely. Unauthorized access
  to these secrets

  can lead to privilege escalation, lateral movement and unauthorized actions within
  the cluster.'
author: Elastic (converted by SIEMLess)
date: '2025-06-17'
modified: '2025-07-07'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    event_action: exec
  condition: selection
tags:
- attack.discovery
- attack.credential_access
- attack.t1528
- attack.t1613
- attack.t1552
