title: Kubernetes Pod Created With HostNetwork
id: 12cbf709-69e8-4055-94f9-24314385c27e
status: stable
level: medium
description: 'This rules detects an attempt to create or modify a pod attached to
  the host network. HostNetwork allows a pod to use

  the node network namespace. Doing so gives the pod access to any service running
  on localhost of the host. An attacker

  could use this access to snoop on network activity of other pods on the same node
  or bypass restrictive network policies

  applied to its given namespace.'
author: Elastic (converted by SIEMLess)
date: '2022-07-05'
modified: '2025-06-18'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: kubernetes.audit_logs
    decision: allow
    kubernetes_audit_objectRef_resource: pods
    kubernetes_audit_verb: ("create
    kubernetes_audit_requestObject_spec_hostNetwork: 'true'
    kubernetes_audit_requestObject_spec_containers_image: ("docker.elastic.co/beats/elastic-agent:8.4.0")
  condition: selection
tags:
- attack.execution
- attack.privilege_escalation
- attack.t1610
- attack.t1611
references:
- https://research.nccgroup.com/2021/11/10/detection-engineering-for-kubernetes-clusters/#part3-kubernetes-detections
- https://kubernetes.io/docs/concepts/security/pod-security-policy/#host-namespaces
- https://bishopfox.com/blog/kubernetes-pod-privilege-escalation
falsepositives:
- "    An administrator or developer may want to use a pod that runs as root and shares\
  \ the hosts IPC, Network, and PID\n    namespaces for debugging purposes. If something\
  \ is going wrong in the cluster and there is no easy way to SSH onto\n    the host\
  \ nodes directly, a privileged pod of this nature can be useful for viewing things\
  \ like iptable rules and\n    network namespaces from the host's perspective. Add\
  \ exceptions for trusted container images using the query field\n    \"kubernetes.audit.requestObject.spec.container.image\"\
  \n    "
