title: Lateral Movement via Startup Folder
id: 25224a80-5a4a-4b8a-991e-6ab390465c4f
status: stable
level: high
description: 'Identifies suspicious file creations in the startup folder of a remote
  system. An adversary could abuse this to move

  laterally by dropping a malicious script or executable that will be executed after
  a reboot or user logon.'
author: Elastic (converted by SIEMLess)
date: '2020-10-19'
modified: '2025-03-20'
logsource:
  product: windows
  category: file_event
detection:
  selection:
    host_os_type: windows
    file_path|contains:
    - ?:\\Users\\*\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\*
    - ?:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\*
  condition: selection
tags:
- attack.persistence
- attack.lateral_movement
- attack.t1547.001
- attack.t1021.001
- attack.t1021
- attack.t1547
references:
- https://www.mdsec.co.uk/2017/06/rdpinception/
- https://www.elastic.co/security-labs/hunting-for-lateral-movement-using-event-query-language
