title: Linux Restricted Shell Breakout via Linux Binary(s)
id: 52376a86-ee86-4967-97ae-1a05f55816f0
status: stable
level: medium
description: 'Identifies the abuse of a Linux binary to break out of a restricted
  shell or environment by spawning an interactive

  system shell. The activity of spawning a shell from a binary is not common behavior
  for a user or system administrator,

  and may indicate an attempt to evade detection, increase capabilities or enhance
  the stability of an adversary.'
author: Elastic (converted by SIEMLess)
date: '2022-05-06'
modified: '2025-02-04'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: env
    process_args: --
    process_parent_name: ssh
    process_parent_args: -o
    event_action: exec
    process_parent_args|contains:
    - '*PAGER*'
    - '!*sh'
    - exec *sh
    process_args|contains:
    - '*PAGER*'
    - '!*sh'
    - exec *sh
    process_parent_name|contains:
    - byebug
    - ftp
    - strace
    - zip
    - tar
    process_parent_name|endswith: awk
    process_parent_args|endswith: sh,-s
    process_args|endswith: sh
  condition: selection
tags:
- attack.execution
- attack.t1059
- attack.t1059.004
references:
- https://gtfobins.github.io/gtfobins/apt/
- https://gtfobins.github.io/gtfobins/apt-get/
- https://gtfobins.github.io/gtfobins/nawk/
- https://gtfobins.github.io/gtfobins/mawk/
- https://gtfobins.github.io/gtfobins/awk/
- https://gtfobins.github.io/gtfobins/gawk/
- https://gtfobins.github.io/gtfobins/busybox/
- https://gtfobins.github.io/gtfobins/c89/
- https://gtfobins.github.io/gtfobins/c99/
- https://gtfobins.github.io/gtfobins/cpulimit/
- https://gtfobins.github.io/gtfobins/crash/
- https://gtfobins.github.io/gtfobins/env/
- https://gtfobins.github.io/gtfobins/expect/
- https://gtfobins.github.io/gtfobins/find/
- https://gtfobins.github.io/gtfobins/flock/
- https://gtfobins.github.io/gtfobins/gcc/
- https://gtfobins.github.io/gtfobins/mysql/
- https://gtfobins.github.io/gtfobins/nice/
- https://gtfobins.github.io/gtfobins/ssh/
- https://gtfobins.github.io/gtfobins/vi/
- https://gtfobins.github.io/gtfobins/vim/
- https://gtfobins.github.io/gtfobins/capsh/
- https://gtfobins.github.io/gtfobins/byebug/
- https://gtfobins.github.io/gtfobins/git/
- https://gtfobins.github.io/gtfobins/ftp/
- https://www.elastic.co/security-labs/sequel-on-persistence-mechanisms
