title: Linux init (PID 1) Secret Dump via GDB
id: d4ff2f53-c802-4d2e-9fb9-9ecc08356c3f
status: stable
level: medium
description: 'This rule monitors for the potential memory dump of the init process
  (PID 1) through gdb. Attackers may leverage memory

  dumping techniques to attempt secret extraction from privileged processes. Tools
  that display this behavior include

  "truffleproc" and "bash-memory-dump". This behavior should not happen by default,
  and should be investigated thoroughly.'
author: Elastic (converted by SIEMLess)
date: '2023-08-30'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: gdb
    process_args: '1'
  condition: selection
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.007
references:
- https://github.com/controlplaneio/truffleproc
- https://github.com/hajzer/bash-memory-dump
