title: Linux User Account Creation
id: edfd5ca9-9d6c-44d9-b615-1e56b920219c
status: stable
level: low
description: Identifies attempts to create new users. Attackers may add new users
  to establish persistence on a system.
author: Elastic (converted by SIEMLess)
date: '2023-02-13'
modified: '2025-02-03'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: creation
  condition: selection
tags:
- attack.persistence
- attack.t1136.001
- attack.t1136
references:
- https://www.elastic.co/security-labs/primer-on-persistence-mechanisms
