title: Linux Telegram API Request
id: af1e36fe-0abd-4463-b5ec-4e276dec0b26
status: stable
level: low
description: 'This rule detects when a process executes the curl or wget command with
  an argument that includes the

  api.telegram.org domain. This may indicate command and control behavior.'
author: Elastic (converted by SIEMLess)
date: '2025-04-29'
modified: '2025-10-17'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
  condition: selection
tags:
- attack.command_and_control
- attack.t1071.001
- attack.t1071
