title: Linux User Account Credential Modification
id: 79e7291f-9e3b-4a4b-9823-800daa89c8f9
status: stable
level: low
description: 'This rule detects Linux user account credential modification events
  where the echo command is

  used to directly echo a password into the passwd utility. This technique is used
  by malware

  to automate the process of user account credential modification on Linux systems
  post-infection.'
author: Elastic (converted by SIEMLess)
date: '2025-02-21'
modified: '2025-04-07'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    event_action: exec
    process_parent_command_line: runc init
  condition: selection
tags:
- attack.persistence
- attack.t1098
