title: Linux Group Creation
id: a1c2589e-0c8c-4ca8-9eb6-f83c4bbdbe8f
status: stable
level: low
description: Identifies attempts to create a new group. Attackers may create new groups
  to establish persistence on a system.
author: Elastic (converted by SIEMLess)
date: '2023-02-13'
modified: '2025-02-03'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: creation
  condition: selection
tags:
- attack.persistence
- attack.t1136.001
- attack.t1136
references:
- https://www.elastic.co/security-labs/primer-on-persistence-mechanisms
