title: LSASS Process Access via Windows API
id: ff4599cb-409f-4910-a239-52e4e6f532ff
status: stable
level: medium
description: Identifies access attempts to the LSASS handle, which may indicate an
  attempt to dump credentials from LSASS memory.
author: Elastic (converted by SIEMLess)
date: '2023-03-02'
modified: '2025-02-03'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    process_executable|contains:
    - ?:\\ProgramData\\GetSupportService*\\Updates\\Update_*.exe
    - ?:\\ProgramData\\Microsoft\\Windows Defender\\Platform\\*\\MsMpEng.exe
  condition: selection
tags:
- attack.execution
- attack.credential_access
- attack.t1003
- attack.t1106
- attack.t1003.001
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.001/T1003.001.md
