title: M365 Threat Intelligence Signal
id: 60c814fc-7d06-11f0-b326-f661ea17fbcd
status: stable
level: medium
description: 'Identifies a Microsoft 365 audit log generated for Threat Intelligence
  signals by Microsoft Defender for Office 365.

  Signals generated may relate to services such as Exchange Online, SharePoint Online,
  OneDrive for Business and others.'
author: Elastic (converted by SIEMLess)
date: '2025-08-19'
modified: '2025-09-01'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: o365.audit
    event_provider: ThreatIntelligence
  condition: selection
tags:
- attack.initial_access
- attack.t1566
references:
- https://learn.microsoft.com/en-us/purview/audit-supported-services
- https://www.octiga.io/en-gb/insights/nist-csf-for-office-365
- https://learn.microsoft.com/en-us/office/office-365-management-api/office-365-management-activity-api-schema
falsepositives:
- "    Signals are generated by Microsoft Defender for Office 365. False-positives\
  \ may occur if legitimate user activity is\n    misclassified as a threat.\n    "
