title: Machine Learning Detected DGA activity using a known SUNBURST DNS domain
id: bcaa15ce-2d41-44d7-a322-918f9db77766
status: stable
level: high
description: 'A supervised machine learning model has identified a DNS question name
  that used by the SUNBURST malware and is

  predicted to be the result of a Domain Generation Algorithm.'
author: Elastic (converted by SIEMLess)
date: '2023-09-14'
modified: '2025-04-22'
logsource:
  product: windows
  category: dns_query
detection:
  selection:
    ml_is_dga_malicious_prediction: '1'
    dns_question_registered_domain: avsvmcloud.com
  condition: selection
tags:
- attack.command_and_control
- attack.t1568.002
- attack.t1568
references:
- https://www.elastic.co/guide/en/security/current/prebuilt-ml-jobs.html
- https://docs.elastic.co/en/integrations/dga
- https://www.elastic.co/security-labs/detect-domain-generation-algorithm-activity-with-new-kibana-integration
