title: Machine Learning Detected a DNS Request Predicted to be a DGA Domain
id: f3403393-1fd9-4686-8f6e-596c58bc00b4
status: stable
level: low
description: 'A supervised machine learning model has identified a DNS question name
  that is predicted to be the result of a Domain

  Generation Algorithm (DGA), which could indicate command and control network activity.'
author: Elastic (converted by SIEMLess)
date: '2023-09-14'
modified: '2025-01-15'
logsource:
  product: windows
  category: dns_query
detection:
  selection:
    ml_is_dga_malicious_prediction: '1'
    dns_question_registered_domain: avsvmcloud.com
  condition: selection
tags:
- attack.command_and_control
- attack.t1568.002
- attack.t1568
references:
- https://www.elastic.co/guide/en/security/current/prebuilt-ml-jobs.html
- https://docs.elastic.co/en/integrations/dga
- https://www.elastic.co/security-labs/detect-domain-generation-algorithm-activity-with-new-kibana-integration
