title: Malicious File - Prevented - Elastic Defend
id: f87e6122-ea34-11ee-a417-f661ea17fbce
status: stable
level: low
description: 'Generates a detection alert each time an Elastic Defend alert for malicious
  files is received. Enabling this rule allows

  you to immediately begin investigating your Endpoint malicious file alerts. This
  rule identifies Elastic Defend

  malicious file preventions only, and does not include detection only alerts.'
author: Elastic (converted by SIEMLess)
date: '2024-03-24'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_kind: alert
    event_code: malicious_file
    event_type: denied
    event_outcome: success
  condition: selection
tags:
- attack.execution
- attack.t1204.002
- attack.t1204
references:
- https://github.com/elastic/protections-artifacts/tree/main/yara
- https://docs.elastic.co/en/integrations/endpoint
