title: Manual Dracut Execution
id: 834ee026-f9f9-4ec7-b5e0-7fbfe84765f4
status: stable
level: low
description: 'This rule detects manual execution of the `dracut` command on Linux
  systems. Dracut is a tool used to generate an

  initramfs image that is used to boot the system. Attackers may use `dracut` to create
  a custom initramfs image that

  includes malicious code or backdoors, allowing them to maintain persistence on the
  system.'
author: Elastic (converted by SIEMLess)
date: '2025-01-16'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: dracut
  condition: selection
tags:
- attack.persistence
- attack.execution
- attack.t1059
- attack.t1059.004
- attack.t1542
