title: Memory Swap Modification
id: 5e4023e7-6357-4061-ae1c-9df33e78c674
status: stable
level: low
description: 'This rule detects memory swap modification events on Linux systems.
  Memory swap modification can be used to manipulate

  the system''s memory and potentially impact the system''s performance. This behavior
  is commonly observed in malware that

  deploys miner software such as XMRig.'
author: Elastic (converted by SIEMLess)
date: '2024-11-04'
modified: '2025-10-17'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: sysctl
    process_args: -c
  condition: selection
tags:
- attack.impact
- attack.execution
- attack.t1496
- attack.t1059
- attack.t1059.004
