title: MFA Disabled for Google Workspace Organization
id: e555105c-ba6d-481f-82bb-9b633e7b4827
status: stable
level: medium
description: 'Detects when multi-factor authentication (MFA) is disabled for a Google
  Workspace organization. An adversary may attempt

  to modify a password policy in order to weaken an organization’s security controls.'
author: Elastic (converted by SIEMLess)
date: '2020-11-17'
modified: '2024-09-23'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: google_workspace.admin
    event_provider: admin
    event_category: iam
    event_action: (ENFORCE_STRONG_AUTHENTICATION
    google_workspace_admin_new_value: 'false'
  condition: selection
tags:
- attack.persistence
- attack.t1556
references:
- https://support.google.com/a/answer/7061566
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-one
- https://www.elastic.co/security-labs/google-workspace-attack-surface-part-two
falsepositives:
- "    MFA settings may be modified by system administrators. Verify that the configuration\
  \ change was expected. Exceptions\n    can be added to this rule to filter expected\
  \ behavior.\n    "
