title: Microsoft 365 Exchange Safe Attachment Rule Disabled
id: 03024bd9-d23f-4ec1-8674-3cf1a21e130b
status: stable
level: low
description: 'Identifies when a safe attachment rule is disabled in Microsoft 365.
  Safe attachment rules can extend malware

  protections to include routing all messages and attachments without a known malware
  signature to a special hypervisor

  environment. An adversary or insider threat may disable a safe attachment rule to
  exfiltrate data or evade defenses.'
author: Elastic (converted by SIEMLess)
date: '2020-11-19'
modified: '2025-09-26'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: o365.audit
    event_provider: Exchange
    event_category: web
    event_action: Disable-SafeAttachmentRule
    event_outcome: success
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562
references:
- https://docs.microsoft.com/en-us/powershell/module/exchange/disable-safeattachmentrule?view=exchange-ps
falsepositives:
- "    A safe attachment rule may be disabled by a system or network administrator.\
  \ Verify that the configuration change\n    was expected. Exceptions can be added\
  \ to this rule to filter expected behavior.\n    "
