title: Microsoft 365 Exchange Transport Rule Creation
id: ff4dd44a-0ac6-44c4-8609-3f81bc820f02
status: stable
level: medium
description: 'Identifies a transport rule creation in Microsoft 365. As a best practice,
  Exchange Online mail transport rules should

  not be set to forward email to domains outside of your organization. An adversary
  may create transport rules to

  exfiltrate data.'
author: Elastic (converted by SIEMLess)
date: '2020-11-18'
modified: '2025-09-26'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: o365.audit
    event_provider: Exchange
    event_category: web
    event_action: New-TransportRule
    event_outcome: success
  condition: selection
tags:
- attack.exfiltration
- attack.t1537
references:
- https://docs.microsoft.com/en-us/powershell/module/exchange/new-transportrule?view=exchange-ps
- https://docs.microsoft.com/en-us/exchange/security-and-compliance/mail-flow-rules/mail-flow-rules
falsepositives:
- "    A new transport rule may be created by a system or network administrator. Verify\
  \ that the configuration change was\n    expected. Exceptions can be added to this\
  \ rule to filter expected behavior.\n    "
