title: Microsoft 365 Exchange DKIM Signing Configuration Disabled
id: 514121ce-c7b6-474a-8237-68ff71672379
status: stable
level: medium
description: 'Identifies when a DomainKeys Identified Mail (DKIM) signing configuration
  is disabled in Microsoft 365. With DKIM in

  Microsoft 365, messages that are sent from Exchange Online will be cryptographically
  signed. This will allow the

  receiving email system to validate that the messages were generated by a server
  that the organization authorized and

  were not spoofed.'
author: Elastic (converted by SIEMLess)
date: '2020-11-18'
modified: '2025-09-30'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: o365.audit
    event_provider: Exchange
    event_category: web
    event_action: Set-DkimSigningConfig
    o365_audit_Parameters_Enabled: 'False'
    event_outcome: success
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562
- attack.t1562.001
references:
- https://docs.microsoft.com/en-us/powershell/module/exchange/set-dkimsigningconfig?view=exchange-ps
falsepositives:
- "    Disabling a DKIM configuration may be done by a system or network administrator.\
  \ Verify that the configuration\n    change was expected. Exceptions can be added\
  \ to this rule to filter expected behavior.\n    "
