title: Microsoft Entra ID OAuth Phishing via Visual Studio Code Client
id: 14fa0285-fe78-4843-ac8e-f4b481f49da9
status: stable
level: medium
description: 'Detects potentially suspicious OAuth authorization activity in Microsoft
  Entra ID where the Visual Studio Code

  first-party application (client_id = aebc6443-996d-45c2-90f0-388ff96faa56) is used
  to request access to Microsoft Graph

  resources. While this client ID is legitimately used by Visual Studio Code, threat
  actors have been observed abusing it

  in phishing campaigns to make OAuth requests appear trustworthy. These attacks rely
  on redirect URIs such as VSCode''s

  Insiders redirect location, prompting victims to return an OAuth authorization code
  that can be exchanged for access

  tokens. This rule may help identify unauthorized use of the VS Code OAuth flow as
  part of social engineering or

  credential phishing activity.'
author: Elastic (converted by SIEMLess)
date: '2025-04-23'
modified: '2025-09-30'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: azure.signinlogs
    event_action: Sign-in
    event_outcome: success
    azure_signinlogs_properties_resource_display_name: Microsoft
    azure_signinlogs_properties_resource_id: 00000003-0000-0000-c000-000000000000
    azure_signinlogs_properties_app_id: aebc6443-996d-45c2-90f0-388ff96faa56
    azure_signinlogs_properties_app_display_name: Visual
  condition: selection
tags:
- attack.initial_access
- attack.credential_access
- attack.t1528
- attack.t1566
- attack.t1078.004
- attack.t1078
- attack.t1566.002
references:
- https://docs.microsoft.com/en-us/azure/active-directory/reports-monitoring/reference-azure-monitor-sign-ins-log-schema
- https://www.volexity.com/blog/2025/04/22/phishing-for-codes-russian-threat-actors-target-microsoft-365-oauth-workflows/
