title: Microsoft Exchange Worker Spawning Suspicious Processes
id: f81ee52c-297e-46d9-9205-07e66931df26
status: stable
level: high
description: 'Identifies suspicious processes being spawned by the Microsoft Exchange
  Server worker process (w3wp). This activity may

  indicate exploitation activity or access to an existing web shell backdoor.'
author: Elastic (converted by SIEMLess)
date: '2021-03-08'
modified: '2025-09-12'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - cmd.exe
    - powershell.exe
    - pwsh.exe
    - powershell_ise.exe
  condition: selection
tags:
- attack.initial_access
- attack.execution
- attack.t1059
- attack.t1059.001
- attack.t1190
- attack.t1059.003
references:
- https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers
- https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities
- https://discuss.elastic.co/t/detection-and-response-for-hafnium-activity/266289
