title: Microsoft 365 Exchange Anti-Phish Policy Deletion
id: d68eb1b5-5f1c-4b6d-9e63-5b6b145cd4aa
status: stable
level: medium
description: 'Identifies the deletion of an anti-phishing policy in Microsoft 365.
  By default, Microsoft 365 includes built-in

  features that help protect users from phishing attacks. Anti-phishing polices increase
  this protection by refining

  settings to better detect and prevent attacks.'
author: Elastic (converted by SIEMLess)
date: '2020-11-19'
modified: '2025-09-30'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: o365.audit
    event_provider: Exchange
    event_category: web
    event_action: Remove-AntiPhishPolicy
    event_outcome: success
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562
- attack.t1562.001
references:
- https://docs.microsoft.com/en-us/powershell/module/exchange/remove-antiphishpolicy?view=exchange-ps
- https://docs.microsoft.com/en-us/microsoft-365/security/office-365-security/set-up-anti-phishing-policies?view=o365-worldwide
falsepositives:
- "    An anti-phishing policy may be deleted by a system or network administrator.\
  \ Verify that the configuration change\n    was expected. Exceptions can be added\
  \ to this rule to filter expected behavior.\n    "
