title: Microsoft Windows Defender Tampering
id: fe794edd-487f-4a90-b285-3ee54f2af2d3
status: stable
level: medium
description: 'Identifies when one or more features on Microsoft Defender are disabled.
  Adversaries may disable or tamper with

  Microsoft Defender features to evade detection and conceal malicious behavior.'
author: Elastic (converted by SIEMLess)
date: '2021-10-18'
modified: '2025-08-26'
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    _original_eql: "registry where host.os.type == \"windows\" and event.type == \"\
      change\" and process.executable != null and\n  (\n    (\n      registry.value\
      \ : (\n        \"PUAProtection\", \"DisallowExploitProtectionOverride\", \"\
      TamperProtection\", \"EnableControlledFolderAccess\",\n        \"SpynetReporting\"\
      , \"SubmitSamplesConsent\"\n      ) and registry.data.strings : (\"0\", \"0x00000000\"\
      )\n    ) or\n    (\n      registry.value : (\n        \"DisableAntiSpyware\"\
      , \"DisableRealtimeMonitoring\", \"DisableIntrusionPreventionSystem\", \"DisableScriptScanning\"\
      ,\n        \"DisableIOAVProtection\", \"DisableEnhancedNotifications\", \"DisableBlockAtFirstSeen\"\
      , \"DisableBehaviorMonitoring\"\n      ) and registry.data.strings : (\"1\"\
      , \"0x00000001\")\n    )\n  ) and\n  not process.executable : (\n    \"?:\\\\\
      Windows\\\\system32\\\\svchost.exe\", \n    \"?:\\\\Windows\\\\CCM\\\\CcmExec.exe\"\
      , \n    \"?:\\\\Windows\\\\System32\\\\DeviceEnroller.exe\", \n    \"?:\\\\\
      Program Files (x86)\\\\Trend Micro\\\\Security Agent\\\\tmuninst.exe\",\n  \
      \  \"\\\\Device\\\\HarddiskVolume*\\\\Windows\\\\system32\\\\svchost.exe\",\
      \ \n    \"\\\\Device\\\\HarddiskVolume*\\\\Windows\\\\CCM\\\\CcmExec.exe\",\
      \ \n    \"\\\\Device\\\\HarddiskVolume*\\\\Windows\\\\System32\\\\DeviceEnroller.exe\"\
      , \n    \"\\\\Device\\\\HarddiskVolume*\\\\Program Files (x86)\\\\Trend Micro\\\
      \\Security Agent\\\\tmuninst.exe\"\n  )\n\n/*\n    Full registry key paths omitted\
      \ due to data source variations:\n    \"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\
      \\Windows Defender\\\\DisableAntiSpyware\"\n    \"HKLM\\\\SOFTWARE\\\\Policies\\\
      \\Microsoft\\\\Windows Defender\\\\Real-Time Protection\\\\DisableRealtimeMonitoring\"\
      \n    \"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows Defender\\\\Real-Time\
      \ Protection\\\\DisableIntrusionPreventionSystem\"\n    \"HKLM\\\\SOFTWARE\\\
      \\Policies\\\\Microsoft\\\\Windows Defender\\\\Real-Time Protection\\\\DisableScriptScanning\"\
      \n    \"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows Defender\\\\Real-Time\
      \ Protection\\\\DisableIOAVProtection\"\n    \"HKLM\\\\SOFTWARE\\\\Policies\\\
      \\Microsoft\\\\Windows Defender\\\\Reporting\\\\DisableEnhancedNotifications\"\
      \n    \"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows Defender\\\\SpyNet\\\
      \\DisableBlockAtFirstSeen\"\n    \"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\
      \\Windows Defender\\\\Real-Time Protection\\\\DisableBehaviorMonitoring\"\n\
      \    \"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows Defender\\\\PUAProtection\"\
      \n    \"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows Defender Security\
      \ Center\\\\App and Browser protection\\\\DisallowExploitProtectionOverride\"\
      \n    \"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows Defender\\\\Features\\\
      \\TamperProtection\"\n    \"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\
      \ Defender\\\\Windows Defender Exploit Guard\\\\Controlled Folder Access\\\\\
      EnableControlledFolderAccess\"\n    \"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\
      \\Windows Defender\\\\SpyNet\\\\SpynetReporting\"\n    \"HKLM\\\\SOFTWARE\\\\\
      Policies\\\\Microsoft\\\\Windows Defender\\\\SpyNet\\\\SubmitSamplesConsent\"\
      \n*/"
  condition: selection
  _conversion_note: Complex EQL with sample - requires manual review
tags:
- attack.defense_evasion
- attack.t1112
- attack.t1562
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
- https://www.tenforums.com/tutorials/32236-enable-disable-microsoft-defender-pua-protection-windows-10-a.html
- https://www.tenforums.com/tutorials/104025-turn-off-core-isolation-memory-integrity-windows-10-a.html
- https://www.tenforums.com/tutorials/105533-enable-disable-windows-defender-exploit-protection-settings.html
- https://www.tenforums.com/tutorials/123792-turn-off-tamper-protection-microsoft-defender-antivirus.html
- https://www.tenforums.com/tutorials/51514-turn-off-microsoft-defender-periodic-scanning-windows-10-a.html
- https://www.tenforums.com/tutorials/3569-turn-off-real-time-protection-microsoft-defender-antivirus.html
- https://www.tenforums.com/tutorials/99576-how-schedule-scan-microsoft-defender-antivirus-windows-10-a.html
- https://www.elastic.co/security-labs/invisible-miners-unveiling-ghostengine
falsepositives:
- Legitimate Windows Defender configuration changes
