title: Microsoft Entra ID High Risk Sign-in
id: 37994bca-0611-4500-ab67-5588afe73b77
status: stable
level: high
description: 'Identifies high risk Microsoft Entra ID sign-ins by leveraging Microsoft''s
  Identity Protection machine learning

  and heuristics. Identity Protection categorizes risk into three tiers: low, medium,
  and high. While Microsoft does not

  provide specific details about how risk is calculated, each level brings higher
  confidence that the user or sign-in is

  compromised.'
author: Elastic (converted by SIEMLess)
date: '2021-01-04'
modified: '2025-09-30'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: azure.signinlogs
    azure_signinlogs_properties_risk_level_during_signin: high
    azure_signinlogs_properties_risk_level_aggregated: high
  condition: selection
tags:
- attack.initial_access
- attack.t1078.004
- attack.t1078
references:
- https://docs.microsoft.com/en-us/azure/active-directory/conditional-access/howto-conditional-access-policy-risk
- https://docs.microsoft.com/en-us/azure/active-directory/identity-protection/overview-identity-protection
- https://docs.microsoft.com/en-us/azure/active-directory/identity-protection/howto-identity-protection-investigate-risk
