title: Microsoft 365 Exchange Anti-Phish Rule Modification
id: 97314185-2568-4561-ae81-f3e480e5e695
status: stable
level: medium
description: 'Identifies the modification of an anti-phishing rule in Microsoft 365.
  By default, Microsoft 365 includes built-in

  features that help protect users from phishing attacks. Anti-phishing rules increase
  this protection by refining

  settings to better detect and prevent attacks.'
author: Elastic (converted by SIEMLess)
date: '2020-11-19'
modified: '2025-09-30'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: o365.audit
    event_provider: Exchange
    event_category: web
    event_action: ("Remove-AntiPhishRule
    event_outcome: success
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562
- attack.t1562.001
references:
- https://docs.microsoft.com/en-us/powershell/module/exchange/remove-antiphishrule?view=exchange-ps
- https://docs.microsoft.com/en-us/powershell/module/exchange/disable-antiphishrule?view=exchange-ps
falsepositives:
- "    An anti-phishing rule may be deleted by a system or network administrator.\
  \ Verify that the configuration change was\n    expected. Exceptions can be added\
  \ to this rule to filter expected behavior.\n    "
