title: Microsoft Management Console File from Unusual Path
id: 7e23dfef-da2c-4d64-b11d-5f285b638853
status: stable
level: medium
description: 'Identifies attempts to open a Microsoft Management Console File from
  untrusted paths. Adversaries may use MSC files for

  initial access and execution.'
author: Elastic (converted by SIEMLess)
date: '2024-06-19'
modified: '2025-09-11'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_executable|contains:
    - ?:\\Windows\\System32\\mmc.exe
    - \\Device\\HarddiskVolume*\\Windows\\System32\\mmc.exe
    process_args|contains:
    - ?:\\Windows\\System32\\*.msc
    - ?:\\Windows\\SysWOW64\\*.msc
    - ?:\\Program files\\*.msc
    process_command_line|contains:
    - C:\\Windows\\system32\\mmc.exe eventvwr.msc /s
    - mmc.exe eventvwr.msc /s
    - \
    - ' CompMgmt.msc*'
    process_args|endswith: .msc
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.t1218.014
- attack.t1059
- attack.t1059.005
- attack.t1059.007
- attack.t1218
references:
- https://www.elastic.co/security-labs/grimresource
