title: Microsoft 365 Teams External Access Enabled
id: 27f7c15a-91f8-4c3d-8b9e-1f99cc030a51
status: stable
level: medium
description: 'Identifies when external access is enabled in Microsoft Teams. External
  access lets Teams and Skype for Business users

  communicate with other users that are outside their organization. An adversary may
  enable external access or add an

  allowed domain to exfiltrate data or maintain persistence in an environment.'
author: Elastic (converted by SIEMLess)
date: '2020-11-30'
modified: '2025-09-30'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: o365.audit
    event_provider: (SkypeForBusiness
    event_category: web
    event_action: Set-CsTenantFederationConfiguration
    o365_audit_Parameters_AllowFederatedUsers: 'True'
    event_outcome: success
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562
references:
- https://docs.microsoft.com/en-us/microsoftteams/manage-external-access
falsepositives:
- "    Teams external access may be enabled by a system or network administrator.\
  \ Verify that the configuration change was\n    expected. Exceptions can be added\
  \ to this rule to filter expected behavior.\n    "
