title: Microsoft Sentinel External Alerts
id: 74147312-ba03-4bea-91d1-040d54c1e8c3
status: stable
level: medium
description: 'Generates a detection alert for each Microsoft Sentinel alert written
  to the configured indices. Enabling this rule

  allows you to immediately begin investigating Microsoft Sentinel alerts in the app.'
author: Elastic (converted by SIEMLess)
date: '2025-07-31'
modified: '2025-10-17'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_kind: alert
    data_stream_dataset: microsoft_sentinel.alert
  condition: selection
references:
- https://docs.elastic.co/en/integrations/microsoft_sentinel
