title: Microsoft 365 Teams Guest Access Enabled
id: 5e552599-ddec-4e14-bad1-28aa42404388
status: stable
level: medium
description: 'Identifies when guest access is enabled in Microsoft Teams. Guest access
  in Teams allows people outside the organization

  to access teams and channels. An adversary may enable guest access to maintain persistence
  in an environment.'
author: Elastic (converted by SIEMLess)
date: '2020-11-20'
modified: '2025-09-26'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: o365.audit
    event_provider: (SkypeForBusiness
    event_category: web
    event_action: Set-CsTeamsClientConfiguration
    o365_audit_Parameters_AllowGuestUser: 'True'
    event_outcome: success
  condition: selection
tags:
- attack.persistence
- attack.t1098
references:
- https://docs.microsoft.com/en-us/powershell/module/skype/get-csteamsclientconfiguration?view=skype-ps
falsepositives:
- "    Teams guest access may be enabled by a system or network administrator. Verify\
  \ that the configuration change was\n    expected. Exceptions can be added to this\
  \ rule to filter expected behavior.\n    "
