title: Mimikatz Memssp Log File Detected
id: ebb200e8-adf0-43f8-a0bb-4ee5b5d852c6
status: stable
level: high
description: Identifies the password log file from the default Mimikatz memssp module.
author: Elastic (converted by SIEMLess)
date: '2020-08-31'
modified: '2025-08-26'
logsource:
  product: windows
  category: file_event
detection:
  selection:
    host_os_type: windows
  condition: selection
tags:
- attack.credential_access
- attack.t1003
references:
- https://www.elastic.co/security-labs/detect-credential-access
