title: Modification of the msPKIAccountCredentials
id: 670b3b5a-35e5-42db-bd36-6c5b9b4b7313
status: stable
level: medium
description: 'Identify the modification of the msPKIAccountCredentials attribute in
  an Active Directory User Object. Attackers can

  abuse the credentials roaming feature to overwrite an arbitrary file for privilege
  escalation. ms-PKI-AccountCredentials

  contains binary large objects (BLOBs) of encrypted credential objects from the credential
  manager store, private keys,

  certificates, and certificate requests.'
author: Elastic (converted by SIEMLess)
date: '2022-11-09'
modified: '2025-11-14'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_code: '5136'
    host_os_type: windows
    winlog_event_data_AttributeLDAPDisplayName: msPKIAccountCredentials
    winlog_event_data_OperationType: '%%14674'
    winlog_event_data_SubjectUserSid: S-1-5-18
  condition: selection
tags:
- attack.privilege_escalation
- attack.t1068
references:
- https://www.mandiant.com/resources/blog/apt29-windows-credential-roaming
- https://social.technet.microsoft.com/wiki/contents/articles/11483.windows-credential-roaming.aspx
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5136
