title: Modification of AmsiEnable Registry Key
id: f874315d-5188-4b4a-8521-d1c73093a7e4
status: stable
level: high
description: 'Identifies modifications of the AmsiEnable registry key to 0, which
  disables the Antimalware Scan Interface (AMSI). An

  adversary can modify this key to disable AMSI protections.'
author: Elastic (converted by SIEMLess)
date: '2021-06-01'
modified: '2025-08-26'
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    host_os_type: windows
    event_type: change
    registry_data_strings|contains:
    - '0'
    - '0x00000000'
  condition: selection
tags:
- attack.defense_evasion
- attack.t1112
- attack.t1562.001
- attack.t1562
references:
- https://hackinparis.com/data/slides/2019/talks/HIP2019-Dominic_Chell-Cracking_The_Perimeter_With_Sharpshooter.pdf
- https://docs.microsoft.com/en-us/windows/win32/amsi/antimalware-scan-interface-portal
