title: Mofcomp Activity
id: 210d4430-b371-470e-b879-80b7182aa75e
status: stable
level: low
description: 'Managed Object Format (MOF) files can be compiled locally or remotely
  through mofcomp.exe. Attackers may leverage MOF

  files to build their own namespaces and classes into the Windows Management Instrumentation
  (WMI) repository, or

  establish persistence using WMI Event Subscription.'
author: Elastic (converted by SIEMLess)
date: '2023-08-23'
modified: '2025-02-21'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_args|contains:
    - '*\\MSSQL\\Binn\\*.mof'
    - '*\\Microsoft SQL Server\\???\\Shared\\*.mof'
    - '*\\OLAP\\bin\\*.mof'
    process_args|endswith: .mof
  condition: selection
tags:
- attack.persistence
- attack.execution
- attack.t1047
- attack.t1546.003
- attack.t1546
