title: Mount Launched Inside a Container
id: c73cc6ab-b30e-46bf-b5f2-29d9ab4caf7b
status: stable
level: medium
description: 'This rule detects the use of the mount utility from inside a container.
  The mount command is used to make a

  device or file system accessible to the system, and then to connect its root directory
  to a specified mount point on the

  local file system. When launched inside a privileged container--a container deployed
  with all the capabilities of the

  host machine-- an attacker can access sensitive host level files which could be
  used for further privilege escalation

  and container escapes to the host machine. Any usage of mount inside a running privileged
  container should be further

  investigated.'
author: Elastic (converted by SIEMLess)
date: '2025-03-12'
modified: '2025-03-12'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    event_action: exec
    process_entry_leader_entry_meta_type: container
    process_name: mount
  condition: selection
tags:
- attack.privilege_escalation
- attack.t1611
references:
- https://book.hacktricks.xyz/linux-hardening/privilege-escalation/docker-security/docker-breakout-privilege-escalation#privileged
