title: Mounting Hidden or WebDav Remote Shares
id: c4210e1c-64f2-4f48-b67e-b5a8ffe3aa14
status: stable
level: medium
description: 'Identifies the use of net.exe to mount a WebDav or hidden remote share.
  This may indicate lateral movement or

  preparation for data exfiltration.'
author: Elastic (converted by SIEMLess)
date: '2020-11-02'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_pe_original_file_name: net1.exe
    process_args|contains:
    - \\\\*\\*$*
    - \\\\*@SSL\\*
    - http*
  condition: selection
tags:
- attack.initial_access
- attack.lateral_movement
- attack.discovery
- attack.t1087.001
- attack.t1021
- attack.t1087.002
- attack.t1078.003
- attack.t1087
- attack.t1021.002
- attack.t1078
