title: MS Office Macro Security Registry Modifications
id: feeed87c-5e95-4339-aef1-47fd79bcfbe3
status: stable
level: medium
description: 'Microsoft Office Products offer options for users and developers to
  control the security settings for running and using

  Macros. Adversaries may abuse these security settings to modify the default behavior
  of the Office Application to trust

  future macros and/or disable security warnings, which could increase their chances
  of establishing persistence.'
author: Elastic (converted by SIEMLess)
date: '2022-01-12'
modified: '2025-08-26'
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    host_os_type: windows
    event_type: change
    registry_value|contains:
    - AccessVBOM
    - VbaWarnings
    registry_data_strings|contains:
    - '0x00000001'
    - '1'
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.t1112
- attack.t1204
- attack.t1204.002
