title: Mshta Making Network Connections
id: c2d90150-0133-451c-a783-533e736c12d7
status: stable
level: medium
description: 'Identifies Mshta.exe making outbound network connections. This may indicate
  adversarial activity, as Mshta is often

  leveraged by adversaries to execute malicious scripts and evade detection.'
author: Elastic (converted by SIEMLess)
date: '2020-09-02'
modified: '2025-08-26'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by process.entity_id with maxspan=10m\n  [process where\
      \ host.os.type == \"windows\" and event.type == \"start\" and process.name :\
      \ \"mshta.exe\" and\n     not process.parent.name : \"Microsoft.ConfigurationManagement.exe\"\
      \ and\n     not (process.parent.executable : \"C:\\\\Amazon\\\\Amazon Assistant\\\
      \\amazonAssistantService.exe\" or\n          process.parent.executable : \"\
      C:\\\\TeamViewer\\\\TeamViewer.exe\") and\n     not process.args : \"ADSelfService_Enroll.hta\"\
      ]\n  [network where host.os.type == \"windows\" and process.name : \"mshta.exe\"\
      ]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.defense_evasion
- attack.t1218
- attack.t1218.005
references:
- https://www.elastic.co/security-labs/elastic-protects-against-data-wiper-malware-targeting-ukraine-hermeticwiper
