title: Multiple Okta User Auth Events with Same Device Token Hash Behind a Proxy
id: 50887ba8-7ff7-11ee-a038-f661ea17fbcd
status: stable
level: medium
description: 'Detects when Okta user authentication events are reported for multiple
  users with the same device token hash behind a

  proxy.'
author: Elastic (converted by SIEMLess)
date: '2023-11-10'
modified: '2025-09-08'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: okta.system
    okta_actor_id: okta*
    okta_debug_context_debug_data_dt_hash: '*'
    okta_event_type: user.authentication*
    okta_security_context_is_proxy: 'true'
  condition: selection
tags:
- attack.credential_access
- attack.t1110.003
- attack.t1110.004
- attack.t1110
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
- https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy
- https://sec.okta.com/articles/2023/08/cross-tenant-impersonation-prevention-and-detection
- https://www.elastic.co/security-labs/monitoring-okta-threats-with-elastic-security
- https://www.elastic.co/security-labs/starter-guide-to-understanding-okta
falsepositives:
- An Okta admnistrator may be logged into multiple accounts from the same host for
  legitimate reasons.
- Users may share an endpoint related to work or personal use in which separate Okta
  accounts are used.
- Shared systems such as Kiosks and conference room computers may be used by multiple
  users.
