title: Multiple Okta Sessions Detected for a Single User
id: 621e92b6-7e54-11ee-bdc0-f661ea17fbcd
status: stable
level: medium
description: 'Detects when a user has started multiple Okta sessions with the same
  user account and different session IDs. This may

  indicate that an attacker has stolen the user''s session cookie and is using it
  to access the user''s account from a

  different location.'
author: Elastic (converted by SIEMLess)
date: '2023-11-07'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: okta.system
    okta_event_type: user.session.start
    okta_authentication_context_external_session_id: '*'
    okta_actor_id: okta*
    okta_actor_display_name: okta*)
  condition: selection
tags:
- attack.lateral_movement
- attack.t1550.004
- attack.t1550
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
- https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy
- https://sec.okta.com/articles/2023/08/cross-tenant-impersonation-prevention-and-detection
- https://www.elastic.co/security-labs/monitoring-okta-threats-with-elastic-security
- https://www.elastic.co/security-labs/starter-guide-to-understanding-okta
falsepositives:
- A user may have multiple sessions open at the same time, such as on a mobile device
  and a laptop.
