title: My First Rule
id: a198fbbd-9413-45ec-a269-47ae4ccf59ce
status: stable
level: low
description: 'This rule helps you test and practice using alerts with Elastic Security
  as you get set up. It’s not a sign of threat

  activity.'
author: Elastic (converted by SIEMLess)
date: '2022-09-22'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_kind: event
  condition: selection
references:
- https://www.elastic.co/guide/en/security/current/prebuilt-rules.html
falsepositives:
- This rule is not looking for threat activity. Disable the rule if you're already
  familiar with alerts.
