title: NetSupport Manager Execution from an Unusual Path
id: 5f73aef2-7abc-4fd9-ac0d-ab8ec3e13891
status: stable
level: high
description: 'Identifies execution of the NetSupport remote access software from non-default
  paths. Adversaries may abuse NetSupport

  Manager to control a target victim machine.'
author: Elastic (converted by SIEMLess)
date: '2025-08-20'
modified: '2025-08-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_pe_original_file_name: client32.exe
    process_executable|contains:
    - ?:\\Users\\*.exe
    - ?:\\ProgramData\\*.exe
    - \\Device\\HarddiskVolume?\\Users\\*.exe
    - \\Device\\HarddiskVolume?\\ProgramData\\*.exe
    process_parent_executable|contains:
    - ?:\\Users\\*\\client32.exe
    - ?:\\ProgramData\\*\\client32.exe
  condition: selection
tags:
- attack.command_and_control
- attack.t1219
references:
- https://www.netsupportsoftware.com/
