title: Network Connection via Compiled HTML File
id: b29ee2be-bf99-446c-ab1a-2dc0183394b8
status: stable
level: low
description: 'Compiled HTML files (.chm) are commonly distributed as part of the Microsoft
  HTML Help system. Adversaries may conceal

  malicious code in a CHM file and deliver it to a victim for execution. CHM content
  is loaded by the HTML Help executable

  program (hh.exe).'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-08-26'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by process.entity_id\n  [process where host.os.type ==\
      \ \"windows\" and process.name : \"hh.exe\" and event.type == \"start\"]\n \
      \ [network where host.os.type == \"windows\" and process.name : \"hh.exe\" and\n\
      \     not cidrmatch(destination.ip, \"10.0.0.0/8\", \"127.0.0.0/8\", \"169.254.0.0/16\"\
      , \"172.16.0.0/12\", \"192.0.0.0/24\",\n       \"192.0.0.0/29\", \"192.0.0.8/32\"\
      , \"192.0.0.9/32\", \"192.0.0.10/32\", \"192.0.0.170/32\", \"192.0.0.171/32\"\
      ,\n       \"192.0.2.0/24\", \"192.31.196.0/24\", \"192.52.193.0/24\", \"192.168.0.0/16\"\
      , \"192.88.99.0/24\", \"224.0.0.0/4\",\n       \"100.64.0.0/10\", \"192.175.48.0/24\"\
      ,\"198.18.0.0/15\", \"198.51.100.0/24\", \"203.0.113.0/24\", \"240.0.0.0/4\"\
      , \"::1\",\n       \"FE80::/10\", \"FF00::/8\") and\n     not dns.question.name\
      \ : \"localhost\"]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.defense_evasion
- attack.execution
- attack.t1218.001
- attack.t1218
- attack.t1204.002
- attack.t1204
references:
- https://www.iana.org/assignments/iana-ipv4-special-registry/iana-ipv4-special-registry.xhtml
