title: NetworkManager Dispatcher Script Creation
id: 86aa8579-1526-4dff-97cd-3635eb0e0545
status: stable
level: low
description: 'This rule detects the creation of a NetworkManager dispatcher script
  on a Linux system. NetworkManager dispatcher

  scripts are shell scripts that NetworkManager executes when network interfaces change
  state. Attackers can abuse

  NetworkManager dispatcher scripts to maintain persistence on a system by executing
  malicious code whenever a network

  event occurs.'
author: Elastic (converted by SIEMLess)
date: '2025-01-16'
modified: '2025-03-20'
logsource:
  product: linux
  category: file_event
detection:
  selection:
    host_os_type: linux
    event_type: creation
    process_name: sed
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.execution
- attack.t1574
- attack.t1059.004
- attack.t1059
- attack.t1543
