title: Network Connection via Registration Utility
id: fb02b8d3-71ee-4af1-bacd-215d23f17efa
status: stable
level: low
description: 'Identifies the native Windows tools regsvr32.exe, regsvr64.exe, RegSvcs.exe,
  or RegAsm.exe making a network connection.

  This may be indicative of an attacker bypassing allowlists or running arbitrary
  scripts via a signed Microsoft binary.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by process.entity_id\n  [process where host.os.type ==\
      \ \"windows\" and event.type == \"start\" and\n   process.name : (\"regsvr32.exe\"\
      , \"RegAsm.exe\", \"RegSvcs.exe\") and\n   not (\n         (?process.Ext.token.integrity_level_name\
      \ : \"System\" or ?winlog.event_data.IntegrityLevel : \"System\") and\n    \
      \     (process.parent.name : \"msiexec.exe\" or process.parent.executable :\
      \ (\"C:\\\\Program Files (x86)\\\\*.exe\", \"C:\\\\Program Files\\\\*.exe\"\
      ))\n       )\n   ]\n  [network where host.os.type == \"windows\" and process.name\
      \ : (\"regsvr32.exe\", \"RegAsm.exe\", \"RegSvcs.exe\")  and\n   not cidrmatch(destination.ip,\
      \ \"10.0.0.0/8\", \"127.0.0.0/8\", \"169.254.0.0/16\", \"172.16.0.0/12\", \"\
      192.0.0.0/24\",\n       \"192.0.0.0/29\", \"192.0.0.8/32\", \"192.0.0.9/32\"\
      , \"192.0.0.10/32\", \"192.0.0.170/32\", \"192.0.0.171/32\",\n       \"192.0.2.0/24\"\
      , \"192.31.196.0/24\", \"192.52.193.0/24\", \"192.168.0.0/16\", \"192.88.99.0/24\"\
      , \"224.0.0.0/4\",\n       \"100.64.0.0/10\", \"192.175.48.0/24\",\"198.18.0.0/15\"\
      , \"198.51.100.0/24\", \"203.0.113.0/24\", \"240.0.0.0/4\", \"::1\",\n     \
      \  \"FE80::/10\", \"FF00::/8\") and network.protocol != \"dns\"]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.defense_evasion
- attack.execution
- attack.t1218.009
- attack.t1218
- attack.t1218.010
references:
- https://www.iana.org/assignments/iana-ipv4-special-registry/iana-ipv4-special-registry.xhtml
falsepositives:
- "    Security testing may produce events like this. Activity of this kind performed\
  \ by non-engineers and ordinary users\n    is unusual.\n    "
