title: Network Activity Detected via cat
id: afd04601-12fc-4149-9b78-9c3f8fe45d39
status: stable
level: medium
description: 'This rule monitors for the execution of the cat command, followed by
  a connection attempt by the same process. Cat is

  capable of transfering data via tcp/udp channels by redirecting its read output
  to a /dev/tcp or /dev/udp channel. This

  activity is highly suspicious, and should be investigated. Attackers may leverage
  this capability to transfer tools or

  files to another host in the network or exfiltrate data while attempting to evade
  detection in the process.'
author: Elastic (converted by SIEMLess)
date: '2023-09-04'
modified: '2025-02-04'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by host.id, process.entity_id with maxspan=1s\n  [process\
      \ where host.os.type == \"linux\" and event.type == \"start\" and event.action\
      \ == \"exec\" and\n   process.name == \"cat\" and process.parent.name in (\"\
      bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\")]\n\
      \  [network where host.os.type == \"linux\" and event.action in (\"connection_attempted\"\
      , \"disconnect_received\") and\n   process.name == \"cat\" and not (destination.ip\
      \ == null or destination.ip == \"0.0.0.0\" or cidrmatch(\n     destination.ip,\
      \ \"10.0.0.0/8\", \"127.0.0.0/8\", \"169.254.0.0/16\", \"172.16.0.0/12\", \"\
      192.0.0.0/24\", \"192.0.0.0/29\",\n     \"192.0.0.8/32\", \"192.0.0.9/32\",\
      \ \"192.0.0.10/32\", \"192.0.0.170/32\", \"192.0.0.171/32\", \"192.0.2.0/24\"\
      ,\n     \"192.31.196.0/24\", \"192.52.193.0/24\", \"192.168.0.0/16\", \"192.88.99.0/24\"\
      , \"224.0.0.0/4\", \"100.64.0.0/10\",\n     \"192.175.48.0/24\",\"198.18.0.0/15\"\
      , \"198.51.100.0/24\", \"203.0.113.0/24\", \"240.0.0.0/4\", \"::1\", \"FE80::/10\"\
      ,\n     \"FF00::/8\"\n     )\n   )]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.exfiltration
- attack.defense_evasion
- attack.command_and_control
