title: New Okta Identity Provider (IdP) Added by Admin
id: 29b53942-7cd4-11ee-b70e-f661ea17fbcd
status: stable
level: medium
description: 'Detects the creation of a new Identity Provider (IdP) by a Super Administrator
  or Organization Administrator within

  Okta.'
author: Elastic (converted by SIEMLess)
date: '2023-11-06'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: okta.system
    event_action: system.idp.lifecycle.create
    okta_outcome_result: SUCCESS
  condition: selection
tags:
- attack.persistence
- attack.t1556
- attack.t1556.007
references:
- https://blog.cloudflare.com/cloudflare-investigation-of-the-january-2022-okta-compromise/
- https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy
- https://sec.okta.com/articles/2023/08/cross-tenant-impersonation-prevention-and-detection
- https://unit42.paloaltonetworks.com/muddled-libra/
- https://www.elastic.co/security-labs/monitoring-okta-threats-with-elastic-security
- https://www.elastic.co/security-labs/starter-guide-to-understanding-okta
