title: New Okta Authentication Behavior Detected
id: 260486ee-7d98-11ee-9599-f661ea17fbcd
status: stable
level: medium
description: Detects events where Okta behavior detection has identified a new authentication
  behavior.
author: Elastic (converted by SIEMLess)
date: '2023-11-07'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: okta.system
    okta_debug_context_debug_data_risk_behaviors: '*'
  condition: selection
tags:
- attack.initial_access
references:
- https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy
- https://sec.okta.com/articles/2023/08/cross-tenant-impersonation-prevention-and-detection
- https://unit42.paloaltonetworks.com/muddled-libra/
- https://help.okta.com/oie/en-us/content/topics/security/behavior-detection/about-behavior-detection.htm
- https://www.elastic.co/security-labs/monitoring-okta-threats-with-elastic-security
- https://www.elastic.co/security-labs/starter-guide-to-understanding-okta
