title: New ActiveSyncAllowedDeviceID Added via PowerShell
id: ce64d965-6cb0-466d-b74f-8d2c76f47f05
status: stable
level: medium
description: 'Identifies the use of the Exchange PowerShell cmdlet, Set-CASMailbox,
  to add a new ActiveSync allowed device.

  Adversaries may target user email to collect sensitive information.'
author: Elastic (converted by SIEMLess)
date: '2020-12-15'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - powershell.exe
    - pwsh.exe
    - powershell_ise.exe
  condition: selection
tags:
- attack.persistence
- attack.execution
- attack.t1098.002
- attack.t1098
- attack.t1059.001
- attack.t1059
references:
- https://www.volexity.com/blog/2020/12/14/dark-halo-leverages-solarwinds-compromise-to-breach-organizations/
- https://docs.microsoft.com/en-us/powershell/module/exchange/set-casmailbox?view=exchange-ps
falsepositives:
- Legitimate exchange system administration activity.
