title: Node.js Pre or Post-Install Script Execution
id: 0871a5d8-6b5f-4a12-a568-fd7bc05bd8db
status: stable
level: medium
description: 'This rule detects the execution of Node.js pre or post-install scripts.
  These scripts are executed

  by the Node.js package manager (npm) during the installation of packages. Adversaries
  may abuse

  this technique to execute arbitrary commands on the system and establish persistence.
  This activity

  was observed in the wild as part of the Shai-Hulud worm.'
author: Elastic (converted by SIEMLess)
date: '2025-09-18'
modified: '2025-10-17'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by host.id with maxspan=10s\n  [process where host.os.type\
      \ == \"linux\" and event.type == \"start\" and event.action in (\"exec\", \"\
      ProcessRollup2\") and process.name == \"node\" and process.args == \"install\"\
      ] by process.entity_id\n  [process where host.os.type == \"linux\" and event.type\
      \ == \"start\" and event.action in (\"exec\", \"ProcessRollup2\") and process.parent.name\
      \ == \"node\"] by process.parent.entity_id"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.defense_evasion
- attack.persistence
- attack.execution
- attack.t1574
- attack.t1059.004
- attack.t1059
- attack.t1543
references:
- https://www.elastic.co/blog/shai-hulud-worm-npm-supply-chain-compromise
