title: NTDS or SAM Database File Copied
id: 3bc6deaa-fbd4-433a-ae21-3e892f95624f
status: stable
level: high
description: 'Identifies a copy operation of the Active Directory Domain Database
  (ntds.dit) or Security Account Manager (SAM) files.

  Those files contain sensitive information including hashed domain and/or local credentials.'
author: Elastic (converted by SIEMLess)
date: '2020-11-24'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - Cmd.Exe
    - PowerShell.EXE
    - XCOPY.EXE
    process_args|contains:
    - '*/y*'
    - '*/vss*'
    - '*/d*'
    process_command_line|contains:
    - '*\\ntds.dit*'
    - '*\\config\\SAM*'
    - '*\\*\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy*\\*'
    - '*/system32/config/SAM*'
    - '*\\User Data\\*'
  condition: selection
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.003
- attack.t1003.002
references:
- https://thedfirreport.com/2020/11/23/pysa-mespinoza-ransomware/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.002/T1003.002.md#atomic-test-3---esentutlexe-sam-copy
- https://www.elastic.co/security-labs/detect-credential-access
- https://www.elastic.co/security-labs/siestagraph-new-implant-uncovered-in-asean-member-foreign-ministry
