title: Okta FastPass Phishing Detection
id: ee39a9f7-5a79-4b0a-9815-d36b3cf28d3e
status: stable
level: medium
description: Detects when Okta FastPass prevents a user from authenticating to a phishing
  website.
author: Elastic (converted by SIEMLess)
date: '2023-05-07'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: okta.system
    event_category: authentication
    okta_event_type: user.authentication.auth_via_mfa
    event_outcome: failure
    okta_outcome_reason: FastPass
  condition: selection
tags:
- attack.initial_access
- attack.t1566
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
- https://sec.okta.com/fastpassphishingdetection
- https://sec.okta.com/articles/2023/08/cross-tenant-impersonation-prevention-and-detection
- https://www.elastic.co/security-labs/monitoring-okta-threats-with-elastic-security
- https://www.elastic.co/security-labs/starter-guide-to-understanding-okta
