title: Okta Brute Force or Password Spraying Attack
id: 42bf698b-4738-445b-8231-c834ddefd8a0
status: stable
level: medium
description: 'Identifies a high number of failed Okta user authentication attempts
  from a single IP address, which could be indicative

  of a brute force or password spraying attack. An adversary may attempt a brute force
  or password spraying attack to

  obtain unauthorized access to user accounts.'
author: Elastic (converted by SIEMLess)
date: '2020-07-16'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: okta.system
    event_category: authentication
    event_outcome: failure
  condition: selection
tags:
- attack.credential_access
- attack.t1110
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
- https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy
- https://www.elastic.co/security-labs/monitoring-okta-threats-with-elastic-security
- https://www.elastic.co/security-labs/starter-guide-to-understanding-okta
falsepositives:
- "    Automated processes that attempt to authenticate using expired credentials\
  \ and unbounded retries may lead to false\n    positives.\n    "
