title: OpenSSL Password Hash Generation
id: f4b857b3-faef-430d-b420-90be48647f00
status: stable
level: low
description: 'This rule detects the usage of the `openssl` binary to generate password
  hashes on Linux systems. The `openssl` command

  is a cryptographic utility that can be used to generate password hashes. Attackers
  may use `openssl` to generate

  password hashes for new user accounts or to change the password of existing accounts,
  which can be leveraged to maintain

  persistence on a Linux system.'
author: Elastic (converted by SIEMLess)
date: '2025-01-16'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: openssl
    process_args: passwd
  condition: selection
tags:
- attack.persistence
- attack.t1136.001
- attack.t1136
