title: Outbound Scheduled Task Activity via PowerShell
id: 5cd55388-a19c-47c7-8ec4-f41656c2fded
status: stable
level: medium
description: 'Identifies the PowerShell process loading the Task Scheduler COM DLL
  followed by an outbound RPC network connection

  within a short time period. This may indicate lateral movement or remote discovery
  via scheduled tasks.'
author: Elastic (converted by SIEMLess)
date: '2020-12-15'
modified: '2025-11-06'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by host.id, process.entity_id with maxspan = 5s\n [any\
      \ where host.os.type == \"windows\" and (event.category == \"library\" or (event.category\
      \ == \"process\" and event.action : \"Image loaded*\")) and\n  (?dll.name :\
      \ \"taskschd.dll\" or file.name : \"taskschd.dll\") and process.name : (\"powershell.exe\"\
      , \"pwsh.exe\", \"powershell_ise.exe\")]\n [network where host.os.type == \"\
      windows\" and process.name : (\"powershell.exe\", \"pwsh.exe\", \"powershell_ise.exe\"\
      ) and destination.port == 135 and not cidrmatch(destination.ip, \"127.0.0.0/8\"\
      , \"::1/128\")]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.execution
- attack.t1053.005
- attack.t1053
- attack.t1059.001
- attack.t1059
references:
- https://www.volexity.com/blog/2020/12/14/dark-halo-leverages-solarwinds-compromise-to-breach-organizations/
- https://www.elastic.co/security-labs/hunting-for-lateral-movement-using-event-query-language
falsepositives:
- Legitimate scheduled tasks may be created during installation of new software.
