title: Permission Theft - Detected - Elastic Endgame
id: c3167e1b-f73c-41be-b60b-87f4df707fe3
status: stable
level: high
description: 'Elastic Endgame detected Permission Theft. Click the Elastic Endgame
  icon in the event.module column or the link in the

  rule.reference column for additional information.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-03-21'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_kind: alert
    event_module: endgame
    endgame_metadata_type: detection
    event_action: token_protection_event
    endgame_event_subtype_full: token_protection_event)
  condition: selection
tags:
- attack.privilege_escalation
- attack.t1134
