title: Persistence via Hidden Run Key Detected
id: a9b05c3b-b304-4bf9-970d-acdfaef2944c
status: stable
level: high
description: 'Identifies a persistence mechanism that utilizes the NtSetValueKey native
  API to create a hidden (null terminated)

  registry key. An adversary may use this method to hide from system utilities such
  as the Registry Editor (regedit).'
author: Elastic (converted by SIEMLess)
date: '2020-11-15'
modified: '2025-08-26'
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    host_os_type: windows
    event_type: change
    registry_path|contains:
    - '*\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\'
    - '*\\Software\\WOW6432Node\\Microsoft\\Windows\\CurrentVersion\\Run\\'
    - '*\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\\'
    registry_path|endswith: \\Run\\
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.execution
- attack.t1547.001
- attack.t1547
- attack.t1112
- attack.t1106
references:
- https://github.com/outflanknl/SharpHide
- https://github.com/ewhitehats/InvisiblePersistence/blob/master/InvisibleRegValues_Whitepaper.pdf
