title: Persistence via BITS Job Notify Cmdline
id: c3b915e0-22f3-4bf7-991d-b643513c722f
status: stable
level: medium
description: 'An adversary can use the Background Intelligent Transfer Service (BITS)
  SetNotifyCmdLine method to execute a program

  that runs after a job finishes transferring data or after a job enters a specified
  state in order to persist on a

  system.'
author: Elastic (converted by SIEMLess)
date: '2021-12-04'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_executable|contains:
    - ?:\\Windows\\System32\\WerFaultSecure.exe
    - ?:\\Windows\\System32\\WerFault.exe
    - ?:\\Windows\\System32\\wermgr.exe
    - ?:\\WINDOWS\\system32\\directxdatabaseupdater.exe
  condition: selection
tags:
- attack.persistence
- attack.t1197
references:
- https://pentestlab.blog/2019/10/30/persistence-bits-jobs/
- https://docs.microsoft.com/en-us/windows/win32/api/bits1_5/nf-bits1_5-ibackgroundcopyjob2-setnotifycmdline
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/bitsadmin-setnotifycmdline
- https://www.elastic.co/blog/hunting-for-persistence-using-elastic-security-part-2
