title: Persistence via Docker Shortcut Modification
id: c81cefcb-82b9-4408-a533-3c3df549e62d
status: stable
level: medium
description: 'An adversary can establish persistence by modifying an existing macOS
  dock property list in order to execute a malicious

  application instead of the intended one when invoked.'
author: Elastic (converted by SIEMLess)
date: '2020-12-18'
modified: '2025-03-18'
logsource:
  product: macos
  category: file_event
detection:
  selection:
    host_os_type: macos
    event_action: modification
  condition: selection
tags:
- attack.persistence
- attack.t1543
references:
- https://github.com/specterops/presentations/raw/master/Leo%20Pitt/Hey_Im_Still_in_Here_Modern_macOS_Persistence_SO-CON2020.pdf
