title: Persistence via PowerShell profile
id: 5cf6397e-eb91-4f31-8951-9f0eaa755a31
status: stable
level: medium
description: 'Identifies the creation or modification of a PowerShell profile. PowerShell
  profile is a script that is executed when

  PowerShell starts to customize the user environment, which can be abused by attackers
  to persist in a environment where

  PowerShell is common.'
author: Elastic (converted by SIEMLess)
date: '2022-10-13'
modified: '2025-08-26'
logsource:
  product: windows
  category: file_event
detection:
  selection:
    host_os_type: windows
    file_name|contains:
    - profile.ps1
    - Microsoft.Powershell_profile.ps1
    file_path|contains:
    - ?:\\Users\\*\\Documents\\WindowsPowerShell\\*.ps1
    - ?:\\Users\\*\\Documents\\PowerShell\\*.ps1
    - ?:\\Windows\\System32\\WindowsPowerShell\\*.ps1
    - \\Device\\HarddiskVolume*\\Users\\*\\Documents\\WindowsPowerShell\\*.ps1
    - \\Device\\HarddiskVolume*\\Users\\*\\Documents\\PowerShell\\*.ps1
    - \\Device\\HarddiskVolume*\\Windows\\System32\\WindowsPowerShell\\*.ps1
  condition: selection
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1546.013
- attack.t1546
references:
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_profiles
- https://www.welivesecurity.com/2019/05/29/turla-powershell-usage/
