title: Persistence via KDE AutoStart Script or Desktop File Modification
id: e3e904b3-0a8e-4e68-86a8-977a163e21d3
status: stable
level: medium
description: 'Identifies the creation or modification of a K Desktop Environment (KDE)
  AutoStart script or desktop file that will

  execute upon each user logon. Adversaries may abuse this method for persistence.'
author: Elastic (converted by SIEMLess)
date: '2021-01-06'
modified: '2025-03-20'
logsource:
  product: linux
  category: file_event
detection:
  selection:
    host_os_type: linux
    file_path|contains:
    - /home/*/.config/autostart/*
    - /root/.config/autostart/*
    - /home/*/.kde/Autostart/*
    - /root/.kde/Autostart/*
    - /home/*/.kde4/Autostart/*
    - /root/.kde4/Autostart/*
    - /home/*/.kde/share/autostart/*
    - /root/.kde/share/autostart/*
    - /home/*/.kde4/share/autostart/*
    - /root/.kde4/share/autostart/*
    - /home/*/.local/share/autostart/*
    - /root/.local/share/autostart/*
    - /home/*/.config/autostart-scripts/*
    - /root/.config/autostart-scripts/*
    - /etc/xdg/autostart/*
    - /usr/share/autostart/*
  condition: selection
tags:
- attack.persistence
- attack.t1547
references:
- https://userbase.kde.org/System_Settings/Autostart
- https://www.amnesty.org/en/latest/research/2020/09/german-made-finspy-spyware-found-in-egypt-and-mac-and-linux-versions-revealed/
- https://www.intezer.com/blog/research/operation-electrorat-attacker-creates-fake-companies-to-drain-your-crypto-wallets/
- https://www.elastic.co/security-labs/primer-on-persistence-mechanisms
