title: Persistence via TelemetryController Scheduled Task Hijack
id: 68921d85-d0dc-48b3-865f-43291ca2c4f2
status: stable
level: high
description: 'Detects the successful hijack of Microsoft Compatibility Appraiser scheduled
  task to establish persistence with an

  integrity level of system.'
author: Elastic (converted by SIEMLess)
date: '2020-08-17'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - conhost.exe
    - DeviceCensus.exe
    - CompatTelRunner.exe
    - DismHost.exe
    - rundll32.exe
    - powershell.exe
  condition: selection
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1053.005
- attack.t1053
- attack.t1574
references:
- https://www.trustedsec.com/blog/abusing-windows-telemetry-for-persistence
