title: Persistence via Scheduled Job Creation
id: 1327384f-00f3-44d5-9a8c-2373ba071e92
status: stable
level: medium
description: 'A job can be used to schedule programs or scripts to be executed at
  a specified date and time. Adversaries may abuse

  task scheduling functionality to facilitate initial or recurring execution of malicious
  code.'
author: Elastic (converted by SIEMLess)
date: '2021-03-15'
modified: '2025-03-20'
logsource:
  product: windows
  category: file_event
detection:
  selection:
    host_os_type: windows
  condition: selection
tags:
- attack.persistence
- attack.t1053.005
- attack.t1053
falsepositives:
- Legitimate scheduled jobs may be created during installation of new software.
