title: Persistence via WMI Event Subscription
id: 9b6813a1-daf1-457e-b0e6-0bb4e55b8a4c
status: stable
level: low
description: 'An adversary can use Windows Management Instrumentation (WMI) to install
  event filters, providers, consumers, and

  bindings that execute code when a defined event occurs. Adversaries may use the
  capabilities of WMI to subscribe to an

  event and execute arbitrary code when that event occurs, providing persistence on
  a system.'
author: Elastic (converted by SIEMLess)
date: '2020-12-04'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_pe_original_file_name: wmic.exe
    process_args|contains:
    - ActiveScriptEventConsumer
    - CommandLineEventConsumer
  condition: selection
tags:
- attack.persistence
- attack.execution
- attack.t1047
- attack.t1546.003
- attack.t1546
references:
- https://www.elastic.co/security-labs/hunting-for-persistence-using-elastic-security-part-1
