title: Potential Kerberos SPN Spoofing via Suspicious DNS Query
id: 99ac5005-8a9e-4625-a0af-5f7bb447204b
status: stable
level: high
description: 'Identifies queries to a DNS record containing a base64-encoded blob
  matching the pattern "UWhRCA...BAAAA". This pattern

  corresponds to a marshaled CREDENTIAL_TARGET_INFORMATION structure, commonly used
  in Kerberos coercion attacks. It is

  associated with tools and techniques that exploit SPN spoofing via DNS. Adversaries
  may abuse this to coerce victim

  systems into authenticating to attacker-controlled hosts while requesting Kerberos
  tickets for legitimate services

  (often the victim''s own identity), enabling attacks such as NTLM reflection.'
author: Elastic (converted by SIEMLess)
date: '2025-06-14'
modified: '2025-06-14'
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    host_os_type: windows
    dns_question_name|endswith: UWhRC*BAAAA*
  condition: selection
tags:
- attack.credential_access
- attack.t1187
- attack.t1557
- attack.t1557.001
references:
- https://www.synacktiv.com/publications/ntlm-reflection-is-dead-long-live-ntlm-reflection-an-in-depth-analysis-of-cve-2025
- https://blog.redteam-pentesting.de/2025/reflective-kerberos-relay-attack/
- https://googleprojectzero.blogspot.com/2021/10/using-kerberos-for-authentication-relay.html
- https://github.com/CICADA8-Research/RemoteKrbRelay/blob/main/README.md
- https://github.com/Orange-Cyberdefense/ocd-mindmaps/blob/main/excalimap/mindmap/ad/authenticated.md
