title: Potential Code Execution via Postgresql
id: 2a692072-d78d-42f3-a48a-775677d79c4e
status: stable
level: medium
description: 'This rule monitors for suspicious activities that may indicate an attacker
  attempting to execute arbitrary code within a

  PostgreSQL environment. Attackers can execute code via PostgreSQL as a result of
  gaining unauthorized access to a public

  facing PostgreSQL database or exploiting vulnerabilities, such as remote command
  execution and SQL injection attacks,

  which can result in unauthorized access and malicious actions, and facilitate post-exploitation
  activities for

  unauthorized access and malicious actions.'
author: Elastic (converted by SIEMLess)
date: '2022-06-20'
modified: '2025-02-04'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    user_name: postgres
    process_parent_name: puppet
    process_parent_args|endswith: sh
    process_args|endswith: sh
  condition: selection
tags:
- attack.execution
- attack.t1059
- attack.t1059.004
