title: Potential Credential Access via LSASS Memory Dump
id: 9960432d-9b26-409f-972b-839a959e79e2
status: stable
level: high
description: 'Identifies suspicious access to LSASS handle from a call trace pointing
  to DBGHelp.dll or DBGCore.dll, which both export

  the MiniDumpWriteDump method that can be used to dump LSASS memory content in preparation
  for credential access.'
author: Elastic (converted by SIEMLess)
date: '2021-10-07'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_code: '10'
    winlog_event_data_CallTrace|contains:
    - '*dbghelp*'
    - '*dbgcore*'
    process_executable|contains:
    - ?:\\Windows\\System32\\WerFault.exe
    - ?:\\Windows\\SysWOW64\\WerFault.exe
    - ?:\\Windows\\System32\\WerFaultSecure.exe
  condition: selection
tags:
- attack.execution
- attack.credential_access
- attack.t1003
- attack.t1106
- attack.t1003.001
references:
- https://www.ired.team/offensive-security/credential-access-and-credential-dumping/dump-credentials-from-lsass-process-without-mimikatz
- https://www.elastic.co/security-labs/detect-credential-access
- https://www.elastic.co/security-labs/elastic-protects-against-data-wiper-malware-targeting-ukraine-hermeticwiper
