title: Potential Privilege Escalation via Recently Compiled Executable
id: 193549e8-bb9e-466a-a7f9-7e783f5cb5a6
status: stable
level: medium
description: 'This rule monitors a sequence involving a program compilation event
  followed by its execution and a subsequent

  alteration of UID permissions to root privileges. This behavior can potentially
  indicate the execution of a kernel or

  software privilege escalation exploit.'
author: Elastic (converted by SIEMLess)
date: '2023-08-28'
modified: '2025-02-04'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by host.id with maxspan=1m\n  [process where host.os.type\
      \ == \"linux\" and event.type == \"start\" and event.action == \"exec\" and\n\
      \   process.name in (\"gcc\", \"g++\", \"cc\") and user.id != \"0\"] by process.args\n\
      \  [file where host.os.type == \"linux\" and event.action == \"creation\" and\
      \ event.type == \"creation\" and\n   process.name == \"ld\" and user.id != \"\
      0\"] by file.name\n  [process where host.os.type == \"linux\" and event.type\
      \ == \"start\" and event.action == \"exec\" and\n   user.id != \"0\"] by process.name\n\
      \  [process where host.os.type == \"linux\" and event.action in (\"uid_change\"\
      , \"guid_change\") and event.type == \"change\" and\n   user.id == \"0\"] by\
      \ process.name"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.privilege_escalation
- attack.t1068
