title: Potential Enumeration via Active Directory Web Service
id: 9c951837-7d13-4b0c-be7a-f346623c8795
status: stable
level: medium
description: 'Identifies processes loading Active Directory related modules followed
  by a network connection to the ADWS dedicated TCP

  port. Adversaries may abuse the ADWS Windows service that allows Active Directory
  to be queried via this web service.'
author: Elastic (converted by SIEMLess)
date: '2024-01-31'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by process.entity_id with maxspan=3m\n [library where\
      \ host.os.type == \"windows\" and\n  dll.name : (\"System.DirectoryServices*.dll\"\
      , \"System.IdentityModel*.dll\") and\n  not user.id in (\"S-1-5-18\", \"S-1-5-19\"\
      , \"S-1-5-20\") and\n  not process.executable :\n                (\"?:\\\\windows\\\
      \\system32\\\\dsac.exe\",\n                 \"?:\\\\program files\\\\powershell\\\
      \\?\\\\pwsh.exe\",\n                 \"?:\\\\windows\\\\system32\\\\windowspowershell\\\
      \\*.exe\",\n                 \"?:\\\\windows\\\\syswow64\\\\windowspowershell\\\
      \\*.exe\",\n                 \"?:\\\\program files\\\\microsoft monitoring agent\\\
      \\*.exe\",\n                 \"?:\\\\windows\\\\adws\\\\microsoft.activedirectory.webservices.exe\"\
      )]\n [network where host.os.type == \"windows\" and destination.port == 9389\
      \ and source.port >= 49152 and\n  network.direction == \"egress\" and network.transport\
      \ == \"tcp\" and not cidrmatch(destination.ip, \"127.0.0.0/8\", \"::1/128\"\
      )]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.discovery
- attack.t1018
references:
- https://github.com/FalconForceTeam/SOAPHound
