title: Potential OpenSSH Backdoor Logging Activity
id: f28e2be4-6eca-4349-bdd9-381573730c22
status: stable
level: low
description: 'Identifies a Secure Shell (SSH) client or server process creating or
  writing to a known SSH backdoor log file.

  Adversaries may modify SSH related binaries for persistence or credential access
  via patching sensitive functions to

  enable unauthorized access or to log SSH credentials for exfiltration.'
author: Elastic (converted by SIEMLess)
date: '2020-12-21'
modified: '2025-03-20'
logsource:
  product: linux
  category: file_event
detection:
  selection:
    host_os_type: linux
    event_type: change
    process_executable|contains:
    - /usr/sbin/sshd
    - /usr/bin/ssh
    file_name|contains:
    - .cache
    - .viminfo
    - .bash_history
    - .google_authenticator
    - .jelenv
    - .csvignore
    - .rtreport
    file_extension|contains:
    - in
    - out
    - ini
    - h
    - gz
    - so
    - sock
    - sync
    - '0'
    - '1'
    - '2'
    - '3'
    - '4'
    - '5'
    - '6'
    - '7'
    - '8'
    - '9'
    file_path|contains:
    - /private/etc/*--
    - /usr/share/*
    - /usr/include/*
    - /usr/local/include/*
    - /private/tmp/*
    - /private/var/tmp/*
    - /usr/tmp/*
    - /usr/share/man/*
    - /usr/local/share/*
    - /usr/lib/*.so.*
    - /private/etc/ssh/.sshd_auth
    - /usr/bin/ssd
    - /private/var/opt/power
    - /private/etc/ssh/ssh_known_hosts
    - /private/var/html/lol
    - /private/var/log/utmp
    - /private/var/lib
    - /var/run/sshd/sshd.pid
    - /var/run/nscd/ns.pid
    - /var/run/udev/ud.pid
    - /var/run/udevd.pid
  condition: selection
tags:
- attack.persistence
- attack.credential_access
- attack.t1556
- attack.t1554
references:
- https://github.com/eset/malware-ioc/tree/master/sshdoor
- https://www.welivesecurity.com/wp-content/uploads/2021/01/ESET_Kobalos.pdf
falsepositives:
- Updates to approved and trusted SSH executables can trigger this rule.
