title: Potential LSASS Memory Dump via PssCaptureSnapShot
id: 0f93cb9a-1931-48c2-8cd0-f173fd3e5283
status: stable
level: high
description: 'Identifies suspicious access to an LSASS handle via PssCaptureSnapShot
  where two successive process accesses are

  performed by the same process and target two different instances of LSASS. This
  may indicate an attempt to evade

  detection and dump LSASS memory for credential access.'
author: Elastic (converted by SIEMLess)
date: '2021-10-14'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_category: process
    host_os_type: windows
    event_code: '10'
    winlog_event_data_TargetImage: ("C:\\Windows\\system32\\lsass.exe
    c: \\Windows\\System32\\lsass.exe")
  condition: selection
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.001
references:
- https://www.matteomalvica.com/blog/2019/12/02/win-defender-atp-cred-bypass/
- https://twitter.com/sbousseaden/status/1280619931516747777?lang=en
