title: Potential Escalation via Vulnerable MSI Repair
id: 043d80a3-c49e-43ef-9c72-1088f0c7b278
status: stable
level: high
description: 'Identifies when a browser process navigates to the Microsoft Help page
  followed by spawning an elevated process. This

  may indicate a successful exploitation for privilege escalation abusing a vulnerable
  Windows Installer repair setup.'
author: Elastic (converted by SIEMLess)
date: '2024-09-12'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_type: start
    host_os_type: windows
    user_domain|contains:
    - NT AUTHORITY
    - AUTORITE NT
    - AUTORIDADE NT
    process_parent_name|contains:
    - chrome.exe
    - msedge.exe
    - brave.exe
    - whale.exe
    - browser.exe
    - dragon.exe
    - vivaldi.exe
    - opera.exe
    - iexplore
    - firefox.exe
    - waterfox.exe
    - iexplore.exe
    - tor.exe
    - safari.exe
    process_parent_command_line|endswith: go.microsoft.com*
  condition: selection
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1218.007
- attack.t1218
- attack.t1068
references:
- https://sec-consult.com/blog/detail/msi-installer-repair-to-system-a-detailed-journey/
- https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2024-38014
