title: Potential Credential Access via Trusted Developer Utility
id: 9d110cb3-5f4b-4c9a-b9f5-53f0a1707ae5
status: stable
level: high
description: 'An instance of MSBuild, the Microsoft Build Engine, loaded DLLs (dynamically
  linked libraries) responsible for Windows

  credential management. This technique is sometimes used for credential dumping.'
author: Elastic (converted by SIEMLess)
date: '2020-03-25'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by process.entity_id\n [process where host.os.type ==\
      \ \"windows\" and event.type == \"start\" and (process.name : \"MSBuild.exe\"\
      \ or process.pe.original_file_name == \"MSBuild.exe\")]\n [any where host.os.type\
      \ == \"windows\" and (event.category == \"library\" or (event.category == \"\
      process\" and event.action : \"Image loaded*\")) and\n  (?dll.name : (\"vaultcli.dll\"\
      , \"SAMLib.DLL\") or file.name : (\"vaultcli.dll\", \"SAMLib.DLL\"))]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.defense_evasion
- attack.credential_access
- attack.t1003
- attack.t1555.004
- attack.t1555
- attack.t1127.001
- attack.t1003.002
- attack.t1127
falsepositives:
- The Build Engine is commonly used by Windows developers but use by non-engineers
  is unusual.
