title: Potential Linux Backdoor User Account Creation
id: 494ebba4-ecb7-4be4-8c6f-654c686549ad
status: stable
level: medium
description: 'Identifies the attempt to create a new backdoor user by setting the
  user''s UID to 0. Attackers may alter a user''s UID to

  0 to establish persistence on a system.'
author: Elastic (converted by SIEMLess)
date: '2023-03-07'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: usermod
  condition: selection
tags:
- attack.persistence
- attack.t1136.001
- attack.t1136
references:
- https://www.elastic.co/security-labs/primer-on-persistence-mechanisms
