title: Potential Network Scan Detected
id: 0171f283-ade7-4f87-9521-ac346c68cc9b
status: stable
level: low
description: 'This rule identifies a potential port scan. A port scan is a method
  utilized by attackers to systematically scan a

  target system or network for open ports, allowing them to identify available services
  and potential vulnerabilities. By

  mapping out the open ports, attackers can gather critical information to plan and
  execute targeted attacks, gaining

  unauthorized access, compromising security, and potentially leading to data breaches,
  unauthorized control, or further

  exploitation of the targeted system or network. This rule defines a threshold-based
  approach to detect connection

  attempts from a single source to a wide range of destination ports.'
author: Elastic (converted by SIEMLess)
date: '2023-05-17'
modified: '2025-02-28'
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    event_action: network_flow
    destination_port: '*'
    source_ip: (10.0.0.0/8
  condition: selection
tags:
- attack.discovery
- attack.reconnaissance
- attack.t1595
- attack.t1595.001
- attack.t1046
