title: Potential Reverse Shell via Java
id: 5a3d5447-31c9-409a-aed1-72f9921594fd
status: stable
level: medium
description: 'This detection rule identifies the execution of a Linux shell process
  from a Java JAR application post an incoming

  network connection. This behavior may indicate reverse shell activity via a Java
  application.'
author: Elastic (converted by SIEMLess)
date: '2023-07-04'
modified: '2025-02-04'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by host.id with maxspan=5s\n  [network where host.os.type\
      \ == \"linux\" and event.action in (\"connection_accepted\", \"connection_attempted\"\
      ) and\n   process.executable : (\"/usr/bin/java\", \"/bin/java\", \"/usr/lib/jvm/*\"\
      , \"/usr/java/*\") and\n   not (destination.ip == null or destination.ip ==\
      \ \"0.0.0.0\" or cidrmatch(\n     destination.ip, \"10.0.0.0/8\", \"127.0.0.0/8\"\
      , \"169.254.0.0/16\", \"172.16.0.0/12\", \"192.0.0.0/24\", \"192.0.0.0/29\"\
      ,\n     \"192.0.0.8/32\", \"192.0.0.9/32\", \"192.0.0.10/32\", \"192.0.0.170/32\"\
      , \"192.0.0.171/32\", \"192.0.2.0/24\",\n     \"192.31.196.0/24\", \"192.52.193.0/24\"\
      , \"192.168.0.0/16\", \"192.88.99.0/24\", \"224.0.0.0/4\", \"100.64.0.0/10\"\
      ,\n     \"192.175.48.0/24\",\"198.18.0.0/15\", \"198.51.100.0/24\", \"203.0.113.0/24\"\
      , \"240.0.0.0/4\", \"::1\", \"FE80::/10\",\n     \"FF00::/8\"\n    )\n  )] by\
      \ process.entity_id\n  [process where host.os.type == \"linux\" and event.action\
      \ == \"exec\" and\n   process.parent.executable : (\"/usr/bin/java\", \"/bin/java\"\
      , \"/usr/lib/jvm/*\", \"/usr/java/*\") and\n   process.parent.args : \"-jar\"\
      \ and process.name in (\"bash\", \"dash\", \"ash\", \"sh\", \"tcsh\", \"csh\"\
      , \"zsh\", \"ksh\", \"fish\")\n   and not process.parent.args in (\n     \"\
      /usr/share/java/jenkins.war\", \"/etc/remote-iot/services/remoteiot.jar\",\n\
      \     \"/usr/lib64/NetExtender.jar\", \"/usr/lib/jenkins/jenkins.war\"\n   )]\
      \ by process.parent.entity_id"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.execution
- attack.command_and_control
- attack.t1059
- attack.t1059.004
- attack.t1071
references:
- https://github.com/swisskyrepo/PayloadsAllTheThings/blob/master/Methodology%20and%20Resources/Reverse%20Shell%20Cheatsheet.md
