title: Potential Secure File Deletion via SDelete Utility
id: 5aee924b-6ceb-4633-980e-1bde8cdb40c5
status: stable
level: low
description: 'Detects file name patterns generated by the use of Sysinternals SDelete
  utility to securely delete a file via multiple

  file overwrite and rename operations.'
author: Elastic (converted by SIEMLess)
date: '2020-08-18'
modified: '2025-08-26'
logsource:
  product: windows
  category: file_event
detection:
  selection:
    host_os_type: windows
    event_type: change
    file_name|endswith: AAA.AAA
  condition: selection
tags:
- attack.impact
- attack.defense_evasion
- attack.t1070.004
- attack.t1485
- attack.t1070
