title: Potential Computer Account Relay Activity
id: 263481c8-1e9b-492e-912d-d1760707f810
status: stable
level: low
description: 'Identifies potential relay activities against a Computer account by
  identifying authentication events using the computer

  account coming from from hosts other than the server that owns the account. Attackers
  may relay the computer account

  hash after capturing it using forced authentication.'
author: Elastic (converted by SIEMLess)
date: '2024-07-24'
modified: '2025-06-16'
logsource:
  product: windows
  category: authentication
detection:
  selection:
    host_os_type: windows
  condition: selection
tags:
- attack.credential_access
- attack.t1187
- attack.t1557
- attack.t1557.001
references:
- https://github.com/p0dalirius/windows-coerced-authentication-methods
- https://www.thehacker.recipes/a-d/movement/mitm-and-coerced-authentications
- https://attack.mitre.org/techniques/T1187/
