title: Potential Fake CAPTCHA Phishing Attack
id: fbad57ec-4442-48db-a34f-5ee907b44a22
status: stable
level: high
description: 'Identifies potential fake CAPTCHA phishing attack based on PowerShell
  or Cmd argument values. Adversaries employ this

  technique via compromised websites with browser injects, posing either as fake CAPTCHAs
  to access the site or as a page

  loading error requiring a fix to display the page. The victim is instructed to copy
  and past a malicious command to

  the Windows Run dialog box.'
author: Elastic (converted by SIEMLess)
date: '2025-08-19'
modified: '2025-08-19'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - powershell.exe
    - cmd.exe
    - mshta.exe
    process_command_line|contains:
    - '*recaptcha *'
    - '*CAPTCHA Verif*'
    - '*complete verification*'
    - '*Verification ID*'
    - '*Verification Code*'
    - '*Verification UID*'
    - '*hυmаn vаlіdаtiοn*'
    - '*human ID*'
    - '*Action Identificator*'
    - '*not a robot*'
    - '*Click OK to*'
    - '*anti-robot test*'
    - '*Cloudflare ID*'
  condition: selection
tags:
- attack.defense_evasion
- attack.initial_access
- attack.execution
- attack.t1059.003
- attack.t1566
- attack.t1059
- attack.t1566.001
- attack.t1218.005
- attack.t1218
- attack.t1059.001
