title: Potential Evasion via Filter Manager
id: 06dceabf-adca-48af-ac79-ffdf4c3b1e9a
status: stable
level: medium
description: 'The Filter Manager Control Program (fltMC.exe) binary may be abused
  by adversaries to unload a filter driver and evade

  defenses.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-08-26'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562
- attack.t1562.001
