title: Potential Privilege Escalation via Enlightenment
id: bc0fc359-68db-421e-a435-348ced7a7f92
status: stable
level: high
description: 'Identifies an attempt to exploit a local privilege escalation CVE-2022-37706
  via a flaw in Linux window manager package

  Enlightenment. enlightenment_sys in Enlightenment before 0.25.4 allows local users
  to gain privileges because it is

  setuid root, and the system library function mishandles pathnames that begin with
  a /dev/.. substring.'
author: Elastic (converted by SIEMLess)
date: '2024-01-05'
modified: '2025-02-04'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by host.id, process.parent.entity_id with maxspan=5s\n\
      \  [process where host.os.type == \"linux\" and event.type == \"start\" and\
      \ event.action == \"exec\" and\n    process.name == \"enlightenment_sys\" and\
      \ process.args in (\"/bin/mount/\", \"-o\",\"noexec\",\"nosuid\",\"nodev\",\"\
      uid=*\") ]\n  [process where host.os.type == \"linux\" and event.action == \"\
      uid_change\" and event.type == \"change\" and user.id == \"0\"]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.privilege_escalation
- attack.t1068
references:
- https://ubuntu.com/security/CVE-2022-37706
- https://www.exploit-db.com/exploits/51180
