title: Potential Credential Access via Windows Utilities
id: 00140285-b827-4aee-aa09-8113f58a08f3
status: stable
level: high
description: 'Identifies the execution of known Windows utilities often abused to
  dump LSASS memory or the Active Directory database

  (NTDS.dit) in preparation for credential access.'
author: Elastic (converted by SIEMLess)
date: '2020-11-24'
modified: '2025-09-11'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_args|endswith: MiniDump*
    process_command_line|endswith: comsvcs*#*24*
  condition: selection
tags:
- attack.defense_evasion
- attack.credential_access
- attack.t1003
- attack.t1003.003
- attack.t1218.011
- attack.t1218
- attack.t1003.001
references:
- https://lolbas-project.github.io/
- https://www.elastic.co/security-labs/elastic-protects-against-data-wiper-malware-targeting-ukraine-hermeticwiper
