title: Potential Persistence via File Modification
id: 192657ba-ab0e-4901-89a2-911d611eee98
status: stable
level: low
description: 'This rule leverages the File Integrity Monitoring (FIM) integration
  to detect file modifications of files that are

  commonly used for persistence on Linux systems. The rule detects modifications to
  files that are commonly used for cron

  jobs, systemd services, message-of-the-day (MOTD), SSH configurations, shell configurations,
  runtime control, init

  daemon, passwd/sudoers/shadow files, Systemd udevd, and XDG/KDE autostart entries.
  To leverage this rule, the paths

  specified in the query need to be added to the FIM policy in the Elastic Security
  app.'
author: Elastic (converted by SIEMLess)
date: '2024-06-03'
modified: '2025-01-22'
logsource:
  product: linux
  category: file_event
detection:
  selection:
    host_os_type: linux
    event_dataset: fim.event
    event_action: updated
    file_path|contains:
    - /var/spool/cron/crontabs/tmp.*
    - /run/udev/rules.d/*rules.*
    - /home/*/.ssh/known_hosts.*
    - /root/.ssh/known_hosts.*
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.credential_access
- attack.t1574
- attack.t1136
- attack.t1053
- attack.t1548.003
- attack.t1053.003
- attack.t1548
- attack.t1014
- attack.t1037.004
- attack.t1037
- attack.t1547
- attack.t1574.006
- attack.t1556
- attack.t1547.006
- attack.t1136.001
- attack.t1543.002
- attack.t1543
references:
- https://www.elastic.co/security-labs/primer-on-persistence-mechanisms
- https://www.elastic.co/security-labs/sequel-on-persistence-mechanisms
