title: Potential Unauthorized Access via Wildcard Injection Detected
id: 4a99ac6f-9a54-4ba5-a64f-6eb65695841b
status: stable
level: low
description: 'This rule monitors for the execution of the "chown" and "chmod" commands
  with command line flags that could indicate a

  wildcard injection attack. Linux wildcard injection is a type of security vulnerability
  where attackers manipulate

  commands or input containing wildcards (e.g., *, ?, []) to execute unintended operations
  or access sensitive data by

  tricking the system into interpreting the wildcard characters in unexpected ways.'
author: Elastic (converted by SIEMLess)
date: '2023-07-28'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_args: -R
  condition: selection
tags:
- attack.privilege_escalation
- attack.credential_access
- attack.t1003.008
- attack.t1003
- attack.t1068
references:
- https://www.exploit-db.com/papers/33930
