title: Potential Kerberos Relay Attack against a Computer Account
id: 2d58f67c-156e-480a-a6eb-a698fd8197ff
status: stable
level: high
description: 'Detects potential relay attacks by identifying coercion attempts followed
  by authentication events using a target

  server''s computer account, originating from a different host. This may indicate
  that an attacker has captured and

  relayed the server''s computer account hash to execute code on behalf of the compromised
  system.'
author: Elastic (converted by SIEMLess)
date: '2025-06-18'
modified: '2025-10-17'
logsource:
  product: windows
  category: file_event
detection:
  selection:
    _original_eql: "sequence by winlog.computer_name, source.ip with maxspan=5s\n\n\
      /* Filter for an event that indicates coercion against known abused named pipes\
      \ using an account that is not the host */\n[file where host.os.type == \"windows\"\
      \ and event.code : \"5145\" and \n    not startswith~(winlog.computer_name,\
      \ substring(user.name, 0, -1)) and\n    file.name : (\n        \"Spoolss\",\
      \ \"netdfs\", \"lsarpc\", \"lsass\", \"netlogon\", \"samr\", \"efsrpc\", \"\
      FssagentRpc\",\n        \"eventlog\", \"winreg\", \"srvsvc\", \"dnsserver\"\
      , \"dhcpserver\", \"WinsPipe\"\n    )]\n\n/* Detects a logon attempt using the\
      \ Kerberos protocol resulting from the coercion coming from the same IP address\
      \ */\n[authentication where host.os.type == \"windows\" and event.code in (\"\
      4624\", \"4625\") and\n    endswith~(user.name, \"$\") and winlog.logon.type\
      \ : \"network\" and\n    winlog.event_data.AuthenticationPackageName : \"Kerberos\"\
      \ and\n\n    /* Filter for a machine account that matches the hostname */\n\
      \    startswith~(winlog.computer_name, substring(user.name, 0, -1)) and\n\n\
      \    /* Verify if the Source IP belongs to the host */\n    not endswith(string(source.ip),\
      \ string(host.ip)) and\n    source.ip != null and source.ip != \"::1\" and source.ip\
      \ != \"127.0.0.1\"]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.credential_access
- attack.t1187
- attack.t1557
- attack.t1557.001
references:
- https://github.com/p0dalirius/windows-coerced-authentication-methods
- https://www.thehacker.recipes/a-d/movement/mitm-and-coerced-authentications
- https://www.synacktiv.com/publications/ntlm-reflection-is-dead-long-live-ntlm-reflection-an-in-depth-analysis-of-cve-2025
- https://blog.redteam-pentesting.de/2025/reflective-kerberos-relay-attack/
- https://googleprojectzero.blogspot.com/2021/10/using-kerberos-for-authentication-relay.html
- https://github.com/CICADA8-Research/RemoteKrbRelay/blob/main/README.md
- https://github.com/Orange-Cyberdefense/ocd-mindmaps/blob/main/excalimap/mindmap/ad/authenticated.md
