title: Potential Remote Credential Access via Registry
id: 850d901a-2a3c-46c6-8b22-55398a01aad8
status: stable
level: high
description: 'Identifies remote access to the registry to potentially dump credential
  data from the Security Account Manager (SAM)

  registry hive in preparation for credential access and privileges elevation.'
author: Elastic (converted by SIEMLess)
date: '2022-03-01'
modified: '2024-05-21'
logsource:
  product: windows
  category: file_event
detection:
  selection:
    host_os_type: windows
    event_action: creation
    user_id|contains:
    - S-1-5-21-*
    - S-1-12-1-*
    file_path|contains:
    - ?:\\Windows\\system32\\*.tmp
    - ?:\\WINDOWS\\Temp\\*.tmp
  condition: selection
tags:
- attack.lateral_movement
- attack.credential_access
- attack.t1003
- attack.t1021
- attack.t1003.002
references:
- https://github.com/SecureAuthCorp/impacket/blob/master/examples/secretsdump.py
- https://www.elastic.co/security-labs/detect-credential-access
