title: Potential macOS SSH Brute Force Detected
id: ace1e989-a541-44df-93a8-a8b0591b63c0
status: stable
level: medium
description: 'Identifies a high number (20) of macOS SSH KeyGen process executions
  from the same host. An adversary may attempt a

  brute force attack to obtain unauthorized access to user accounts.'
author: Elastic (converted by SIEMLess)
date: '2020-11-16'
modified: '2025-01-15'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    event_category: process
    host_os_type: macos
    event_type: start
    process_name: sshd-keygen-wrapper
    process_parent_name: launchd
  condition: selection
tags:
- attack.credential_access
- attack.t1110
references:
- https://themittenmac.com/detecting-ssh-activity-via-process-monitoring/
