title: Potential Modification of Accessibility Binaries
id: 7405ddf1-6c8e-41ce-818f-48bea6bcaed8
status: stable
level: high
description: 'Windows contains accessibility features that may be launched with a
  key combination before a user has logged in. An

  adversary can modify the way these programs are launched to get a command prompt
  or backdoor without logging in to the

  system.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-09-11'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    user_name: SYSTEM
    process_parent_name|contains:
    - Utilman.exe
    - winlogon.exe
    process_args|contains:
    - C:\\Windows\\System32\\osk.exe
    - C:\\Windows\\System32\\Magnify.exe
    - C:\\Windows\\System32\\Narrator.exe
    - C:\\Windows\\System32\\Sethc.exe
    - utilman.exe
    - ATBroker.exe
    - DisplaySwitch.exe
    - sethc.exe
  condition: selection
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1546.008
- attack.t1546
references:
- https://www.elastic.co/blog/practical-security-engineering-stateful-detection
