title: Potential PowerShell Obfuscated Script
id: 8025db49-c57c-4fc0-bd86-7ccd6d10a35a
status: stable
level: medium
description: 'Identifies scripts that contain patterns and known methods that obfuscate
  PowerShell code. Attackers can use obfuscation

  techniques to bypass PowerShell security protections such as Antimalware Scan Interface
  (AMSI).'
author: Elastic (converted by SIEMLess)
date: '2024-07-03'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_category: process
    host_os_type: windows
    powershell_file_script_block_text: (
    env: ComSpec[4
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.t1027
- attack.t1059
- attack.t1059.001
- attack.t1140
references:
- https://github.com/danielbohannon/Invoke-Obfuscation
