title: Potential Data Splitting Detected
id: e302e6c3-448c-4243-8d9b-d41da70db582
status: stable
level: low
description: 'This rule looks for the usage of common data splitting utilities with
  specific arguments that indicate data splitting

  for exfiltration on Linux systems. Data splitting is a technique used by adversaries
  to split data into smaller parts to

  avoid detection and exfiltrate data.'
author: Elastic (converted by SIEMLess)
date: '2024-11-04'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: dd
    process_args: -C
  condition: selection
tags:
- attack.exfiltration
