title: Potential Reverse Shell Activity via Terminal
id: a1a0375f-22c2-48c0-81a4-7c2d11cc6856
status: stable
level: high
description: Identifies the execution of a shell process with suspicious arguments
  which may be indicative of reverse shell activity.
author: Elastic (converted by SIEMLess)
date: '2020-01-07'
modified: '2024-09-23'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    process_args|contains:
    - '*/dev/tcp/*'
    - '*/dev/udp/*'
    - '*zsh/net/tcp*'
    - '*zsh/net/udp*'
    process_command_line|contains:
    - '*/dev/tcp/sirh_db/*'
    - '*/dev/tcp/remoteiot.com/*'
    - '*dev/tcp/elk.stag.one/*'
    - '*dev/tcp/kafka/*'
    - '*/dev/tcp/$0/$1*'
    - '*/dev/tcp/127.*'
    - '*/dev/udp/127.*'
    - '*/dev/tcp/localhost/*'
    - '*/dev/tcp/itom-vault/*'
  condition: selection
tags:
- attack.execution
- attack.t1059
references:
- https://github.com/swisskyrepo/PayloadsAllTheThings/blob/master/Methodology%20and%20Resources/Reverse%20Shell%20Cheatsheet.md
- https://github.com/WangYihang/Reverse-Shell-Manager
- https://www.netsparker.com/blog/web-security/understanding-reverse-shells/
- https://www.elastic.co/security-labs/detecting-log4j2-with-elastic-security
