title: Potential Disabling of AppArmor
id: fac52c69-2646-4e79-89c0-fd7653461010
status: stable
level: low
description: 'This rule monitors for potential attempts to disable AppArmor. AppArmor
  is a Linux security module that enforces

  fine-grained access control policies to restrict the actions and resources that
  specific applications and processes can

  access. Adversaries may disable security tools to avoid possible detection of their
  tools and activities.'
author: Elastic (converted by SIEMLess)
date: '2023-08-28'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: ln
    process_args: /etc/apparmor.d/disable/
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562
- attack.t1562.001
