title: Potential File Transfer via Certreq
id: 79f0a1f7-ed6b-471c-8eb1-23abd6470b1c
status: stable
level: medium
description: 'Identifies Certreq making an HTTP Post request. Adversaries could abuse
  Certreq to download files or upload data to a

  remote URL.'
author: Elastic (converted by SIEMLess)
date: '2023-01-13'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_pe_original_file_name: CertReq.exe
  condition: selection
tags:
- attack.exfiltration
- attack.defense_evasion
- attack.command_and_control
- attack.t1567
- attack.t1218
- attack.t1105
references:
- https://lolbas-project.github.io/lolbas/Binaries/Certreq/
