title: Potential Hex Payload Execution via Common Utility
id: 0c1e8fda-4f09-451e-bc77-a192b6cbfc32
status: stable
level: low
description: 'This rule detects potential hex payload execution on Linux systems.
  Adversaries may use hex encoding to obfuscate

  payloads and evade detection mechanisms.'
author: Elastic (converted by SIEMLess)
date: '2024-11-04'
modified: '2025-04-29'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: xxd
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.t1059
- attack.t1204
- attack.t1140
- attack.t1027
- attack.t1059.004
- attack.t1204.002
