title: Potential Veeam Credential Access Command
id: b661f86d-1c23-4ce7-a59e-2edbdba28247
status: stable
level: medium
description: 'Identifies commands that can access and decrypt Veeam credentials stored
  in MSSQL databases. Attackers can use Veeam

  Credentials to target backups as part of destructive operations such as Ransomware
  attacks.'
author: Elastic (converted by SIEMLess)
date: '2024-03-14'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_args|contains:
    - Invoke-Sqlcmd
    - Invoke-SqlExecute
    - Invoke-DbaQuery
    - Invoke-SqlQuery
    process_args|endswith: '[VeeamBackup].[dbo].[Credentials]*'
  condition: selection
tags:
- attack.execution
- attack.credential_access
- attack.t1003
- attack.t1059.001
- attack.t1059
- attack.t1555
references:
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
