title: Potential SharpRDP Behavior
id: 8c81e506-6e82-4884-9b9a-75d3d252f967
status: stable
level: high
description: 'Identifies potential behavior of SharpRDP, which is a tool that can
  be used to perform authenticated command execution

  against a remote target via Remote Desktop Protocol (RDP) for the purposes of lateral
  movement.'
author: Elastic (converted by SIEMLess)
date: '2020-11-11'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "/* Incoming RDP followed by a new RunMRU string value set to cmd,\
      \ powershell, taskmgr or tsclient, followed by process execution within 1m */\n\
      \nsequence by host.id with maxspan=1m\n  [network where host.os.type == \"windows\"\
      \ and event.type == \"start\" and process.name : \"svchost.exe\" and destination.port\
      \ == 3389 and\n   network.direction : (\"incoming\", \"ingress\") and network.transport\
      \ == \"tcp\" and\n   source.ip != \"127.0.0.1\" and source.ip != \"::1\"\n \
      \ ]\n\n  [registry where host.os.type == \"windows\" and event.type == \"change\"\
      \ and process.name : \"explorer.exe\" and\n   registry.path : (\"HKEY_USERS\\\
      \\*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\RunMRU\\\
      \\*\") and\n   registry.data.strings : (\"cmd.exe*\", \"powershell.exe*\", \"\
      taskmgr*\", \"\\\\\\\\tsclient\\\\*.exe\\\\*\")\n  ]\n\n  [process where host.os.type\
      \ == \"windows\" and event.type == \"start\" and\n   (process.parent.name :\
      \ (\"cmd.exe\", \"powershell.exe\", \"taskmgr.exe\") or process.args : (\"\\\
      \\\\\\tsclient\\\\*.exe\")) and\n   not process.name : \"conhost.exe\"\n   ]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.lateral_movement
- attack.t1021.001
- attack.t1021
references:
- https://posts.specterops.io/revisiting-remote-desktop-lateral-movement-8fb905cb46c3
- https://github.com/sbousseaden/EVTX-ATTACK-SAMPLES/blob/master/Lateral%20Movement/LM_sysmon_3_12_13_1_SharpRDP.evtx
- https://www.elastic.co/security-labs/hunting-for-lateral-movement-using-event-query-language
