title: Potential File Download via a Headless Browser
id: 5f2f463e-6997-478c-8405-fb41cc283281
status: stable
level: high
description: 'Identifies the use of a browser to download a file from a remote URL
  and from a suspicious parent process. Adversaries

  may use browsers to avoid ingress tool transfer restrictions.'
author: Elastic (converted by SIEMLess)
date: '2024-05-10'
modified: '2025-09-11'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - chrome.exe
    - msedge.exe
    - brave.exe
    - browser.exe
    - dragon.exe
    - vivaldi.exe
    process_args|contains:
    - --disable-gpu
    - --dump-dom
    - '*http*'
    - data:text/html;base64,*
    process_parent_name|contains:
    - cmd.exe
    - powershell.exe
    - wscript.exe
    - cscript.exe
    - mshta.exe
    - conhost.exe
    - msiexec.exe
    - explorer.exe
    - rundll32.exe
    - winword.exe
    - excel.exe
    - onenote.exe
    - hh.exe
    - powerpnt.exe
    - forfiles.exe
    - pcalua.exe
    - wmiprvse.exe
    process_executable|contains:
    - ?:\\inetpub\\wwwroot\\*\\ext\\modules\\html2pdf\\bin\\chrome\\*\\chrome-win64\\chrome.exe
    - \\Device\\HarddiskVolume*\\inetpub\\wwwroot\\*\\ext\\modules\\html2pdf\\bin\\chrome\\*\\chrome-win64\\chrome.exe
  condition: selection
tags:
- attack.command_and_control
- attack.t1105
references:
- https://lolbas-project.github.io/lolbas/Binaries/Msedge/
