title: Potential Cookies Theft via Browser Debugging
id: 027ff9ea-85e7-42e3-99d2-bbb7069e02eb
status: stable
level: medium
description: 'Identifies the execution of a Chromium based browser with the debugging
  process argument, which may indicate an attempt

  to steal authentication cookies. An adversary may steal web application or service
  session cookies and use them to gain

  access web applications or Internet services as an authenticated user without needing
  credentials.'
author: Elastic (converted by SIEMLess)
date: '2020-12-21'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    process_args|contains:
    - --remote-debugging-port=*
    - --remote-debugging-targets=*
    - --remote-debugging-pipe=*
  condition: selection
tags:
- attack.credential_access
- attack.t1539
references:
- https://github.com/defaultnamehere/cookie_crimes
- https://embracethered.com/blog/posts/2020/cookie-crimes-on-mirosoft-edge/
- https://github.com/rapid7/metasploit-framework/blob/master/documentation/modules/post/multi/gather/chrome_cookies.md
- https://posts.specterops.io/hands-in-the-cookie-jar-dumping-cookies-with-chromiums-remote-debugger-port-34c4f468844e
falsepositives:
- Developers performing browsers plugin or extension debugging.
