title: Potential Impersonation Attempt via Kubectl
id: 3c6685eb-9eaa-43a4-be1b-a7f9f1f5e63d
status: stable
level: low
description: 'This rule detects potential impersonation attempts via the "kubectl"
  command in Linux environments. It identifies

  process events where "kubectl" is executed with arguments that suggest an attempt
  to impersonate another user or

  group, such as using "--kubeconfig", "--token", "--as", or "--as-group". This could
  indicate an adversary trying

  to gain unauthorized access or escalate privileges within a Kubernetes cluster.
  If this rule is triggered, in

  conjunction with rules related to secret access or kubeconfig file discovery, it
  may indicate a potential

  impersonation attempt.'
author: Elastic (converted by SIEMLess)
date: '2025-06-19'
modified: '2025-07-21'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: kubectl
  condition: selection
tags:
- attack.defense_evasion
- attack.credential_access
- attack.t1528
- attack.t1550.001
- attack.t1552
- attack.t1550
- attack.t1078
