title: Potential Command and Control via Internet Explorer
id: acd611f3-2b93-47b3-a0a3-7723bcc46f6d
status: stable
level: medium
description: 'Identifies instances of Internet Explorer (iexplore.exe) being started
  via the Component Object Model (COM) making

  unusual network connections. Adversaries could abuse Internet Explorer via COM to
  avoid suspicious processes making

  network connections and bypass host-based firewall restrictions.'
author: Elastic (converted by SIEMLess)
date: '2020-11-28'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by host.id, user.name with maxspan = 5s\n  [library where\
      \ host.os.type == \"windows\" and dll.name : \"IEProxy.dll\" and process.name\
      \ : (\"rundll32.exe\", \"regsvr32.exe\")]\n  [process where host.os.type ==\
      \ \"windows\" and event.type == \"start\" and process.parent.name : \"iexplore.exe\"\
      \ and process.parent.args : \"-Embedding\"]\n  /* IE started via COM in normal\
      \ conditions makes few connections, mainly to Microsoft and OCSP related domains,\
      \ add FPs here */\n  [network where host.os.type == \"windows\" and network.protocol\
      \ == \"dns\" and process.name : \"iexplore.exe\" and\n   not dns.question.name\
      \ :\n   (\n    \"*.microsoft.com\",\n    \"*.digicert.com\",\n    \"*.msocsp.com\"\
      ,\n    \"*.windowsupdate.com\",\n    \"*.bing.com\",\n    \"*.identrust.com\"\
      ,\n    \"*.sharepoint.com\",\n    \"*.office365.com\",\n    \"*.office.com\"\
      \n    )\n  ] /* with runs=5 */"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.execution
- attack.command_and_control
- attack.t1559
- attack.t1071
- attack.t1559.001
falsepositives:
- Processes such as MS Office using IEproxy to render HTML content.
