title: Potential Data Exfiltration Through Curl
id: be70614d-4295-473c-a953-582aef41c865
status: stable
level: medium
description: "Detects the use of curl to upload an archived file to an internet server.\
  \ Threat actors often will collect data on a\nsystem and compress it in an archive\
  \ file before exfiltrating the file back to their C2 server for review. Many threat\
  \ \nactors have been seen utilizing curl to upload this archive file with the collected\
  \ data to do this. Use of curl in this \nway while not inherently malicious should\
  \ be considered highly abnormal and suspicious activity."
author: Elastic (converted by SIEMLess)
date: '2025-04-29'
modified: '2025-10-17'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: curl
  condition: selection
tags:
- attack.exfiltration
- attack.t1048
references:
- https://everything.curl.dev/usingcurl/uploads
