title: Potential Admin Group Account Addition
id: 565c2b44-7a21-4818-955f-8d4737967d2e
status: stable
level: medium
description: 'Identifies attempts to add an account to the admin group via the command
  line. This could be an indication of privilege

  escalation activity.'
author: Elastic (converted by SIEMLess)
date: '2020-01-05'
modified: '2025-03-18'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
  condition: selection
tags:
- attack.privilege_escalation
- attack.t1078.003
- attack.t1078
references:
- https://managingosx.wordpress.com/2010/01/14/add-a-user-to-the-admin-group-via-command-line-3-0/
