title: Potential SSH-IT SSH Worm Downloaded
id: 2ddc468e-b39b-4f5b-9825-f3dcb0e998ea
status: stable
level: medium
description: 'Identifies processes that are capable of downloading files with command
  line arguments containing URLs to SSH-IT''s

  autonomous SSH worm. This worm intercepts outgoing SSH connections every time a
  user uses ssh.'
author: Elastic (converted by SIEMLess)
date: '2023-09-21'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_args|contains:
    - https://thc.org/ssh-it/x
    - http://nossl.segfault.net/ssh-it-deploy.sh
    - https://gsocket.io/x
    - https://thc.org/ssh-it/bs
    - http://nossl.segfault.net/bs
  condition: selection
tags:
- attack.lateral_movement
- attack.t1021.004
- attack.t1563.001
- attack.t1021
- attack.t1563
references:
- https://www.thc.org/ssh-it/
