title: Potential Web Shell ASPX File Creation
id: 32144184-7bfa-4541-9c3f-b65f16d24df9
status: stable
level: low
description: Identifies the creation of ASPX files in specific directories that are
  commonly targeted by attackers to deploy web shells.
author: Elastic (converted by SIEMLess)
date: '2025-07-24'
modified: '2025-08-18'
logsource:
  product: windows
  category: file_event
detection:
  selection:
    host_os_type: windows
  condition: selection
tags:
- attack.persistence
- attack.t1505.003
- attack.t1505
references:
- https://blog.viettelcybersecurity.com/toolshell-a-critical-sharepoint-vulnerability-chain-under-active-exploitation/
- https://www.sentinelone.com/blog/sharepoint-toolshell-zero-day-exploited-in-the-wild-targets-enterprise-servers/
- https://www.rapid7.com/blog/post/2024/10/30/investigating-a-sharepoint-compromise-ir-tales-from-the-field/
