title: Potential Kerberos Attack via Bifrost
id: 16904215-2c95-4ac8-bf5c-12354e047192
status: stable
level: high
description: 'Identifies use of Bifrost, a known macOS Kerberos pentesting tool, which
  can be used to dump cached Kerberos tickets or

  attempt unauthorized authentication techniques such as pass-the-ticket/hash and
  kerberoasting.'
author: Elastic (converted by SIEMLess)
date: '2020-01-12'
modified: '2025-03-18'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
  condition: selection
tags:
- attack.lateral_movement
- attack.credential_access
- attack.t1550.003
- attack.t1550
- attack.t1558
- attack.t1558.003
references:
- https://github.com/its-a-feature/bifrost
