title: Potential Privilege Escalation through Writable Docker Socket
id: 7acb2de3-8465-472a-8d9c-ccd7b73d0ed8
status: stable
level: medium
description: 'This rule monitors for the usage of Docker runtime sockets to escalate
  privileges on Linux systems. Docker sockets by

  default are only be writable by the root user and docker group. Attackers that have
  permissions to write to these

  sockets may be able to create and run a container that allows them to escalate privileges
  and gain further access onto

  the host file system.'
author: Elastic (converted by SIEMLess)
date: '2023-07-25'
modified: '2025-10-17'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: socat
    process_args|contains:
    - UNIX-CONNECT:*/docker.sock
    - UNIX-CONNECT:*/dockershim.sock
  condition: selection
tags:
- attack.privilege_escalation
- attack.t1611
references:
- https://book.hacktricks.xyz/linux-hardening/privilege-escalation/docker-security/docker-breakout-privilege-escalation#automatic-enumeration-and-escape
