title: Potential Credential Access via Renamed COM+ Services DLL
id: c5c9f591-d111-4cf8-baec-c26a39bc31ef
status: stable
level: high
description: 'Identifies suspicious renamed COMSVCS.DLL Image Load, which exports
  the MiniDump function that can be used to dump a

  process memory. This may indicate an attempt to dump LSASS memory while bypassing
  command-line based detection in

  preparation for credential access.'
author: Elastic (converted by SIEMLess)
date: '2021-10-17'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by process.entity_id with maxspan=1m\n [process where\
      \ host.os.type == \"windows\" and event.category == \"process\" and\n    process.name\
      \ : \"rundll32.exe\"]\n [process where host.os.type == \"windows\" and event.category\
      \ == \"process\" and event.dataset : \"windows.sysmon_operational\" and event.code\
      \ == \"7\" and\n   (file.pe.original_file_name : \"COMSVCS.DLL\" or file.pe.imphash\
      \ : \"EADBCCBB324829ACB5F2BBE87E5549A8\") and\n    /* renamed COMSVCS */\n \
      \   not file.name : \"COMSVCS.DLL\"]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.defense_evasion
- attack.credential_access
- attack.t1003
- attack.t1218.011
- attack.t1218
- attack.t1003.001
references:
- https://modexp.wordpress.com/2019/08/30/minidumpwritedump-via-com-services-dll/
