title: Potential PowerShell HackTool Script by Author
id: 2553a9af-52a4-4a05-bb03-85b2a479a0a0
status: stable
level: medium
description: 'Detects known PowerShell offensive tooling author''s name in PowerShell
  scripts. Attackers commonly use out-of-the-box

  offensive tools without modifying the code, which may still contain the author artifacts.
  This rule identifies common

  author handles found in popular PowerShell scripts used for red team exercises.'
author: Elastic (converted by SIEMLess)
date: '2024-05-08'
modified: '2025-09-03'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_category: process
    powershell_file_script_block_text: ("Get-UEFIDatabaseSigner
  condition: selection
tags:
- attack.execution
- attack.t1059
- attack.t1059.001
references:
- https://github.com/atc-project/atc-data/blob/master/docs/Logging_Policies/LP_0109_windows_powershell_script_block_log.md
