title: Potential Defense Evasion via Doas
id: 26a726d7-126e-4267-b43d-e9a70bfdee1e
status: stable
level: low
description: 'This rule detects the creation or rename of the Doas configuration file
  on a Linux system. Adversaries may create or

  modify the Doas configuration file to elevate privileges and execute commands as
  other users while attempting to evade

  detection.'
author: Elastic (converted by SIEMLess)
date: '2024-08-28'
modified: '2025-03-20'
logsource:
  product: linux
  category: file_event
detection:
  selection:
    host_os_type: linux
    file_path: /etc/doas.conf
  condition: selection
tags:
- attack.defense_evasion
- attack.t1548.003
- attack.t1548
references:
- https://wiki.archlinux.org/title/Doas
