title: Potential Reverse Shell via Child
id: 2138bb70-5a5e-42fd-be5e-b38edf6a6777
status: stable
level: medium
description: 'This detection rule identifies suspicious network traffic patterns associated
  with TCP reverse shell activity. This

  activity consists of a network event that is followed by the creation of a shell
  process with suspicious command line

  arguments. An attacker may establish a Linux TCP reverse shell to gain remote access
  to a target system.'
author: Elastic (converted by SIEMLess)
date: '2023-11-02'
modified: '2025-02-04'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by host.id, process.entity_id with maxspan=5s\n  [network\
      \ where event.type == \"start\" and host.os.type == \"linux\" and\n     event.action\
      \ in (\"connection_attempted\", \"connection_accepted\") and\n     process.name\
      \ : (\"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\"\
      , \"socat\") and destination.ip != null and\n     not cidrmatch(destination.ip,\
      \ \"127.0.0.0/8\", \"169.254.0.0/16\", \"224.0.0.0/4\", \"::1\")]\n  [process\
      \ where event.type == \"start\" and host.os.type == \"linux\" and event.action\
      \ == \"exec\" and\n     process.name in (\"bash\", \"dash\", \"sh\", \"tcsh\"\
      , \"csh\", \"zsh\", \"ksh\", \"fish\") and (\n       (process.args : (\"-i\"\
      , \"-l\")) or (process.parent.name == \"socat\" and process.parent.args : \"\
      *exec*\")\n   )]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.execution
- attack.command_and_control
- attack.t1059
- attack.t1059.004
- attack.t1071
references:
- https://github.com/swisskyrepo/PayloadsAllTheThings/blob/master/Methodology%20and%20Resources/Reverse%20Shell%20Cheatsheet.md
