title: Potential Windows Error Manager Masquerading
id: 6ea41894-66c3-4df7-ad6b-2c5074eb3df8
status: stable
level: medium
description: 'Identifies suspicious instances of the Windows Error Reporting process
  (WerFault.exe or Wermgr.exe) with matching

  command-line and process executable values performing outgoing network connections.
  This may be indicative of a

  masquerading attempt to evade suspicious child process behavior detections.'
author: Elastic (converted by SIEMLess)
date: '2020-08-24'
modified: '2025-08-12'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by host.id, process.entity_id with maxspan = 5s\n  [process\
      \ where host.os.type == \"windows\" and event.type:\"start\" and process.name\
      \ : (\"wermgr.exe\", \"WerFault.exe\") and\n    (process.args_count == 1 and\n\
      \      /* Excludes bug where a missing closing quote sets args_count to 1 despite\
      \ extra args */\n      not process.command_line regex~ \"\"\"\\\".*\\.exe[^\\\
      \"].*\"\"\")]\n  [network where host.os.type == \"windows\" and process.name\
      \ : (\"wermgr.exe\", \"WerFault.exe\") and network.protocol != \"dns\" and\n\
      \    network.direction : (\"outgoing\", \"egress\") and destination.ip !=\"\
      ::1\" and destination.ip !=\"127.0.0.1\"\n  ]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.defense_evasion
- attack.t1036.005
- attack.t1036
references:
- https://twitter.com/SBousseaden/status/1235533224337641473
- https://www.hexacorn.com/blog/2019/09/20/werfault-command-line-switches-v0-1/
- https://app.any.run/tasks/26051d84-b68e-4afb-8a9a-76921a271b81/
- https://www.elastic.co/security-labs/elastic-security-uncovers-blister-malware-campaign
falsepositives:
- Legit Application Crash with rare Werfault commandline value
