title: Potential Active Directory Replication Account Backdoor
id: f8822053-a5d2-46db-8c96-d460b12c36ac
status: stable
level: medium
description: 'Identifies the modification of the nTSecurityDescriptor attribute in
  a domain object with rights related to DCSync to a

  user/computer account. Attackers can use this backdoor to re-obtain access to hashes
  of any user/computer.'
author: Elastic (converted by SIEMLess)
date: '2024-07-10'
modified: '2025-11-14'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_code: '5136'
    host_os_type: windows
    winlog_event_data_AttributeLDAPDisplayName: nTSecurityDescriptor
    winlog_event_data_AttributeValue: (
  condition: selection
tags:
- attack.credential_access
- attack.t1003.006
- attack.t1003
references:
- https://twitter.com/menasec1/status/1111556090137903104
- https://www.specterops.io/assets/resources/an_ace_up_the_sleeve.pdf
- https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_account_backdoor_dcsync_rights.yml
- https://learn.microsoft.com/en-us/windows/win32/adschema/r-ds-replication-get-changes-all
- https://learn.microsoft.com/en-us/windows/win32/adschema/r-ds-replication-get-changes
- https://learn.microsoft.com/en-us/windows/win32/adschema/r-ds-replication-get-changes-in-filtered-set
