title: Potential Credential Access via DuplicateHandle in LSASS
id: 02a4576a-7480-4284-9327-548a806b5e48
status: stable
level: medium
description: 'Identifies suspicious access to an LSASS handle via DuplicateHandle
  from an unknown call trace module. This may indicate

  an attempt to bypass the NtOpenProcess API to evade detection and dump LSASS memory
  for credential access.'
author: Elastic (converted by SIEMLess)
date: '2021-09-27'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_code: '10'
    winlog_event_data_GrantedAccess: '0x40'
    winlog_event_data_CallTrace|endswith: UNKNOWN*
  condition: selection
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.001
references:
- https://github.com/CCob/MirrorDump
