title: Potential Protocol Tunneling via EarthWorm
id: 9f1c4ca3-44b5-481d-ba42-32dc215a2769
status: stable
level: medium
description: 'Identifies the execution of the EarthWorm tunneler. Adversaries may
  tunnel network communications to and from a victim

  system within a separate protocol to avoid detection and network filtering, or to
  enable access to otherwise unreachable

  systems.'
author: Elastic (converted by SIEMLess)
date: '2021-04-12'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
  condition: selection
tags:
- attack.command_and_control
- attack.t1572
references:
- http://rootkiter.com/EarthWorm/
- https://decoded.avast.io/luigicamastra/apt-group-targeting-governmental-agencies-in-east-asia/
