title: Potential Linux Credential Dumping via Unshadow
id: e7cb3cfd-aaa3-4d7b-af18-23b89955062c
status: stable
level: medium
description: 'Identifies the execution of the unshadow utility which is part of John
  the Ripper, a password-cracking tool on the host

  machine. Malicious actors can use the utility to retrieve the combined contents
  of the ''/etc/shadow'' and ''/etc/password''

  files. Using the combined file generated from the utility, the malicious threat
  actors can use them as input for

  password-cracking utilities or prepare themselves for future operations by gathering
  credential information of the

  victim.'
author: Elastic (converted by SIEMLess)
date: '2023-02-27'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: unshadow
  condition: selection
tags:
- attack.credential_access
- attack.t1003.008
- attack.t1003
references:
- https://www.cyberciti.biz/faq/unix-linux-password-cracking-john-the-ripper/
