title: Potential Persistence via Periodic Tasks
id: 48ec9452-e1fd-4513-a376-10a1a26d2c83
status: stable
level: low
description: 'Identifies the creation or modification of the default configuration
  for periodic tasks. Adversaries may abuse periodic

  tasks to execute malicious code or maintain persistence.'
author: Elastic (converted by SIEMLess)
date: '2021-01-21'
modified: '2025-03-18'
logsource:
  product: macos
  category: file_event
detection:
  selection:
    host_os_type: macos
    event_action: modification
  condition: selection
tags:
- attack.persistence
- attack.t1053
- attack.t1053.003
references:
- https://opensource.apple.com/source/crontabs/crontabs-13/private/etc/defaults/periodic.conf.auto.html
- https://www.oreilly.com/library/view/mac-os-x/0596003706/re328.html
- https://github.com/D00MFist/PersistentJXA/blob/master/PeriodicPersist.js
