title: Potential Shadow Credentials added to AD Object
id: 79f97b31-480e-4e63-a7f4-ede42bf2c6de
status: stable
level: high
description: 'Identify the modification of the msDS-KeyCredentialLink attribute in
  an Active Directory Computer or User Object.

  Attackers can abuse control over the object and create a key pair, append to raw
  public key in the attribute, and obtain

  persistent and stealthy access to the target user or computer object.'
author: Elastic (converted by SIEMLess)
date: '2022-01-26'
modified: '2025-11-14'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_code: '5136'
    host_os_type: windows
    winlog_event_data_AttributeLDAPDisplayName: msDS-KeyCredentialLink
    winlog_event_data_AttributeValue: B\:828*
    winlog_event_data_SubjectUserName: MSOL_*
  condition: selection
tags:
- attack.credential_access
- attack.t1556
references:
- https://posts.specterops.io/shadow-credentials-abusing-key-trust-account-mapping-for-takeover-8ee1a53566ab
- https://www.thehacker.recipes/ad/movement/kerberos/shadow-credentials
- https://github.com/OTRF/Set-AuditRule
- https://cyberstoph.org/posts/2022/03/detecting-shadow-credentials/
falsepositives:
- "    Modifications in the msDS-KeyCredentialLink attribute can be done legitimately\
  \ by the Azure AD Connect\n    synchronization account or the ADFS service account.\
  \ These accounts can be added as Exceptions.\n    "
