title: Potential Process Injection via PowerShell
id: 2e29e96a-b67c-455a-afe4-de6183431d0d
status: stable
level: high
description: 'Detects the use of Windows API functions that are commonly abused by
  malware and security tools to load malicious code

  or inject it into remote processes.'
author: Elastic (converted by SIEMLess)
date: '2021-10-14'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_category: process
    host_os_type: windows
    powershell_file_script_block_text: (
    file_directory: (
    C: \ProgramData\Microsoft\Windows
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.t1055.002
- attack.t1055.001
- attack.t1059
- attack.t1106
- attack.t1059.001
- attack.t1055
references:
- https://github.com/EmpireProject/Empire/blob/master/data/module_source/management/Invoke-PSInject.ps1
- https://github.com/EmpireProject/Empire/blob/master/data/module_source/management/Invoke-ReflectivePEInjection.ps1
- https://github.com/BC-SECURITY/Empire/blob/master/empire/server/data/module_source/credentials/Invoke-Mimikatz.ps1
- https://www.elastic.co/security-labs/detect-credential-access
falsepositives:
- Legitimate PowerShell scripts that make use of these functions.
