title: Potential Execution via FileFix Phishing Attack
id: 7dc45430-7407-4790-b89e-c857c3f6bf23
status: stable
level: high
description: 'Identifies the execution of Windows commands or downloaded files via
  the browser''s dialog box. Adversaries may use phishing

  to instruct the victim to copy and paste malicious commands for execution via crafted
  phsihing web pages.'
author: Elastic (converted by SIEMLess)
date: '2025-08-20'
modified: '2025-08-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_parent_args: --service-sandbox-type=none
    process_name|contains:
    - pwsh.exe
    - powershell.exe
    - curl.exe
    - msiexec.exe
    - mshta.exe
    - wscript.exe
    - cscript.exe
    - rundll32.exe
    - certutil.exe
    - certreq.exe
    process_args|contains:
    - ndfapi.dll,NdfRunDllDiagnoseWithAnswerFile
    - shwebsvc.dll,AddNetPlaceRunDll
  condition: selection
tags:
- attack.defense_evasion
- attack.initial_access
- attack.execution
- attack.t1059.003
- attack.t1566
- attack.t1059
- attack.t1566.001
- attack.t1218.005
- attack.t1218
- attack.t1059.001
references:
- https://mrd0x.com/filefix-clickfix-alternative/
