title: Potential NetNTLMv1 Downgrade Attack
id: 4d169db7-0323-4157-9ad3-ea5ece9019c9
status: stable
level: medium
description: 'Identifies registry modification to force the system to fall back to
  NTLMv1 for authentication. This modification is

  possible with local administrator privileges and is commonly referred to as a `NetNTLMv1
  downgrade attack`.'
author: Elastic (converted by SIEMLess)
date: '2025-04-14'
modified: '2025-08-26'
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    host_os_type: windows
    registry_value: LmCompatibilityLevel
  condition: selection
tags:
- attack.defense_evasion
- attack.t1112
- attack.t1562
- attack.t1562.010
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/security-policy-settings/network-security-lan-manager-authentication-level
