title: Potential RemoteMonologue Attack
id: c18975f5-676c-4091-b626-81e8938aa2ee
status: stable
level: medium
description: 'Identifies attempt to perform session hijack via COM object registry
  modification by setting the RunAs value to

  Interactive User.'
author: Elastic (converted by SIEMLess)
date: '2025-04-14'
modified: '2025-09-18'
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    host_os_type: windows
    registry_value: RunAs
    process_executable|contains: C:\\Program Files\\TeamViewer\\TeamViewer.exe
    registry_path|contains:
    - HKLM\\SOFTWARE\\Microsoft\\Office\\ClickToRun\\VREGISTRY_*
    - \\REGISTRY\\MACHINE\\SOFTWARE\\Microsoft\\Office\\ClickToRun\\VREGISTRY_*
    registry_path|endswith: \\S-1-*Classes\\AppID\\{D3E34B21-9D75-101A-8C3D-00AA001A1652}\\RunAs
  condition: selection
tags:
- attack.defense_evasion
- attack.t1112
- attack.t1562
references:
- https://www.ibm.com/think/x-force/remotemonologue-weaponizing-dcom-ntlm-authentication-coercions#1
- https://github.com/xforcered/RemoteMonologue
