title: Potential Reverse Shell via Suspicious Child Process
id: 76e4d92b-61c1-4a95-ab61-5fd94179a1ee
status: stable
level: medium
description: 'This detection rule detects the creation of a shell through a suspicious
  process chain. Any reverse shells spawned by

  the specified utilities that are initialized from a single process followed by a
  network connection attempt will be

  captured through this rule. Attackers may spawn reverse shells to establish persistence
  onto a target system.'
author: Elastic (converted by SIEMLess)
date: '2023-07-04'
modified: '2025-02-04'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by host.id, process.entity_id with maxspan=1s\n  [process\
      \ where host.os.type == \"linux\" and event.type == \"start\" and event.action\
      \ in (\"exec\", \"fork\") and (\n    (process.name : \"python*\" and process.args\
      \ : \"-c\" and process.args : (\n     \"*import*pty*spawn*\", \"*import*subprocess*call*\"\
      \n    )) or\n    (process.name : \"perl*\" and process.args : \"-e\" and process.args\
      \ : \"*socket*\" and process.args : (\n     \"*exec*\", \"*system*\"\n    ))\
      \ or\n    (process.name : \"ruby*\" and process.args : (\"-e\", \"-rsocket\"\
      ) and process.args : (\n     \"*TCPSocket.new*\", \"*TCPSocket.open*\"\n   \
      \  )) or\n    (process.name : \"lua*\" and process.args : \"-e\" and process.args\
      \ : \"*socket.tcp*\" and process.args : (\n     \"*io.popen*\", \"*os.execute*\"\
      \n    )) or\n    (process.name : \"php*\" and process.args : \"-r\" and process.args\
      \ : \"*fsockopen*\" and process.args : \"*/bin/*sh*\") or\n    (process.name\
      \ : (\"awk\", \"gawk\", \"mawk\", \"nawk\") and process.args : \"*/inet/tcp/*\"\
      ) or\n    (process.name : \"openssl\" and process.args : \"-connect\") or\n\
      \    (process.name : (\"nc\", \"ncat\", \"netcat\") and process.args == \"-e\"\
      \ and process.args_count >= 3 and\n     not process.args == \"-z\") or\n   \
      \ (process.name : \"telnet\" and process.args_count >= 3)\n  ) and process.parent.name\
      \ : (\n    \"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\",\
      \ \"fish\", \"python*\", \"php*\", \"perl\", \"ruby\", \"lua*\",\n    \"openssl\"\
      , \"nc\", \"netcat\", \"ncat\", \"telnet\", \"awk\")]\n  [network where host.os.type\
      \ == \"linux\" and event.type == \"start\" and event.action in (\"connection_attempted\"\
      , \"connection_accepted\") and\n    process.name : (\"python*\", \"php*\", \"\
      perl\", \"ruby\", \"lua*\", \"openssl\", \"nc\", \"netcat\", \"ncat\", \"telnet\"\
      , \"awk\") and\n    destination.ip != null and not cidrmatch(destination.ip,\
      \ \"127.0.0.0/8\", \"169.254.0.0/16\", \"224.0.0.0/4\", \"::1\")]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.execution
- attack.command_and_control
- attack.t1059
- attack.t1059.004
- attack.t1071
references:
- https://github.com/swisskyrepo/PayloadsAllTheThings/blob/master/Methodology%20and%20Resources/Reverse%20Shell%20Cheatsheet.md
