title: Potential Invoke-Mimikatz PowerShell Script
id: ac96ceb8-4399-4191-af1d-4feeac1f1f46
status: stable
level: high
description: 'Mimikatz is a credential dumper capable of obtaining plaintext Windows
  account logins and passwords, along with many

  other features that make it useful for testing the security of networks. This rule
  detects Invoke-Mimikatz PowerShell

  script and alike.'
author: Elastic (converted by SIEMLess)
date: '2020-12-07'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_category: process
    host_os_type: windows
    powershell_file_script_block_text: (
    sekurlsa: :logonpasswords
    crypto: :certificates
  condition: selection
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.001
references:
- https://attack.mitre.org/software/S0002/
- https://raw.githubusercontent.com/EmpireProject/Empire/master/data/module_source/credentials/Invoke-Mimikatz.ps1
- https://www.elastic.co/security-labs/detect-credential-access
