title: Potential LSA Authentication Package Abuse
id: e9abe69b-1deb-4e19-ac4a-5d5ac00f72eb
status: stable
level: medium
description: 'Adversaries can use the autostart mechanism provided by the Local Security
  Authority (LSA) authentication packages for

  privilege escalation or persistence by placing a reference to a binary in the Windows
  registry. The binary will then be

  executed by SYSTEM when the authentication packages are loaded.'
author: Elastic (converted by SIEMLess)
date: '2021-01-21'
modified: '2025-01-15'
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    host_os_type: windows
    event_type: change
    registry_path|contains:
    - HKLM\\SYSTEM\\*ControlSet*\\Control\\Lsa\\Authentication Packages
    - \\REGISTRY\\MACHINE\\SYSTEM\\*ControlSet*\\Control\\Lsa\\Authentication Packages
  condition: selection
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1547.002
- attack.t1547
