title: Potential File Transfer via Curl for Windows
id: 2e0051cb-51f8-492f-9d90-174e16b5e96b
status: stable
level: low
description: 'Identifies Curl for Windows making an HTTP request. Adversaries could
  abuse Curl to download files or upload data to a

  remote URL.'
author: Elastic (converted by SIEMLess)
date: '2025-02-03'
modified: '2025-08-27'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    user_id: S-1-5-18
    winlog_event_data_IntegrityLevel: System
    process_executable|contains:
    - ?:\\Windows\\System32\\curl.exe
    - ?:\\Windows\\SysWOW64\\curl.exe
    process_parent_name|contains:
    - cmd.exe
    - powershell.exe
    - rundll32.exe
    - explorer.exe
    - conhost.exe
    - forfiles.exe
    - wscript.exe
    - cscript.exe
    - mshta.exe
    - hh.exe
    - mmc.exe
    event_dataset|contains:
    - windows.sysmon_operational
    - windows.sysmon
    process_command_line|endswith: http*
  condition: selection
tags:
- attack.command_and_control
- attack.t1105
references:
- https://attack.mitre.org/techniques/T1105/
