title: Potential Local NTLM Relay via HTTP
id: 4682fd2c-cfae-47ed-a543-9bed37657aa6
status: stable
level: high
description: 'Identifies attempt to coerce a local NTLM authentication via HTTP using
  the Windows Printer Spooler service as a target.

  An adversary may use this primitive in combination with other techniques to elevate
  privileges on a compromised system.'
author: Elastic (converted by SIEMLess)
date: '2022-04-30'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_args|contains:
    - http*/print/pipe/*
    - http*/pipe/spoolss
    - http*/pipe/srvsvc
  condition: selection
tags:
- attack.defense_evasion
- attack.credential_access
- attack.t1218.011
- attack.t1218
- attack.t1212
references:
- https://github.com/med0x2e/NTLMRelay2Self
- https://github.com/topotam/PetitPotam
- https://github.com/dirkjanm/krbrelayx/blob/master/printerbug.py
