title: Potential PowerShell HackTool Script by Function Names
id: cde1bafa-9f01-4f43-a872-605b678968b0
status: stable
level: medium
description: 'Detects known PowerShell offensive tooling functions names in PowerShell
  scripts. Attackers commonly use out-of-the-box

  offensive tools without modifying the code. This rule aim is to take advantage of
  that.'
author: Elastic (converted by SIEMLess)
date: '2023-01-17'
modified: '2025-09-03'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_category: process
    host_os_type: windows
    powershell_file_script_block_text: (
    user_id: ("S-1-5-18
  condition: selection
tags:
- attack.execution
- attack.t1059
- attack.t1059.001
references:
- https://github.com/atc-project/atc-data/blob/master/docs/Logging_Policies/LP_0109_windows_powershell_script_block_log.md
- https://github.com/BC-SECURITY/Empire
- https://www.microsoft.com/en-us/security/blog/2025/05/27/new-russia-affiliated-actor-void-blizzard-targets-critical-sectors-for-espionage/
