title: Potential Linux Tunneling and/or Port Forwarding
id: 6ee947e9-de7e-4281-a55d-09289bdf947e
status: stable
level: medium
description: 'This rule monitors for a set of Linux utilities that can be used for
  tunneling and port forwarding. Attackers can

  leverage tunneling and port forwarding techniques to bypass network defenses, establish
  hidden communication channels,

  and gain unauthorized access to internal resources, facilitating data exfiltration,
  lateral movement, and remote

  control.'
author: Elastic (converted by SIEMLess)
date: '2023-08-23'
modified: '2025-06-30'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: socat
    process_args|contains:
    - TCP4-LISTEN:*
    - SOCKS*
  condition: selection
tags:
- attack.command_and_control
- attack.t1572
references:
- https://blog.bitsadmin.com/living-off-the-foreign-land-windows-as-offensive-platform
- https://book.hacktricks.xyz/generic-methodologies-and-resources/tunneling-and-port-forwarding
