title: PowerShell Suspicious Discovery Related Windows API Functions
id: 61ac3638-40a3-44b2-855a-985636ca985e
status: stable
level: low
description: 'This rule detects the use of discovery-related Windows API functions
  in PowerShell Scripts. Attackers can use these

  functions to perform various situational awareness related activities, like enumerating
  users, shares, sessions, domain

  trusts, groups, etc.'
author: Elastic (converted by SIEMLess)
date: '2021-10-13'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_category: process
    host_os_type: windows
    powershell_file_script_block_text: (
    Copyright: (c)
  condition: selection
tags:
- attack.discovery
- attack.execution
- attack.collection
- attack.t1087.001
- attack.t1069
- attack.t1482
- attack.t1059
- attack.t1069.001
- attack.t1039
- attack.t1106
- attack.t1135
- attack.t1087
- attack.t1059.001
references:
- https://github.com/BC-SECURITY/Empire/blob/9259e5106986847d2bb770c4289c0c0f1adf2344/data/module_source/situational_awareness/network/powerview.ps1#L21413
- https://github.com/atc-project/atc-data/blob/master/docs/Logging_Policies/LP_0109_windows_powershell_script_block_log.md
falsepositives:
- Legitimate PowerShell scripts that make use of these functions.
