title: PowerShell Kerberos Ticket Request
id: eb610e70-f9e6-4949-82b9-f1c5bcd37c39
status: stable
level: high
description: 'Detects PowerShell scripts that have the capability of requesting kerberos
  tickets, which is a common step in

  Kerberoasting toolkits to crack service accounts.'
author: Elastic (converted by SIEMLess)
date: '2022-01-24'
modified: '2025-09-03'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_category: process
    host_os_type: windows
    powershell_file_script_block_text: (
    user_id: ("S-1-5-18
  condition: selection
tags:
- attack.execution
- attack.credential_access
- attack.t1003
- attack.t1059
- attack.t1558
- attack.t1558.003
- attack.t1059.001
references:
- https://cobalt.io/blog/kerberoast-attack-techniques
- https://github.com/EmpireProject/Empire/blob/master/data/module_source/credentials/Invoke-Kerberoast.ps1
