title: PowerShell Suspicious Script with Clipboard Retrieval Capabilities
id: 92984446-aefb-4d5e-ad12-598042ca80ba
status: stable
level: medium
description: 'Detects PowerShell scripts that can get the contents of the clipboard,
  which attackers can abuse to retrieve sensitive

  information like credentials, messages, etc.'
author: Elastic (converted by SIEMLess)
date: '2023-01-12'
modified: '2025-09-03'
logsource:
  product: windows
  category: file_event
detection:
  selection:
    event_category: process
    host_os_type: windows
    powershell_file_script_block_text: (
    user_id: S-1-5-18
    file_path: '*WindowsPowerShell\\Modules\\*.ps1'
    file_name: ("Convert-ExcelRangeToImage.ps1
  condition: selection
tags:
- attack.execution
- attack.collection
- attack.t1059
- attack.t1059.001
- attack.t1115
references:
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.management/get-clipboard
- https://github.com/EmpireProject/Empire/blob/master/data/module_source/collection/Get-ClipboardContents.ps1
