title: PowerShell Invoke-NinjaCopy script
id: b8386923-b02c-4b94-986a-d223d9b01f88
status: stable
level: high
description: 'Detects PowerShell scripts that contain the default exported functions
  used on Invoke-NinjaCopy. Attackers can use

  Invoke-NinjaCopy to read SYSTEM files that are normally locked, such as the NTDS.dit
  file or registry hives.'
author: Elastic (converted by SIEMLess)
date: '2023-01-23'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_category: process
    host_os_type: windows
    powershell_file_script_block_text: (
    user_id: S-1-5-18
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.credential_access
- attack.t1003
- attack.t1003.003
- attack.t1059
- attack.t1003.002
- attack.t1006
- attack.t1059.001
references:
- https://github.com/BC-SECURITY/Empire/blob/main/empire/server/data/module_source/collection/Invoke-NinjaCopy.ps1
