title: PowerShell Script Block Logging Disabled
id: 818e23e6-2094-4f0e-8c01-22d30f3506c6
status: stable
level: medium
description: 'Identifies attempts to disable PowerShell Script Block Logging via registry
  modification. Attackers may disable this

  logging to conceal their activities in the host and evade detection.'
author: Elastic (converted by SIEMLess)
date: '2022-01-31'
modified: '2025-08-28'
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    host_os_type: windows
    event_type: change
    registry_data_strings|contains:
    - '0'
    - '0x00000000'
    process_executable|contains:
    - ?:\\Windows\\System32\\svchost.exe
    - ?:\\Windows\\System32\\DeviceEnroller.exe
    - ?:\\Windows\\system32\\omadmclient.exe
  condition: selection
tags:
- attack.defense_evasion
- attack.t1112
- attack.t1562.002
- attack.t1562
references:
- https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.PowerShell::EnableScriptBlockLogging
