title: PowerShell Script with Webcam Video Capture Capabilities
id: eb44611f-62a8-4036-a5ef-587098be6c43
status: stable
level: medium
description: 'Detects PowerShell scripts that can be used to record webcam video.
  Attackers can capture this information to extort or

  spy on victims.'
author: Elastic (converted by SIEMLess)
date: '2023-07-18'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_category: process
    host_os_type: windows
    powershell_file_script_block_text: (
  condition: selection
tags:
- attack.execution
- attack.collection
- attack.t1059
- attack.t1059.001
- attack.t1125
references:
- https://github.com/EmpireProject/Empire/blob/master/lib/modules/powershell/collection/WebcamRecorder.py
