title: PowerShell Share Enumeration Script
id: 4c59cff1-b78a-41b8-a9f1-4231984d1fb6
status: stable
level: high
description: 'Detects scripts that contain PowerShell functions, structures, or Windows
  API functions related to windows share

  enumeration activities. Attackers, mainly ransomware groups, commonly identify and
  inspect network shares, looking for

  critical information for encryption and/or exfiltration.'
author: Elastic (converted by SIEMLess)
date: '2022-08-17'
modified: '2025-09-03'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_category: process
    host_os_type: windows
    powershell_file_script_block_text: (
    user_id: S-1-5-18
  condition: selection
tags:
- attack.discovery
- attack.execution
- attack.collection
- attack.t1059
- attack.t1039
- attack.t1106
- attack.t1135
- attack.t1059.001
references:
- https://www.advintel.io/post/hunting-for-corporate-insurance-policies-indicators-of-ransom-exfiltrations
- https://thedfirreport.com/2022/04/04/stolen-images-campaign-ends-in-conti-ransomware/
- https://github.com/atc-project/atc-data/blob/master/docs/Logging_Policies/LP_0109_windows_powershell_script_block_log.md
