title: PowerShell MiniDump Script
id: 577ec21e-56fe-4065-91d8-45eb8224fe77
status: stable
level: high
description: 'This rule detects PowerShell scripts capable of dumping process memory
  using WindowsErrorReporting or Dbghelp.dll

  MiniDumpWriteDump. Attackers can use this tooling to dump LSASS and get access to
  credentials.'
author: Elastic (converted by SIEMLess)
date: '2021-10-05'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_category: process
    host_os_type: windows
    powershell_file_script_block_text: (MiniDumpWriteDump
    user_id: S-1-5-18
  condition: selection
tags:
- attack.execution
- attack.credential_access
- attack.t1003
- attack.t1059.001
- attack.t1059
- attack.t1003.001
references:
- https://github.com/PowerShellMafia/PowerSploit/blob/master/Exfiltration/Out-Minidump.ps1
- https://github.com/FuzzySecurity/PowerShell-Suite/blob/master/Get-ProcessMiniDump.ps1
- https://github.com/atc-project/atc-data/blob/master/docs/Logging_Policies/LP_0109_windows_powershell_script_block_log.md
falsepositives:
- PowerShell scripts that use this capability for troubleshooting.
