title: Privileges Elevation via Parent Process PID Spoofing
id: 26b01043-4f04-4d2f-882a-5a1d2e95751b
status: stable
level: high
description: 'Identifies parent process spoofing used to create an elevated child
  process. Adversaries may spoof the parent process

  identifier (PPID) of a new process to evade process-monitoring defenses or to elevate
  privileges.'
author: Elastic (converted by SIEMLess)
date: '2022-10-20'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_action: start
    process_code_signature_subject_name: Netwrix Corporation
    process_executable|contains:
    - ?:\\Windows\\System32\\MpSigStub.exe
    - ?:\\Windows\\SysWOW64\\MpSigStub.exe
    process_parent_executable|contains:
    - ?:\\Windows\\System32\\wuauclt.exe
    - ?:\\Windows\\SysWOW64\\wuauclt.exe
    - ?:\\Windows\\UUS\\Packages\\Preview\\*\\wuaucltcore.exe
    - ?:\\Windows\\UUS\\amd64\\wuauclt.exe
    - ?:\\Windows\\UUS\\amd64\\wuaucltcore.exe
    - ?:\\ProgramData\\Microsoft\\Windows\\UUS\\*\\wuaucltcore.exe
  condition: selection
tags:
- attack.privilege_escalation
- attack.t1134
- attack.t1134.002
- attack.t1134.004
references:
- https://gist.github.com/xpn/a057a26ec81e736518ee50848b9c2cd6
- https://blog.didierstevens.com/2017/03/20/
- https://learn.microsoft.com/en-us/windows/win32/api/processthreadsapi/nf-processthreadsapi-updateprocthreadattribute
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1134.002/T1134.002.md
