title: Process Activity via Compiled HTML File
id: e3343ab9-4245-4715-b344-e11c56b0a47f
status: stable
level: medium
description: 'Compiled HTML files (.chm) are commonly distributed as part of the Microsoft
  HTML Help system. Adversaries may conceal

  malicious code in a CHM file and deliver it to a victim for execution. CHM content
  is loaded by the HTML Help executable

  program (hh.exe).'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - mshta.exe
    - cmd.exe
    - powershell.exe
    - pwsh.exe
    - powershell_ise.exe
    - cscript.exe
    - wscript.exe
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.t1218.001
- attack.t1218
- attack.t1204.002
- attack.t1204
falsepositives:
- "    The HTML Help executable program (hh.exe) runs whenever a user clicks a compiled\
  \ help (.chm) file or menu item that\n    opens the help file inside the Help Viewer.\
  \ This is not always malicious, but adversaries may abuse this technology\n    to\
  \ conceal malicious code.\n    "
