title: Process Capability Set via setcap Utility
id: f18a474c-3632-427f-bcf5-363c994309ee
status: stable
level: low
description: 'This rule detects the use of the setcap utility to set capabilities
  on a process. The setcap utility is used to set the

  capabilities of a binary to allow it to perform privileged operations without needing
  to run as root. This can be used

  by attackers to establish persistence by creating a backdoor, or escalate privileges
  by abusing a misconfiguration on a

  system.'
author: Elastic (converted by SIEMLess)
date: '2024-06-03'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: setcap
    process_parent_executable|contains:
    - /var/lib/dpkg/*
    - /var/lib/docker/*
    - /tmp/newroot/*
    - /var/tmp/newroot/*
  condition: selection
tags:
- attack.persistence
- attack.privilege_escalation
