title: Process Injection by the Microsoft Build Engine
id: 9d110cb3-5f4b-4c9a-b9f5-53f0a1707ae9
status: stable
level: low
description: 'An instance of MSBuild, the Microsoft Build Engine, created a thread
  in another process. This technique is sometimes

  used to evade detection or elevate privileges.'
author: Elastic (converted by SIEMLess)
date: '2020-03-25'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_provider: Microsoft-Windows-Sysmon
    event_code: '8'
  condition: selection
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1127.001
- attack.t1055
- attack.t1127
falsepositives:
- The Build Engine is commonly used by Windows developers but use by non-engineers
  is unusual.
