title: Process Execution from an Unusual Directory
id: ebfe1448-7fac-4d59-acea-181bd89b1f7f
status: stable
level: medium
description: 'Identifies process execution from suspicious default Windows directories.
  This is sometimes done by adversaries to hide

  malware in trusted paths.'
author: Elastic (converted by SIEMLess)
date: '2020-10-30'
modified: '2025-05-05'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_executable|contains:
    - ?:\\Intel\\Wireless\\WUSetupLauncher.exe
    - ?:\\Intel\\Wireless\\Setup.exe
    - ?:\\Intel\\Move Mouse.exe
    - ?:\\windows\\Panther\\DiagTrackRunner.exe
    - ?:\\Windows\\servicing\\GC64\\tzupd.exe
    - ?:\\Users\\Public\\res\\RemoteLite.exe
    - ?:\\Users\\Public\\IBM\\ClientSolutions\\*.exe
    - ?:\\Users\\Public\\Documents\\syspin.exe
    - ?:\\Users\\Public\\res\\FileWatcher.exe
    process_name|contains:
    - SpeechUXWiz.exe
    - SystemSettings.exe
    - TrustedInstaller.exe
    - PrintDialog.exe
    - MpSigStub.exe
    - LMS.exe
    - mpam-*.exe
  condition: selection
tags:
- attack.defense_evasion
- attack.t1036.005
- attack.t1036
references:
- https://www.elastic.co/security-labs/invisible-miners-unveiling-ghostengine
- https://www.elastic.co/security-labs/siestagraph-new-implant-uncovered-in-asean-member-foreign-ministry
