title: Process Injection - Detected - Elastic Endgame
id: 80c52164-c82a-402c-9964-852533d58be1
status: stable
level: high
description: 'Elastic Endgame detected Process Injection. Click the Elastic Endgame
  icon in the event.module column or the link in the

  rule.reference column for additional information.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-03-21'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_kind: alert
    event_module: endgame
    endgame_metadata_type: detection
    event_action: kernel_shellcode_event
    endgame_event_subtype_full: kernel_shellcode_event)
  condition: selection
tags:
- attack.privilege_escalation
- attack.t1055
