title: Process Termination followed by Deletion
id: 09443c92-46b3-45a4-8f25-383b028b258d
status: stable
level: medium
description: 'Identifies a process termination event quickly followed by the deletion
  of its executable file. Malware tools and other

  non-native files dropped or created on a system by an adversary may leave traces
  to indicate to what occurred. Removal

  of these files can occur during an intrusion, or as part of a post-intrusion process
  to minimize the adversary''s

  footprint.'
author: Elastic (converted by SIEMLess)
date: '2020-11-04'
modified: '2025-02-03'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by host.id with maxspan=5s\n   [process where host.os.type\
      \ == \"windows\" and event.type == \"end\" and\n    process.code_signature.trusted\
      \ != true and\n    not process.executable like\n             (\"C:\\\\Windows\\\
      \\SoftwareDistribution\\\\*.exe\",\n              \"C:\\\\Windows\\\\WinSxS\\\
      \\*.exe\",\n              \"?:\\\\Windows\\\\Postillion\\\\Office\\\\*.exe\"\
      ) and\n    not (\n      process.name : \"infinst.exe\" and process.parent.name:\
      \ \"dxsetup.exe\" and\n      process.parent.code_signature.subject_name == \"\
      NVIDIA Corporation\" and\n      process.parent.code_signature.status == \"trusted\"\
      \n    )\n   ] by process.executable\n   [file where host.os.type == \"windows\"\
      \ and event.type == \"deletion\" and file.extension in~ (\"exe\", \"scr\", \"\
      com\") and\n    not process.executable like\n             (\"?:\\\\Program Files\\\
      \\*.exe\",\n              \"?:\\\\Program Files (x86)\\\\*.exe\",\n        \
      \      \"?:\\\\Windows\\\\System32\\\\svchost.exe\",\n              \"?:\\\\\
      Windows\\\\System32\\\\drvinst.exe\",\n              \"?:\\\\Windows\\\\Postillion\\\
      \\Office\\\\*.exe\") and\n    not file.path like (\n          \"?:\\\\Program\
      \ Files\\\\*.exe\",\n          \"?:\\\\Program Files (x86)\\\\*.exe\",\n   \
      \       \"?:\\\\Windows\\\\Temp\\\\*\\\\DismHost.exe\",\n          \"?:\\\\\
      $WINDOWS.~BT\\\\Work\\\\*\\\\DismHost.exe\",\n          \"?:\\\\$WinREAgent\\\
      \\Scratch\\\\*\\\\DismHost.exe\",\n          \"?:\\\\Windows\\\\tenable_mw_scan_*.exe\"\
      ,\n          \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Temp\\\\LogiUI\\\\Pak\\\
      \\uninstall.exe\",\n          \"?:\\\\ProgramData\\\\chocolatey\\\\*.exe\"\n\
      \    ) and\n    not (process.name : \"OktaVerifySetup-*.exe\" and process.code_signature.subject_name\
      \ == \"Okta, Inc.\") and\n    not (\n      process.executable : \"?:\\\\Windows\\\
      \\SysWOW64\\\\config\\\\systemprofile\\\\Citrix\\\\UpdaterBinaries\\\\CitrixReceiver\\\
      \\*\" and\n      process.code_signature.subject_name == \"Citrix Systems, Inc.\"\
      \ and\n      file.path : \"?:\\\\Windows\\\\SysWOW64\\\\config\\\\systemprofile\\\
      \\Citrix\\\\UpdaterBinaries\\\\CitrixReceiver\\\\*\\\\bootstrapperhelper.exe\"\
      \n    )\n   ] by file.path"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.defense_evasion
- attack.t1036.001
- attack.t1070
- attack.t1070.004
- attack.t1036
