title: Prompt for Credentials with Osascript
id: 38948d29-3d5d-42e3-8aec-be832aaaf8eb
status: stable
level: high
description: 'Identifies the use of osascript to execute scripts via standard input
  that may prompt a user with a rogue dialog for

  credentials.'
author: Elastic (converted by SIEMLess)
date: '2020-11-16'
modified: '2025-04-21'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    event_action: exec
    host_os_type: macos
    process_name: osascript
    process_args: -e
    process_parent_executable: /bin/bash
  condition: selection
tags:
- attack.credential_access
- attack.t1056
- attack.t1056.002
references:
- https://github.com/EmpireProject/EmPyre/blob/master/lib/modules/collection/osx/prompt.py
- https://ss64.com/osx/osascript.html
