title: ProxyChains Activity
id: 4b868f1f-15ff-4ba3-8c11-d5a7a6356d37
status: stable
level: low
description: 'This rule monitors for the execution of the ProxyChains utility. ProxyChains
  is a command-line tool that enables the

  routing of network connections through intermediary proxies, enhancing anonymity
  and enabling access to restricted

  resources. Attackers can exploit the ProxyChains utility to hide their true source
  IP address, evade detection, and

  perform malicious activities through a chain of proxy servers, potentially masking
  their identity and intentions.'
author: Elastic (converted by SIEMLess)
date: '2023-08-23'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: proxychains
  condition: selection
tags:
- attack.command_and_control
- attack.t1572
references:
- https://blog.bitsadmin.com/living-off-the-foreign-land-windows-as-offensive-platform
