title: Ransomware - Prevented - Elastic Endgame
id: e3c5d5cb-41d5-4206-805c-f30561eae3ac
status: stable
level: high
description: 'Elastic Endgame prevented ransomware. Click the Elastic Endgame icon
  in the event.module column or the link in the

  rule.reference column for additional information.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-03-21'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_kind: alert
    event_module: endgame
    endgame_metadata_type: prevention
    event_action: ransomware_event
    endgame_event_subtype_full: ransomware_event)
  condition: selection
