title: Rapid7 Threat Command CVEs Correlation
id: 3a657da0-1df2-11ef-a327-f661ea17fbcc
status: stable
level: high
description: 'This rule is triggered when CVEs collected from the Rapid7 Threat Command
  Integration have a match against

  vulnerabilities that were found in the customer environment.'
author: Elastic (converted by SIEMLess)
date: '2024-05-29'
modified: '2025-04-22'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    vulnerability_id: '*'
  condition: selection
references:
- https://www.elastic.co/guide/en/beats/filebeat/current/filebeat-module-threatintel.html
- https://docs.elastic.co/integrations/ti_rapid7_threat_command
