title: Rapid Secret Retrieval Attempts from AWS SecretsManager
id: 185c782e-f86a-11ee-9d9f-f661ea17fbce
status: stable
level: medium
description: 'This rule attempts to identify rapid secret retrieval attempts from
  AWS SecretsManager. Adversaries may attempt to

  retrieve secrets from the Secrets Manager programmatically using the `GetSecretValue`
  or `BatchGetSecretValue` API

  actions.'
author: Elastic (converted by SIEMLess)
date: '2024-04-11'
modified: '2025-02-03'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: aws.cloudtrail
    event_provider: secretsmanager.amazonaws.com
    event_action: (GetSecretValue
    event_outcome: success
    user_agent_name: ("Chrome
  condition: selection
tags:
- attack.credential_access
- attack.t1555.006
- attack.t1555
references:
- https://docs.aws.amazon.com/secretsmanager/latest/apireference/API_GetSecretValue.html
- https://detectioninthe.cloud/ttps/credential_access/access_secret_in_secrets_manager/
- https://cloud.hacktricks.xyz/pentesting-cloud/aws-security/aws-services/aws-secrets-manager-enum
- https://docs.aws.amazon.com/secretsmanager/latest/apireference/API_BatchGetSecretValue.html
falsepositives:
- "    Verify whether the user identity, user agent, and/or hostname should be using\
  \ GetSecretString or BatchGetSecretValue\n    APIs for the specified SecretId. If\
  \ known behavior is causing false positives, it can be exempted from the rule.\n\
  \    "
