title: rc.local/rc.common File Creation
id: 0f4d35e4-925e-4959-ab24-911be207ee6f
status: stable
level: medium
description: 'This rule monitors the creation/alteration of the rc.local/rc.common
  file. The /etc/rc.local file is used to start

  custom applications, services, scripts or commands during start-up. The rc.local
  file has mostly been replaced by

  Systemd. However, through the "systemd-rc-local-generator", rc.local files can be
  converted to services that run at

  boot. Adversaries may alter rc.local/rc.common to execute malicious code at start-up,
  and gain persistence onto the

  system.'
author: Elastic (converted by SIEMLess)
date: '2023-02-28'
modified: '2025-02-04'
logsource:
  product: linux
  category: file_event
detection:
  selection:
    host_os_type: linux
    file_Ext_original_extension: dpkg-new
    process_name: perl
    process_executable|contains:
    - /nix/store/*
    - /var/lib/dpkg/*
    - /snap/*
    - /dev/fd/*
    - /usr/lib/virtualbox/*
  condition: selection
tags:
- attack.persistence
- attack.t1037.004
- attack.t1037
references:
- https://www.intezer.com/blog/malware-analysis/hiddenwasp-malware-targeting-linux-systems/
- https://pberba.github.io/security/2022/02/06/linux-threat-hunting-for-persistence-initialization-scripts-and-shell-configuration/#8-boot-or-logon-initialization-scripts-rc-scripts
- https://www.cyberciti.biz/faq/how-to-enable-rc-local-shell-script-on-systemd-while-booting-linux-system/
- https://www.elastic.co/security-labs/sequel-on-persistence-mechanisms
