title: Remote File Copy to a Hidden Share
id: fa01341d-6662-426b-9d0c-6d81e33c8a9d
status: stable
level: medium
description: 'Identifies a remote file copy attempt to a hidden network share. This
  may indicate lateral movement or data staging

  activity.'
author: Elastic (converted by SIEMLess)
date: '2020-11-04'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - cmd.exe
    - powershell.exe
    - xcopy.exe
    - pwsh.exe
    - powershell_ise.exe
    process_command_line|contains:
    - '*copy*'
    - '*move*'
    - '* cp *'
    - '* mv *'
    process_command_line|endswith: \\\\*\\*$*
  condition: selection
tags:
- attack.lateral_movement
- attack.t1021
- attack.t1021.002
references:
- https://www.elastic.co/security-labs/hunting-for-lateral-movement-using-event-query-language
