title: Remote Scheduled Task Creation via RPC
id: 9c865691-5599-447a-bac9-b3f2df5f9a9d
status: stable
level: medium
description: Identifies scheduled task creation from a remote source. This could be
  indicative of adversary lateral movement.
author: Elastic (converted by SIEMLess)
date: '2022-08-29'
modified: '2025-11-14'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_action: scheduled-task-created
  condition: selection
tags:
- attack.lateral_movement
- attack.execution
- attack.t1053.005
- attack.t1053
- attack.t1021
