title: Remote Desktop Enabled in Windows Firewall by Netsh
id: 074464f9-f30d-4029-8c03-0ed237fffec7
status: stable
level: medium
description: 'Identifies use of the network shell utility (netsh.exe) to enable inbound
  Remote Desktop Protocol (RDP) connections in

  the Windows Firewall.'
author: Elastic (converted by SIEMLess)
date: '2020-10-13'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_pe_original_file_name: netsh.exe
    process_args|contains:
    - action=allow
    - enable=Yes
    - enable
  condition: selection
tags:
- attack.defense_evasion
- attack.t1562.004
- attack.t1562
