title: Remote File Download via PowerShell
id: 33f306e8-417c-411b-965c-c2812d6d3f4d
status: stable
level: medium
description: Identifies powershell.exe being used to download an executable file from
  an untrusted remote destination.
author: Elastic (converted by SIEMLess)
date: '2020-11-30'
modified: '2025-09-04'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by process.entity_id with maxspan=30s\n[network where\
      \ host.os.type == \"windows\" and \n  process.name : (\"powershell.exe\", \"\
      pwsh.exe\", \"powershell_ise.exe\") and\n  network.protocol == \"dns\" and\n\
      \  not dns.question.name : (\n        \"*.microsoft.com\", \"*.azureedge.net\"\
      , \"*.powershellgallery.com\", \"*.windowsupdate.com\",\n        \"metadata.google.internal\"\
      , \"dist.nuget.org\", \"artifacts.elastic.co\", \"*.digicert.com\",\n      \
      \  \"*.chocolatey.org\", \"outlook.office365.com\", \"cdn.oneget.org\", \"ci.dot.net\"\
      ,\n        \"packages.icinga.com\", \"login.microsoftonline.com\", \"*.gov\"\
      , \"*.azure.com\", \"*.python.org\",\n        \"dl.google.com\", \"sensor.cloud.tenable.com\"\
      , \"*.azurefd.net\", \"*.office.net\", \"*.anac*\",\n        \"aka.ms\", \"\
      dot.net\", \"*.visualstudio.com\", \"*.local\") and\n  not user.id == \"S-1-5-18\"\
      \ and\n  /* Filter out NetBIOS/LLMNR-style names (e.g. host, localhost, etc.)\
      \ */\n  dns.question.name regex \"\"\".*\\.[a-zA-Z]{2,5}\"\"\"]\n[file where\
      \ host.os.type == \"windows\" and event.type == \"creation\" and\n  process.name\
      \ : \"powershell.exe\" and \n  (file.extension : (\"exe\", \"dll\", \"ps1\"\
      , \"bat\") or file.Ext.header_bytes : \"4d5a*\") and\n  not file.name : \"__PSScriptPolicy*.ps1\"\
      \ and\n  not file.path : (\n        \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\
      \\Temp\\\\????????.dll\",\n        \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\\
      Temp\\\\*\\\\????????.dll\",\n        \"?:\\\\Windows\\\\TEMP\\\\ansible-tmp-*\\\
      \\AnsiballZ*.ps1\"\n  ) and\n  not user.id == \"S-1-5-18\"]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.execution
- attack.command_and_control
- attack.t1059
- attack.t1105
- attack.t1059.001
