title: Remote Computer Account DnsHostName Update
id: 6bed021a-0afb-461c-acbe-ffdb9574d3f3
status: stable
level: high
description: 'Identifies the remote update to a computer account''s DnsHostName attribute.
  If the new value set is a valid domain

  controller DNS hostname and the subject computer name is not a domain controller,
  then it''s highly likely a preparation

  step to exploit CVE-2022-26923 in an attempt to elevate privileges from a standard
  domain user to domain admin

  privileges.'
author: Elastic (converted by SIEMLess)
date: '2022-05-11'
modified: '2025-11-14'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_action: changed-computer-account
    user_id|contains:
    - S-1-5-21-*
    - S-1-12-1-*
  condition: selection
tags:
- attack.privilege_escalation
- attack.t1078
- attack.t1078.002
- attack.t1068
references:
- https://research.ifcr.dk/certifried-active-directory-domain-privilege-escalation-cve-2022-26923-9e098fe298f4
- https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2022-26923
