title: Renamed Utility Executed with Short Program Name
id: 17c7f6a5-5bc9-4e1f-92bf-13632d24384d
status: stable
level: medium
description: 'Identifies the execution of a process with a single character process
  name, differing from the original file name. This

  is often done by adversaries while staging, executing temporary utilities, or trying
  to bypass security detections based

  on the process name.'
author: Elastic (converted by SIEMLess)
date: '2020-11-15'
modified: '2025-08-26'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
  condition: selection
tags:
- attack.defense_evasion
- attack.t1036.003
- attack.t1036
