title: Scheduled Tasks AT Command Enabled
id: 9aa0e1f6-52ce-42e1-abb3-09657cee2698
status: stable
level: medium
description: 'Identifies attempts to enable the Windows scheduled tasks AT command
  via the registry. Attackers may use this method to

  move laterally or persist locally. The AT command has been deprecated since Windows
  8 and Windows Server 2012, but still

  exists for backwards compatibility.'
author: Elastic (converted by SIEMLess)
date: '2020-11-23'
modified: '2025-08-26'
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    host_os_type: windows
    event_type: change
    registry_data_strings|contains:
    - '1'
    - '0x00000001'
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.t1053
- attack.t1562
- attack.t1562.001
- attack.t1053.002
references:
- https://docs.microsoft.com/en-us/windows/win32/cimwin32prov/win32-scheduledjob
