title: Scheduled Task Created by a Windows Script
id: 689b9d57-e4d5-4357-ad17-9c334609d79a
status: stable
level: medium
description: 'A scheduled task was created by a Windows script via cscript.exe, wscript.exe
  or powershell.exe. This can be abused by

  an adversary to establish persistence.'
author: Elastic (converted by SIEMLess)
date: '2020-11-29'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by host.id with maxspan = 30s\n  [any where host.os.type\
      \ == \"windows\" and \n    (event.category : (\"library\", \"driver\") or (event.category\
      \ == \"process\" and event.action : \"Image loaded*\")) and\n    (?dll.name\
      \ : \"taskschd.dll\" or file.name : \"taskschd.dll\") and\n    process.name\
      \ : (\"cscript.exe\", \"wscript.exe\", \"powershell.exe\", \"pwsh.exe\", \"\
      powershell_ise.exe\")]\n  [registry where host.os.type == \"windows\" and event.type\
      \ == \"change\" and registry.value : \"Actions\" and\n    registry.path : (\n\
      \      \"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Schedule\\\
      \\TaskCache\\\\Tasks\\\\*\\\\Actions\",\n      \"\\\\REGISTRY\\\\MACHINE\\\\\
      SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Schedule\\\\TaskCache\\\
      \\Tasks\\\\*\\\\Actions\"\n  )]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.persistence
- attack.execution
- attack.t1053
- attack.t1059.005
- attack.t1059
- attack.t1053.005
- attack.t1059.001
falsepositives:
- Legitimate scheduled tasks may be created during installation of new software.
