title: ScreenConnect Server Spawning Suspicious Processes
id: 3d00feab-e203-4acc-a463-c3e15b7e9a73
status: stable
level: high
description: 'Identifies suspicious processes being spawned by the ScreenConnect server
  process (ScreenConnect.Service.exe). This

  activity may indicate exploitation activity or access to an existing web shell backdoor.'
author: Elastic (converted by SIEMLess)
date: '2024-03-26'
modified: '2025-09-12'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - cmd.exe
    - powershell.exe
    - pwsh.exe
    - powershell_ise.exe
    - csc.exe
  condition: selection
tags:
- attack.initial_access
- attack.execution
- attack.t1059
- attack.t1059.001
- attack.t1190
- attack.t1059.003
references:
- https://blackpointcyber.com/resources/blog/breaking-through-the-screen/
