title: Searching for Saved Credentials via VaultCmd
id: be8afaed-4bcd-4e0a-b5f9-5562003dde81
status: stable
level: medium
description: 'Windows Credential Manager allows you to create, view, or delete saved
  credentials for signing into websites, connected

  applications, and networks. An adversary may abuse this to list or dump credentials
  stored in the Credential Manager for

  saved usernames and passwords. This may also be performed in preparation of lateral
  movement.'
author: Elastic (converted by SIEMLess)
date: '2021-01-19'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
  condition: selection
tags:
- attack.credential_access
- attack.t1003
- attack.t1555.004
- attack.t1555
references:
- https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16
- https://web.archive.org/web/20201004080456/https://rastamouse.me/blog/rdp-jump-boxes/
- https://www.elastic.co/security-labs/detect-credential-access
