title: Security File Access via Common Utilities
id: 7efca3ad-a348-43b2-b544-c93a78a0ef92
status: stable
level: low
description: 'This rule detects sensitive security file access via common utilities
  on Linux systems. Adversaries may attempt to read

  from sensitive files using common utilities to gather information about the system
  and its security configuration.'
author: Elastic (converted by SIEMLess)
date: '2024-11-04'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
  condition: selection
tags:
- attack.discovery
