title: Sensitive Keys Or Passwords Searched For Inside A Container
id: 23cd4ba2-344e-41bf-bcda-655bea43fdbc
status: stable
level: medium
description: 'This rule detects the use of system search utilities like grep and find
  to search for private SSH keys or passwords

  inside a container. Unauthorized access to these sensitive files could lead to further
  compromise of the container

  environment or facilitate a container breakout to the underlying host machine.'
author: Elastic (converted by SIEMLess)
date: '2025-03-12'
modified: '2025-03-12'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    event_action: exec
    process_entry_leader_entry_meta_type: container
  condition: selection
tags:
- attack.credential_access
- attack.t1552
- attack.t1552.001
references:
- https://sysdig.com/blog/cve-2021-25741-kubelet-falco/
