title: Sensitive Privilege SeEnableDelegationPrivilege assigned to a User
id: f494c678-3c33-43aa-b169-bb3d5198c41d
status: stable
level: high
description: 'Identifies the assignment of the SeEnableDelegationPrivilege sensitive
  "user right" to a user. The

  SeEnableDelegationPrivilege "user right" enables computer and user accounts to be
  trusted for delegation. Attackers can

  abuse this right to compromise Active Directory accounts and elevate their privileges.'
author: Elastic (converted by SIEMLess)
date: '2022-01-27'
modified: '2025-11-14'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_code: '4704'
    host_os_type: windows
    winlog_event_data_PrivilegeList: SeEnableDelegationPrivilege
  condition: selection
tags:
- attack.persistence
- attack.credential_access
- attack.t1098
- attack.t1558
references:
- https://blog.harmj0y.net/activedirectory/the-most-dangerous-user-right-you-probably-have-never-heard-of/
- https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_alert_active_directory_user_control.yml
- https://twitter.com/_nwodtuhs/status/1454049485080907776
- https://www.thehacker.recipes/ad/movement/kerberos/delegations
- https://github.com/atc-project/atomic-threat-coverage/blob/master/Atomic_Threat_Coverage/Logging_Policies/LP_0105_windows_audit_authorization_policy_change.md
