title: SentinelOne Alert External Alerts
id: 9b35422b-9102-45a9-8610-2e0c22281c55
status: stable
level: medium
description: 'Generates a detection alert for each SentinelOne alert written to the
  configured indices. Enabling this rule allows you

  to immediately begin investigating SentinelOne alerts in the app.'
author: Elastic (converted by SIEMLess)
date: '2025-07-31'
modified: '2025-10-17'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_kind: event
    data_stream_dataset: sentinel_one.alert
  condition: selection
references:
- https://docs.elastic.co/en/integrations/sentinel_one
