title: SentinelOne Threat External Alerts
id: e43b7578-f3cc-4682-a8cf-f9d8a5fb07f1
status: stable
level: medium
description: 'Generates a detection alert for each SentinelOne threat written to the
  configured indices. Enabling this rule allows you

  to immediately begin investigating SentinelOne threat alerts in the app.'
author: Elastic (converted by SIEMLess)
date: '2025-08-04'
modified: '2025-10-17'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_kind: alert
    data_stream_dataset: sentinel_one.threat
  condition: selection
references:
- https://docs.elastic.co/en/integrations/sentinel_one
