title: Service DACL Modification via sc.exe
id: 5188c68e-d3de-4e96-994d-9e242269446f
status: stable
level: medium
description: Identifies DACL modifications to deny access to a service, making it
  unstoppable, or hide it from system and users.
author: Elastic (converted by SIEMLess)
date: '2024-07-16'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_args|contains:
    - '*;IU*'
    - '*;SU*'
    - '*;BA*'
    - '*;SY*'
    - '*;WD*'
    process_args|endswith: D;*
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1564
- attack.t1543.003
- attack.t1543
references:
- https://blogs.jpcert.or.jp/en/2024/07/mirrorface-attack-against-japanese-organisations.html
- https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sc_sdset_deny_service_access.yml
- https://learn.microsoft.com/en-us/windows/win32/secauthz/sid-strings
- https://www.sans.org/blog/red-team-tactics-hiding-windows-services/
