title: Service Control Spawned via Script Interpreter
id: e8571d5f-bea1-46c2-9f56-998de2d3ed95
status: stable
level: low
description: 'Identifies Service Control (sc.exe) spawning from script interpreter
  processes to create, modify, or start services.

  This can potentially indicate an attempt to elevate privileges or maintain persistence.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_pe_original_file_name: sc.exe
    process_parent_name|contains:
    - cmd.exe
    - wscript.exe
    - rundll32.exe
    - regsvr32.exe
    - wmic.exe
    - mshta.exe
    - powershell.exe
    - pwsh.exe
    process_args|contains:
    - config
    - create
    - start
    - delete
    - stop
    - pause
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.privilege_escalation
- attack.t1059.003
- attack.t1059
- attack.t1059.005
- attack.t1218.010
- attack.t1543.003
- attack.t1047
- attack.t1218.011
- attack.t1218
- attack.t1059.001
- attack.t1543
references:
- https://www.elastic.co/security-labs/invisible-miners-unveiling-ghostengine
