title: Simple HTTP Web Server Connection
id: 183f3cd2-4cc6-44c0-917c-c5d29ecdcf74
status: stable
level: low
description: 'This rule detects connections accepted by a simple HTTP web server in
  Python and PHP built-in modules. Adversaries may

  create simple HTTP web servers to establish persistence on a compromised system
  by uploading a reverse or command shell

  payload to the server web root, allowing them to regain remote access to the system
  if lost. This event may occur when

  an attacker requests the server to execute a command or script via a potential backdoor.'
author: Elastic (converted by SIEMLess)
date: '2024-12-17'
modified: '2025-10-13'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by process.entity_id with maxspan=1m\n[process where\
      \ host.os.type == \"linux\" and event.type == \"start\" and \n (\n  (process.name\
      \ regex~ \"\"\"php?[0-9]?\\.?[0-9]{0,2}\"\"\" and process.command_line like\
      \ \"*-S*\") or\n  (process.name like \"python*\" and process.command_line like\
      \ (\"*--cgi*\", \"*CGIHTTPServer*\"))\n )]\n[network where host.os.type == \"\
      linux\" and event.type == \"start\" and event.action == \"connection_accepted\"\
      ]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.persistence
- attack.execution
- attack.command_and_control
- attack.t1505
- attack.t1071
- attack.t1505.003
- attack.t1059
- attack.t1059.004
