title: Splunk External Alerts
id: d3b6222f-537e-4b84-956a-3ebae2dcf811
status: stable
level: medium
description: 'Generates a detection alert for each Splunk alert written to the configured
  indices. Enabling this rule allows you to

  immediately begin investigating Splunk alerts in the app.'
author: Elastic (converted by SIEMLess)
date: '2025-07-31'
modified: '2025-10-17'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_kind: alert
    data_stream_dataset: splunk.alert
  condition: selection
references:
- https://docs.elastic.co/en/integrations/splunk
