title: SSL Certificate Deletion
id: 7957f3b9-f590-4062-b9f9-003c32bfc7d6
status: stable
level: low
description: 'This rule detects the deletion of SSL certificates on a Linux system.
  Adversaries may delete SSL certificates to subvert

  trust controls and negatively impact the system.'
author: Elastic (converted by SIEMLess)
date: '2024-08-28'
modified: '2025-03-20'
logsource:
  product: linux
  category: file_event
detection:
  selection:
    host_os_type: linux
    event_type: deletion
  condition: selection
tags:
- attack.impact
- attack.defense_evasion
- attack.t1070.004
- attack.t1553
- attack.t1485
- attack.t1070
