title: Startup Persistence by a Suspicious Process
id: 440e2db4-bc7f-4c96-a068-65b78da59bde
status: stable
level: medium
description: 'Identifies files written to or modified in the startup folder by commonly
  abused processes. Adversaries may use this

  technique to maintain persistence.'
author: Elastic (converted by SIEMLess)
date: '2020-11-18'
modified: '2025-03-20'
logsource:
  product: windows
  category: file_event
detection:
  selection:
    host_os_type: windows
    file_path|contains:
    - C:\\Users\\*\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\*
    - C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp\\*
    process_name|contains:
    - cmd.exe
    - powershell.exe
    - wmic.exe
    - mshta.exe
    - pwsh.exe
    - cscript.exe
    - wscript.exe
    - regsvr32.exe
    - RegAsm.exe
    - rundll32.exe
    - EQNEDT32.EXE
    - WINWORD.EXE
    - EXCEL.EXE
    - POWERPNT.EXE
    - MSPUB.EXE
    - MSACCESS.EXE
    - iexplore.exe
    - InstallUtil.exe
  condition: selection
tags:
- attack.persistence
- attack.t1547.001
- attack.t1547
references:
- https://www.elastic.co/security-labs/hunting-for-persistence-using-elastic-security-part-1
- https://www.elastic.co/security-labs/elastic-security-uncovers-blister-malware-campaign
