title: Statistical Model Detected C2 Beaconing Activity with High Confidence
id: 0ab319ef-92b8-4c7f-989b-5de93c852e93
status: stable
level: low
description: 'A statistical model has identified command-and-control (C2) beaconing
  activity with high confidence. Beaconing can help

  attackers maintain stealthy communication with their C2 servers, receive instructions
  and payloads, exfiltrate data and

  maintain persistence in a network.'
author: Elastic (converted by SIEMLess)
date: '2023-09-22'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    beacon_stats_beaconing_score: '3'
  condition: selection
tags:
- attack.command_and_control
- attack.t1102
- attack.t1102.002
references:
- https://www.elastic.co/guide/en/security/current/prebuilt-ml-jobs.html
- https://docs.elastic.co/en/integrations/beaconing
- https://www.elastic.co/security-labs/identifying-beaconing-malware-using-elastic
