title: Stolen Credentials Used to Login to Okta Account After MFA Reset
id: 5610b192-7f18-11ee-825b-f661ea17fbcd
status: stable
level: high
description: 'Detects a sequence of suspicious activities on Windows hosts indicative
  of credential compromise, followed by efforts to

  undermine multi-factor authentication (MFA) and single sign-on (SSO) mechanisms
  for an Okta user account.'
author: Elastic (converted by SIEMLess)
date: '2023-11-09'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by user.name with maxspan=12h\n    [any where host.os.type\
      \ == \"windows\" and signal.rule.threat.tactic.name == \"Credential Access\"\
      ]\n    [any where event.dataset == \"okta.system\" and okta.event_type == \"\
      user.mfa.factor.update\"]\n    [any where event.dataset == \"okta.system\" and\
      \ okta.event_type: (\"user.session.start\", \"user.authentication*\")]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.persistence
- attack.t1556.006
- attack.t1556
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
- https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy
- https://sec.okta.com/articles/2023/08/cross-tenant-impersonation-prevention-and-detection
- https://www.elastic.co/security-labs/monitoring-okta-threats-with-elastic-security
- https://www.elastic.co/security-labs/starter-guide-to-understanding-okta
falsepositives:
- "    A Windows administrator may have triggered a low-fidelity credential access\
  \ alert during a legitimate administrative\n    action. Following this, the administrator\
  \ may have reset the MFA credentials for themselves and then logged into the\n \
  \   Okta console for AD directory services integration management.\n    "
