title: Suspicious Symbolic Link Created
id: 8a024633-c444-45c0-a4fe-78128d8c1ab6
status: stable
level: low
description: 'Identifies the creation of a symbolic link to a suspicious file or location.
  A symbolic link is a reference to a file or

  directory that acts as a pointer or shortcut, allowing users to access the target
  file or directory from a different

  location in the file system. An attacker can potentially leverage symbolic links
  for privilege escalation by tricking a

  privileged process into following the symbolic link to a sensitive file, giving
  the attacker access to data or

  capabilities they would not normally have.'
author: Elastic (converted by SIEMLess)
date: '2023-07-27'
modified: '2025-02-04'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    event_action: exec
    process_name: ln
    process_working_directory: /usr/bin
    user_Ext_real_id: '0'
    group_Ext_real_id: '0'
    process_args|contains:
    - /home/*/.ssh/*
    - /root/.ssh/*
    - /etc/sudoers.d/*
    - /dev/shm/*
  condition: selection
tags:
- attack.privilege_escalation
- attack.credential_access
- attack.t1003.008
- attack.t1003
- attack.t1548
