title: Suspicious Execution via Microsoft Office Add-Ins
id: ae8a142c-6a1d-4918-bea7-0b617e99ecfa
status: stable
level: medium
description: 'Identifies execution of common Microsoft Office applications to launch
  an Office Add-In from a suspicious path or with

  an unusual parent process. This may indicate an attempt to get initial access via
  a malicious phishing MS Office Add-In.'
author: Elastic (converted by SIEMLess)
date: '2023-03-20'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - WINWORD.EXE
    - EXCEL.EXE
    - POWERPNT.EXE
    - MSACCESS.EXE
    - VSTOInstaller.exe
    process_args|contains:
    - ?:\\Users\\*\\Temp\\7z*
    - ?:\\Users\\*\\Temp\\Rar$*
    - ?:\\Users\\*\\Temp\\Temp?_*
    - ?:\\Users\\*\\Temp\\BNZ.*
    - ?:\\Users\\*\\Downloads\\*
    - ?:\\Users\\*\\AppData\\Roaming\\*
    - ?:\\Users\\Public\\*
    - ?:\\ProgramData\\*
    - ?:\\Windows\\Temp\\*
    - \\Device\\*
    - http*
    process_parent_name|contains:
    - cmd.exe
    - powershell.exe
    process_parent_executable|contains:
    - ?:\\Program Files\\Logitech\\LogiOptions\\PlugInInstallerUtility*.exe
    - ?:\\ProgramData\\Logishrd\\LogiOptions\\Plugins\\VSTO\\*\\VSTOInstaller.exe
    - ?:\\Program Files\\Logitech\\LogiOptions\\PlugInInstallerUtility.exe
    - ?:\\Program Files\\LogiOptionsPlus\\PlugInInstallerUtility*.exe
    - ?:\\ProgramData\\Logishrd\\LogiOptionsPlus\\Plugins\\VSTO\\*\\VSTOInstaller.exe
    - ?:\\Program Files\\Common Files\\microsoft shared\\VSTO\\*\\VSTOInstaller.exe
    process_args|endswith: .vsto
  condition: selection
tags:
- attack.persistence
- attack.initial_access
- attack.t1566
- attack.t1566.001
- attack.t1137
- attack.t1137.006
references:
- https://github.com/Octoberfest7/XLL_Phishing
- https://labs.f-secure.com/archive/add-in-opportunities-for-office-persistence/
