title: Suspicious Endpoint Security Parent Process
id: b41a13c6-ba45-4bab-a534-df53d0cfed6a
status: stable
level: medium
description: 'A suspicious Endpoint Security parent process was detected. This may
  indicate a process hollowing or other form of code

  injection.'
author: Elastic (converted by SIEMLess)
date: '2020-08-24'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - esensor.exe
    - elastic-endpoint.exe
    process_parent_executable|contains:
    - ?:\\Windows\\System32\\cmd.exe
    - ?:\\Windows\\System32\\SecurityHealthHost.exe
    - ?:\\Windows\\System32\\SecurityHealth\\*\\SecurityHealthHost.exe
    - ?:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe
    process_args|contains:
    - test
    - version
    - top
    - run
    - '*help'
    - status
    - upgrade
    - /launch
    - /enable
    - /av
  condition: selection
tags:
- attack.defense_evasion
- attack.t1036.005
- attack.t1036
