title: Suspicious Child Process of Adobe Acrobat Reader Update Service
id: f85ce03f-d8a8-4c83-acdc-5c8cd0592be7
status: stable
level: high
description: 'Detects attempts to exploit privilege escalation vulnerabilities related
  to the Adobe Acrobat Reader

  PrivilegedHelperTool responsible for installing updates. For more information, refer
  to CVE-2020-9615, CVE-2020-9614 and

  CVE-2020-9613 and verify that the impacted system is patched.'
author: Elastic (converted by SIEMLess)
date: '2021-01-19'
modified: '2025-03-18'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
    user_name: root
  condition: selection
tags:
- attack.privilege_escalation
- attack.t1068
references:
- https://rekken.github.io/2020/05/14/Security-Flaws-in-Adobe-Acrobat-Reader-Allow-Malicious-Program-to-Gain-Root-on-macOS-Silently/
falsepositives:
- Trusted system or Adobe Acrobat Related processes.
