title: Suspicious Execution via Windows Subsystem for Linux
id: 3e0eeb75-16e8-4f2f-9826-62461ca128b7
status: stable
level: low
description: 'Detects Linux Bash commands from the the Windows Subsystem for Linux.
  Adversaries may enable and use WSL for Linux to

  avoid detection.'
author: Elastic (converted by SIEMLess)
date: '2023-01-13'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    process_pe_original_file_name: Bash.exe
    process_command_line|contains:
    - bash
    - bash.exe
    process_args|contains:
    - wsl-bootstrap
    - docker-desktop-data
    - '*.vscode-server*'
    process_parent_executable|contains: ?:\\Program Files\\Docker\\*.exe
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.t1059
- attack.t1202
- attack.t1059.004
references:
- https://blog.f-secure.com/hunting-for-windows-subsystem-for-linux/
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Wsl/
- https://blog.qualys.com/vulnerabilities-threat-research/2022/03/22/implications-of-windows-subsystem-for-linux-for-adversaries-defenders-part-1
