title: Suspicious Communication App Child Process
id: adbfa3ee-777e-4747-b6b0-7bd645f30880
status: stable
level: medium
description: 'Identifies suspicious child processes of communications apps, which
  can indicate a potential masquerading as the

  communication app or the exploitation of a vulnerability on the application causing
  it to execute code.'
author: Elastic (converted by SIEMLess)
date: '2023-08-04'
modified: '2025-08-26'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_executable|contains:
    - ?:\\Windows\\splwow64.exe
    - ?:\\Windows\\System32\\spool\\drivers\\x64\\3\\*.EXE
    process_code_signature_subject_name|contains: Mozilla Corporation
    process_parent_name|contains:
    - CiscoCollabHost.exe
    - WebexHost.exe
    process_command_line|contains:
    - C:\\WINDOWS\\system32\\cmd.exe /d /s /c \
    - ",\n              "
    - C:\\Program^ Files\\NVIDIA^ Corporation\\NVSMI\\nvidia-smi.exe\
    process_args|contains:
    - C:\\WINDOWS/System32/nvidia-smi.exe
    - C:\\WINDOWS\\System32\\nvidia-smi.exe
    - C:\\Windows\\System32\\DriverStore\\FileRepository/*/nvidia-smi.exe*
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1036.005
- attack.t1036.001
- attack.t1036
- attack.t1055
- attack.t1554
