title: Suspicious Microsoft Diagnostics Wizard Execution
id: 2c3c29a4-f170-42f8-a3d8-2ceebc18eb6a
status: stable
level: high
description: 'Identifies potential abuse of the Microsoft Diagnostics Troubleshooting
  Wizard (MSDT) to proxy malicious command or

  binary execution via malicious process arguments.'
author: Elastic (converted by SIEMLess)
date: '2022-05-31'
modified: '2025-09-11'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_pe_original_file_name: msdt.exe
    process_args|contains:
    - ?:\\WINDOWS\\diagnostics\\index\\PCWDiagnostic.xml
    - PCWDiagnostic.xml
    - ?:\\Users\\Public\\*
    - ?:\\Windows\\Temp\\*
    process_parent_name|contains:
    - explorer.exe
    - cmd.exe
    - powershell.exe
    - cscript.exe
    - wscript.exe
    - mshta.exe
    - rundll32.exe
    - regsvr32.exe
    process_executable|contains:
    - ?:\\Windows\\system32\\msdt.exe
    - ?:\\Windows\\SysWOW64\\msdt.exe
    - \\Device\\HarddiskVolume*\\Windows\\system32\\msdt.exe
    - \\Device\\HarddiskVolume*\\Windows\\SysWOW64\\msdt.exe
  condition: selection
tags:
- attack.defense_evasion
- attack.t1218
references:
- https://twitter.com/nao_sec/status/1530196847679401984
- https://lolbas-project.github.io/lolbas/Binaries/Msdt/
