title: Suspicious DLL Loaded for Persistence or Privilege Escalation
id: bfeaf89b-a2a7-48a3-817f-e41829dc61ee
status: stable
level: high
description: 'Identifies the loading of a non Microsoft signed DLL that is missing
  on a default Windows install (phantom DLL) or one

  that can be loaded from a different location by a native Windows process. This may
  be abused to persist or elevate

  privileges via privileged file write vulnerabilities.'
author: Elastic (converted by SIEMLess)
date: '2020-01-07'
modified: '2025-09-01'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_category: process
    file_code_signature_status: Valid
    event_category|contains:
    - driver
    - library
    dll_name|contains:
    - wlbsctrl.dll
    - wbemcomn.dll
    - WptsExtensions.dll
    - Tsmsisrv.dll
    - TSVIPSrv.dll
    - Msfte.dll
    - wow64log.dll
    - WindowsCoreDeviceInfo.dll
    - Ualapi.dll
    - wlanhlp.dll
    - phoneinfo.dll
    - EdgeGdi.dll
    - cdpsgshims.dll
    - windowsperformancerecordercontrol.dll
    - diagtrack_win.dll
    - TPPCOIPW32.dll
    - tpgenlic.dll
    - thinmon.dll
    - fxsst.dll
    - msTracer.dll
    dll_code_signature_subject_name|contains:
    - Microsoft Windows
    - Microsoft Corporation
    - Microsoft Windows Publisher
    file_name|contains:
    - wlbsctrl.dll
    - wbemcomn.dll
    - WptsExtensions.dll
    - Tsmsisrv.dll
    - TSVIPSrv.dll
    - Msfte.dll
    - wow64log.dll
    - WindowsCoreDeviceInfo.dll
    - Ualapi.dll
    - wlanhlp.dll
    - phoneinfo.dll
    - EdgeGdi.dll
    - cdpsgshims.dll
    - windowsperformancerecordercontrol.dll
    - diagtrack_win.dll
    - TPPCOIPW32.dll
    - tpgenlic.dll
    - thinmon.dll
    - fxsst.dll
    - msTracer.dll
    file_hash_sha256|contains:
    - 6e837794fc282446906c36d681958f2f6212043fc117c716936920be166a700f
    - b14e4954e8cca060ffeb57f2458b6a3a39c7d2f27e94391cbcea5387652f21a4
    - c258d90acd006fa109dc6b748008edbb196d6168bc75ace0de0de54a4db46662
    dll_path|contains:
    - ?:\\Windows\\System32\\wbemcomn.dll
    - ?:\\Windows\\SysWOW64\\wbemcomn.dll
    - ?:\\Windows\\System32\\windowsperformancerecordercontrol.dll
    - ?:\\Windows\\System32\\wlanhlp.dll
    - \\Device\\HarddiskVolume?\\Windows\\SysWOW64\\wbemcomn.dll
    - \\Device\\HarddiskVolume?\\Windows\\System32\\wbemcomn.dll
    - \\Device\\HarddiskVolume?\\Windows\\SysWOW64\\wlanhlp.dll
    - \\Device\\HarddiskVolume?\\Windows\\System32\\wlanhlp.dll
    - \\Device\\HarddiskVolume?\\Windows\\SysWOW64\\windowsperformancerecordercontrol.dll
    - \\Device\\HarddiskVolume?\\Windows\\System32\\windowsperformancerecordercontrol.dll
    - C:\\ProgramData\\docker\\windowsfilter\\*\\Files\\Windows\\System32\\windowsperformancerecordercontrol.dll
    - C:\\ProgramData\\docker\\windowsfilter\\*\\Files\\Windows\\System32\\windowsperformancerecordercontrol.dll
    - \\Device\\vmsmb\\VSMB-{*}\\os\\windows\\system32\\*.dll
    file_path|contains:
    - ?:\\Windows\\System32\\wbemcomn.dll
    - ?:\\Windows\\SysWOW64\\wbemcomn.dll
    - ?:\\Windows\\System32\\windowsperformancerecordercontrol.dll
    - ?:\\Windows\\System32\\wlanhlp.dll
    - C:\\ProgramData\\docker\\windowsfilter\\*\\Files\\Windows\\System32\\windowsperformancerecordercontrol.dll
    - C:\\ProgramData\\docker\\windowsfilter\\*\\Files\\Windows\\System32\\wbemcomn.dll
    - \\Device\\vmsmb\\VSMB-{*}\\os\\windows\\system32\\*.dll
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.t1036.001
- attack.t1574
- attack.t1574.001
- attack.t1036
references:
- https://itm4n.github.io/windows-dll-hijacking-clarified/
- http://remoteawesomethoughts.blogspot.com/2019/05/windows-10-task-schedulerservice.html
- https://googleprojectzero.blogspot.com/2018/04/windows-exploitation-tricks-exploiting.html
- https://shellz.club/2020/10/16/edgegdi-dll-for-persistence-and-lateral-movement.html
- https://windows-internals.com/faxing-your-way-to-system/
- http://waleedassar.blogspot.com/2013/01/wow64logdll.html
