title: Suspicious Memory grep Activity
id: d74d6506-427a-4790-b170-0c2a6ddac799
status: stable
level: low
description: 'Monitors for grep activity related to memory mapping. The /proc/*/maps
  file in Linux provides a memory map for a

  specific process, detailing the memory segments, permissions, and what files are
  mapped to these segments. Attackers may

  read a process''s memory map to identify memory addresses for code injection or
  process hijacking.'
author: Elastic (converted by SIEMLess)
date: '2024-02-05'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
  condition: selection
tags:
- attack.discovery
- attack.t1057
references:
- https://github.com/arget13/DDexec
