title: Suspicious ScreenConnect Client Child Process
id: 78de1aeb-5225-4067-b8cc-f4a1de8a8546
status: stable
level: medium
description: 'Identifies suspicious processes being spawned by the ScreenConnect client
  processes. This activity may indicate

  execution abusing unauthorized access to the ScreenConnect remote access software.'
author: Elastic (converted by SIEMLess)
date: '2024-03-27'
modified: '2025-05-05'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_parent_name|contains:
    - ScreenConnect.ClientService.exe
    - ScreenConnect.WindowsClient.exe
    - ScreenConnect.WindowsBackstageShell.exe
    - ScreenConnect.WindowsFileManager.exe
    process_args|contains:
    - /q
    - /quiet
    - /qn
    - -q
    - -quiet
    - -qn
    - -Q+
    process_name|contains:
    - mshta.exe
    - certutil.exe
    - bistadmin.exe
    - certreq.exe
    - wscript.exe
    - cscript.exe
    - curl.exe
    - ssh.exe
    - scp.exe
    - wevtutil.exe
    - wget.exe
    - wmic.exe
  condition: selection
tags:
- attack.command_and_control
- attack.t1219
references:
- https://www.huntress.com/blog/slashandgrab-screen-connect-post-exploitation-in-the-wild-cve-2024-1709-cve-2024-1708
