title: Suspicious Access to LDAP Attributes
id: 68ad737b-f90a-4fe5-bda6-a68fa460044e
status: stable
level: low
description: 'Identify read access to a high number of Active Directory object attributes.
  The knowledge of objects properties can

  help adversaries find vulnerabilities, elevate privileges or collect sensitive information.'
author: Elastic (converted by SIEMLess)
date: '2023-01-29'
modified: '2025-11-14'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_code: '4662'
    winlog_event_data_AccessMaskDescription: Read Property
  condition: selection
tags:
- attack.discovery
- attack.t1069
