title: Suspicious APT Package Manager Execution
id: ad959eeb-2b7b-4722-ba08-a45f6622f005
status: stable
level: medium
description: 'Detects suspicious process events executed by the APT package manager,
  potentially indicating persistence through an APT

  backdoor. In Linux, APT (Advanced Package Tool) is a command-line utility used for
  handling packages on Debian-based

  systems, providing functions for installing, updating, upgrading, and removing software
  along with managing package

  repositories. Attackers can backdoor APT to gain persistence by injecting malicious
  code into scripts that APT runs,

  thereby ensuring continued unauthorized access or control each time APT is used
  for package management.'
author: Elastic (converted by SIEMLess)
date: '2024-02-01'
modified: '2025-10-17'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by host.id with maxspan=5s\n  [process where host.os.type\
      \ == \"linux\" and event.type == \"start\" and event.action in (\"exec\", \"\
      start\", \"ProcessRollup2\") and\n   process.parent.name == \"apt\" and process.args\
      \ == \"-c\" and process.name in (\n     \"bash\", \"dash\", \"sh\", \"tcsh\"\
      , \"csh\", \"zsh\", \"ksh\", \"fish\"\n   ) and not process.executable == \"\
      /usr/lib/venv-salt-minion/bin/python.original\"\n  ] by process.entity_id\n\
      \  [process where host.os.type == \"linux\" and event.type == \"start\" and\
      \ event.action in (\"exec\", \"start\", \"ProcessRollup2\") and process.name\
      \ : (\n     \"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\"\
      , \"fish\", \"python*\", \"php*\",\n     \"perl\", \"ruby\", \"lua*\", \"openssl\"\
      , \"nc\", \"netcat\", \"ncat\", \"telnet\", \"awk\"\n   )\n  ] by process.parent.entity_id"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.defense_evasion
- attack.persistence
- attack.execution
- attack.t1574
- attack.t1546
- attack.t1059
- attack.t1546.016
- attack.t1059.004
- attack.t1543
references:
- https://www.elastic.co/security-labs/sequel-on-persistence-mechanisms
