title: Suspicious Explorer Child Process
id: 9a5b4e31-6cde-4295-9ff7-6be1b8567e1b
status: stable
level: medium
description: 'Identifies a suspicious Windows explorer child process. Explorer.exe
  can be abused to launch malicious scripts or

  executables from a trusted parent process.'
author: Elastic (converted by SIEMLess)
date: '2020-10-29'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - cscript.exe
    - wscript.exe
    - powershell.exe
    - rundll32.exe
    - cmd.exe
    - mshta.exe
    - regsvr32.exe
    process_parent_args|contains:
    - /factory,{5BD95610-9434-43C2-886C-57852CC8A120}
    - /factory,{ceff45ee-c862-41de-aee2-a022c81eda92}
  condition: selection
tags:
- attack.defense_evasion
- attack.initial_access
- attack.execution
- attack.t1059.003
- attack.t1566
- attack.t1059
- attack.t1059.005
- attack.t1566.001
- attack.t1218
- attack.t1059.001
- attack.t1566.002
