title: Suspicious .NET Reflection via PowerShell
id: e26f042e-c590-4e82-8e05-41e81bd822ad
status: stable
level: medium
description: 'Detects the use of Reflection.Assembly to load PEs and DLLs in memory
  in PowerShell scripts. Attackers use this method

  to load executables and DLLs without writing to the disk, bypassing security solutions.'
author: Elastic (converted by SIEMLess)
date: '2021-10-15'
modified: '2025-07-02'
logsource:
  product: windows
  category: file_event
detection:
  selection:
    event_category: process
    host_os_type: windows
    powershell_file_script_block_text: ("reflection.assembly]::Load('System.
    file_name: PathFunctions.ps1
    user_id: S-1-5-18
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.t1055.002
- attack.t1055.001
- attack.t1059
- attack.t1620
- attack.t1059.001
- attack.t1055
references:
- https://docs.microsoft.com/en-us/dotnet/api/system.reflection.assembly.load
