title: Suspicious Execution from a Mounted Device
id: 8a1d4831-3ce6-4859-9891-28931fa6101d
status: stable
level: medium
description: 'Identifies when a script interpreter or signed binary is launched via
  a non-standard working directory. An attacker may

  use this technique to evade defenses.'
author: Elastic (converted by SIEMLess)
date: '2021-05-28'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - rundll32.exe
    - mshta.exe
    - powershell.exe
    - pwsh.exe
    - cmd.exe
    - regsvr32.exe
    - cscript.exe
    - wscript.exe
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.t1059.003
- attack.t1059
- attack.t1218.010
- attack.t1218.005
- attack.t1218.011
- attack.t1218
- attack.t1059.001
references:
- https://www.microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/
- https://www.volexity.com/blog/2021/05/27/suspected-apt29-operation-launches-election-fraud-themed-phishing-campaigns/
