title: Suspicious Zoom Child Process
id: 97aba1ef-6034-4bd3-8c1a-1e0996b27afa
status: stable
level: medium
description: 'A suspicious Zoom child process was detected, which may indicate an
  attempt to run unnoticed. Verify process details

  such as command line, network connections, file writes and associated file signature
  details as well.'
author: Elastic (converted by SIEMLess)
date: '2020-09-03'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - cmd.exe
    - powershell.exe
    - pwsh.exe
    - powershell_ise.exe
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.t1203
- attack.t1055
- attack.t1036
