title: Suspicious Mining Process Creation Event
id: e2258f48-ba75-4248-951b-7c885edf18c2
status: stable
level: medium
description: 'Identifies service creation events of common mining services, possibly
  indicating the infection of a system with a

  cryptominer.'
author: Elastic (converted by SIEMLess)
date: '2023-02-08'
modified: '2025-03-20'
logsource:
  product: linux
  category: file_event
detection:
  selection:
    host_os_type: linux
    event_type: creation
    event_action|contains:
    - creation
    - file_create_event
    file_name|contains:
    - aliyun.service
    - moneroocean_miner.service
    - c3pool_miner.service
    - pnsd.service
    - apache4.service
    - pastebin.service
    - xvf.service
  condition: selection
tags:
- attack.execution
- attack.t1059
- attack.t1059.004
