title: Suspicious LSASS Access via MalSecLogon
id: 7ba58110-ae13-439b-8192-357b0fcfa9d7
status: stable
level: high
description: 'Identifies suspicious access to LSASS handle from a call trace pointing
  to seclogon.dll and with a suspicious access

  rights value. This may indicate an attempt to leak an LSASS handle via abusing the
  Secondary Logon service in

  preparation for credential access.'
author: Elastic (converted by SIEMLess)
date: '2022-06-29'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_code: '10'
    winlog_event_data_GrantedAccess: '0x14c0'
    winlog_event_data_CallTrace|endswith: seclogon.dll*
  condition: selection
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.001
references:
- https://splintercod3.blogspot.com/p/the-hidden-side-of-seclogon-part-3.html
