title: Suspicious MS Outlook Child Process
id: 32f4675e-6c49-4ace-80f9-97c9259dca2e
status: stable
level: low
description: 'Identifies suspicious child processes of Microsoft Outlook. These child
  processes are often associated with spear

  phishing activity.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - Microsoft.Workflow.Compiler.exe
    - arp.exe
    - atbroker.exe
    - bginfo.exe
    - bitsadmin.exe
    - cdb.exe
    - certutil.exe
    - cmd.exe
    - cmstp.exe
    - cscript.exe
    - csi.exe
    - dnx.exe
    - dsget.exe
    - dsquery.exe
    - forfiles.exe
    - fsi.exe
    - ftp.exe
    - gpresult.exe
    - hostname.exe
    - ieexec.exe
    - iexpress.exe
    - installutil.exe
    - ipconfig.exe
    - mshta.exe
    - msxsl.exe
    - nbtstat.exe
    - net.exe
    - net1.exe
    - netsh.exe
    - netstat.exe
    - nltest.exe
    - odbcconf.exe
    - ping.exe
    - powershell.exe
    - pwsh.exe
    - qprocess.exe
    - quser.exe
    - qwinsta.exe
    - rcsi.exe
    - reg.exe
    - regasm.exe
    - regsvcs.exe
    - regsvr32.exe
    - sc.exe
    - schtasks.exe
    - systeminfo.exe
    - tasklist.exe
    - tracert.exe
    - whoami.exe
    - wmic.exe
    - wscript.exe
    - xwizard.exe
  condition: selection
tags:
- attack.defense_evasion
- attack.initial_access
- attack.execution
- attack.t1059.003
- attack.t1566
- attack.t1059
- attack.t1566.001
- attack.t1218
- attack.t1059.001
