title: Suspicious Browser Child Process
id: 080bc66a-5d56-4d1f-8071-817671716db9
status: stable
level: high
description: 'Identifies the execution of a suspicious browser child process. Adversaries
  may gain access to a system through a user

  visiting a website over the normal course of browsing. With this technique, the
  user''s web browser is typically targeted

  for exploitation.'
author: Elastic (converted by SIEMLess)
date: '2020-12-23'
modified: '2025-03-18'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
    process_command_line|contains:
    - '*curl*'
    - '*nscurl*'
    - '*wget*'
    - '*whoami*'
    - '*pwd*'
  condition: selection
tags:
- attack.initial_access
- attack.execution
- attack.t1189
- attack.t1203
references:
- https://objective-see.com/blog/blog_0x43.html
- https://fr.slideshare.net/codeblue_jp/cb19-recent-apt-attack-on-crypto-exchange-employees-by-heungsoo-kang
