title: Suspicious Module Loaded by LSASS
id: 3a6001a0-0939-4bbe-86f4-47d8faeb7b97
status: stable
level: medium
description: 'Identifies LSASS loading an unsigned or untrusted DLL. Windows Security
  Support Provider (SSP) DLLs are loaded into

  LSSAS process at system start. Once loaded into the LSA, SSP DLLs have access to
  encrypted and plaintext passwords that

  are stored in Windows, such as any logged-on user''s Domain password or smart card
  PINs.'
author: Elastic (converted by SIEMLess)
date: '2022-12-28'
modified: '2025-01-15'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    dll_code_signature_subject_name|contains:
    - Microsoft Windows
    - Microsoft Corporation
    - Microsoft Windows Publisher
    - Microsoft Windows Software Compatibility Publisher
    - Microsoft Windows Hardware Compatibility Publisher
    - McAfee, Inc.
    - SecMaker AB
    - HID Global Corporation
    - HID Global
    - Apple Inc.
    - Citrix Systems, Inc.
    - Dell Inc
    - Hewlett-Packard Company
    - Symantec Corporation
    - National Instruments Corporation
    - DigitalPersona, Inc.
    - Novell, Inc.
    - gemalto
    - EasyAntiCheat Oy
    - Entrust Datacard Corporation
    - AuriStor, Inc.
    - LogMeIn, Inc.
    - VMware, Inc.
    - Istituto Poligrafico e Zecca dello Stato S.p.A.
    - Nubeva Technologies Ltd
    dll_code_signature_status|contains:
    - trusted
    - errorExpired
    - errorCode_endpoint*
    - errorChaining
    dll_hash_sha256|contains:
    - 811a03a5d7c03802676d2613d741be690b3461022ea925eb6b2651a5be740a4c
    - 1181542d9cfd63fb00c76242567446513e6773ea37db6211545629ba2ecf26a1
    - ed6e735aa6233ed262f50f67585949712f1622751035db256811b4088c214ce3
    - 26be2e4383728eebe191c0ab19706188f0e9592add2e0bf86b37442083ae5e12
    - 9367e78b84ef30cf38ab27776605f2645e52e3f6e93369c674972b668a444faa
    - d46cc934765c5ecd53867070f540e8d6f7701e834831c51c2b0552aba871921b
    - 0f77a3826d7a5cd0533990be0269d951a88a5c277bc47cff94553330b715ec61
    - 4aca034d3d85a9e9127b5d7a10882c2ef4c3e0daa3329ae2ac1d0797398695fb
    - 86031e69914d9d33c34c2f4ac4ae523cef855254d411f88ac26684265c981d95
  condition: selection
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.001
references:
- https://blog.xpnsec.com/exploring-mimikatz-part-2/
- https://github.com/jas502n/mimikat_ssp
