title: Suspicious Activity Reported by Okta User
id: f994964f-6fce-4d75-8e79-e16ccc412588
status: stable
level: medium
description: 'Detects when a user reports suspicious activity for their Okta account.
  These events should be investigated, as they can

  help security teams identify when an adversary is attempting to gain access to their
  network.'
author: Elastic (converted by SIEMLess)
date: '2020-05-21'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: okta.system
    event_action: user.account.report_suspicious_activity_by_enduser
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.initial_access
- attack.privilege_escalation
- attack.t1078
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
- https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy
- https://www.elastic.co/security-labs/monitoring-okta-threats-with-elastic-security
- https://www.elastic.co/security-labs/starter-guide-to-understanding-okta
falsepositives:
- A user may report suspicious activity on their Okta account in error.
