title: Suspicious Execution from INET Cache
id: dca6b4b0-ae70-44eb-bb7a-ce6db502ee78
status: stable
level: high
description: 'Identifies the execution of a process with arguments pointing to the
  INetCache Folder. Adversaries may deliver malicious

  content via WININET during initial access.'
author: Elastic (converted by SIEMLess)
date: '2024-02-14'
modified: '2025-09-11'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_parent_name|contains:
    - explorer.exe
    - winrar.exe
    - 7zFM.exe
    - Bandizip.exe
    process_executable|contains: ?:\\Program Files\\*.exe
    process_args|endswith: \\AppData\\Local\\Microsoft\\Windows\\INetCache\\IE\\*
  condition: selection
tags:
- attack.initial_access
- attack.command_and_control
- attack.t1566
- attack.t1566.001
- attack.t1105
references:
- https://www.trendmicro.com/en_us/research/24/b/cve202421412-water-hydra-targets-traders-with-windows-defender-s.html
