title: Suspicious Renaming of ESXI Files
id: 97db8b42-69d8-4bf3-9fd4-c69a1d895d68
status: stable
level: medium
description: 'Identifies instances where VMware-related files, such as those with
  extensions like ".vmdk", ".vmx", ".vmxf", ".vmsd",

  ".vmsn", ".vswp", ".vmss", ".nvram", and ".vmem", are renamed on a Linux system.
  The rule monitors for the "rename"

  event action associated with these file types, which could indicate malicious activity.'
author: Elastic (converted by SIEMLess)
date: '2023-04-11'
modified: '2025-05-05'
logsource:
  product: linux
  category: file_event
detection:
  selection:
    host_os_type: linux
    event_action: rename
    file_Ext_original_name|contains:
    - '*.vmdk'
    - '*.vmx'
    - '*.vmxf'
    - '*.vmsd'
    - '*.vmsn'
    - '*.vswp'
    - '*.vmss'
    - '*.nvram'
    - '*.vmem'
    file_name|contains:
    - '*.vmdk'
    - '*.vmx'
    - '*.vmxf'
    - '*.vmsd'
    - '*.vmsn'
    - '*.vswp'
    - '*.vmss'
    - '*.nvram'
    - '*.vmem'
  condition: selection
tags:
- attack.defense_evasion
- attack.t1036.003
- attack.t1036
references:
- https://www.bleepingcomputer.com/news/security/massive-esxiargs-ransomware-attack-targets-vmware-esxi-servers-worldwide/
