title: Suspicious Network Connection via systemd
id: f3818c85-2207-4b51-8a28-d70fb156ee87
status: stable
level: medium
description: 'Detects suspicious network events executed by systemd, potentially indicating
  persistence through a systemd backdoor.

  Systemd is a system and service manager for Linux operating systems, used to initialize
  and manage system processes.

  Attackers can backdoor systemd for persistence by creating or modifying systemd
  unit files to execute malicious scripts

  or commands, or by replacing legitimate systemd binaries with compromised ones,
  ensuring that their malicious code is

  automatically executed at system startup or during certain system events.'
author: Elastic (converted by SIEMLess)
date: '2024-02-01'
modified: '2025-02-04'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by host.id with maxspan=5s\n  [process where host.os.type\
      \ == \"linux\" and event.type == \"start\" and event.action == \"exec\" and\n\
      \   process.parent.name == \"systemd\" and process.name in (\n     \"python*\"\
      , \"php*\", \"perl\", \"ruby\", \"lua*\", \"openssl\", \"nc\", \"netcat\", \"\
      ncat\", \"telnet\", \"awk\"\n   )\n  ] by process.entity_id\n  [network where\
      \ host.os.type == \"linux\" and event.action == \"connection_attempted\" and\
      \ event.type == \"start\" and\n   not process.executable == \"/tmp/newroot/bin/curl\"\
      ] by process.parent.entity_id"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.defense_evasion
- attack.persistence
- attack.command_and_control
- attack.t1543.002
- attack.t1574
- attack.t1543
