title: Suspicious /proc/maps Discovery
id: 2f95540c-923e-4f57-9dae-de30169c68b9
status: stable
level: low
description: 'Monitors for /proc/*/maps file reads. The /proc/*/maps file in Linux
  provides a memory map for a specific process,

  detailing the memory segments, permissions, and what files are mapped to these segments.
  Attackers may read a process''s

  memory map to identify memory addresses for code injection or process hijacking.'
author: Elastic (converted by SIEMLess)
date: '2024-01-29'
modified: '2025-04-25'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
  condition: selection
tags:
- attack.discovery
- attack.t1057
references:
- https://github.com/arget13/DDexec
