title: Suspicious CertUtil Commands
id: fd70c98a-c410-42dc-a2e3-761c71848acf
status: stable
level: medium
description: 'Identifies suspicious commands being used with certutil.exe. CertUtil
  is a native Windows component which is part of

  Certificate Services. CertUtil is often abused by attackers to live off the land
  for stealthier command and control or

  data exfiltration.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_pe_original_file_name: CertUtil.exe
    process_args|contains:
    - ?decode
    - ?encode
    - ?urlcache
    - ?verifyctl
    - ?encodehex
    - ?decodehex
    - ?exportPFX
  condition: selection
tags:
- attack.defense_evasion
- attack.t1140
references:
- https://twitter.com/Moriarty_Meng/status/984380793383370752
- https://twitter.com/egre55/status/1087685529016193025
- https://www.sysadmins.lv/blog-en/certutil-tips-and-tricks-working-with-x509-file-format.aspx
- https://docs.microsoft.com/en-us/archive/blogs/pki/basic-crl-checking-with-certutil
- https://www.elastic.co/security-labs/siestagraph-new-implant-uncovered-in-asean-member-foreign-ministry
