title: Suspicious Process Execution via Renamed PsExec Executable
id: e2f9fdf5-8076-45ad-9427-41e0e03dc9c2
status: stable
level: medium
description: 'Identifies suspicious psexec activity which is executing from the psexec
  service that has been renamed, possibly to

  evade detection.'
author: Elastic (converted by SIEMLess)
date: '2020-08-14'
modified: '2025-08-26'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.t1569.002
- attack.t1569
- attack.t1036.003
- attack.t1036
