title: Suspicious Startup Shell Folder Modification
id: c8b150f0-0164-475b-a75e-74b47800a9ff
status: stable
level: high
description: 'Identifies suspicious startup shell folder modifications to change the
  default Startup directory in order to bypass

  detections monitoring file creation in the Windows Startup folder.'
author: Elastic (converted by SIEMLess)
date: '2021-03-15'
modified: '2025-09-11'
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    host_os_type: windows
    event_type: change
    registry_value|contains:
    - Common Startup
    - Startup
    registry_path|contains:
    - HKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\\Common
      Startup
    - HKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\\Common
      Startup
    - HKEY_USERS\\*\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User
      Shell Folders\\Startup
    - HKEY_USERS\\*\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell
      Folders\\Startup
    - HKU\\*\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\\Startup
    - HKU\\*\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\\Startup
    - HKCU\\*\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell
      Folders\\Startup
    - HKCU\\*\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\\Startup
    - \\REGISTRY\\MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User
      Shell Folders\\Common Startup
    - \\REGISTRY\\MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell
      Folders\\Common Startup
    - \\REGISTRY\\USER\\*\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User
      Shell Folders\\Startup
    - \\REGISTRY\\USER\\*\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell
      Folders\\Startup
    - MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell
      Folders\\Common Startup
    - MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\\Common
      Startup
    - USER\\*\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell
      Folders\\Startup
    - USER\\*\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\\Startup
    registry_data_strings|contains:
    - C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\Startup
    - '%ProgramData%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup'
    - '%USERPROFILE%\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup'
    - '%%USERPROFILE%%\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup'
    - C:\\Users\\*\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup
    - \\\\*
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1547.001
- attack.t1547
- attack.t1112
references:
- https://www.elastic.co/security-labs/elastic-security-uncovers-blister-malware-campaign
- https://www.elastic.co/security-labs/revisiting-blister-new-developments-of-the-blister-loader
