title: Suspicious Execution from Foomatic-rip or Cupsd Parent
id: 986361cd-3dac-47fe-afa1-5c5dd89f2fb4
status: stable
level: high
description: 'This detection rule addresses multiple vulnerabilities in the CUPS printing
  system, including CVE-2024-47176,

  CVE-2024-47076, CVE-2024-47175, and CVE-2024-47177. Specifically, this rule detects
  suspicious process command lines

  executed by child processes of foomatic-rip and cupsd. These flaws impact components
  like cups-browsed, libcupsfilters,

  libppd, and foomatic-rip, allowing remote unauthenticated attackers to manipulate
  IPP URLs or inject malicious data

  through crafted UDP packets or network spoofing. This can result in arbitrary command
  execution when a print job is

  initiated.'
author: Elastic (converted by SIEMLess)
date: '2024-09-27'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
  condition: selection
tags:
- attack.execution
- attack.t1203
references:
- https://www.elastic.co/security-labs/cups-overflow
- https://www.evilsocket.net/2024/09/26/Attacking-UNIX-systems-via-CUPS-Part-I/
- https://gist.github.com/stong/c8847ef27910ae344a7b5408d9840ee1
- https://github.com/RickdeJager/cupshax/blob/main/cupshax.py
