title: Symbolic Link to Shadow Copy Created
id: d117cbb4-7d56-41b4-b999-bdf8c25648a0
status: stable
level: medium
description: 'Identifies the creation of symbolic links to a shadow copy. Symbolic
  links can be used to access files in the shadow

  copy, including sensitive files such as ntds.dit, System Boot Key and browser offline
  credentials.'
author: Elastic (converted by SIEMLess)
date: '2021-12-25'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - cmd.exe
    - powershell.exe
    process_args|contains:
    - '*mklink*'
    - '*SymbolicLink*'
    process_command_line|contains: '*HarddiskVolumeShadowCopy*'
  condition: selection
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.003
- attack.t1003.002
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/mklink
- https://2017.zeronights.org/wp-content/uploads/materials/ZN17_Kheirkhabarov_Hunting_for_Credentials_Dumping_in_Windows_Environment.pdf
- https://blog.netwrix.com/2021/11/30/extracting-password-hashes-from-the-ntds-dit-file/
- https://www.hackingarticles.in/credential-dumping-ntds-dit/
falsepositives:
- Legitimate administrative activity related to shadow copies.
