title: System Binary Path File Permission Modification
id: 0049cf71-fe13-4d79-b767-f7519921ffb5
status: stable
level: low
description: 'This rule identifies file permission modification events on files located
  in common system binary paths. Adversaries may attempt to

  hide their payloads in the default Linux system directories, and modify the file
  permissions of these payloads prior to execution.'
author: Elastic (converted by SIEMLess)
date: '2025-01-07'
modified: '2025-02-04'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    event_action: exec
    process_parent_command_line: runc init
  condition: selection
tags:
- attack.execution
- attack.t1059
references:
- https://blog.exatrack.com/Perfctl-using-portainer-and-new-persistences/
