title: Systemd Timer Created
id: 7fb500fa-8e24-4bd1-9480-2a819352602c
status: stable
level: low
description: 'Detects the creation of a systemd timer within any of the default systemd
  timer directories. Systemd timers can be used

  by an attacker to gain persistence, by scheduling the execution of a command or
  script. Similarly to cron/at, systemd

  timers can be set up to execute on boot time, or on a specific point in time, which
  allows attackers to regain access in

  case the connection to the infected asset was lost.'
author: Elastic (converted by SIEMLess)
date: '2023-02-24'
modified: '2025-02-03'
logsource:
  product: linux
  category: file_event
detection:
  selection:
    host_os_type: linux
    file_extension: timer
    file_Ext_original_extension: dpkg-new
    process_name: perl
    file_path|contains:
    - /etc/systemd/system/*
    - /etc/systemd/user/*
    - /usr/local/lib/systemd/system/*
    - /lib/systemd/system/*
    - /usr/lib/systemd/system/*
    - /usr/lib/systemd/user/*
    - /home/*/.config/systemd/user/*
    - /home/*/.local/share/systemd/user/*
    - /root/.config/systemd/user/*
    - /root/.local/share/systemd/user/*
    process_executable|contains:
    - /nix/store/*
    - /var/lib/dpkg/*
    - /tmp/vmis.*
    - /snap/*
    - /dev/fd/*
    - /usr/lib/virtualbox/*
  condition: selection
tags:
- attack.persistence
- attack.t1053
- attack.t1053.006
references:
- https://opensource.com/article/20/7/systemd-timers
- https://pberba.github.io/security/2022/01/30/linux-threat-hunting-for-persistence-systemd-timers-cron/
- https://www.elastic.co/security-labs/primer-on-persistence-mechanisms
