title: System Public IP Discovery via DNS Query
id: 642ce354-4252-4d43-80c9-6603f16571c1
status: stable
level: high
description: Identifies DNS queries to known public IP address lookup web services.
  Malwares tend to perform this action to assess potential targets.
author: Elastic (converted by SIEMLess)
date: '2025-08-20'
modified: '2025-09-11'
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    host_os_type: windows
    process_name|contains:
    - MSBuild.exe
    - mshta.exe
    - wscript.exe
    - powershell.exe
    - pwsh.exe
    - msiexec.exe
    - rundll32.exe
    - bitsadmin.exe
    - InstallUtil.exe
    - RegAsm.exe
    - vbc.exe
    - RegSvcs.exe
    - python.exe
    - regsvr32.exe
    - dllhost.exe
    - node.exe
    - javaw.exe
    - java.exe
    - '*.pif'
    - '*.com'
    process_code_signature_subject_name|contains:
    - AutoIt Consulting Ltd
    - OpenJS Foundation
    - Python Software Foundation
    process_executable|contains:
    - ?:\\Users\\*.exe
    - ?:\\ProgramData\\*.exe
    dns_question_name|contains:
    - ip-api.com
    - checkip.dyndns.org
    - api.ipify.org
    - api.ipify.com
    - whatismyip.akamai.com
    - bot.whatismyipaddress.com
    - ifcfg.me
    - ident.me
    - ipof.in
    - ip.tyk.nu
    - icanhazip.com
    - curlmyip.com
    - wgetip.com
    - eth0.me
    - ipecho.net
    - ip.appspot.com
    - api.myip.com
    - geoiptool.com
    - api.2ip.ua
    - api.ip.sb
    - ipinfo.io
    - checkip.amazonaws.com
    - wtfismyip.com
    - iplogger.*
    - freegeoip.net
    - freegeoip.app
    - ipinfo.io
    - geoplugin.net
    - myip.dnsomatic.com
    - www.geoplugin.net
    - api64.ipify.org
    - ip4.seeip.org
    - '*.geojs.io'
    - '*portmap.io'
    - api.2ip.ua
    - api.db-ip.com
    - geolocation-db.com
    - httpbin.org
    - myip.opendns.com
  condition: selection
tags:
- attack.discovery
- attack.command_and_control
- attack.t1071.004
- attack.t1071
- attack.t1016
references:
- https://attack.mitre.org/techniques/T1016/
