title: System Shells via Services
id: 0022d47d-39c7-4f69-a232-4fe9dc7a3acd
status: stable
level: medium
description: 'Windows services typically run as SYSTEM and can be used as a privilege
  escalation opportunity. Malware or penetration

  testers may run a shell as a service to gain SYSTEM permissions.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - cmd.exe
    - powershell.exe
    - pwsh.exe
    - powershell_ise.exe
  condition: selection
tags:
- attack.persistence
- attack.execution
- attack.t1059.003
- attack.t1059
- attack.t1543.003
- attack.t1059.001
- attack.t1543
