title: SystemKey Access via Command Line
id: d75991f2-b989-419d-b797-ac1e54ec2d61
status: stable
level: high
description: 'Keychains are the built-in way for macOS to keep track of users'' passwords
  and credentials for many services and

  features, including Wi-Fi and website passwords, secure notes, certificates, and
  Kerberos. Adversaries may collect the

  keychain storage data from a system to acquire credentials.'
author: Elastic (converted by SIEMLess)
date: '2020-01-07'
modified: '2025-03-18'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
  condition: selection
tags:
- attack.credential_access
- attack.t1555.001
- attack.t1555
references:
- https://github.com/AlessandroZ/LaZagne/blob/master/Mac/lazagne/softwares/system/chainbreaker.py
