title: System V Init Script Created
id: 474fd20e-14cc-49c5-8160-d9ab4ba16c8b
status: stable
level: low
description: 'Files that are placed in the /etc/init.d/ directory in Unix can be used
  to start custom applications, services, scripts

  or commands during start-up. Init.d has been mostly replaced in favor of Systemd.
  However, the "systemd-sysv-generator"

  can convert init.d files to service unit files that run at boot. Adversaries may
  add or alter files located in the

  /etc/init.d/ directory to execute malicious code upon boot in order to gain persistence
  on the system.'
author: Elastic (converted by SIEMLess)
date: '2023-03-21'
modified: '2025-03-20'
logsource:
  product: linux
  category: file_event
detection:
  selection:
    host_os_type: linux
    process_name: perl
  condition: selection
tags:
- attack.persistence
- attack.t1037
references:
- https://www.intezer.com/blog/malware-analysis/hiddenwasp-malware-targeting-linux-systems/
- https://pberba.github.io/security/2022/02/06/linux-threat-hunting-for-persistence-initialization-scripts-and-shell-configuration/#8-boot-or-logon-initialization-scripts-rc-scripts
- https://www.cyberciti.biz/faq/how-to-enable-rc-local-shell-script-on-systemd-while-booting-linux-system/
- https://www.elastic.co/security-labs/sequel-on-persistence-mechanisms
