title: Tainted Kernel Module Load
id: 05cad2fb-200c-407f-b472-02ea8c9e5e4a
status: stable
level: low
description: 'This rule monitors the syslog log file for messages related to instances
  of a tainted kernel module load. Rootkits often

  leverage kernel modules as their main defense evasion technique. Detecting tainted
  kernel module loads is crucial for

  ensuring system security and integrity, as malicious or unauthorized modules can
  compromise the kernel and lead to

  system vulnerabilities or unauthorized access.'
author: Elastic (converted by SIEMLess)
date: '2023-10-23'
modified: '2025-01-15'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_dataset: system.syslog
    process_name: kernel
    message: module
    failed: signature
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1547
- attack.t1014
- attack.t1547.006
