title: Tampering of Shell Command-Line History
id: 7bcbb3ac-e533-41ad-a612-d6c3bf666aba
status: stable
level: medium
description: 'Adversaries may attempt to clear or disable the Bash command-line history
  in an attempt to evade detection or forensic

  investigations.'
author: Elastic (converted by SIEMLess)
date: '2020-05-04'
modified: '2025-01-15'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    event_type: start
    process_args|contains:
    - HISTFILE=/dev/null
    - HISTFILESIZE=0
  condition: selection
tags:
- attack.defense_evasion
- attack.t1070.003
- attack.t1070
references:
- https://www.elastic.co/security-labs/detecting-log4j2-with-elastic-security
