title: TCC Bypass via Mounted APFS Snapshot Access
id: b00bcd89-000c-4425-b94c-716ef67762f6
status: stable
level: high
description: 'Identifies the use of the mount_apfs command to mount the entire file
  system through Apple File System (APFS) snapshots

  as read-only and with the noowners flag set. This action enables the adversary to
  access almost any file in the file

  system, including all user data and files protected by Apple’s privacy framework
  (TCC).'
author: Elastic (converted by SIEMLess)
date: '2020-01-04'
modified: '2025-03-18'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
    process_name: mount_apfs
  condition: selection
tags:
- attack.defense_evasion
- attack.t1006
references:
- https://theevilbit.github.io/posts/cve_2020_9771/
