title: TeamFiltration User-Agents Detected
id: f541ca3a-5752-11f0-b44b-f661ea17fbcd
status: stable
level: medium
description: 'Identifies potential enumeration or password spraying activity using
  TeamFiltration tool. TeamFiltration is an

  open-source enumeration, password spraying and exfiltration tool designed for Entra
  ID and Microsoft 365. Adversaries

  are known to use TeamFiltration in-the-wild to enumerate users, groups, and roles,
  as well as to perform password

  spraying attacks against Microsoft Entra ID and Microsoft 365 accounts. This rule
  detects the use of TeamFiltration by

  monitoring for specific user-agent strings associated with the tool in Azure and
  Microsoft 365 logs.'
author: Elastic (converted by SIEMLess)
date: '2025-07-02'
modified: '2025-07-02'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    event_dataset: ("azure.signinlogs
    user_agent_name: Electron
    user_agent_os_name: Windows
    user_agent_version: 8.5.1")
    user_agent_original: Mozilla/5.0
  condition: selection
tags:
- attack.discovery
- attack.credential_access
- attack.t1069.003
- attack.t1580
- attack.t1069
- attack.t1110
- attack.t1082
- attack.t1201
- attack.t1087
- attack.t1087.004
- attack.t1110.003
- attack.t1526
- attack.t1673
references:
- https://www.proofpoint.com/us/blog/threat-insight/attackers-unleash-teamfiltration-account-takeover-campaign
- https://github.com/Flangvik/TeamFiltration
falsepositives:
- "    Legitimate administrative or security assessment activities may use these user-agents,\
  \ especially in environments\n    where TeamFiltration is employed for authorized\
  \ audits. If this is expected behavior, consider adjusting the rule or\n    adding\
  \ exceptions for specific user-agents or IP addresses.\n    "
- "    Expected red team assessments or penetration tests may utilize TeamFiltration\
  \ to evaluate the security posture of\n    Azure or Microsoft 365 environments.\
  \ If this is expected behavior, consider adjusting the rule or adding exceptions\n\
  \    for specific IP addresses, registered applications, JWT tokens, PRTs or user\n\
  \    "
