title: Threat Intel URL Indicator Match
id: f3e22c8b-ea47-45d1-b502-b57b6de950b3
status: stable
level: high
description: 'This rule is triggered when a URL indicator from the Threat Intel Filebeat
  module or integrations has a match against an

  event that contains URL data, like DNS events, network logs, etc.'
author: Elastic (converted by SIEMLess)
date: '2023-05-22'
modified: '2025-04-22'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    url_full: '*'
  condition: selection
references:
- https://www.elastic.co/guide/en/beats/filebeat/current/filebeat-module-threatintel.html
- https://www.elastic.co/guide/en/security/current/es-threat-intel-integrations.html
- https://www.elastic.co/security/tip
