title: Threat Intel IP Address Indicator Match
id: 0c41e478-5263-4c69-8f9e-7dfd2c22da64
status: stable
level: high
description: 'This rule is triggered when an IP address indicator from the Threat
  Intel Filebeat module or integrations has a match

  against a network event.'
author: Elastic (converted by SIEMLess)
date: '2023-05-22'
modified: '2025-04-22'
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    source_ip: '*'
    destination_ip: '*'
  condition: selection
references:
- https://www.elastic.co/guide/en/beats/filebeat/current/filebeat-module-threatintel.html
- https://www.elastic.co/guide/en/security/current/es-threat-intel-integrations.html
- https://www.elastic.co/security/tip
