title: Threat Intel Windows Registry Indicator Match
id: a61809f3-fb5b-465c-8bff-23a8a068ac60
status: stable
level: high
description: 'This rule is triggered when a Windows registry indicator from the Threat
  Intel Filebeat module or integrations has a

  match against an event that contains registry data.'
author: Elastic (converted by SIEMLess)
date: '2023-05-22'
modified: '2025-04-22'
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*'
  condition: selection
references:
- https://www.elastic.co/guide/en/beats/filebeat/current/filebeat-module-threatintel.html
- https://www.elastic.co/guide/en/security/current/es-threat-intel-integrations.html
- https://www.elastic.co/security/tip
