title: UAC Bypass Attempt via Privileged IFileOperation COM Interface
id: 5a14d01d-7ac8-4545-914c-b687c2cf66b3
status: stable
level: high
description: 'Identifies attempts to bypass User Account Control (UAC) via DLL side-loading.
  Attackers may attempt to bypass UAC to

  stealthily execute code with elevated permissions.'
author: Elastic (converted by SIEMLess)
date: '2020-10-27'
modified: '2025-09-01'
logsource:
  product: windows
  category: file_event
detection:
  selection:
    host_os_type: windows
    file_name|contains:
    - wow64log.dll
    - comctl32.dll
    - DismCore.dll
    - OskSupport.dll
    - duser.dll
    - Accessibility.ni.dll
    file_path|contains:
    - C:\\Windows\\SoftwareDistribution\\*
    - C:\\Windows\\WinSxS\\*
  condition: selection
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1574
- attack.t1574.001
- attack.t1548.002
- attack.t1548
references:
- https://github.com/hfiref0x/UACME
- https://www.elastic.co/security-labs/exploring-windows-uac-bypasses-techniques-and-detection-strategies
