title: UAC Bypass Attempt with IEditionUpgradeManager Elevated COM Interface
id: b90cdde7-7e0d-4359-8bf0-2c112ce2008a
status: stable
level: high
description: 'Identifies attempts to bypass User Account Control (UAC) by abusing
  an elevated COM Interface to launch a rogue Windows

  ClipUp program. Attackers may attempt to bypass UAC to stealthily execute code with
  elevated permissions.'
author: Elastic (converted by SIEMLess)
date: '2020-10-28'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.privilege_escalation
- attack.t1559
- attack.t1548.002
- attack.t1559.001
- attack.t1548
references:
- https://github.com/hfiref0x/UACME
