title: UAC Bypass via DiskCleanup Scheduled Task Hijack
id: 1dcc51f6-ba26-49e7-9ef4-2655abb2361e
status: stable
level: medium
description: 'Identifies User Account Control (UAC) bypass via hijacking DiskCleanup
  Scheduled Task. Attackers bypass UAC to

  stealthily execute code with elevated permissions.'
author: Elastic (converted by SIEMLess)
date: '2020-08-18'
modified: '2025-08-28'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_executable|contains:
    - C:\\Windows\\System32\\cleanmgr.exe
    - C:\\Windows\\SysWOW64\\cleanmgr.exe
    - C:\\Windows\\System32\\taskhostw.exe
    - \\Device\\HarddiskVolume*\\Windows\\System32\\cleanmgr.exe
    - \\Device\\HarddiskVolume*\\Windows\\SysWOW64\\cleanmgr.exe
    - \\Device\\HarddiskVolume*\\Windows\\System32\\taskhostw.exe
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.privilege_escalation
- attack.t1053.005
- attack.t1053
- attack.t1548.002
- attack.t1548
