title: UAC Bypass via Windows Firewall Snap-In Hijack
id: 1178ae09-5aff-460a-9f2f-455cd0ac4d8e
status: stable
level: medium
description: 'Identifies attempts to bypass User Account Control (UAC) by hijacking
  the Microsoft Management Console (MMC) Windows

  Firewall snap-in. Attackers bypass UAC to stealthily execute code with elevated
  permissions.'
author: Elastic (converted by SIEMLess)
date: '2020-10-14'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_parent_name: mmc.exe
    process_Ext_token_integrity_level_name: high
    process_parent_args: WF.msc
  condition: selection
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1218.014
- attack.t1218
- attack.t1548.002
- attack.t1548
references:
- https://github.com/AzAgarampur/byeintegrity-uac
