title: Unexpected Child Process of macOS Screensaver Engine
id: 48d7f54d-c29e-4430-93a9-9db6b5892270
status: stable
level: medium
description: 'Identifies when a child process is spawned by the screensaver engine
  process, which is consistent with an attacker''s

  malicious payload being executed after the screensaver activated on the endpoint.
  An adversary can maintain persistence

  on a macOS endpoint by creating a malicious screensaver (.saver) file and configuring
  the screensaver plist file to

  execute code each time the screensaver is activated.'
author: Elastic (converted by SIEMLess)
date: '2021-10-05'
modified: '2025-02-04'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
    event_type: start
    process_parent_name: ScreenSaverEngine
  condition: selection
tags:
- attack.persistence
- attack.t1546.002
- attack.t1546
references:
- https://posts.specterops.io/saving-your-access-d562bf5bf90b
- https://github.com/D00MFist/PersistentJXA
