title: Unsigned DLL Side-Loading from a Suspicious Folder
id: ca98c7cf-a56e-4057-a4e8-39603f7f0389
status: stable
level: medium
description: 'Identifies a Windows trusted program running from locations often abused
  by adversaries to masquerade as a trusted

  program and loading a recently dropped DLL. This behavior may indicate an attempt
  to evade defenses via side-loading a

  malicious DLL within the memory space of a signed processes.'
author: Elastic (converted by SIEMLess)
date: '2022-11-22'
modified: '2025-09-01'
logsource:
  product: windows
  category: image_load
detection:
  selection:
    host_os_type: windows
    dll_code_signature_status|contains:
    - trusted
    - errorExpired
    - errorCode_endpoint*
    - errorChaining
    dll_path|contains:
    - ?:\\PerfLogs\\*.dll
    - ?:\\Users\\*\\Pictures\\*.dll
    - ?:\\Users\\*\\Music\\*.dll
    - ?:\\Users\\Public\\*.dll
    - ?:\\Users\\*\\Documents\\*.dll
    - ?:\\Windows\\Tasks\\*.dll
    - ?:\\Windows\\System32\\Tasks\\*.dll
    - ?:\\Intel\\*.dll
    - ?:\\AMD\\Temp\\*.dll
    - ?:\\Windows\\AppReadiness\\*.dll
    - ?:\\Windows\\ServiceState\\*.dll
    - ?:\\Windows\\security\\*.dll
    - ?:\\Windows\\System\\*.dll
    - ?:\\Windows\\IdentityCRL\\*.dll
    - ?:\\Windows\\Branding\\*.dll
    - ?:\\Windows\\csc\\*.dll
    - ?:\\Windows\\DigitalLocker\\*.dll
    - ?:\\Windows\\en-US\\*.dll
    - ?:\\Windows\\wlansvc\\*.dll
    - ?:\\Windows\\Prefetch\\*.dll
    - ?:\\Windows\\Fonts\\*.dll
    - ?:\\Windows\\diagnostics\\*.dll
    - ?:\\Windows\\TAPI\\*.dll
    - ?:\\Windows\\INF\\*.dll
    - ?:\\windows\\tracing\\*.dll
    - ?:\\windows\\IME\\*.dll
    - ?:\\Windows\\Performance\\*.dll
    - ?:\\windows\\intel\\*.dll
    - ?:\\windows\\ms\\*.dll
    - ?:\\Windows\\dot3svc\\*.dll
    - ?:\\Windows\\ServiceProfiles\\*.dll
    - ?:\\Windows\\panther\\*.dll
    - ?:\\Windows\\RemotePackages\\*.dll
    - ?:\\Windows\\OCR\\*.dll
    - ?:\\Windows\\appcompat\\*.dll
    - ?:\\Windows\\apppatch\\*.dll
    - ?:\\Windows\\addins\\*.dll
    - ?:\\Windows\\Setup\\*.dll
    - ?:\\Windows\\Help\\*.dll
    - ?:\\Windows\\SKB\\*.dll
    - ?:\\Windows\\Vss\\*.dll
    - ?:\\Windows\\Web\\*.dll
    - ?:\\Windows\\servicing\\*.dll
    - ?:\\Windows\\CbsTemp\\*.dll
    - ?:\\Windows\\Logs\\*.dll
    - ?:\\Windows\\WaaS\\*.dll
    - ?:\\Windows\\twain_32\\*.dll
    - ?:\\Windows\\ShellExperiences\\*.dll
    - ?:\\Windows\\ShellComponents\\*.dll
    - ?:\\Windows\\PLA\\*.dll
    - ?:\\Windows\\Migration\\*.dll
    - ?:\\Windows\\debug\\*.dll
    - ?:\\Windows\\Cursors\\*.dll
    - ?:\\Windows\\Containers\\*.dll
    - ?:\\Windows\\Boot\\*.dll
    - ?:\\Windows\\bcastdvr\\*.dll
    - ?:\\Windows\\TextInput\\*.dll
    - ?:\\Windows\\schemas\\*.dll
    - ?:\\Windows\\SchCache\\*.dll
    - ?:\\Windows\\Resources\\*.dll
    - ?:\\Windows\\rescache\\*.dll
    - ?:\\Windows\\Provisioning\\*.dll
    - ?:\\Windows\\PrintDialog\\*.dll
    - ?:\\Windows\\PolicyDefinitions\\*.dll
    - ?:\\Windows\\media\\*.dll
    - ?:\\Windows\\Globalization\\*.dll
    - ?:\\Windows\\L2Schemas\\*.dll
    - ?:\\Windows\\LiveKernelReports\\*.dll
    - ?:\\Windows\\ModemLogs\\*.dll
    - ?:\\Windows\\ImmersiveControlPanel\\*.dll
    - ?:\\$Recycle.Bin\\*.dll
  condition: selection
tags:
- attack.defense_evasion
- attack.t1036.001
- attack.t1574
- attack.t1574.001
- attack.t1036
references:
- https://www.elastic.co/security-labs/Hunting-for-Suspicious-Windows-Libraries-for-Execution-and-Evasion
