title: Unusual Network Connection via DllHost
id: c7894234-7814-44c2-92a9-f7d851ea246a
status: stable
level: medium
description: 'Identifies unusual instances of dllhost.exe making outbound network
  connections. This may indicate adversarial Command

  and Control activity.'
author: Elastic (converted by SIEMLess)
date: '2021-05-28'
modified: '2025-08-28'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _original_eql: "sequence by host.id, process.entity_id with maxspan=1m\n  [process\
      \ where host.os.type == \"windows\" and event.type == \"start\" and process.name\
      \ : \"dllhost.exe\" and process.args_count == 1]\n  [network where host.os.type\
      \ == \"windows\" and process.name : \"dllhost.exe\" and\n   not cidrmatch(destination.ip,\
      \ \"10.0.0.0/8\", \"127.0.0.0/8\", \"169.254.0.0/16\", \"172.16.0.0/12\", \"\
      192.0.0.0/24\",\n    \"192.0.0.0/29\", \"192.0.0.8/32\", \"192.0.0.9/32\", \"\
      192.0.0.10/32\", \"192.0.0.170/32\", \"192.0.0.171/32\", \"192.0.2.0/24\",\n\
      \    \"192.31.196.0/24\", \"192.52.193.0/24\", \"192.168.0.0/16\", \"192.88.99.0/24\"\
      , \"224.0.0.0/4\", \"100.64.0.0/10\",\n    \"192.175.48.0/24\", \"198.18.0.0/15\"\
      , \"198.51.100.0/24\", \"203.0.113.0/24\", \"240.0.0.0/4\", \"::1\", \"FE80::/10\"\
      ,\n    \"FF00::/8\")]"
  condition: selection
  _conversion_note: Complex EQL with sequence - requires manual review
tags:
- attack.defense_evasion
- attack.t1218
references:
- https://www.microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/
- https://www.volexity.com/blog/2021/05/27/suspected-apt29-operation-launches-election-fraud-themed-phishing-campaigns/
- https://www.iana.org/assignments/iana-ipv4-special-registry/iana-ipv4-special-registry.xhtml
