title: Unusual Executable File Creation by a System Critical Process
id: e94262f2-c1e9-4d3f-a907-aeab16712e1a
status: stable
level: high
description: 'Identifies an unexpected executable file being created or modified by
  a Windows system critical process, which may

  indicate activity related to remote code execution or other forms of exploitation.'
author: Elastic (converted by SIEMLess)
date: '2020-08-19'
modified: '2025-08-26'
logsource:
  product: windows
  category: file_event
detection:
  selection:
    host_os_type: windows
    file_extension|contains:
    - exe
    - dll
    process_name|contains:
    - smss.exe
    - autochk.exe
    - csrss.exe
    - wininit.exe
    - services.exe
    - lsass.exe
    - winlogon.exe
    - userinit.exe
    - LogonUI.exe
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.t1203
- attack.t1211
