title: Unusual Child Process of dns.exe
id: 8c37dc0e-e3ac-4c97-8aa0-cf6a9122de45
status: stable
level: high
description: 'Identifies an unexpected process spawning from dns.exe, the process
  responsible for Windows DNS server services, which

  may indicate activity related to remote code execution or other forms of exploitation.'
author: Elastic (converted by SIEMLess)
date: '2020-07-16'
modified: '2025-09-11'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_executable|contains:
    - ?:\\Windows\\System32\\conhost.exe
    - \\Device\\HarddiskVolume*\\Windows\\System32\\conhost.exe
    - \\Device\\HarddiskVolume*\\Program Files\\ReasonLabs\\*
  condition: selection
tags:
- attack.lateral_movement
- attack.t1210
references:
- https://research.checkpoint.com/2020/resolving-your-way-into-domain-admin-exploiting-a-17-year-old-bug-in-windows-dns-servers/
- https://msrc-blog.microsoft.com/2020/07/14/july-2020-security-update-cve-2020-1350-vulnerability-in-windows-domain-name-system-dns-server/
- https://github.com/maxpl0it/CVE-2020-1350-DoS
- https://www.elastic.co/security-labs/detection-rules-for-sigred-vulnerability
falsepositives:
- "    Werfault.exe will legitimately spawn when dns.exe crashes, but the DNS service\
  \ is very stable and so this is a low\n    occurring event. Denial of Service (DoS)\
  \ attempts by intentionally crashing the service will also cause werfault.exe\n\
  \    to spawn.\n    "
