title: Unusual Execution via Microsoft Common Console File
id: e760c72b-bb1f-44f0-9f0d-37d51744ee75
status: stable
level: high
description: 'Identifies the execution of a child process from a Microsoft Common
  Console file. Adversaries may embed a malicious

  command in an MSC file in order to trick victims into executing malicious commands.'
author: Elastic (converted by SIEMLess)
date: '2024-05-12'
modified: '2025-09-11'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_parent_args|contains:
    - ?:\\Windows\\System32\\*.msc
    - ?:\\Windows\\SysWOW64\\*.msc
    - ?:\\Program files\\*.msc
    process_executable|contains:
    - ?:\\Windows\\System32\\vmconnect.exe
    - ?:\\Windows\\System32\\WerFault.exe
    - ?:\\Windows\\System32\\wermgr.exe
  condition: selection
tags:
- attack.initial_access
- attack.execution
- attack.t1566
- attack.t1204
- attack.t1566.001
- attack.t1204.002
- attack.t1566.002
references:
- https://www.genians.co.kr/blog/threat_intelligence/facebook
