title: Unusual Process Execution Path - Alternate Data Stream
id: 4bd1c1af-79d4-4d37-9efa-6e0240640242
status: stable
level: medium
description: 'Identifies processes running from an Alternate Data Stream. This is
  uncommon for legitimate processes and sometimes done

  by adversaries to hide malware.'
author: Elastic (converted by SIEMLess)
date: '2020-12-04'
modified: '2025-08-12'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
  condition: selection
tags:
- attack.defense_evasion
- attack.t1564.004
- attack.t1564
