title: Unusual File Creation - Alternate Data Stream
id: 71bccb61-e19b-452f-b104-79a60e546a95
status: stable
level: low
description: 'Identifies suspicious creation of Alternate Data Streams on highly targeted
  files. This is uncommon for legitimate files

  and sometimes done by adversaries to hide malware.'
author: Elastic (converted by SIEMLess)
date: '2021-01-21'
modified: '2025-07-02'
logsource:
  product: windows
  category: file_event
detection:
  selection:
    host_os_type: windows
    event_type: creation
    file_path|contains:
    - C:\\*:zone.identifier*
    - C:\\users\\*\\appdata\\roaming\\microsoft\\teams\\old_weblogs_*:$DATA
    - C:\\Windows\\CSC\\*:CscBitmapStream
    file_name|endswith: :sec.endpointdlp:$DATA
  condition: selection
tags:
- attack.defense_evasion
- attack.t1564.004
- attack.t1564
