title: Unusual Print Spooler Child Process
id: ee5300a7-7e31-4a72-a258-250abb8b3aa1
status: stable
level: medium
description: 'Detects unusual Print Spooler service (spoolsv.exe) child processes.
  This may indicate an attempt to exploit privilege

  escalation vulnerabilities related to the Printing Service on Windows.'
author: Elastic (converted by SIEMLess)
date: '2021-07-06'
modified: '2025-08-28'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - cmd.exe
    - powershell.exe
    process_command_line|contains:
    - '*add portopening*'
    - '*rule name*'
    process_command_line|endswith: PrintConfig.dll*
  condition: selection
tags:
- attack.privilege_escalation
- attack.t1068
references:
- https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-34527
falsepositives:
- "    Install or update of a legitimate printing driver. Verify the printer driver\
  \ file metadata such as manufacturer and\n    signature information.\n    "
