title: User Account Creation
id: 1aa9181a-492b-4c01-8b16-fa0735786b2b
status: stable
level: low
description: 'Identifies attempts to create new users. This is sometimes done by attackers
  to increase access or establish persistence

  on a system or domain.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - net.exe
    - net1.exe
    process_args|contains:
    - /ad
    - /add
  condition: selection
tags:
- attack.persistence
- attack.t1136.001
- attack.t1136
