title: Virtual Machine Fingerprinting via Grep
id: c85eb82c-d2c8-485c-a36f-534f914b7663
status: stable
level: medium
description: 'An adversary may attempt to get detailed information about the operating
  system and hardware. This rule identifies

  common locations used to discover virtual machine hardware by a non-root user. This
  technique has been used by the Pupy

  RAT and other malware.'
author: Elastic (converted by SIEMLess)
date: '2021-09-29'
modified: '2025-01-15'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    event_type: start
    process_args|contains:
    - parallels*
    - vmware*
    - virtualbox*
  condition: selection
tags:
- attack.discovery
- attack.t1082
references:
- https://objective-see.com/blog/blog_0x4F.html
falsepositives:
- "    Certain tools or automated software may enumerate hardware information. These\
  \ tools can be exempted via user name or\n    process arguments to eliminate potential\
  \ noise.\n    "
