title: Virtual Private Network Connection Attempt
id: 15dacaa0-5b90-466b-acab-63435a59701a
status: stable
level: low
description: 'Identifies the execution of macOS built-in commands to connect to an
  existing Virtual Private Network (VPN). Adversaries

  may use VPN connections to laterally move and control remote systems on a network.'
author: Elastic (converted by SIEMLess)
date: '2020-01-25'
modified: '2025-03-18'
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    host_os_type: macos
    process_name: osascript
  condition: selection
tags:
- attack.lateral_movement
- attack.t1021
references:
- https://github.com/rapid7/metasploit-framework/blob/master/modules/post/osx/manage/vpn.rb
- https://www.unix.com/man-page/osx/8/networksetup/
- https://superuser.com/questions/358513/start-configured-vpn-from-command-line-osx
