title: VNC (Virtual Network Computing) to the Internet
id: 3ad49c61-7adc-42c1-b788-732eda2f5abf
status: stable
level: medium
description: 'This rule detects network events that may indicate the use of VNC traffic
  to the Internet. VNC is commonly used by

  system administrators to remotely control a system for maintenance or to use shared
  resources. It should almost never be

  directly exposed to the Internet, as it is frequently targeted and exploited by
  threat actors as an initial access or

  backdoor vector.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-05-05'
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    event_dataset: network_traffic.flow
    event_category: (network
    network_transport: tcp
    source_ip: (
    destination_ip: (
    FE80: :/10
    FF00: :/8
  condition: selection
tags:
- attack.command_and_control
- attack.t1219
references:
- https://www.iana.org/assignments/iana-ipv4-special-registry/iana-ipv4-special-registry.xhtml
falsepositives:
- "    VNC connections may be made directly to Linux cloud server instances but such\
  \ connections are usually made only by\n    engineers. VNC is less common than SSH\
  \ or RDP but may be required by some work flows such as remote access and\n    support\
  \ for specialized software products or servers. Such work-flows are usually known\
  \ and not unexpected. Usage\n    that is unfamiliar to server or network owners\
  \ can be unexpected and suspicious.\n    "
