title: VNC (Virtual Network Computing) from the Internet
id: 5700cb81-df44-46aa-a5d7-337798f53eb8
status: stable
level: high
description: 'This rule detects network events that may indicate the use of VNC traffic
  from the Internet. VNC is commonly used by

  system administrators to remotely control a system for maintenance or to use shared
  resources. It should almost never be

  directly exposed to the Internet, as it is frequently targeted and exploited by
  threat actors as an initial access or

  backdoor vector.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-05-05'
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    event_dataset: network_traffic.flow
    event_category: (network
    network_transport: tcp
    source_ip: (
    FE80: :/10
    FF00: :/8
    destination_ip: (
  condition: selection
tags:
- attack.initial_access
- attack.command_and_control
- attack.t1219
- attack.t1190
references:
- https://www.iana.org/assignments/iana-ipv4-special-registry/iana-ipv4-special-registry.xhtml
falsepositives:
- "    VNC connections may be received directly to Linux cloud server instances but\
  \ such connections are usually made only\n    by engineers. VNC is less common than\
  \ SSH or RDP but may be required by some work-flows such as remote access and\n\
  \    support for specialized software products or servers. Such work-flows are usually\
  \ known and not unexpected. Usage\n    that is unfamiliar to server or network owners\
  \ can be unexpected and suspicious.\n    "
