title: Volume Shadow Copy Deletion via PowerShell
id: d99a037b-c8e2-47a5-97b9-170d076827c4
status: stable
level: high
description: 'Identifies the use of the Win32_ShadowCopy class and related cmdlets
  to achieve shadow copy deletion. This commonly

  occurs in tandem with ransomware or other destructive attacks.'
author: Elastic (converted by SIEMLess)
date: '2021-07-19'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - powershell.exe
    - pwsh.exe
    - powershell_ise.exe
    process_args|contains: '*Win32_ShadowCopy*'
  condition: selection
tags:
- attack.impact
- attack.execution
- attack.t1490
- attack.t1059.001
- attack.t1059
references:
- https://docs.microsoft.com/en-us/previous-versions/windows/desktop/vsswmi/win32-shadowcopy
- https://powershell.one/wmi/root/cimv2/win32_shadowcopy
- https://www.fortinet.com/blog/threat-research/stomping-shadow-copies-a-second-look-into-deletion-methods
