title: Web Server Spawned via Python
id: 99c2b626-de44-4322-b1f9-157ca408c17e
status: stable
level: low
description: 'This rule identifies when a web server is spawned via Python. Attackers
  may use Python to spawn a web server to

  exfiltrate/infiltrate data or to move laterally within a network.'
author: Elastic (converted by SIEMLess)
date: '2024-11-04'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
  condition: selection
tags:
- attack.lateral_movement
- attack.execution
- attack.t1059
- attack.t1059.006
- attack.t1570
