title: Werfault ReflectDebugger Persistence
id: 205b52c4-9c28-4af4-8979-935f3278d61a
status: stable
level: low
description: 'Identifies the registration of a Werfault Debugger. Attackers may abuse
  this mechanism to execute malicious payloads

  every time the utility is executed with the "-pr" parameter.'
author: Elastic (converted by SIEMLess)
date: '2023-08-29'
modified: '2025-08-26'
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    host_os_type: windows
    event_type: change
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1112
- attack.t1546
references:
- https://cocomelonc.github.io/malware/2022/11/02/malware-pers-18.html
