title: Windows Defender Exclusions Added via PowerShell
id: 2c17e5d7-08b9-43b2-b58a-0270d65ac85b
status: stable
level: medium
description: 'Identifies modifications to the Windows Defender configuration settings
  using PowerShell to add exclusions at the folder

  directory or process level.'
author: Elastic (converted by SIEMLess)
date: '2021-07-20'
modified: '2025-09-12'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - powershell.exe
    - pwsh.exe
    - powershell_ise.exe
    process_args|contains: '*-Exclusion*'
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.t1059
- attack.t1562
- attack.t1562.001
- attack.t1562.006
- attack.t1059.001
references:
- https://www.bitdefender.com/files/News/CaseStudies/study/400/Bitdefender-PR-Whitepaper-MosaicLoader-creat5540-en-EN.pdf
- https://www.elastic.co/security-labs/elastic-security-uncovers-blister-malware-campaign
- https://www.elastic.co/security-labs/operation-bleeding-bear
- https://www.elastic.co/security-labs/invisible-miners-unveiling-ghostengine
