title: Windows Script Executing PowerShell
id: f545ff26-3c94-4fd0-bd33-3c7f95a3a0fc
status: stable
level: low
description: 'Identifies a PowerShell process launched by either cscript.exe or wscript.exe.
  Observing Windows scripting processes

  executing a PowerShell script, may be indicative of malicious activity.'
author: Elastic (converted by SIEMLess)
date: '2020-02-18'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_parent_name|contains:
    - cscript.exe
    - wscript.exe
  condition: selection
tags:
- attack.initial_access
- attack.execution
- attack.t1566
- attack.t1059.005
- attack.t1059
- attack.t1566.001
- attack.t1059.001
references:
- https://www.elastic.co/security-labs/operation-bleeding-bear
