title: Windows Firewall Disabled via PowerShell
id: f63c8e3c-d396-404f-b2ea-0379d3942d73
status: stable
level: medium
description: 'Identifies when the Windows Firewall is disabled using PowerShell cmdlets,
  which can help attackers evade network

  constraints, like internet and network lateral communication restrictions.'
author: Elastic (converted by SIEMLess)
date: '2021-10-15'
modified: '2025-09-12'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - powershell.exe
    - pwsh.exe
    - powershell_ise.exe
    process_args|contains:
    - '*-All*'
    - '*Public*'
    - '*Domain*'
    - '*Private*'
    process_args|endswith: False*
  condition: selection
tags:
- attack.defense_evasion
- attack.execution
- attack.t1059
- attack.t1562.004
- attack.t1562
- attack.t1059.001
references:
- https://docs.microsoft.com/en-us/powershell/module/netsecurity/set-netfirewallprofile?view=windowsserver2019-ps
- https://www.tutorialspoint.com/how-to-get-windows-firewall-profile-settings-using-powershell
- http://powershellhelp.space/commands/set-netfirewallrule-psv5.php
- http://woshub.com/manage-windows-firewall-powershell/
falsepositives:
- "    Windows Firewall can be disabled by a system administrator. Verify whether\
  \ the user identity, user agent, and/or\n    hostname should be making changes in\
  \ your environment. Windows Profile being disabled by unfamiliar users should be\n\
  \    investigated. If known behavior is causing false positives, it can be exempted\
  \ from the rule.\n    "
