title: Windows Script Execution from Archive
id: 30f9d940-7d55-4fff-a8b9-4715d20eb204
status: stable
level: medium
description: 'Identifies attempts to execute Jscript/Vbscript files from an archive
  file. The use of archives is a common delivery method

  of malicious scripts.'
author: Elastic (converted by SIEMLess)
date: '2025-08-20'
modified: '2025-08-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_parent_name|contains:
    - explorer.exe
    - winrar.exe
    - 7zFM.exe
    process_args|contains:
    - ?:\\Users\\*\\AppData\\Local\\Temp\\7z*\\*
    - ?:\\Users\\*\\AppData\\Local\\Temp\\*.zip.*\\*
    - ?:\\Users\\*\\AppData\\Local\\Temp\\Rar$*\\*
    - ?:\\Users\\*\\AppData\\Local\\Temp\\Temp?_*\\*
    - ?:\\Users\\*\\AppData\\Local\\Temp\\BNZ.*
  condition: selection
tags:
- attack.execution
- attack.t1059
- attack.t1059.005
- attack.t1059.007
references:
- https://medium.com/walmartglobaltech/smartapesg-4605157a5b80
