title: Windows Server Update Service Spawning Suspicious Processes
id: 1ac027c2-8c60-4715-af73-927b9c219e20
status: stable
level: high
description: 'Identifies suspicious processes being spawned by the Windows Server
  Update Service. This activity may indicate exploitation

  activity or access to an existing web shell backdoor.'
author: Elastic (converted by SIEMLess)
date: '2025-10-24'
modified: '2025-10-24'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_name|contains:
    - cmd.exe
    - powershell.exe
    - pwsh.exe
    - powershell_ise.exe
    - rundll32.exe
    - curl.exe
  condition: selection
tags:
- attack.initial_access
- attack.execution
- attack.t1059
- attack.t1059.001
- attack.t1190
- attack.t1059.003
references:
- https://msrc.microsoft.com/update-guide/vulnerability/CVE-2025-59287
- https://hawktrace.com/blog/CVE-2025-59287
