title: Wireless Credential Dumping using Netsh Command
id: 2de87d72-ee0c-43e2-b975-5f0b029ac600
status: stable
level: high
description: Identifies attempts to dump Wireless saved access keys in clear text
  using the Windows built-in utility Netsh.
author: Elastic (converted by SIEMLess)
date: '2022-11-01'
modified: '2025-03-20'
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    host_os_type: windows
    event_type: start
    process_pe_original_file_name: netsh.exe
  condition: selection
tags:
- attack.discovery
- attack.credential_access
- attack.t1003
- attack.t1082
- attack.t1555
references:
- https://learn.microsoft.com/en-us/windows-server/networking/technologies/netsh/netsh-contexts
- https://www.geeksforgeeks.org/how-to-find-the-wi-fi-password-using-cmd-in-windows/
