title: Yum Package Manager Plugin File Creation
id: 0b15bcad-aff1-4250-a5be-5d1b7eb56d07
status: stable
level: low
description: 'Detects file creation events in the plugin directories for the Yum package
  manager. In Linux, Yum (Yellowdog Updater,

  Modified) is a command-line utility used for handling packages on (by default) Fedora-based
  systems, providing functions

  for installing, updating, upgrading, and removing software along with managing package
  repositories. Attackers can

  backdoor Yum to gain persistence by injecting malicious code into plugins that Yum
  runs, thereby ensuring continued

  unauthorized access or control each time Yum is used for package management.'
author: Elastic (converted by SIEMLess)
date: '2024-06-25'
modified: '2025-01-24'
logsource:
  product: linux
  category: file_event
detection:
  selection:
    host_os_type: linux
    process_name: perl
    file_path|contains:
    - /usr/lib/yum-plugins/*
    - /etc/yum/pluginconf.d/*
    process_executable|contains:
    - /nix/store/*
    - /var/lib/dpkg/*
    - /tmp/vmis.*
    - /snap/*
    - /dev/fd/*
    - /usr/lib/*
    - /usr/libexec/*
    - /etc/kernel/*
  condition: selection
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1574
- attack.t1546.016
- attack.t1546
- attack.t1543
references:
- https://github.com/rapid7/metasploit-framework/blob/master/modules/exploits/linux/local/yum_package_manager_persistence.rb
- https://www.elastic.co/security-labs/sequel-on-persistence-mechanisms
