title: Yum/DNF Plugin Status Discovery
id: 78390eb5-c838-4c1d-8240-69dd7397cfb7
status: stable
level: low
description: 'This rule detects the execution of the `grep` command with the `plugins`
  argument on Linux systems. This command is used

  to search for YUM/DNF configurations and/or plugins with an enabled state. This
  behavior may indicate an attacker is

  attempting to establish persistence in a YUM or DNF plugin.'
author: Elastic (converted by SIEMLess)
date: '2024-06-25'
modified: '2025-03-20'
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    host_os_type: linux
    event_type: start
    process_name: grep
    process_args|contains:
    - /etc/yum.conf
    - /usr/lib/yum-plugins/*
    - /etc/yum/pluginconf.d/*
    - /usr/lib/python*/site-packages/dnf-plugins/*
    - /etc/dnf/plugins/*
    - /etc/dnf/dnf.conf
  condition: selection
tags:
- attack.discovery
- attack.t1082
references:
- https://github.com/rapid7/metasploit-framework/blob/master/modules/exploits/linux/local/yum_package_manager_persistence.rb
- https://pwnshift.github.io/2020/10/01/persistence.html
- https://www.elastic.co/security-labs/sequel-on-persistence-mechanisms
