title: abusing_managebdewsf
id: 3b2d74f0-b616-4da8-b770-9fa5d2ff8b29
status: experimental
level: medium
description: |
  Detects abusing of deprecated manage-bde.wsf. Tampering with manage-bde.wsf to run things in unattended ways.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Den Iuzvyk
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule abusing_managebdewsf {
 meta:
    author = "Den Iuzvyk"
    description = "Detects abusing of deprecated manage-bde.wsf. Tampering with manage-bde.wsf to run things in unattended ways.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/9WtUBfP8HJWR"
    version = "0.01"
    created = "2021-03-09"
    category = "process_creation"
    product = "windows"
    mitre = "execution, t1204, t1059"

  events:
(re.regex($selection.target.process.file.full_path, `.*\\cscript\.exe`) and re.regex($selection.target.process.command_line, `.*cscript manage-bde\.wsf.*`) and ($selection.metadata.product_event_type = "4688" or $selection.metadata.product_event_type = "1"))

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/9WtUBfP8HJWR
tags:


