title: abusing_settingcontentms_to_launch_arbitrary_shell_command_execution
id: 9ca0f576-a1aa-4c6e-b112-a348569190c2
status: experimental
level: medium
description: |
  None  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Sreeman
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule abusing_settingcontentms_to_launch_arbitrary_shell_command_execution {
 meta:
    author = "Sreeman"
    description = "None  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/C5xyVr16NfbZ"
    version = "0.01"
    created = "2020/03/13"
    product = "Windows"
    mitre = "t1204, t1193, execution, initial_access"

  events:
(re.regex($selection.target.process.command_line, `.*\.SettingContent-ms.*`) and not (re.regex($selection.target.file.full_path, `.*immersivecontrolpanel.*`)))

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/C5xyVr16NfbZ
tags:


