title: admin_user_rdp
id: 213f0095-2f66-43e5-a7f0-5534ce7662bd
status: experimental
level: medium
description: |
  It shows those who log in remotely with admin account.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Furkan Celik
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule admin_user_rdp {
 meta:
    author = "Furkan Celik"
    description = "It shows those who log in remotely with admin account.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/C9gFtXfGDIcd"
    version = "0.01"
    created = "2021-03-09"
    product = "windows"
    service = "security"

  events:
($selection.metadata.product_event_type = "4624" and $selection.extensions.auth.mechanism = "10" and $selection.principal.application = "Negotiate" and re.regex($selection.principal.user.user_display_name, `Admin-.*`))

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/C9gFtXfGDIcd
tags:


