title: apt29
id: 8844f788-975b-490b-9752-6801ba0d0a62
status: experimental
level: medium
description: |
  This method detects a suspicious powershell command line combination as used by APT29 in a campaign against US think tanks  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Florian Roth
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule apt29 {
 meta:
    author = "Florian Roth"
    description = "This method detects a suspicious powershell command line combination as used by APT29 in a campaign against US think tanks  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/EID3KC4B5JxZ"
    version = "0.01"
    created = "2018/12/04"
    product = "windows"
    service = "sysmon"

  events:
($selection.metadata.product_event_type = "1" and re.regex($selection.target.process.command_line, `.*-noni -ep bypass $.*`))

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/EID3KC4B5JxZ
tags:


