title: bits_http_client_useragent_usage
id: b0f5c103-5d71-44a9-9785-86af68a42036
status: experimental
level: medium
description: |
  This rule can be used to hunt for anomalous trafic initiated to external hosts in proxy logs  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Joseph Kamau
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule bits_http_client_useragent_usage {
 meta:
    author = "Joseph Kamau"
    description = "This rule can be used to hunt for anomalous trafic initiated to external hosts in proxy logs  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/Z15hUenKYohQ"
    version = "0.01"
    created = "2021-03-09"
    product = "proxy"
    mitre = "defense_evasion, t1197"

  events:
re.regex($selection.principal.application, `Microsoft BITS.*`)

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/Z15hUenKYohQ
tags:


