title: burp_suite_scanner_and_burp_collaborator_detected_via_proxy
id: b90f2b9a-2d33-484f-bbd0-b1564442f58c
status: experimental
level: medium
description: |
  Burp Suite Scanner Activirt Detected via Proxy  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Emir Erdogan
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule burp_suite_scanner_and_burp_collaborator_detected_via_proxy {
 meta:
    author = "Emir Erdogan"
    description = "Burp Suite Scanner Activirt Detected via Proxy  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/QhIyqc5Qdl6m"
    version = "0.01"
    created = "2021-03-09"
    category = "proxy"
    mitre = "T1190, T1210"

  events:
re.regex($selection.target.url, `.*burpcollaborator.*`)

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/QhIyqc5Qdl6m
tags:


