title: certutil_encode
id: db7a022b-b994-4ccd-9945-5fd2ef51f132
status: experimental
level: medium
description: |
  Detects suspicious a certutil command that used to encode files, which is sometimes used for data exfiltration  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Florian Roth
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule certutil_encode {
 meta:
    author = "Florian Roth"
    description = "Detects suspicious a certutil command that used to encode files, which is sometimes used for data exfiltration  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/3xvaWdoC0q2R"
    version = "0.01"
    created = "2019/02/24"
    category = "process_creation"
    product = "windows"

  events:
((re.regex($selection.target.process.command_line, `certutil -f -encode .*`) or re.regex($selection.target.process.command_line, `certutil\.exe -f -encode .*`) or re.regex($selection.target.process.command_line, `certutil -encode -f .*`) or re.regex($selection.target.process.command_line, `certutil\.exe -encode -f .*`)) and ($selection.metadata.product_event_type = "4688" or $selection.metadata.product_event_type = "1"))

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/3xvaWdoC0q2R
tags:


