title: cobaltstrike_malleable_onedrive_browsing_traffic_profile
id: 73fe9c3e-a995-45d0-984a-a97df875dda7
status: experimental
level: medium
description: |
  Detects Malleable OneDrive Profile  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Markus Neis
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule cobaltstrike_malleable_onedrive_browsing_traffic_profile {
 meta:
    author = "Markus Neis"
    description = "Detects Malleable OneDrive Profile  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/KN9myumUJzVW"
    version = "0.01"
    created = "2021-03-09"
    category = "proxy"
    mitre = "t1102"

  events:
(($selection.network.http.method = "GET" and re.regex($selection.target.url, `.*\?manifest=wac`) and $selection.principal.hostname = "onedrive.live.com") and not (re.regex($selection.target.url, `http.*://onedrive\.live\.com/.*`)))

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/KN9myumUJzVW
tags:


