title: cobalt_strike_dns_beaconing
id: 2743fe77-6440-4ec1-b62f-3c98775afe2e
status: experimental
level: medium
description: |
  Detects suspicious DNS queries known from Cobalt Strike beacons  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Florian Roth
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule cobalt_strike_dns_beaconing {
 meta:
    author = "Florian Roth"
    description = "Detects suspicious DNS queries known from Cobalt Strike beacons  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/2FdcmmsHHL0h"
    version = "0.01"
    created = "2018/05/10"
    category = "dns"

  events:
(re.regex($selection.target.url, `aaa\.stage\..*`) or re.regex($selection.target.url, `post\.1.*`))

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/2FdcmmsHHL0h
tags:


