title: crypto_miner_user_agent
id: 1910801c-6fb6-4f8b-9d12-7efc2f2021ba
status: experimental
level: medium
description: |
  Detects suspicious user agent strings used by crypto miners in proxy logs  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Florian Roth
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule crypto_miner_user_agent {
 meta:
    author = "Florian Roth"
    description = "Detects suspicious user agent strings used by crypto miners in proxy logs  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/ONlbvog75WoW"
    version = "0.01"
    created = "2019/10/21"
    category = "proxy"

  events:
(re.regex($selection.principal.application, `XMRig .*`) or re.regex($selection.principal.application, `ccminer.*`))

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/ONlbvog75WoW
tags:


