title: docker_user_agent
id: 6ece94bb-5bbc-4ad3-8421-36a86d6bc1e2
status: experimental
level: medium
description: |
  Detects docker user agent strings in proxy logs when a user runs the 'docker push' command.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Simon Lavigne
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule docker_user_agent {
 meta:
    author = "Simon Lavigne"
    description = "Detects docker user agent strings in proxy logs when a user runs the 'docker push' command.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/QUznqcdWU6GP"
    version = "0.01"
    created = "2021-03-09"
    category = "proxy"

  events:
(re.regex($selection.principal.application, `docker/.*`) and $selection.network.http.method = "PUT")

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/QUznqcdWU6GP
tags:


