title: empire_user_agents_proxy
id: 5b8056aa-8416-49d7-ac8d-9ee42aee7522
status: experimental
level: medium
description: |
  Empire User Agents Detection.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Alexandr Yampolskyi, SOC Prime
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule empire_user_agents_proxy {
 meta:
    author = "Alexandr Yampolskyi, SOC Prime"
    description = "Empire User Agents Detection.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/YuTlLtuvk1d7"
    version = "0.01"
    created = "2019/02/27"
    product = "proxy"
    mitre = "Command and Control, t1071"

  events:
($selection.principal.application = "Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0) like Gecko" or $selection.principal.application = "Mozilla/6.0 (X11; Linux x86_64; rv:24.0) Gecko/20140205     Firefox/27.0 Iceweasel/25.3.0" or $selection.principal.application = "Mozilla/5.0 (Windows NT 6.3; rv:36.0) Gecko/20100101 Firefox/36.0")

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/YuTlLtuvk1d7
tags:


