title: flash_player_update_from_suspicious_location
id: e0dd0d13-89ba-4221-9066-84e4fecb4192
status: experimental
level: medium
description: |
  Detects a flashplayer update from an unofficial location  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Florian Roth
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule flash_player_update_from_suspicious_location {
 meta:
    author = "Florian Roth"
    description = "Detects a flashplayer update from an unofficial location  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/HD39fwuyNdgn"
    version = "0.01"
    created = "2021-03-09"
    category = "proxy"

  events:
((re.regex($selection.target.url, `.*/install_flash_player\.exe`) or re.regex($selection.target.url, `.*/flash_install\.php.*`)) and not (re.regex($selection.target.url, `.*\.adobe\.com/.*`)))

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/HD39fwuyNdgn
tags:


