title: info_file_javascript_created
id: b04b530c-10ac-4ff8-972a-a26e2cffd631
status: experimental
level: medium
description: |
  JavaScript (.js, .jse) file creation
author: Google Cloud Security
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    /*
 * Copyright 2021 Google LLC
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     https://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

rule info_file_javascript_created
{
  meta:
    author = "Google Cloud Security"
    description = "JavaScript (.js, .jse) file creation"
    yara_version = "YL2.0"
    rule_version = "1.0"

  events:
    $e1.metadata.event_type = "FILE_CREATION"
    re.regex($e1.target.file.full_path, `\.jse?$`) nocase

  condition:
    $e1
}

  condition: _yaral_rule
references:
  - 
tags:


