title: info_certutil_urlcache
id: 1a3d4f32-0cb1-44b1-8f55-8e3a13173386
status: experimental
level: medium
description: |
  Certutil making an HTTP connection
author: Google Cloud Security
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    /*
 * Copyright 2021 Google LLC
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     https://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

rule info_certutil_urlcache
{
  meta:
    author = "Google Cloud Security"
    description = "Certutil making an HTTP connection"
    yara_version = "YL2.0"
    rule_version = "1.0"

  events:
    $e1.metadata.event_type = "PROCESS_LAUNCH"
    re.regex($e1.principal.process.command_line, `\bcertutil(\.exe)?\b.+\burlcache\b`) nocase

  condition:
    $e1
}

  condition: _yaral_rule
references:
  - 
tags:


