title: info_dns_lookup_exact
id: d67ca62a-5ea9-4c20-8773-e92f5b04d591
status: experimental
level: medium
description: |
  DNS lookups of a full, exact address (e.g. accounts.google.com)
author: Google Cloud Security
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    /*
 * Copyright 2021 Google LLC
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     https://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

rule info_dns_lookup_exact
{
  meta:
    author = "Google Cloud Security"
    description = "DNS lookups of a full, exact address (e.g. accounts.google.com)"
    yara_version = "YL2.0"
    rule_version = "1.0"

  events:
    $e1.metadata.event_type = "NETWORK_DNS"
    $e1.network.dns.questions.name = `accounts\.google\.com`

  condition:
    $e1
}

  condition: _yaral_rule
references:
  - 
tags:


