title: lsass_access_detected_via_attack_surface_reduction
id: 58429746-8341-48c6-801b-97b3aeb2bdf1
status: experimental
level: medium
description: |
  Detects Access to LSASS Process  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Markus Neis
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule lsass_access_detected_via_attack_surface_reduction {
 meta:
    author = "Markus Neis"
    description = "Detects Access to LSASS Process  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/jgYfMr0VH05h"
    version = "0.01"
    created = "2018/08/26"
    product = "windows_defender"
    mitre = "credential_access, t1003"

  events:
($selection.metadata.product_event_type = "1121" and re.regex($selection.target.file.full_path, `.*\\lsass\.exe`))

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/jgYfMr0VH05h
tags:


