title: mitre_attack_T1564_001_windows_hidden_files
id: 58da8b2f-0bf7-4084-9f02-3057a805ddd6
status: experimental
level: medium
description: |
  Manually setting a file to be hidden on Windows
author: Google Cloud Security
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    /*
 * Copyright 2021 Google LLC
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     https://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

rule mitre_attack_T1564_001_windows_hidden_files
{
  meta:
    author = "Google Cloud Security"
    description = "Manually setting a file to be hidden on Windows"
    reference = "https://attack.mitre.org/techniques/T1564/001/"
    yara_version = "YL2.0"
    rule_version = "1.0"

  events:
    $e1.metadata.event_type = "PROCESS_LAUNCH"
    re.regex($e1.principal.process.command_line, `attrib\.exe \+h`) nocase

  condition:
    $e1
}

  condition: _yaral_rule
references:
  - https://attack.mitre.org/techniques/T1564/001/
tags:


