title: office_applications_suspicious_process_activity
id: 57374f84-3d17-4098-ada5-248c11238af1
status: experimental
level: medium
description: |
  Detects office applications suspicious process activity  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Osman Demir
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule office_applications_suspicious_process_activity {
 meta:
    author = "Osman Demir"
    description = "Detects office applications suspicious process activity  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/a6DA73rJ25vj"
    version = "0.01"
    created = "2021-03-09"
    product = "windows"
    service = "sysmon"

  events:
($selection.metadata.product_event_type = "1" and ($selection.principal.process.file.full_path = "excel.exe" or $selection.principal.process.file.full_path = "msaccess.exe" or $selection.principal.process.file.full_path = "outlook.exe" or $selection.principal.process.file.full_path = "powerpnt.exe" or $selection.principal.process.file.full_path = "winword.exe") and ($selection.target.process.file.full_path = "powershell.exe" or $selection.target.process.file.full_path = "cmd.exe"))

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/a6DA73rJ25vj
tags:


