title: password_dumper_remote_thread_in_lsass
id: eb384cac-b49a-42e6-a1fa-5551ed76fcc8
status: experimental
level: medium
description: |
  Detects password dumper activity by monitoring remote thread creation EventID 8 in combination with the lsass.exe process as TargetImage. The process in field Process is the malicious program. A single execution can lead to hundrets of events.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Thomas Patzke
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule password_dumper_remote_thread_in_lsass {
 meta:
    author = "Thomas Patzke"
    description = "Detects password dumper activity by monitoring remote thread creation EventID 8 in combination with the lsass.exe process as TargetImage. The process in field Process is the malicious program. A single execution can lead to hundrets of events.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/cn5thgxPP8Yn"
    version = "0.01"
    created = "2021-03-09"
    product = "windows"
    service = "sysmon"

  events:
($selection.metadata.product_event_type = "8" and $selection.target.process.file.full_path = "C:\\Windows\\System32\\lsass.exe" and $selection.principal.application = "")

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/cn5thgxPP8Yn
tags:


