title: pax_dism_wim_mount_via_cmdline
id: ad2b6335-f9b3-41df-9d1e-c4230c10b04b
status: experimental
level: medium
description: |
  Identifies dism processes consistent with the arguments used by the tool PXE and Loot (PAX).  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: SOC Prime Team, Fireeye
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule pax_dism_wim_mount_via_cmdline {
 meta:
    author = "SOC Prime Team, Fireeye"
    description = "Identifies dism processes consistent with the arguments used by the tool PXE and Loot (PAX).  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/6jghgqKDHRlA"
    version = "0.01"
    created = "2021-03-09"
    category = "process_creation"
    product = "windows"
    mitre = "credential_access, t1552, t1552.001"

  events:
(re.regex($selection.target.process.command_line, `.*WimFile.*`) and re.regex($selection.target.process.command_line, `.*MountDir.*`) and re.regex($selection.target.process.command_line, `.*LogPath.*`) and re.regex($selection.target.process.command_line, `.*index.*`) and ($selection.metadata.product_event_type = "4688" or $selection.metadata.product_event_type = "1"))

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/6jghgqKDHRlA
tags:


