title: rdp_login_from_localhost
id: d1d524a0-0379-4de3-9f5b-462d418e21e0
status: experimental
level: medium
description: |
  RDP login with localhost source address may be a tunnelled login  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Thomas Patzke
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule rdp_login_from_localhost {
 meta:
    author = "Thomas Patzke"
    description = "RDP login with localhost source address may be a tunnelled login  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/0fYJxulh13jk"
    version = "0.01"
    created = "2021-03-09"
    product = "windows"
    service = "security"
    mitre = "Lateral Movement, t1076, Command And Control, t1071, t1043"

  events:
($selection.metadata.product_event_type = "4624" and $selection.extensions.auth.mechanism = "10" and ($selection.principal.ip = "::1" or $selection.principal.ip = "127.0.0.1"))

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/0fYJxulh13jk
tags:


