title: ryuk_ransomware
id: 756fb65e-d4d5-4186-a2af-205dbaee682d
status: experimental
level: medium
description: |
  Detects Ryuk Ransomware command lines  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Vasiliy Burov
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule ryuk_ransomware {
 meta:
    author = "Vasiliy Burov"
    description = "Detects Ryuk Ransomware command lines  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/e5l7zmQQ6jzP"
    version = "0.01"
    created = "2019/08/06"
    category = "process_creation"
    product = "windows"

  events:
((re.regex($selection.target.process.command_line, `.*\\net\.exe stop \"samss\" .*`) or re.regex($selection.target.process.command_line, `.*\\net\.exe stop \"audioendpointbuilder\" .*`) or re.regex($selection.target.process.command_line, `.*\\net\.exe stop \"unistoresvc_\?\?\?\?\?\" .*`)) and ($selection.metadata.product_event_type = "4688" or $selection.metadata.product_event_type = "1"))

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/e5l7zmQQ6jzP
tags:


