title: schtask_creation_sysmon
id: 1c030746-b272-4525-a04f-d101e29e7f79
status: experimental
level: medium
description: |
  Detects usage of schtask usage.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Michael Haag, Alexandr Yampolskyi
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule schtask_creation_sysmon {
 meta:
    author = "Michael Haag, Alexandr Yampolskyi"
    description = "Detects usage of schtask usage.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/yN2oW0MnSZcJ"
    version = "0.01"
    created = "2021-03-09"
    product = "windows"
    service = "sysmon"
    mitre = "Execution, t1204"

  events:
($selection.metadata.product_event_type = "1" and $selection.target.process.file.full_path = "schtask.exe")

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/yN2oW0MnSZcJ
tags:


