title: schtask_from_user_profile_sysmon
id: 24e70820-1a34-42fc-95e1-e496ee73b797
status: experimental
level: medium
description: |
  Detects usage of Powershell Download commands.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Michael Haag, Alexandr Yampolskyi
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule schtask_from_user_profile_sysmon {
 meta:
    author = "Michael Haag, Alexandr Yampolskyi"
    description = "Detects usage of Powershell Download commands.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/0pCB5LfLM2ox"
    version = "0.01"
    created = "2021-03-09"
    product = "windows"
    service = "sysmon"
    mitre = "Execution, t1204, t1059"

  events:
($selection.metadata.product_event_type = "1" and (re.regex($selection.target.process.file.full_path, `.*schtask\.exe`) or re.regex($selection.target.process.file.full_path, `.*schtasks\.exe`)) and re.regex($selection.target.process.command_line, `.*\\appdata.*`))

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/0pCB5LfLM2ox
tags:


