title: security_eventlog_cleared
id: d2873949-b766-4f32-a938-c6483b8967e8
status: experimental
level: medium
description: |
  Some threat groups tend to delete the local 'Security' Eventlog using certain utitlities  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Florian Roth
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule security_eventlog_cleared {
 meta:
    author = "Florian Roth"
    description = "Some threat groups tend to delete the local 'Security' Eventlog using certain utitlities  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/NCP61uVfKSmw"
    version = "0.01"
    created = "2021-03-09"
    product = "windows"
    service = "security"
    mitre = "defense_evasion, t1070"

  events:
($selection.metadata.product_event_type = "517" or $selection.metadata.product_event_type = "1102" or $selection.metadata.product_event_type = "104")

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/NCP61uVfKSmw
tags:


