title: suspicious_command_net_user
id: 6a68f426-60f3-415d-a142-ea4a7921ac5e
status: experimental
level: medium
description: |
  Command-line execution of the Windows 'net user' command
author: Google Cloud Security
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    /*
 * Copyright 2021 Google LLC
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     https://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

rule suspicious_command_net_user
{
  meta:
    author = "Google Cloud Security"
    description = "Command-line execution of the Windows 'net user' command"
    yara_version = "YL2.0"
    rule_version = "1.0"

  events:
    re.regex($e1.principal.process.command_line, `\bnet(\.exe)?.+user\b`) nocase

  condition:
    $e1
}

  condition: _yaral_rule
references:
  - 
tags:


