title: suspicious_unusual_location_svchost_execution
id: ef408642-c272-4e47-a99c-d2e0c9f9047a
status: experimental
level: medium
description: |
  Windows 'svchost' executed from an unusual location
author: Google Cloud Security
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    /*
 * Copyright 2021 Google LLC
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     https://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

rule suspicious_unusual_location_svchost_execution
{
  meta:
    author = "Google Cloud Security"
    description = "Windows 'svchost' executed from an unusual location"
    yara_version = "YL2.0"
    rule_version = "1.0"

  events:
    $e1.metadata.event_type = "PROCESS_LAUNCH"
    re.regex($e1.principal.process.command_line, `\bsvchost(\.exe)?\b`) nocase
    not re.regex($e1.principal.process.command_line, `\\Windows\\System32\\`) nocase

  condition:
    $e1
}

  condition: _yaral_rule
references:
  - 
tags:


