title: suspicious_unusual_location_svchost_write
id: d67f2531-6dba-4c93-b7a0-ccaca28cf96e
status: experimental
level: medium
description: |
  Re/creating the Windows 'svchost' in an unusual location
author: Google Cloud Security
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    /*
 * Copyright 2021 Google LLC
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     https://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

rule suspicious_unusual_location_svchost_write
{
  meta:
    author = "Google Cloud Security"
    description = "Re/creating the Windows 'svchost' in an unusual location"
    yara_version = "YL2.0"
    rule_version = "1.0"

  events:
    (
      $e1.metadata.event_type = "FILE_CREATION" or
      $e1.metadata.event_type = "FILE_COPY"
    )
    and
    re.regex($e1.target.file.full_path, `\bsvchost(\.exe)?\b`) nocase and
    not re.regex($e1.principal.process.command_line, `\\Windows\\System32\\`) nocase

  condition:
    $e1
}

  condition: _yaral_rule
references:
  - 
tags:


