title: suspicious_change_in_hosts_file
id: 0d681d0b-1a2b-4306-9956-2904f90f8db4
status: experimental
level: medium
description: |
  Write event to the Windows host file
author: Google Cloud Security
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    /*
 * Copyright 2021 Google LLC
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     https://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

rule suspicious_change_in_hosts_file
{
  meta:
    author = "Google Cloud Security"
    description = "Write event to the Windows host file"
    yara_version = "YL2.0"
    rule_version = "1.0"

  events:
    $e1.metadata.event_type = "FILE_MODIFICATION"
    $e1.target.file.full_path = `\\Windows\\System32\\Drivers\\etc\\hosts` nocase

  condition:
    $e1
}

  condition: _yaral_rule
references:
  - 
tags:


