title: suspicious_command_execution
id: eb1154a7-cb8c-4693-a6b8-d0426154b32b
status: experimental
level: medium
description: |
  Detects suspicious command execution  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Den Iuzvyk
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule suspicious_command_execution {
 meta:
    author = "Den Iuzvyk"
    description = "Detects suspicious command execution  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/HkEeVAuNeql1"
    version = "0.01"
    created = "2021-03-09"
    category = "process_creation"
    product = "windows"
    mitre = "execution, t1204, t1059"

  events:
(re.regex($selection.target.process.file.full_path, `.*\\cmd\.exe`) and re.regex($selection.target.process.command_line, `.*rd.*`) and re.regex($selection.target.process.command_line, `.*/s.*`) and re.regex($selection.target.process.command_line, `.*/q.*`) and re.regex($selection.target.process.command_line, `.*timeout.*`) and re.regex($selection.target.process.command_line, `.* del .*`) and re.regex($selection.target.process.command_line, `.*\.exe.*`) and ($selection.metadata.product_event_type = "4688" or $selection.metadata.product_event_type = "1"))

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/HkEeVAuNeql1
tags:


