title: suspicious_rasdial_activity
id: d30989df-471a-4e5a-b949-ddc4fe3854bd
status: experimental
level: medium
description: |
  Detects suspicious process related to rasdial.exe  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: juju4
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule suspicious_rasdial_activity {
 meta:
    author = "juju4"
    description = "Detects suspicious process related to rasdial.exe  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/CANgPcVVjZPj"
    version = "0.01"
    created = "2021-03-09"
    category = "process_creation"
    product = "windows"

  events:
($selection.target.process.command_line = "rasdial" and ($selection.metadata.product_event_type = "4688" or $selection.metadata.product_event_type = "1"))

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/CANgPcVVjZPj
tags:


