title: suspicious_dns_query_with_b64_encoded_string
id: 055cd05b-a0db-4e08-b08c-cb288d343d43
status: experimental
level: medium
description: |
  Detects suspicious DNS queries using base64 encoding  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Florian Roth
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule suspicious_dns_query_with_b64_encoded_string {
 meta:
    author = "Florian Roth"
    description = "Detects suspicious DNS queries using base64 encoding  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/v6bVaJ9VCDy3"
    version = "0.01"
    created = "2018/05/10"
    category = "dns"

  events:
re.regex($selection.target.url, `.*==\..*`)

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/v6bVaJ9VCDy3
tags:


