title: suspicious_reconnaissance_activity
id: 3be01f60-e962-4923-a689-ae92036f3e7f
status: experimental
level: medium
description: |
  Detects suspicious command line activity on Windows systems  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Florian Roth
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule suspicious_reconnaissance_activity {
 meta:
    author = "Florian Roth"
    description = "Detects suspicious command line activity on Windows systems  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/1H6XajuNzAYw"
    version = "0.01"
    created = "2021-03-09"
    category = "process_creation"
    product = "windows"

  events:
(($selection.target.process.command_line = "net group \"domain admins\" /domain" or $selection.target.process.command_line = "net localgroup administrators") and ($selection.metadata.product_event_type = "4688" or $selection.metadata.product_event_type = "1"))

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/1H6XajuNzAYw
tags:


