title: suspicious_traffic_port_666
id: 6397a477-d531-4117-94f2-dfd69285f349
status: experimental
level: medium
description: |
  Traffic to port 666
author: Google Cloud Security
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    /*
 * Copyright 2021 Google LLC
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     https://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

rule suspicious_traffic_port_666
{
  meta:
    author = "Google Cloud Security"
    description = "Traffic to port 666"
    yara_version = "YL2.0"
    rule_version = "1.0"

  events:
    $e1.target.port = 666

  condition:
    $e1
}

  condition: _yaral_rule
references:
  - 
tags:


