title: sysmon_state_and_configuration_changed
id: 4b5b78bc-d254-4200-b3c9-89a0f87a30e7
status: experimental
level: medium
description: |
  Detects sysmon state and configuration change.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Alexandr Yampolskyi, SOC Prime
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule sysmon_state_and_configuration_changed {
 meta:
    author = "Alexandr Yampolskyi, SOC Prime"
    description = "Detects sysmon state and configuration change.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/IclREjJdDTfK"
    version = "0.01"
    created = "2021-03-09"
    product = "windows"
    service = "sysmon"
    mitre = "Defense Evasion, t1089"

  events:
($selection1.metadata.product_event_type = "4" or $selection1.metadata.product_event_type = "16")

  condition:
    $selection1
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/IclREjJdDTfK
tags:


