title: vulnerable_netlogon_secure_channel_connection_allowed
id: 74271651-ce0e-4de1-b16d-16ef03e9e881
status: experimental
level: medium
description: |
  Detects that a vulnerable Netlogon secure channel connection was allowed, which could be an indicator of CVE-2020-1472.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: NVISO
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule vulnerable_netlogon_secure_channel_connection_allowed {
  meta:
    author = "NVISO"
    description = "Detects that a vulnerable Netlogon secure channel connection was allowed, which could be an indicator of CVE-2020-1472.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/S4U7tNVmkwFr"
    version = "0.01"
    created = "2020/09/15"

  events:
    $event.metadata.product_log_id = "5829"

  condition:
    $event
}


  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/S4U7tNVmkwFr
tags:


