title: wastedlocker_ransomware_hunting_credential_dumping
id: c1ffd306-1075-465b-9e08-3d08b72de0a6
status: experimental
level: medium
description: |
  This rule its part of Cisco Talos investigation about this ransomware, and includes a lot of ATT&CK techniques that i'll be writing in different rules.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Ariel Millahuel
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule wastedlocker_ransomware_hunting_credential_dumping {
 meta:
    author = "Ariel Millahuel"
    description = "This rule its part of Cisco Talos investigation about this ransomware, and includes a lot of ATT&CK techniques that i'll be writing in different rules.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/ohVpL4U6RLYd"
    version = "0.01"
    created = "2021-03-09"
    category = "process_creation"
    product = "windows"
    mitre = "credential_access, T1086, T1035"

  events:
($selection1.target.process.file.full_path = "reg.exe" and ($selection1.target.process.command_line = "reg save HKLM\\SAM C:\\programdata\\SamBkup.hiv" or $selection1.target.process.command_line = "reg save HKLM\\SYSTEM C:\\programdata\\FileName.hiv") and ($selection1.metadata.product_event_type = "4688" or $selection1.metadata.product_event_type = "1"))

  condition:
    $selection1
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/ohVpL4U6RLYd
tags:


