title: windows_powershell_user_agent
id: 1c0f2891-335c-4ea8-a88b-d1f29196c9e9
status: experimental
level: medium
description: |
  Detects Windows PowerShell Web Access  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Florian Roth
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule windows_powershell_user_agent {
 meta:
    author = "Florian Roth"
    description = "Detects Windows PowerShell Web Access  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/xzB8yjUPmYM3"
    version = "0.01"
    created = "2021-03-09"
    category = "proxy"

  events:
re.regex($selection.principal.application, `.* WindowsPowerShell/.*`)

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/xzB8yjUPmYM3
tags:


