title: windows_powershell_webdav_user_agent
id: 20ad9d9f-7e99-4eee-a04e-9dbc566d6967
status: experimental
level: medium
description: |
  Detects Windows PowerShell Web Access  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Florian Roth
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule windows_powershell_webdav_user_agent {
 meta:
    author = "Florian Roth"
    description = "Detects Windows PowerShell Web Access  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/YCaVXPO7wDAX"
    version = "0.01"
    created = "2018/04/06"
    category = "proxy"

  events:
re.regex($selection.principal.application, `Microsoft-WebDAV-MiniRedir/.*`)

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/YCaVXPO7wDAX
tags:


