title: zoom_phishing_email_fake_zoom_login_page__credential_stealer
id: 3c3baf70-6523-4fb4-a78d-dbdf43f4b43a
status: experimental
level: medium
description: |
  Detects Phishing Email  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.
author: Osman Demir
logsource:
  product: chronicle
  service: general
detection:
  _yaral_rule: |
    rule zoom_phishing_email_fake_zoom_login_page__credential_stealer {
 meta:
    author = "Osman Demir"
    description = "Detects Phishing Email  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/0wJzSlJ1QqOI"
    version = "0.01"
    created = "2021-03-09"
    category = "proxy"
    mitre = "T1192, initial_access"

  events:
($selection.security_result.action = "allowed" and $selection.target.url = "http://zoom-emergency.myftp.org")

  condition:
    $selection
}

  condition: _yaral_rule
references:
  - https://tdm.socprime.com/tdm/info/0wJzSlJ1QqOI
tags:


