title: Detection Enrichment - Entra User
id: 63703c5f-3487-4408-96aa-426ae5ae9001
status: experimental
level: medium
description: |
  Sentinel Data Lake job to put an aggregated table of entra users in LAW for filtering/enrichment in detections and automations.
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    EntraUsers
| where TimeGenerated > ago(3d)
| summarize arg_max(TimeGenerated, * ) by id
| project-away _*
| project-rename ObjectId = id
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
