title: Function: ResourcesCount()
id: 83f60c7c-68fd-43f6-b916-db965e0b862a
status: experimental
level: medium
description: |
  Count the number of Azure Resources for each subscription.
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    let ResourcesCount = () {
    arg("").Resources
    | summarize TotalResources = count() by subscriptionId
};
ResourcesCount()
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
