title: Function: ResourcesCount()
id: ba20af42-e041-4f10-86a9-239d3c6468f8
status: experimental
level: medium
description: |
  Count the number of Azure Resources for each subscription.
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    let ResourcesCount = () {
    arg("").Resources
    | summarize TotalResources = count() by subscriptionId
};
ResourcesCount()
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
