title: Function: ResourcesCount()
id: 4672ef5b-7bd1-4fa0-ac55-282ddfe11a12
status: experimental
level: medium
description: |
  Count the number of Azure Resources for each subscription.
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    let ResourcesCount = () {
    arg("").Resources
    | summarize TotalResources = count() by subscriptionId
};
ResourcesCount()
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
