title: Function: ResourcesCount()
id: 50025a04-de88-444b-b592-f4ed9876e1b3
status: experimental
level: medium
description: |
  Count the number of Azure Resources for each subscription.
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    let ResourcesCount = () {
    arg("").Resources
    | summarize TotalResources = count() by subscriptionId
};
ResourcesCount()
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
