title: Function: ResourcesCount()
id: 5186bb16-aa1c-4ec5-a2b5-cab891f85783
status: experimental
level: medium
description: |
  Count the number of Azure Resources for each subscription.
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    let ResourcesCount = () {
    arg("").Resources
    | summarize TotalResources = count() by subscriptionId
};
ResourcesCount()
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
