title: Function: ListPublicIPs()
id: dbc8d352-9fc7-4442-a94f-fc9a5ed9140c
status: experimental
level: medium
description: |
  List all public IPs that are returned by Azure Resource Graph. This can be used for enrichment or filtering.
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    let ListPublicIPs = arg("").Resources
| where type == "microsoft.network/publicipaddresses"
| extend ipAddress = tostring(properties.ipAddress), publicIPAllocationMethod = tostring(properties.publicIPAllocationMethod)
| where isnotempty(ipAddress)
| distinct ipAddress;
ListPublicIPs
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
