title: Hunt for activities where Hard Delete user was performed
id: 2e974fc0-1a83-4b66-bdbe-fd314006dfe9
status: experimental
level: medium
description: |
  This query lists activities where a hard user delete has been performed.

## Defender XDR
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    CloudAppEvents
| where ActionType == "Hard Delete user."
| extend DeletedUser = parse_json(RawEventData).ObjectId
| project
     Timestamp,
     ActionType,
     Application,
     InitiatingUser = AccountDisplayName,
     DeletedUser
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
