title: Microsoft Teams Emoji Reactions
id: 1fc7da2e-2341-4fea-91f5-4be5cbbc2e3d
status: experimental
level: medium
description: |
  This query lists the statistics of the Emoji reactions that have been send via Microsoft Teams

## Defender XDR
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    CloudAppEvents
| where Application == "Microsoft Teams"
| where ActionType == "ReactedToMessage"
| extend Emoji = tostring(RawEventData.MessageReactionType)
| where isnotempty(Emoji)
| summarize TotalUsage = count() by Emoji
| sort by TotalUsage
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
