title: Onboarded Machines by Resource Group
id: 5276cf22-1257-4dd2-80ef-edfbba0bc56f
status: experimental
level: medium
description: |
  This query lists the amount of onboarded Azure Arc Machines for each resourceGroup.

## Sentinel
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    arg("").Resources
| where type == "microsoft.hybridcompute/machines"
| summarize Total = dcount(id), SampleDevices = make_set(name, 10) by resourceGroup
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
