title: Statistics onboarded devices (OS)
id: 5980a73b-4b14-4c08-b119-d0b89dcae6e7
status: experimental
level: medium
description: |
  This query lists how many devices have been onboarded per operating system.
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    DeviceInfo
| where OnboardingStatus == "Onboarded"
| summarize arg_max(Timestamp, *) by DeviceId
| summarize TotalDevices = count() by OSPlatform
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
