title: The art of Knowing Your SIEM & XDR Data
id: 1755da2a-d330-47cb-a66e-eed719ac5f90
status: experimental
level: medium
description: |
  KQL detection rule: The art of Knowing Your SIEM & XDR Data
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    union * 
| where TimeGenerated > ago(90d) 
| distinct Type
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
