title: The art of Knowing Your SIEM & XDR Data
id: 77b44f12-7149-4c1f-bcfa-35f014ed3fef
status: experimental
level: medium
description: |
  KQL detection rule: The art of Knowing Your SIEM & XDR Data
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    union * 
| where TimeGenerated > ago(90d) 
| distinct Type
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
