title: The art of Knowing Your SIEM & XDR Data
id: d8a58d8c-f8a0-4e7d-940f-1cbd0b8a9ab4
status: experimental
level: medium
description: |
  KQL detection rule: The art of Knowing Your SIEM & XDR Data
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    union * 
| where TimeGenerated > ago(90d) 
| distinct Type
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
