title: Top 10 devices with the most Critical and High vulnerabilities
id: b239b815-dc97-4dc4-a4b9-bd95bd0b1d7f
status: experimental
level: medium
description: |
  KQL detection rule: Top 10 devices with the most Critical and High vulnerabilities
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    DeviceTvmSoftwareVulnerabilities
| where VulnerabilitySeverityLevel has_any ('critical', 'High')
| summarize count(), VulnerableCVE = make_set(CveId) by DeviceName
| top 10 by count_
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
