title: Top 10 devices with the most Critical and High vulnerabilities
id: fe5e7080-b0d4-4f53-90bf-5b8ea191cdd0
status: experimental
level: medium
description: |
  KQL detection rule: Top 10 devices with the most Critical and High vulnerabilities
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    DeviceTvmSoftwareVulnerabilities
| where VulnerabilitySeverityLevel has_any ('critical', 'High')
| summarize count(), VulnerableCVE = make_set(CveId) by DeviceName
| top 10 by count_
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
