title: Top 100 devices with the most browser extensions installed
id: f2c87984-0e60-447f-a528-3a2acb077d8e
status: experimental
level: medium
description: |
  KQL detection rule: Top 100 devices with the most browser extensions installed
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    DeviceTvmBrowserExtensions
| summarize
     TotalExtensions = dcount(ExtensionId),
     ExtensionNames = make_set(ExtensionName)
     by DeviceId
| join kind=inner DeviceInfo on DeviceId
| project DeviceName, TotalExtensions, ExtensionNames
| top 100 by TotalExtensions
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
