title: Top 100 devices with the most browser extensions installed
id: 6e37cada-3316-42f3-9682-7803c9628252
status: experimental
level: medium
description: |
  KQL detection rule: Top 100 devices with the most browser extensions installed
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    DeviceTvmBrowserExtensions
| summarize
     TotalExtensions = dcount(ExtensionId),
     ExtensionNames = make_set(ExtensionName)
     by DeviceId
| join kind=inner DeviceInfo on DeviceId
| project DeviceName, TotalExtensions, ExtensionNames
| top 100 by TotalExtensions
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
