title: Visualisation of operations that have been seen in the Cloud App logs in the last 30 days
id: 02f96dc5-ee58-4f6e-b50f-e486b3832304
status: experimental
level: medium
description: |
  KQL detection rule: Visualisation of operations that have been seen in the Cloud App logs in the last 30 days
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    CloudAppEvents
| where Timestamp > ago(30d)
| extend Operation = tostring(parse_json(RawEventData).Operation)
| where Operation != "CrmDefaultActivity" //Filter Dynamics 365 activities.
| summarize count() by Operation
| render piechart with(title="Operations last 30 days")
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
