title: Vulnerabilities visualized in a Piechart
id: 1ed8ae43-5100-4895-a39e-810d4a14312b
status: experimental
level: medium
description: |
  KQL detection rule: Vulnerabilities visualized in a Piechart
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    DeviceTvmSoftwareVulnerabilities
| summarize count() by VulnerabilitySeverityLevel
| render piechart
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
