title: Vulnerabilities visualized in a Piechart
id: 3bf916a0-fedf-4195-b866-8b40a40313c5
status: experimental
level: medium
description: |
  KQL detection rule: Vulnerabilities visualized in a Piechart
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    DeviceTvmSoftwareVulnerabilities
| summarize count() by VulnerabilitySeverityLevel
| render piechart
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
