title: Vulnerabilities visualized in a Piechart
id: a79b57e4-f45f-421b-a999-c895526f40ff
status: experimental
level: medium
description: |
  KQL detection rule: Vulnerabilities visualized in a Piechart
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    DeviceTvmSoftwareVulnerabilities
| summarize count() by VulnerabilitySeverityLevel
| render piechart
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
