title: A client made a web request to a potentially harmful file (ASIM Web Session schema)
id: 4df9d542-a97d-564e-9ff6-44bc7f3ea82b
status: stable
level: medium
description: |
  'This rule identifies a web request to a URL that holds a file type, including .ps1, .bat, .vbs, and .scr that can be harmful if downloaded. This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM WebSession schema (ASIM WebSession Schema)'
author: Yaron
logsource:
  product: azure
  category: file_event
detection:
  selection:
    requestedFileExtension:
      - file_ext_blocklist
  condition: selection
tags:
  - attack.t1189
custom_attributes:
  original_rule_id: 09c49590-4e9d-4da9-a34d-17222d0c9e7e
  source_format: azure_kql