title: A host is potentially running a crypto miner (ASIM Web Session schema)
id: 459bbc88-520b-5f24-a208-a9d6fe13ddb5
status: stable
level: medium
description: |
  'This rule identifies a web request with a user agent header known to belong to a crypto miner. This indicates a crypto miner may have infected the client machine.<br>You can add custom crypto mining indicating User-Agent headers using a watchlist, for more information refer to the [UnusualUserAgents Watchlist](https://aka.ms/ASimUnusualUserAgentsWatchlist).<br><br>   This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM WebSes
author: Yaron
logsource:
  product: azure
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1496
custom_attributes:
  original_rule_id: 8cbc3215-fa58-4bd6-aaaa-f0029c351730
  source_format: azure_kql