title: A host is potentially running a hacking tool (ASIM Web Session schema)
id: 7ff4a468-423f-5a97-9a77-cd941130ba72
status: stable
level: medium
description: |
  'This rule identifies a web request with a user agent header known to belong to a hacking tool. This indicates a hacking tool is used on the host.<br>You can add custom hacking tool indicating User-Agent headers using a watchlist, for more information refer to the [UnusualUserAgents Watchlist](https://aka.ms/ASimUnusualUserAgentsWatchlist).  This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM WebSession schema (ASIM WebSessio
author: Yaron
logsource:
  product: azure
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1059
  - attack.t1046
  - attack.t1021
  - attack.t1557
  - attack.t1102
  - attack.t1020
custom_attributes:
  original_rule_id: 3f0c20d5-6228-48ef-92f3-9ff7822c1954
  source_format: azure_kql