title: A host is potentially running PowerShell to send HTTP(S) requests (ASIM Web Session schema)
id: 60b6469e-d92a-5a84-8a6b-1660fd8ace52
status: stable
level: medium
description: |
  'This rule identifies a web request with a user agent header known to belong PowerShell. <br>You can add custom Powershell indicating User-Agent headers using a watchlist, for more information refer to the [UnusualUserAgents Watchlist](https://aka.ms/ASimUnusualUserAgentsWatchlist).<br><br>  This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM WebSession schema (ASIM WebSession Schema)'
author: Yaron
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1132
  - attack.t1140
  - attack.t1059.001
custom_attributes:
  original_rule_id: 42436753-9944-4d70-801c-daaa4d19ddd2
  source_format: azure_kql