title: Account created from non-approved sources
id: 4c3ecf96-527b-5c60-ba46-0e466d37c9ac
status: stable
level: medium
description: |
  'This query looks for an account being created from a domain that is not regularly seen in a tenant.   Attackers may attempt to add accounts from these sources as a means of establishing persistant access to an environment.   Created accounts should be investigated to confirm expected creation.   Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-user-accounts#short-lived-accounts'
author: Microsoft Security Research
logsource:
  product: azure
  category: file_event
detection:
  selection:
    OperationName: Add User
  condition: selection
tags:
  - attack.t1136.003
custom_attributes:
  original_rule_id: 99d589fa-7337-40d7-91a0-c96d0c4fa437
  source_format: azure_kql