title: Account added and removed from privileged groups
id: 5b8137f7-6be1-5038-811a-7c26d5ec2f4d
status: stable
level: low
description: |
  'Identifies accounts that are added to a privileged group and then quickly removed, which could be a sign of compromise.'
author: Microsoft Security Research
logsource:
  product: azure
detection:
  selection:
    EventID:
      - 4729
      - 4733
      - 4757
  condition: selection
tags:
  - attack.t1098
  - attack.t1078
custom_attributes:
  original_rule_id: 7efc75ce-e2a4-400f-a8b1-283d3b0f2c60
  source_format: azure_kql