title: AD account with Don't Expire Password
id: 25d79eaa-74a3-5185-9fcf-5c2f50d76eb7
status: stable
level: low
description: |
  'Identifies whenever a user account has the setting "Password Never Expires" in the user account properties selected. This is indicated in Security event 4738 in the EventData item labeled UserAccountControl with an included value of %%2089. %%2089 resolves to "Don't Expire Password - Enabled".'
author: Microsoft Security Research
logsource:
  product: azure
  category: authentication
detection:
  selection:
    UserAccountControl|contains:
      - '%%2089'
      - '%%2089'
  condition: selection
tags:
  - attack.t1098
custom_attributes:
  original_rule_id: 6c360107-f3ee-4b91-9f43-f4cfd90441cf
  source_format: azure_kql