title: Anomalous User Agent connection attempt
id: 59c8eb99-ba8b-56f4-acab-292fdaf090f4
status: stable
level: low
description: |
  'Identifies connection attempts (success or fail) from clients with very short or very long User Agent strings and with less than 100 connection attempts.'
author: Microsoft Security Research
logsource:
  product: azure
  category: network_connection
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1190
custom_attributes:
  original_rule_id: f845881e-2500-44dc-8ed7-b372af3e1e25
  source_format: azure_kql