title: AppServices AV Scan with Infected Files
id: 95e7b26b-0d18-5d4b-99c4-5639c0c1ad68
status: stable
level: informational
description: '''Identifies if an AV scan finds infected files in Azure App Services.'''
author: SecurityJedi
logsource:
  product: azure
  category: file_event
detection:
  selection:
    _kql_reference: true
  condition: selection
custom_attributes:
  original_rule_id: 9d0295ee-cb75-4f2c-9952-e5acfbb67036
  source_format: azure_kql