title: AppServices AV Scan Failure
id: e04b66ee-e5a2-57b3-ade1-3b9df3307e38
status: stable
level: informational
description: '''Identifies if an AV scan fails in Azure App Services.'''
author: SecurityJedi
logsource:
  product: azure
detection:
  selection:
    ScanStatus: Failed
  condition: selection
custom_attributes:
  original_rule_id: c2da1106-bfe4-4a63-bf14-5ab73130ccd5
  source_format: azure_kql