title: Authentication Attempt from New Country
id: cd5ad234-fe3d-5033-9e60-dd5d389bc110
status: stable
level: medium
description: |
  Detects when there is a login attempt from a country that has not seen a successful login in the previous 14 days. Threat actors may attempt to authenticate with credentials from compromised accounts - monitoring attempts from anomalous locations may help identify these attempts. Authentication attempts should be investigated to ensure the activity was legitimate and if there is other similar activity. Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-user-a
author: Microsoft Security Research
logsource:
  product: azure
  category: authentication
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1078.004
custom_attributes:
  original_rule_id: ef895ada-e8e8-4cf0-9313-b1ab67fab69f
  source_format: azure_kql