title: AV detections related to Europium actors
id: 555d5227-9291-5461-8f7b-6f142a5708d2
status: stable
level: high
description: |
  'This query looks for Microsoft Defender AV detections related to  Europium actor.  In Microsoft Sentinel the SecurityAlerts table includes only the Device Name of the affected device, this query joins the DeviceInfo table to clearly connect other information such as Device group, ip, etc. This would allow the Microsoft Sentinel analyst to have more context related to the alert, if available.  Reference: https://www.microsoft.com/security/blog/2022/09/08/microsoft-investigates-iranian-attacks-ag
author: Microsoft Security Research
logsource:
  product: azure
detection:
  selection:
    ProviderName: MDATP
  condition: selection
tags:
  - attack.t1486
custom_attributes:
  original_rule_id: 186970ee-5001-41c1-8c73-3178f75ce96a
  source_format: azure_kql