title: Azure VM Run Command operations executing a unique PowerShell script
id: 82d8c575-df68-5a80-984d-fe3b9ee669d5
status: stable
level: medium
description: |
  'Identifies when Azure Run command is used to execute a PowerShell script on a VM that is unique. The uniqueness of the PowerShell script is determined by taking a combined hash of the cmdLets it imports and the file size of the PowerShell script. Alerts from this detection indicate a unique PowerShell was executed in your environment.'
author: Microsoft Security Research
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    InitiatingProcessFileName: RunCommandExtension.exe
    OperationNameValue: Microsoft.Compute/virtualMachines/runCommand/action
    Authorization|contains: virtualMachines
    InitiatingProcessCommandLine|contains: '-File'
  condition: selection
tags:
  - attack.t1570
  - attack.t1059.001
custom_attributes:
  original_rule_id: 5239248b-abfb-4c6a-8177-b104ade5db56
  source_format: azure_kql