title: Brute force attack against user credentials (Uses Authentication Normalization)
id: f7282d5a-5fbc-529e-8191-7032872a46eb
status: stable
level: medium
description: |
  'Identifies evidence of brute force activity against a user based on multiple authentication failures and at least one successful authentication within a given time window. Note that the query does not enforce any sequence, and does not require the successful authentication to occur last. The default failure threshold is 10, success threshold is 1, and the default time window is 20 minutes. To use this analytics rule, make sure you have deployed the [ASIM normalization parsers](https://aka.ms/AS
author: Ofer Shezaf
logsource:
  product: azure
  category: authentication
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1110
custom_attributes:
  original_rule_id: a6c435a2-b1a0-466d-b730-9f8af69262e8
  source_format: azure_kql