title: Cisco Umbrella - Rare User Agent Detected
id: 0108b977-f15c-5230-9336-64e0f9c2b2b3
status: stable
level: medium
description: |
  'Rule helps to detect a rare user-agents indicating web browsing activity by an unusual process other than a web browser.'
author: Microsoft
logsource:
  product: azure
detection:
  selection:
    EventType:
      - proxylogs
      - proxylogs
  condition: selection
custom_attributes:
  original_rule_id: 8c8de3fa-6425-4623-9cd9-45de1dd0569a
  source_format: azure_kql