title: Cisco Umbrella - Connection to non-corporate private network
id: 3faf79a6-538e-5c60-b796-9846a55b2f6f
status: stable
level: medium
description: |
  'IP addresses of broadband links that usually indicates users attempting to access their home network, for example for a remote session to a home computer.'
author: Microsoft
logsource:
  product: azure
  category: network_connection
detection:
  selection:
    EventType: proxylogs
    DvcAction: Allowed
  condition: selection
custom_attributes:
  original_rule_id: c9b6d281-b96b-4763-b728-9a04b9fe1246
  source_format: azure_kql