title: Cisco Umbrella - Connection to Unpopular Website Detected
id: 52810408-ff8c-56e4-8eb2-c150b12eed61
status: stable
level: medium
description: '''Detects first connection to an unpopular website (possible malicious payload delivery).'''
author: Microsoft
logsource:
  product: azure
  category: network_connection
detection:
  selection:
    EventType:
      - proxylogs
      - proxylogs
  condition: selection
custom_attributes:
  original_rule_id: 75297f62-10a8-4fc1-9b2a-12f25c6f05a7
  source_format: azure_kql