title: Cisco Umbrella - URI contains IP address
id: 239a2461-5feb-559b-b463-377a47c019c8
status: stable
level: medium
description: '''Malware can use IP address to communicate with C2.'''
author: Microsoft
logsource:
  product: azure
detection:
  selection:
    EventType: proxylogs
    DvcAction: Allowed
  condition: selection
custom_attributes:
  original_rule_id: ee1818ec-5f65-4991-b711-bcf2ab7e36c3
  source_format: azure_kql