title: Cisco Umbrella - Crypto Miner User-Agent Detected
id: dc308684-d147-55e0-ae46-12be3ec13050
status: stable
level: medium
description: '''Detects suspicious user agent strings used by crypto miners in proxy logs.'''
author: Microsoft
logsource:
  product: azure
detection:
  selection:
    EventType: proxylogs
    HttpUserAgentOriginal:
      - XMRig
  condition: selection
custom_attributes:
  original_rule_id: b619d1f1-7f39-4c7e-bf9e-afbb46457997
  source_format: azure_kql