title: Cisco Umbrella - Empty User Agent Detected
id: bd360019-2044-51ca-9d74-34f1bb3c96d6
status: stable
level: medium
description: |
  'Rule helps to detect empty and unusual user agent indicating web browsing activity by an unusual process other than a web browser.'
author: Microsoft
logsource:
  product: azure
detection:
  selection:
    EventType: proxylogs
  condition: selection
custom_attributes:
  original_rule_id: 2b328487-162d-4034-b472-59f1d53684a1
  source_format: azure_kql