title: Cisco Umbrella - Request Allowed to harmful/malicious URI category
id: 59372bca-6593-5e44-b18d-4aaf9c51ef22
status: stable
level: medium
description: |
  'It is reccomended that these Categories shoud be blocked by policies because they provide harmful/malicious content..'
author: Microsoft
logsource:
  product: azure
detection:
  selection:
    EventType: proxylogs
    DvcAction: Allowed
    UrlCategory:
      - Adult Themes
  condition: selection
custom_attributes:
  original_rule_id: d6bf1931-b1eb-448d-90b2-de118559c7ce
  source_format: azure_kql