title: Cisco Umbrella - Hack Tool User-Agent Detected
id: 19f7a1cb-90d3-5ad2-95da-dd6f2d5ab884
status: stable
level: medium
description: '''Detects suspicious user agent strings used by known hack tools'''
author: Microsoft
logsource:
  product: azure
detection:
  selection:
    EventType: proxylogs
  condition: selection
custom_attributes:
  original_rule_id: 8d537f3c-094f-430c-a588-8a87da36ee3a
  source_format: azure_kql