title: Cisco Umbrella - Windows PowerShell User-Agent Detected
id: abc97940-d998-59a6-98b6-f67423ffb314
status: stable
level: medium
description: |
  'Rule helps to detect Powershell user-agent activity by an unusual process other than a web browser.'
author: Microsoft
logsource:
  product: windows
detection:
  selection:
    EventType: proxylogs
    HttpUserAgentOriginal:
      - WindowsPowerShell
  condition: selection
custom_attributes:
  original_rule_id: b12b3dab-d973-45af-b07e-e29bb34d8db9
  source_format: azure_kql