title: CreepyDrive URLs
id: 8d278895-03cb-50af-a650-176f4785e0bc
status: stable
level: high
description: |
  'CreepyDrive uses OneDrive for command and control. This detection identifies URLs specific to CreepyDrive.'
author: Thomas McElroy
logsource:
  product: azure
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1567.002
  - attack.t1102.002
custom_attributes:
  original_rule_id: b6d03b88-4d27-49a2-9c1c-29f1ad2842dc
  source_format: azure_kql