title: CreepyDrive request URL sequence
id: f985e01e-a27c-501f-b1b7-faf1fd46a805
status: stable
level: high
description: |
  'CreepyDrive uses OneDrive for command and control, however, it makes regular requests to predicatable paths. This detecton will alert when over 20 sequences are observed in a single day.'
author: Thomas McElroy
logsource:
  product: azure
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1567.002
  - attack.t1102.002
custom_attributes:
  original_rule_id: eda260eb-f4a1-4379-ad98-452604da9b3e
  source_format: azure_kql