title: Detect PIM Alert Disabling activity
id: 88de77b5-4c88-5b4c-8f80-3159ec117ff6
status: stable
level: medium
description: |
  'Privileged Identity Management (PIM) generates alerts when there is suspicious or unsafe activity in Microsoft Entra ID (Azure AD) organization.  This query will help detect attackers attempts to disable in product PIM alerts which are associated with Azure MFA requirements and could indicate activation of privileged access'
author: Microsoft Security Research
logsource:
  product: azure
detection:
  selection:
    LoggedByService: PIM
    Category: RoleManagement
    ActivityDisplayName|contains: Disable PIM Alert
  condition: selection
tags:
  - attack.t1098
  - attack.t1078
custom_attributes:
  original_rule_id: 1f3b4dfd-21ff-4ed3-8e27-afc219e05c50
  source_format: azure_kql