title: Dev-0228 File Path Hashes November 2021 (ASIM Version)
id: 9a956201-72e6-5d8d-8c5b-b3479e5b72ef
status: stable
level: high
description: |
  'This hunting query looks for file paths/hashes related to observed activity by Dev-0228. The actor is known to use custom version of popular tool like PsExec, Procdump etc. to carry its activity.  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.  This query uses the Microsoft Sentinel Information Model - https://docs.microsoft.com/azure/sentinel/normalization'
author: Microsoft Security Research
logsource:
  product: azure
  category: file_event
detection:
  selection:
    ProviderName: MDATP
  condition: selection
tags:
  - attack.t1569
  - attack.t1003
custom_attributes:
  original_rule_id: 29a29e5d-354e-4f5e-8321-8b39d25047bf
  source_format: azure_kql