title: Dev-0228 File Path Hashes November 2021
id: f312bbb0-b77a-5868-9f55-92aea332dd1e
status: stable
level: high
description: |
  'This hunting query looks for file paths/hashes related to observed activity by Dev-0228. The actor is known to use custom version of popular tool like PsExec, Procdump etc. to carry its activity.  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.'
author: Microsoft Security Research
logsource:
  product: azure
  category: file_event
detection:
  selection:
    ProviderName: MDATP
  condition: selection
tags:
  - attack.t1569
  - attack.t1003
custom_attributes:
  original_rule_id: 3b443f22-9be9-4c35-ac70-a94757748439
  source_format: azure_kql