title: DNS events related to mining pools (ASIM DNS Schema)
id: 3772a7b5-038c-523e-8bfc-b2949afdcc84
status: stable
level: low
description: |
  'Identifies IP addresses that may be performing DNS lookups associated with common currency mining pools. This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'
author: Microsoft Security Research
logsource:
  product: azure
  category: network_connection
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1496
custom_attributes:
  original_rule_id: c094384d-7ea7-4091-83be-18706ecca981
  source_format: azure_kql