title: DNS events related to ToR proxies  (ASIM DNS Schema)
id: c020f252-228f-5abf-824b-f8887c45dfec
status: stable
level: low
description: |
  'Identifies IP addresses performing DNS lookups associated with common ToR proxies. This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'
author: Yaron Fruchtmann
logsource:
  product: azure
  category: network_connection
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1048
custom_attributes:
  original_rule_id: 3fe3c520-04f1-44b8-8398-782ed21435f8
  source_format: azure_kql