title: DSRM Account Abuse
id: 8219efcd-42ef-5edb-a9c2-f6a244485360
status: stable
level: high
description: |
  'This query detects an abuse of the DSRM account in order to maintain persistence and access to the organization's Active Directory. Ref: https://adsecurity.org/?p=1785'
author: Vasileios Paschalidis
logsource:
  product: azure
detection:
  selection:
    EventLog: Microsoft-Windows-Sysmon/Operational
  condition: selection
tags:
  - attack.t1098
custom_attributes:
  original_rule_id: 979c42dd-533e-4ede-b18b-31a84ba8b3d6
  source_format: azure_kql