title: Email access via active sync
id: 269cd9ef-5486-5f81-b612-29f73247d54b
status: stable
level: medium
description: |
  This query detects attempts to add attacker devices as allowed IDs for active sync using the Set-CASMailbox command. This technique was seen in relation to Solorigate attack but the results can indicate potential malicious activity used in different attacks. - Note that this query can be changed to use the KQL "has_all" operator, which hasn't yet been documented officially, but will be soon.   In short, "has_all" will only match when the referenced field has all strings in the list. - Refer to S
author: Microsoft Security Research
logsource:
  product: windows
detection:
  selection:
    Source: Microsoft-Windows-Sysmon
  condition: selection
tags:
  - attack.t1068
  - attack.t1078
custom_attributes:
  original_rule_id: 2f561e20-d97b-4b13-b02d-18b34af6e87c
  source_format: azure_kql