title: Europium - Hash and IP IOCs - September 2022
id: e7e05b01-708e-5f76-a08b-807a640b5c4b
status: stable
level: high
description: |
  'Identifies a match across various data feeds for  hashes and IP IOC related to Europium  Reference: https://www.microsoft.com/security/blog/2022/09/08/microsoft-investigates-iranian-attacks-against-the-albanian-government'
author: Microsoft Security Research
logsource:
  product: azure
detection:
  selection:
    Source:
      - Microsoft-Windows-Sysmon
      - Microsoft-Windows-Sysmon
    Type:
      - sha256
      - ip
    SourceIP:
      - IPList
    IPAddresses:
      - IPList
    SourceIp:
      - IPList
    ClientIP:
      - IPList
    RemoteIP:
      - IPList
  condition: selection
tags:
  - attack.t1071
  - attack.t1003
custom_attributes:
  original_rule_id: 9d8b5a18-b7db-4c23-84a6-95febaf7e1e4
  source_format: azure_kql