title: Exchange Server Suspicious File Downloads.
id: 5f419f49-4399-5708-be00-74eccb2d5d02
status: stable
level: medium
description: |
  'This query looks for messages related to file downloads of suspicious file types on an Exchange Server. This could indicate attempted deployment of webshells.  This query uses the Exchange HttpProxy AOBGeneratorLog, you will need to onboard this log as a custom log under the table http_proxy_oab_CL before using this query.  This log is commonly found at C:\Program Files\Microsoft\Exchange Server\V15\Logging\OABGeneratorLog on the Exchange server. Details on collecting custom logs into Sentinel 
author: Microsoft Security Research
logsource:
  product: azure
  category: file_event
detection:
  selection:
    InteractiveFile: 'Yes'
    RawData:
      - Download failed and temporary file
  condition: selection
tags:
  - attack.t1190
custom_attributes:
  original_rule_id: 8955c0fb-3408-47b0-a3b9-a1faec41e427
  source_format: azure_kql