title: Exchange Worker Process Making Remote Call
id: bc44fe24-721b-53ca-8884-b52657bdadb9
status: stable
level: medium
description: |
  'This query dynamically identifies Exchange servers and then looks for instances where the IIS worker process initiates a call out to a remote URL using either cmd.exe or powershell.exe. This behaviour was described as post-compromise behaviour following exploitation of CVE-2022-41040 and CVE-2022-41082, this pattern of activity was use to download additional tools to the server. This suspicious activity is generic.'
author: Microsoft Security Community
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    InitiatingProcessParentFileName: w3wp.exe
    scStatus|startswith: 2
  condition: selection
tags:
  - attack.t1059.001
  - attack.t1059.003
custom_attributes:
  original_rule_id: 2c701f94-783c-4cd4-bc9b-3b3334976090
  source_format: azure_kql