title: Failed logon attempts by valid accounts within 10 mins
id: 3b63494a-8646-5924-bdc1-155c26d6773c
status: stable
level: low
description: |
  'Identifies when failed logon attempts are 20 or higher during a 10 minute period (2 failed logons per minute minimum) from valid account.'
author: Microsoft Security Research
logsource:
  product: azure
detection:
  selection:
    AccountType:
      - User
      - User
  condition: selection
tags:
  - attack.t1110
custom_attributes:
  original_rule_id: 0777f138-e5d8-4eab-bec1-e11ddfbc2be2
  source_format: azure_kql