title: Fortinet - Beacon pattern detected
id: 72401e40-eb5f-5f75-9563-1f4d84590754
status: stable
level: low
description: |
  'Identifies patterns in the time deltas of contacts between internal and external IPs in Fortinet network data that are consistent with beaconing.  Accounts for randomness (jitter) and seasonality such as working hours that may have been introduced into the beacon pattern.  The lookback is set to 1d, the minimum granularity in time deltas is set to 60 seconds and the minimum number of beacons required to emit a  detection is set to 4.  Increase the lookback period to capture beacons with larger 
author: Microsoft Security Research
logsource:
  product: azure
detection:
  selection:
    DeviceVendor: Fortinet
  condition: selection
tags:
  - attack.t1071
  - attack.t1571
custom_attributes:
  original_rule_id: 3255ec41-6bd6-4f35-84b1-c032b18bbfcb
  source_format: azure_kql