title: Identify Mango Sandstorm powershell commands
id: c00d4eed-71d8-511f-a224-d0d5338c04ee
status: stable
level: high
description: |
  'The query below identifies powershell commands used by the threat actor Mango Sandstorm. Reference:  https://www.microsoft.com/security/blog/2022/08/25/mercury-leveraging-log4j-2-vulnerabilities-in-unpatched-systems-to-target-israeli-organizations/'
author: Microsoft Security Research
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    FileName: powershell.exe
  condition: selection
tags:
  - attack.t1570
custom_attributes:
  original_rule_id: ce74dc9a-cb3c-4081-8c2f-7d39f6b7bae1
  source_format: azure_kql