title: Known Forest Blizzard group domains - July 2019
id: 18c91cee-2f38-527f-9db5-63e3b7ac0e8c
status: stable
level: high
description: |
  'Matches domain name IOCs related to Forest Blizzard group activity published July 2019 with CommonSecurityLog, DnsEvents and VMConnection dataTypes. References: https://blogs.microsoft.com/on-the-issues/2019/07/17/new-cyberthreats-require-new-ways-to-protect-democracy/.'
author: Microsoft Security Research
logsource:
  product: azure
detection:
  selection:
    ResourceType:
      - AZUREFIREWALLS
      - AZUREFIREWALLS
    Category:
      - AzureFirewallApplicationRule
      - AzureFirewallDnsProxy
  condition: selection
tags:
  - attack.t1071
custom_attributes:
  original_rule_id: 074ce265-f684-41cd-af07-613c5f3e6d0d
  source_format: azure_kql