title: Malformed user agent
id: ddd55fba-4e3c-5460-b1db-9049b655f277
status: stable
level: medium
description: |
  'Malware authors will sometimes hardcode user agent string values when writing the network communication component of their malware. Malformed user agents can be an indication of such malware.'
author: Microsoft Security Research
logsource:
  product: azure
detection:
  selection:
    ResourceType: APPLICATIONGATEWAYS
    OperationName: ApplicationGatewayAccess
    UserAgent|startswith: User
    RecordType:
      - AzureActiveDirectory
      - AzureActiveDirectoryStsLogon
  condition: selection
tags:
  - attack.t1189
  - attack.t1071
  - attack.t1203
custom_attributes:
  original_rule_id: a357535e-f722-4afe-b375-cff362b2b376
  source_format: azure_kql