title: Mass Download & copy to USB device by single user
id: 8ba6fc25-12ef-5a5a-bf67-dbb50a360407
status: stable
level: medium
description: |
  'This query looks for any mass download by a single user with possible file copy activity to a new USB drive. Malicious insiders may perform such activities that may cause harm to the organization.  This query could also reveal unintentional insider that had no intention of malicious activity but their actions may impact an organizations security posture. Reference:https://docs.microsoft.com/defender-cloud-apps/policy-template-reference'
author: Microsoft Security Research
logsource:
  product: azure
detection:
  selection:
    ActionType:
      - FileCreated
      - FileRenamed
    AlertName: mass download by a single user
  condition: selection
tags:
  - attack.t1052
custom_attributes:
  original_rule_id: 6267ce44-1e9d-471b-9f1e-ae76a6b7aa84
  source_format: azure_kql