title: Microsoft Entra ID Health Monitoring Agent Registry Keys Access
id: c6012ac0-ff68-5b21-91e6-f47e46cb9d0a
status: stable
level: medium
description: |
  'This detection uses Windows security events to detect suspicious access attempts to the registry key of Microsoft Entra ID Health monitoring agent. This detection requires an access control entry (ACE) on the system access control list (SACL) of the following securable object HKLM\SOFTWARE\Microsoft\Microsoft Online\Reporting\MonitoringAgent. You can find more information in here https://github.com/OTRF/Set-AuditRule/blob/master/rules/registry/aad_connect_health_monitoring_agent.yml '
author: Microsoft Security Research
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    EventID:
      - 4656
      - 4656
      - 4663
      - 4663
    ObjectType:
      - Key
      - Key
      - Key
      - Key
  condition: selection
tags:
  - attack.t1005
custom_attributes:
  original_rule_id: f819c592-c5f9-4d5c-a79f-1e6819863533
  source_format: azure_kql