title: Microsoft Defender for Endpoint (MDE) signatures for Azure Synapse pipelines and Azure Data Factory
id: 4a0b1901-944d-54f2-9ff2-54f67abd3c66
status: stable
level: high
description: |
  'This query looks for Microsoft Defender for Endpoint detections related to the remote command execution attempts on Azure IR with Managed VNet or SHIR.  In Microsoft Sentinel, the SecurityAlerts table includes the name of the impacted device. Additionally, this query joins the DeviceInfo table to connect other information such as device group, IP address, signed in users, and others allowing analysts using Microsoft Sentinel to have more context related to the alert.  Reference: https://msrc.mi
author: Microsoft Security Research
logsource:
  product: azure
detection:
  selection:
    ProviderName: MDATP
  condition: selection
tags:
  - attack.t1190
custom_attributes:
  original_rule_id: a333d8bf-22a3-4c55-a1e9-5f0a135c0253
  source_format: azure_kql