title: Microsoft Entra ID Health Service Agents Registry Keys Access
id: b01f3106-6ce4-5ca9-82c0-a6639c215865
status: stable
level: medium
description: |
  'This detection uses Windows security events to detect suspicious access attempts to the registry key values and sub-keys of Microsoft Entra ID Health service agents (e.g AD FS). Information from AD Health service agents can be used to potentially abuse some of the features provided by those services in the cloud (e.g. Federation). This detection requires an access control entry (ACE) on the system access control list (SACL) of the following securable object: HKLM:\SOFTWARE\Microsoft\ADHealthAge
author: Microsoft Security Research
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    EventID:
      - 4656
      - 4656
      - 4663
      - 4663
    ObjectType:
      - Key
      - Key
      - Key
      - Key
  condition: selection
tags:
  - attack.t1005
custom_attributes:
  original_rule_id: 06bbf969-fcbe-43fa-bac2-b2fa131d113a
  source_format: azure_kql