title: Midnight Blizzard - Script payload stored in Registry
id: 9b00e660-9fdf-5926-8269-7ea7130b2a35
status: stable
level: medium
description: |
  'This query identifies when a process execution command-line indicates that a registry value is written to allow for later execution a malicious script  References: https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/'
author: Shain
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1059
custom_attributes:
  original_rule_id: 00cb180c-08a8-4e55-a276-63fb1442d5b5
  source_format: azure_kql