title: Multiple Password Reset by user
id: 444e7b1d-fe70-5cee-84c4-0358c10348c4
status: stable
level: low
description: |
  'This query will determine multiple password resets by user across multiple data sources. Account manipulation including password reset may aid adversaries in maintaining access to credentials and certain permission levels within an environment.'
author: Microsoft Security Research
logsource:
  product: azure
  category: authentication
detection:
  selection:
    OfficeWorkload: AzureActiveDirectory
    EventID:
      - 4723
      - 4724
    Facility:
      - auth
      - authpriv
  condition: selection
tags:
  - attack.t1078
  - attack.t1110
custom_attributes:
  original_rule_id: 0b9ae89d-8cad-461c-808f-0494f70ad5c4
  source_format: azure_kql