title: Multiple RDP connections from Single System
id: 53786af4-1e84-5954-bde9-1544d0db8529
status: stable
level: low
description: |
  'Identifies when an RDP connection is made to multiple systems and above the normal connection count for the previous 7 days. Connections from the same system with the same account within the same day. RDP connections are indicated by the EventID 4624 with LogonType = 10'
author: Microsoft Security Research
logsource:
  product: azure
  category: network_connection
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1021
custom_attributes:
  original_rule_id: 78422ef2-62bf-48ca-9bab-72c69818a425
  source_format: azure_kql