title: New country signIn with correct password
id: f3dedcf3-f975-52f2-8959-3e8bfac3d535
status: stable
level: medium
description: |
  'Identifies an interrupted sign-in session from a country the user has not sign-in before in the last 7 days, where the password was correct. Although the session is interrupted by other controls such as multi factor authentication or conditional access policies, the user credentials should be reset due to logs indicating a correct password was observed during sign-in.'
author: Juanse
logsource:
  product: azure
  category: authentication
detection:
  selection:
    PasswordResult: Correct Password
    AuthMethod: Password
  condition: selection
tags:
  - attack.t1078
  - attack.t1110
custom_attributes:
  original_rule_id: 7808c05a-3afd-4d13-998a-a59e2297693f
  source_format: azure_kql