title: NRT Multiple users email forwarded to same destination
id: 1c0adfdd-480b-5c35-8b66-03bab40ac252
status: stable
level: medium
description: |
  'Identifies when multiple (more than one) users mailboxes are configured to forward to the same destination. This could be an attacker-controlled destination mailbox configured to collect mail from multiple compromised user accounts.'
author: Pete Bryan
logsource:
  product: azure
detection:
  selection:
    OfficeWorkload: Exchange
  condition: selection
tags:
  - attack.t1114
  - attack.t1020
custom_attributes:
  original_rule_id: 3b05727d-a8d1-477d-bbdd-d957da96ac7b
  source_format: azure_kql