title: Phishing link click observed in Network Traffic
id: 6ab4bb9f-12cf-5084-b7e1-f2711f163884
status: stable
level: medium
description: |
  'The purpose of this content is to identify successful phishing links accessed by users. Once a user clicks on a phishing link, we observe successful network activity originating from non-Microsoft network devices. These devices may include Palo Alto Networks, Fortinet, Check Point, and Zscaler devices.'
author: Microsoft Security Research
logsource:
  product: azure
  category: network_connection
detection:
  selection:
    DeviceProduct|startswith: FortiGate
  condition: selection
tags:
  - attack.t1566
custom_attributes:
  original_rule_id: 2fed0668-6d43-4c78-87e6-510f96f12145
  source_format: azure_kql