title: Possible contact with a domain generated by a DGA
id: 8d188b8b-4b3c-5a84-b9a8-25ceca3a27f5
status: stable
level: medium
description: |
  'Identifies contacts with domains names in CommonSecurityLog that might have been generated by a Domain Generation Algorithm (DGA). DGAs can be used by malware to generate rendezvous points that are difficult to predict in advance. This detection uses the Alexa Top 1 million domain names to build a model of what normal domains look like. It uses this to identify domains that may have been randomly generated by an algorithm. The triThreshold is set to 500 - increase this to report on domains that
author: Microsoft Security Research
logsource:
  product: azure
detection:
  selection:
    Name|contains: .
  condition: selection
tags:
  - attack.t1568
custom_attributes:
  original_rule_id: 4acd3a04-2fad-4efc-8a4b-51476594cec4
  source_format: azure_kql