title: Potential Password Spray Attack (Uses Authentication Normalization)
id: 6dbc8e29-cc68-5109-95c1-7c6d954d1777
status: stable
level: medium
description: |
  'This query searches for failed attempts to log in from more than 15 various users within a 5 minute timeframe from the same source. This is a potential indication of a password spray attack  To use this analytics rule, make sure you have deployed the [ASIM normalization parsers](https://aka.ms/ASimAuthentication)'
author: Ofer Shezaf
logsource:
  product: azure
  category: authentication
detection:
  selection:
    EventType: Logon
    EventResultDetails:
      - No such user or password
      - Incorrect password
  condition: selection
tags:
  - attack.t1110
custom_attributes:
  original_rule_id: 6a2e2ff4-5568-475e-bef2-b95f12b9367b
  source_format: azure_kql