title: Potential communication with a Domain Generation Algorithm (DGA) based hostname (ASIM Web Session schema)
id: b0e8b103-8db2-564a-a388-9cf6c6970ccc
status: stable
level: medium
description: |
  'This rule identifies communication with hosts that have a domain name that might have been generated by a Domain Generation Algorithm (DGA). DGAs are used by malware to generate rendezvous points that are difficult to predict in advance. This detection uses the top 1 million domain names to build a model of what normal domains look like nad uses the model to identify domains that may have been randomly generated by an algorithm. You can modify the triThreshold and dgaLengthThreshold query param
author: Yaron
logsource:
  product: azure
detection:
  selection:
    Name|contains: .
  condition: selection
tags:
  - attack.t1568
custom_attributes:
  original_rule_id: 9176b18f-a946-42c6-a2f6-0f6d17cd6a8a
  source_format: azure_kql