title: Probable AdFind Recon Tool Usage (Normalized Process Events)
id: 569a00bf-2683-5831-bf95-55d1b633d97d
status: stable
level: high
description: |
  'Identifies the host and account that executed AdFind by hash and filename in addition to common and unique flags that are used by many threat actors in discovery. To use this analytics rule, make sure you have deployed the [ASIM normalization parsers](https://aka.ms/ASimProcessEvent)'
author: Yuval Naor
logsource:
  product: azure
  category: process_creation
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1018
custom_attributes:
  original_rule_id: 45076281-35ae-45e0-b443-c32aa0baf965
  source_format: azure_kql