title: Rare RDP Connections
id: 0211e5f7-054f-5569-acd9-fe9f79d75abf
status: stable
level: medium
description: |
  'Identifies when an RDP connection is new or rare related to any logon type by a given account today compared with the previous 14 days. RDP connections are indicated by the EventID 4624 with LogonType = 10'
author: Microsoft Security Research
logsource:
  product: azure
  category: network_connection
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1021
custom_attributes:
  original_rule_id: 45b903c5-6f56-4969-af10-ae62ac709718
  source_format: azure_kql