title: RunningRAT request parameters
id: 35d8760f-8842-5de5-9aeb-e9e3a51457db
status: stable
level: high
description: |
  'This detection will alert when RunningRAT URI parameters or paths are detect in an HTTP request. Id the device blocked this communication presence of this alert means the RunningRAT implant is likely still executing on the source host.'
author: Thomas McElroy
logsource:
  product: azure
detection:
  selection:
    RequestMethod: GET
  condition: selection
tags:
  - attack.t1041
  - attack.t1071.001
custom_attributes:
  original_rule_id: baedfdf4-7cc8-45a1-81a9-065821628b83
  source_format: azure_kql