title: Service Principal Authentication Attempt from New Country
id: 2d4a5746-7778-5dea-8572-315fda66a631
status: stable
level: medium
description: |
  'Detects when there is a Service Principal login attempt from a country that has not seen a successful login in the previous 14 days.   Threat actors may attempt to authenticate with credentials from compromised accounts - monitoring attempts from anomalous locations may help identify these attempts.   Authentication attempts should be investigated to ensure the activity was legitimate and if there is other similar activity.   Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/s
author: Pete Bryan
logsource:
  product: azure
  category: authentication
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1078.004
custom_attributes:
  original_rule_id: 1baaaf00-655f-4de9-8ff8-312e902cda71
  source_format: azure_kql