title: Silk Typhoon New UM Service Child Process
id: cd2cdb46-d1b4-56f7-bbfd-5186b0376c4a
status: stable
level: medium
description: |
  'This query looks for new processes being spawned by the Exchange UM service where that process has not previously been observed before.  Reference: https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/'
author: Microsoft Security Research
logsource:
  product: azure
  category: process_creation
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1190
custom_attributes:
  original_rule_id: 95a15f39-d9cc-4667-8cdd-58f3113691c9
  source_format: azure_kql