title: Star Blizzard C2 Domains August 2022
id: 93f4995d-f876-5475-bcc1-d3646352f492
status: stable
level: high
description: |
  'Identifies a match across various data feeds for domains related to an actor tracked by Microsoft as Star Blizzard.'
author: Microsoft Security Research
logsource:
  product: azure
detection:
  selection:
    EmailDirection: Inbound
    ResourceType: AZUREFIREWALLS
    Category: AzureFirewallApplicationRule
    Type: domainname
  condition: selection
tags:
  - attack.t1566
custom_attributes:
  original_rule_id: 2149d9bb-8298-444c-8f99-f7bf0274dd05
  source_format: azure_kql