title: SUNBURST suspicious SolarWinds child processes
id: bcf4cba2-6c28-5d40-ace5-d6b8a3160832
status: stable
level: medium
description: |
  Identifies suspicious child processes of SolarWinds.Orion.Core.BusinessLayer.dll that may be evidence of the SUNBURST backdoor References: - https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html - https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f
author: pemontto
logsource:
  product: github
  category: process_creation
detection:
  selection:
    InitiatingProcessFileName: solarwinds.businesslayerhost.exe
  condition: selection
custom_attributes:
  original_rule_id: 4a3073ac-7383-48a9-90a8-eb6716183a54
  source_format: azure_kql