title: SUNBURST suspicious SolarWinds child processes (Normalized Process Events)
id: 6ba664cc-c497-5879-a919-849902719eec
status: stable
level: medium
description: |
  Identifies suspicious child processes of SolarWinds.Orion.Core.BusinessLayer.dll that may be evidence of the SUNBURST backdoor References: - https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html - https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f To use this analytics rule, make sure you have deployed the [ASIM normalization parsers](https://aka.ms/ASimProcessEvent)'
author: Yuval Naor
logsource:
  product: github
  category: process_creation
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1059
  - attack.t1543
custom_attributes:
  original_rule_id: 631d02df-ab51-46c1-8d72-32d0cfec0720
  source_format: azure_kql