title: Suspicious link sharing pattern
id: 119b5b62-14d8-5a30-b8eb-3ea2f9d4ffbf
status: stable
level: low
description: |
  'Alerts in links that have been shared across multiple Zoom chat channels by the same user in a short space if time. Adjust the threshold figure to change the number of channels a message needs to be posted in before an alert is raised.'
author: Microsoft Security Research
logsource:
  product: azure
detection:
  selection:
    Event: chat_message.sent
  condition: selection
tags:
  - attack.t1598
custom_attributes:
  original_rule_id: 1218175f-c534-421c-8070-5dcaabf28067
  source_format: azure_kql