title: Suspicious VM Instance Creation Activity Detected
id: a438140d-1357-5724-bf88-4f266f5e93ae
status: stable
level: medium
description: |
  'This detection identifies high-severity alerts across various Microsoft security products, including Microsoft Defender XDR and Microsoft Entra ID, and correlates them with instances of Google Cloud VM creation. It focuses on instances where VMs were created within a short timeframe of high-severity alerts, potentially indicating suspicious activity.'
author: Microsoft
logsource:
  product: azure
detection:
  selection:
    ServiceName: compute.googleapis.com
    VMOperation: insert
    ProductName:
      - Microsoft 365 Defender
      - Azure Active Directory
      - Microsoft Defender Advanced Threat Protection
      - Microsoft Cloud App Security
      - Azure Active Directory Identity Protection
      - Microsoft Defender ATP
  condition: selection
tags:
  - attack.t1078
  - attack.t1106
  - attack.t1526
custom_attributes:
  original_rule_id: 1cc0ba27-c5ca-411a-a779-fbc89e26be83
  source_format: azure_kql