title: Trust Monitor Event
id: c298670e-e9f4-596e-a663-448eba6d0419
status: stable
level: medium
description: '''This query identifies when a new trust monitor event is detected.'''
author: SecurityJedi
logsource:
  product: azure
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1528
  - attack.t1555
custom_attributes:
  original_rule_id: 8dcf7238-a7d0-4cfd-8d0c-b230e3cd9182
  source_format: azure_kql