title: Unusual identity creation using exchange powershell
id: b8665e65-e847-5f53-9661-f9175c29c7a2
status: stable
level: high
description: |
  ' The query below identifies creation of unusual identity by the Europium actor to mimic Microsoft Exchange Health Manager Service account using Exchange PowerShell commands   Reference: https://www.microsoft.com/security/blog/2022/09/08/microsoft-investigates-iranian-attacks-against-the-albanian-government/'
author: Microsoft Security Research
logsource:
  product: windows
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1136
custom_attributes:
  original_rule_id: 0a3f4f4f-46ad-4562-acd6-f17730a5aef4
  source_format: azure_kql