title: Unusual Anomaly
id: ad14cbf3-77c0-5770-99f7-b08f912ea3b8
status: stable
level: medium
description: |
  'Anomaly Rules generate events in the Anomalies table. This scheduled rule tries to detect Anomalies that are not usual, they could be a type of Anomaly that has recently been activated, or an infrequent type. The detected Anomaly should be reviewed, if it is relevant enough, eventually a separate scheduled Analytics Rule could be created specifically for that Anomaly Type, so an alert and/or incident is generated everytime that type of Anomaly happens.'
author: Microsoft
logsource:
  product: azure
detection:
  selection:
    _kql_reference: true
  condition: selection
custom_attributes:
  original_rule_id: d0255b5f-2a3c-4112-8744-e6757af3283a
  source_format: azure_kql