title: Users searching for VIP user activity
id: 32718df5-d1a4-586d-a117-443acd99de7c
status: stable
level: low
description: |
  This query monitors for users running Log Analytics queries that contain filters for specific, defined VIP user accounts or the VIPUser watchlist template. Use this detection to alert for users specifically searching for activity of sensitive users.
author: Microsoft Security Research
logsource:
  product: azure
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1530
  - attack.t1213
  - attack.t1020
custom_attributes:
  original_rule_id: f7f4a77e-f68f-4b56-9aaf-a0c9d87d7a8e
  source_format: azure_kql