title: User login from different countries within 3 hours (Uses Authentication Normalization)
id: 9046715e-61dd-51c8-8a72-1d718b4e6d90
status: stable
level: high
description: |
  'This query searches for successful user logins from different countries within 3 hours.  To use this analytics rule, make sure you have deployed the [ASIM normalization parsers](https://aka.ms/ASimAuthentication)'
author: Ofer Shezaf
logsource:
  product: azure
  category: authentication
detection:
  selection:
    EventType: Logon
  condition: selection
tags:
  - attack.t1078
custom_attributes:
  original_rule_id: 09ec8fa2-b25f-4696-bfae-05a7b85d7b9e
  source_format: azure_kql