title: User account created without expected attributes defined
id: ac659d18-6ede-5fa4-9421-824611b2cb86
status: stable
level: low
description: |
  'This query looks for accounts being created that do not have attributes populated that are commonly populated in the tenant.   Attackers may attempt to add accounts as a means of establishing persistant access to an environment, looking for anomalies in created accounts may help identify illegitimately created accounts.   Created accounts should be investigated to ensure they were legitimated created.   Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-user
author: Microsoft Security Research
logsource:
  product: azure
  category: file_event
detection:
  selection:
    OperationName:
      - Add user
      - Add user
    Result:
      - success
      - success
  condition: selection
tags:
  - attack.t1136.003
custom_attributes:
  original_rule_id: dc99e38c-f4e9-4837-94d7-353ac0b01a77
  source_format: azure_kql