title: User account added to built in domain local or global group
id: 968ebc4a-b8f0-5984-9625-ec3a0d8d5f79
status: stable
level: low
description: |
  'Identifies when a user account has been added to a privileged built in domain local group or global group such as the Enterprise Admins, Cert Publishers or DnsAdmins. Be sure to verify this is an expected addition.'
author: Microsoft Security Research
logsource:
  product: azure
detection:
  selection:
    AccountType:
      - User
      - User
    EventID:
      - 4728
      - 4732
      - 4756
  condition: selection
tags:
  - attack.t1098
  - attack.t1078
custom_attributes:
  original_rule_id: a35f2c18-1b97-458f-ad26-e033af18eb99
  source_format: azure_kql