title: User account enabled and disabled within 10 mins
id: 0cda50f9-76d4-5671-a3ee-a103267063d8
status: stable
level: medium
description: |
  'Identifies when a user account is enabled and then disabled within 10 minutes. This can be an indication of compromise and an adversary attempting to hide in the noise.'
author: Microsoft Security Research
logsource:
  product: azure
detection:
  selection:
    AccountType:
      - User
      - User
      - User
      - User
  condition: selection
tags:
  - attack.t1098
  - attack.t1078
custom_attributes:
  original_rule_id: 3d023f64-8225-41a2-9570-2bd7c2c4535e
  source_format: azure_kql