title: User account created and deleted within 10 mins
id: 8aaeabf3-1ba0-5bb3-9baa-54684ed5ae8b
status: stable
level: medium
description: |
  'Identifies when a user account is created and then deleted within 10 minutes. This can be an indication of compromise and an adversary attempting to hide in the noise.'
author: Microsoft Security Research
logsource:
  product: azure
  category: file_event
detection:
  selection:
    AccountType:
      - User
      - User
      - User
      - User
  condition: selection
tags:
  - attack.t1098
  - attack.t1078
custom_attributes:
  original_rule_id: 4b93c5af-d20b-4236-b696-a28b8c51407f
  source_format: azure_kql