title: User Account Created Using Incorrect Naming Format
id: 2e108cd7-69c7-545c-aea1-e7a5d8507ca1
status: stable
level: low
description: |
  'This query looks for accounts being created where the name does not match a defined pattern.   Attackers may attempt to add accounts as a means of establishing persistant access to an environment, looking for anomalies in created accounts may help identify illegitimately created accounts.   Created accounts should be investigated to ensure they were legitimated created.   The user_regex field in the query needs to be populated with the expected pattern for the environment before deployment.   R
author: Microsoft Security Research
logsource:
  product: azure
  category: file_event
detection:
  selection:
    OperationName: Add user
    Result: success
  condition: selection
tags:
  - attack.t1136.003
custom_attributes:
  original_rule_id: ee55dc85-d2da-48c1-a6c0-3eaee62a8d56
  source_format: azure_kql