title: Windows host username encoded in base64 web request
id: b3c93186-696a-5992-9821-d7231ee7ba60
status: stable
level: medium
description: |
  'This detection will identify network requests in HTTP proxy data that contains Base64 encoded usernames from machines in the DeviceEvents table. This technique was seen usee by POLONIUM in their RunningRAT tool.'
author: Thomas McElroy
logsource:
  product: windows
detection:
  selection:
    _kql_reference: true
  condition: selection
tags:
  - attack.t1041
  - attack.t1071.001
custom_attributes:
  original_rule_id: 6e715730-82c0-496c-983b-7a20c4590bd9
  source_format: azure_kql