title: Workspace deletion activity from an infected device
id: 3f2fc28f-0010-5820-bb7a-e617dede19bd
status: stable
level: medium
description: |
  'This query will alert on any sign-ins from devices infected with malware in correlation with workspace deletion activity.  Attackers may attempt to delete workspaces containing compute instances after successful compromise to cause service unavailability to regular business operation.'
author: Microsoft Security Research
logsource:
  product: azure
detection:
  selection:
    ProductName: Azure Active Directory Identity Protection
    AlertName: Sign-in from an infected device
  condition: selection
tags:
  - attack.t1078
  - attack.t1489
custom_attributes:
  original_rule_id: a5b3429d-f1da-42b9-883c-327ecb7b91ff
  source_format: azure_kql