title: 3CX Supply Chain Attack Network Indicators
id: 89eec2dd-d92c-5790-958e-b899487bdbf2
status: stable
level: high
description: |
  The following analytic identifies DNS queries to domains associated with the 3CX supply chain attack. It leverages the Network_Resolution datamodel to detect these suspicious domain indicators. This activity is significant because it can indicate a potential compromise stemming from the 3CX supply chain attack, which is known for distributing malicious software through trusted updates. If confirmed malicious, this activity could allow attackers to establish a foothold in the network, exfiltrate 
author: Michael Haag, Splunk
logsource:
  product: splunk
  category: network_connection
detection:
  selection:
    datamodel: Network_Resolution
    isioc: 'true'
  condition: selection
tags:
  - attack.t1195.002
references:
  - https://www.sentinelone.com/blog/smoothoperator-ongoing-campaign-trojanizes-3cx-software-in-software-supply-chain-attack/
  - https://www.cisa.gov/news-events/alerts/2023/03/30/supply-chain-attack-against-3cxdesktopapp
  - https://www.reddit.com/r/crowdstrike/comments/125r3uu/20230329_situational_awareness_crowdstrike/
  - https://www.3cx.com/community/threads/crowdstrike-endpoint-security-detection-re-3cx-desktop-app.119934/page-2#post-558898
  - https://www.3cx.com/community/threads/3cx-desktopapp-security-alert.119951/
custom_attributes:
  original_rule_id: 791b727c-deec-4fbe-a732-756131b3c5a1
  source_format: splunk_spl