title: Abnormally High Number Of Cloud Infrastructure API Calls
id: 35def4bc-2840-5946-8377-9f55df06616d
status: stable
level: medium
description: |
  The following analytic detects a spike in the number of API calls made to your cloud infrastructure by a user. It leverages cloud infrastructure logs and compares the current API call volume against a baseline probability density function to identify anomalies. This activity is significant because an unusual increase in API calls can indicate potential misuse or compromise of cloud resources. If confirmed malicious, this could lead to unauthorized access, data exfiltration, or disruption of clou
author: David Dorsey, Splunk
logsource:
  product: splunk
detection:
  selection:
    datamodel: Change
    status: success
    span: 1h
    isoutlier: 1
    distance_from_threshold: api_calls
  condition: selection
tags:
  - attack.t1078.004
custom_attributes:
  original_rule_id: 0840ddf1-8c89-46ff-b730-c8d6722478c0
  source_format: splunk_spl