title: Abnormally High Number Of Cloud Instances Destroyed
id: f902941e-6ce4-53c2-a91f-becb39f4faf7
status: experimental
level: medium
description: |
  The following analytic identifies an abnormally high number of cloud instances being destroyed within a 4-hour period. It leverages cloud infrastructure logs and applies a probability density model to detect outliers. This activity is significant for a SOC because a sudden spike in destroyed instances could indicate malicious activity, such as an insider threat or a compromised account attempting to disrupt services. If confirmed malicious, this could lead to significant operational disruptions,
author: David Dorsey, Splunk
logsource:
  product: splunk
detection:
  selection:
    datamodel: Change
    action: deleted
    status: success
    object_category: instance
    span: 1h
    isoutlier: 1
    distance_from_threshold: instances_destroyed
  condition: selection
tags:
  - attack.t1078.004
custom_attributes:
  original_rule_id: ef629fc9-1583-4590-b62a-f2247fbf7bbf
  source_format: splunk_spl