title: Abnormally High Number Of Cloud Security Group API Calls
id: 34c77236-01ae-5bbf-97db-e58825b4e772
status: stable
level: medium
description: |
  The following analytic detects a spike in the number of API calls made to cloud security groups by a user. It leverages data from the Change data model, focusing on successful firewall-related changes. This activity is significant because an abnormal increase in security group API calls can indicate potential malicious activity, such as unauthorized access or configuration changes. If confirmed malicious, this could allow an attacker to manipulate security group settings, potentially exposing se
author: David Dorsey, Splunk
logsource:
  product: splunk
detection:
  selection:
    datamodel: Change
    object_category: firewall
    status: success
    span: 1h
    isoutlier: 1
    distance_from_threshold: security_group_api_calls
  condition: selection
tags:
  - attack.t1078.004
custom_attributes:
  original_rule_id: d4dfb7f3-7a37-498a-b5df-f19334e871af
  source_format: splunk_spl