title: Active Setup Registry Autostart
id: 6e7adc8d-9e23-5104-a2af-37d32cd650be
status: stable
level: high
description: |
  The following analytic detects suspicious modifications to the Active Setup registry for persistence and privilege escalation. It leverages data from the Endpoint.Registry data model, focusing on changes to the "StubPath" value within the "SOFTWARE\\Microsoft\\Active Setup\\Installed Components" path. This activity is significant as it is commonly used by malware, adware, and APTs to maintain persistence on compromised machines. If confirmed malicious, this could allow attackers to execute code 
author: Steven Dick, Teoderick Contreras, Splunk
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_value_name: StubPath
    registry_path: '*\\SOFTWARE\\Microsoft\\Active Setup\\Installed Components*'
  condition: selection
tags:
  - attack.t1547.014
references:
  - https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Backdoor%3AWin32%2FPoisonivy.E
  - https://attack.mitre.org/techniques/T1547/014/
custom_attributes:
  original_rule_id: f64579c0-203f-11ec-abcc-acde48001122
  source_format: splunk_spl