title: Active Directory Privilege Escalation Identified
id: 586f79ab-c51a-5cbf-a375-4cf6a2d74d94
status: stable
level: medium
description: |
  The following analytic identifies potential privilege escalation activities within an organization's Active Directory (AD) environment. It detects this activity by correlating multiple analytics from the Active Directory Privilege Escalation analytic story within a specified time frame. This is significant for a SOC as it helps identify coordinated attempts to gain elevated privileges, which could indicate a serious security threat. If confirmed malicious, this activity could allow attackers to 
author: Mauricio Velazco, Splunk
logsource:
  product: splunk
detection:
  selection:
    analyticstories: Active Directory Privilege Escalation
    risk_object_type: system
  condition: selection
tags:
  - attack.t1484
references:
  - https://attack.mitre.org/tactics/TA0004/
  - https://research.splunk.com/stories/active_directory_privilege_escalation/
custom_attributes:
  original_rule_id: 583e8a68-f2f7-45be-8fc9-bf725f0e22fd
  source_format: splunk_spl