title: Add DefaultUser And Password In Registry
id: cab60cba-5b7e-511a-bd19-d39505e36d36
status: stable
level: medium
description: |
  The following analytic detects suspicious registry modifications that implement auto admin logon by adding DefaultUserName and DefaultPassword values. It leverages data from the Endpoint.Registry data model, specifically monitoring changes to the "SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon" registry path. This activity is significant because it is associated with BlackMatter ransomware, which uses this technique to automatically log on to compromised hosts and continue encryption afte
author: Teoderick Contreras, Splunk, Steven Dick
logsource:
  product: windows
  category: authentication
detection:
  selection:
    registry_path: '*SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon*'
    registry_value_name: DefaultPassword
  condition: selection
tags:
  - attack.t1552.002
references:
  - https://news.sophos.com/en-us/2021/08/09/blackmatter-ransomware-emerges-from-the-shadow-of-darkside/
custom_attributes:
  original_rule_id: d4a3eb62-0f1e-11ec-a971-acde48001122
  source_format: splunk_spl