title: Adobe ColdFusion Access Control Bypass
id: 6ab7328b-a7e9-5ff1-a22a-75916150a200
status: stable
level: high
description: |
  The following analytic detects potential exploitation attempts against Adobe ColdFusion vulnerabilities CVE-2023-29298 and CVE-2023-26360. It monitors requests to specific ColdFusion Administrator endpoints, especially those with an unexpected additional forward slash, using the Web datamodel. This activity is significant for a SOC as it indicates attempts to bypass access controls, which can lead to unauthorized access to ColdFusion administration endpoints. If confirmed malicious, this could r
author: Michael Haag, Splunk
logsource:
  product: splunk
detection:
  selection:
    datamodel: Web
    status: 200
    url:
      - //restplay*
      - //CFIDE/restplay*
      - //CFIDE/administrator*
      - //CFIDE/adminapi*
      - //CFIDE/main*
      - //CFIDE/componentutils*
      - //CFIDE/wizards*
      - //CFIDE/servermanager*
      - /restplay*
      - /CFIDE/restplay*
      - /CFIDE/administrator*
      - /CFIDE/adminapi*
      - /CFIDE/main*
      - /CFIDE/componentutils*
      - /CFIDE/wizards*
      - /CFIDE/servermanager*
  condition: selection
tags:
  - attack.t1190
references:
  - https://www.rapid7.com/blog/post/2023/07/11/cve-2023-29298-adobe-coldfusion-access-control-bypass/
custom_attributes:
  original_rule_id: d6821c0b-fcdc-4c95-a77f-e10752fae41a
  source_format: splunk_spl