title: Adobe ColdFusion Unauthenticated Arbitrary File Read
id: e4a43521-f874-59ef-bd61-8e60cb7551e4
status: stable
level: high
description: |
  The following analytic detects potential exploitation of the Adobe ColdFusion vulnerability, CVE-2023-26360, which allows unauthenticated arbitrary file read. It monitors web requests to the "/cf_scripts/scripts/ajax/ckeditor/*" path using the Web datamodel, focusing on specific ColdFusion paths to differentiate malicious activity from normal traffic. This activity is significant due to the vulnerability's high CVSS score of 9.8, indicating severe risk. If confirmed malicious, it could lead to u
author: Michael Haag, Splunk
logsource:
  product: splunk
  category: file_event
detection:
  selection:
    datamodel: Web
    status: 200
    url:
      - /cf_scripts/scripts/ajax/ckeditor/*
  condition: selection
tags:
  - attack.t1190
references:
  - https://www.rapid7.com/db/modules/auxiliary/gather/adobe_coldfusion_fileread_cve_2023_26360/
  - https://github.com/projectdiscovery/nuclei-templates/blob/main/http/cves/2023/CVE-2023-26360.yaml
custom_attributes:
  original_rule_id: 695aceae-21db-4e7f-93ac-a52e39d02b93
  source_format: splunk_spl