title: Advanced IP or Port Scanner Execution
id: 6c6029b5-789e-517a-9f2e-ebe71eb6012a
status: stable
level: medium
description: |
  The following analytic detects the execution of network scanning utilities such as Advanced IP Scanner or Advanced Port Scanner. These legitimate administrative tools are often leveraged by threat actors and ransomware operators during the discovery phase to enumerate active hosts and open ports within a target environment. Detection is based on process creation telemetry referencing known executable names, original file names, or specific command-line parameters such as "/portable" and "/lng" t
author: Nasreddine Bencherchali, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    process:
      - '* /portable *'
      - '* /lng *'
    process_name:
      - advanced_ip_scanner.exe
      - advanced_ip_scanner_console.exe
      - advanced_port_scanner.exe
      - advanced_port_scanner_console.exe
    original_file_name:
      - advanced_ip_scanner.exe
      - advanced_ip_scanner_console.exe
      - advanced_port_scanner.exe
      - advanced_port_scanner_console.exe
  condition: selection
tags:
  - attack.t1046
  - attack.t1135
references:
  - https://news.sophos.com/en-us/2019/12/09/snatch-ransomware-reboots-pcs-into-safe-mode-to-bypass-protection/
  - https://cloud.google.com/blog/topics/threat-intelligence/tactics-techniques-procedures-associated-with-maze-ransomware-incidents/
  - https://assets.documentcloud.org/documents/20444693/fbi-pin-egregor-ransomware-bc-01062021.pdf
  - https://thedfirreport.com/2021/01/18/all-that-for-a-coinminer
  - https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Other/Advanced%20IP%20Scanner
custom_attributes:
  original_rule_id: 9a4e50c7-5b62-4d52-93b4-f2b61332e9a5
  source_format: splunk_spl