title: Allow Inbound Traffic By Firewall Rule Registry
id: ce149134-01cd-578b-b1eb-28fa35c95d0e
status: stable
level: high
description: |
  The following analytic detects suspicious modifications to firewall rule registry settings that allow inbound traffic on specific ports with a public profile. It leverages data from the Endpoint.Registry data model, focusing on registry paths and values indicative of such changes. This activity is significant as it may indicate an adversary attempting to grant remote access to a machine by modifying firewall rules. If confirmed malicious, this could enable unauthorized remote access, potentially
author: Teoderick Contreras, Splunk, Steven Dick
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*\\System\\CurrentControlSet\\Services\\SharedAccess\\Parameters\\FirewallPolicy\\FirewallRules\\*'
    registry_value_data:
      - '*|Action=Allow|*'
      - '*|Dir=In|*'
      - '*|LPort=*'
    action: Allow
    dir: In
  condition: selection
tags:
  - attack.t1021.001
references:
  - https://docs.microsoft.com/en-us/powershell/module/netsecurity/new-netfirewallrule?view=windowsserver2019-ps
custom_attributes:
  original_rule_id: 0a46537c-be02-11eb-92ca-acde48001122
  source_format: splunk_spl