title: Amazon EKS Kubernetes cluster scan detection
id: c03da5fd-db00-5d09-a9f4-d6637cde351e
status: experimental
level: low
description: |
  The following analytic detects unauthenticated requests to an Amazon EKS Kubernetes cluster, specifically identifying actions by the "system:anonymous" user. It leverages AWS CloudWatch Logs data, focusing on user agents and authentication details. This activity is significant as it may indicate unauthorized scanning or probing of the Kubernetes cluster, which could be a precursor to an attack. If confirmed malicious, this could lead to unauthorized access, data exfiltration, or disruption of se
author: Rod Soto, Splunk
logsource:
  product: aws
detection:
  selection:
    _spl_reference: true
  filter:
    useragent: AWS Security Scanner
  condition: selection and not filter
tags:
  - attack.t1526
custom_attributes:
  original_rule_id: 294c4686-63dd-4fe6-93a2-ca807626704a
  source_format: splunk_spl