title: Anomalous usage of 7zip
id: 76c6589a-262a-5066-9eca-e3f29d561f4f
status: stable
level: medium
description: |
  The following analytic detects the execution of 7z.exe, a 7-Zip utility, spawned from rundll32.exe or dllhost.exe. This behavior is identified using Endpoint Detection and Response (EDR) telemetry, focusing on process names and parent processes. This activity is significant as it may indicate an adversary attempting to use 7-Zip for data exfiltration, often by renaming the executable to evade detection. If confirmed malicious, this could lead to unauthorized data archiving and exfiltration, comp
author: Michael Haag, Teoderick Contreras, Splunk
logsource:
  product: splunk
detection:
  selection:
    parent_process_name:
      - rundll32.exe
      - dllhost.exe
  condition: selection
tags:
  - attack.t1560.001
references:
  - https://attack.mitre.org/techniques/T1560/001/
  - https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/
  - https://thedfirreport.com/2021/01/31/bazar-no-ryuk/
custom_attributes:
  original_rule_id: 9364ee8e-a39a-11eb-8f1d-acde48001122
  source_format: splunk_spl