title: ASL AWS Credential Access RDS Password reset
id: cb05e455-8f3f-5275-aae1-2e6a7c19431e
status: stable
level: high
description: |
  The following analytic detects the resetting of the master user password for an Amazon RDS DB instance. It leverages AWS CloudTrail logs from Amazon Security Lake to identify events where the `ModifyDBInstance` API call includes a new `masterUserPassword` parameter. This activity is significant because unauthorized password resets can grant attackers access to sensitive data stored in production databases, such as credit card information, PII, and healthcare data. If confirmed malicious, this co
author: Patrick Bareiss, Splunk
logsource:
  product: aws
  category: authentication
detection:
  selection:
    operation:
      - ModifyDBInstance
      - ModifyDBCluster
  condition: selection
tags:
  - attack.t1110
  - attack.t1586.003
references:
  - https://aws.amazon.com/premiumsupport/knowledge-center/reset-master-user-password-rds
custom_attributes:
  original_rule_id: d15e9bd9-ef64-4d84-bc04-f62955a9fee8
  source_format: splunk_spl