title: ASL AWS Network Access Control List Deleted
id: a32cb96a-f08d-58d6-b7f9-82b4b62dcf31
status: stable
level: medium
description: |
  The following analytic detects the deletion of AWS Network Access Control Lists (ACLs). It leverages AWS CloudTrail logs to identify events where a user deletes a network ACL entry. This activity is significant because deleting a network ACL can remove critical access restrictions, potentially allowing unauthorized access to cloud instances. If confirmed malicious, this action could enable attackers to bypass network security controls, leading to unauthorized access, data exfiltration, or furthe
author: Patrick Bareiss, Splunk
logsource:
  product: aws
  category: network_connection
detection:
  selection:
    operation: DeleteNetworkAclEntry
    status: Success
    path:
      - egress
      - networkAclId
    output:
      - egress
      - networkAclId
    egress: 'false'
  condition: selection
tags:
  - attack.t1562.007
custom_attributes:
  original_rule_id: e010ddf5-e9a5-44e5-bdd6-0c919ba8fc8b
  source_format: splunk_spl