title: ASL AWS Concurrent Sessions From Different Ips
id: 9fd3b9b7-a0e6-5235-83cc-3ed6d5240dd0
status: stable
level: medium
description: |
  The following analytic identifies an AWS IAM account with concurrent sessions originating from more than one unique IP address within a 5-minute span. This detection leverages AWS CloudTrail logs, specifically the `DescribeEventAggregates` API call, to identify multiple IP addresses associated with the same user session. This behavior is significant as it may indicate a session hijacking attack, where an adversary uses stolen session cookies to access AWS resources from a different location. If 
author: Patrick Bareiss, Splunk
logsource:
  product: aws
detection:
  selection:
    operation: DescribeEventAggregates
    span: 5m
  filter:
    domain: AWS Internal
  condition: selection and not filter
tags:
  - attack.t1185
references:
  - https://attack.mitre.org/techniques/T1185/
  - https://breakdev.org/evilginx-2-next-generation-of-phishing-2fa-tokens/
  - https://github.com/kgretzky/evilginx2
custom_attributes:
  original_rule_id: b3424bbe-3204-4469-887b-ec144483a336
  source_format: splunk_spl