title: ASL AWS Defense Evasion Delete Cloudtrail
id: 8a1aa4e5-567c-56ff-9955-06465861a036
status: stable
level: high
description: |
  The following analytic detects AWS `DeleteTrail` events within CloudTrail logs. It leverages Amazon Security Lake logs parsed in the Open Cybersecurity Schema Framework (OCSF) format to identify when a CloudTrail is deleted. This activity is significant because adversaries may delete CloudTrail logs to evade detection and operate with stealth. If confirmed malicious, this action could allow attackers to cover their tracks, making it difficult to trace their activities and investigate other poten
author: Patrick Bareiss, Splunk
logsource:
  product: aws
  category: file_event
detection:
  selection:
    operation: DeleteTrail
  condition: selection
tags:
  - attack.t1562.008
references:
  - https://attack.mitre.org/techniques/T1562/008/
custom_attributes:
  original_rule_id: 1f0b47e5-0134-43eb-851c-e3258638945e
  source_format: splunk_spl