title: ASL AWS SAML Update identity provider
id: c92ce424-3670-5087-bcb3-08ae2e8f9591
status: stable
level: high
description: |
  The following analytic detects updates to the SAML provider in AWS. It leverages AWS CloudTrail logs to identify the `UpdateSAMLProvider` event, analyzing fields such as `sAMLProviderArn`, `sourceIPAddress`, and `userIdentity` details. Monitoring updates to the SAML provider is crucial as it may indicate a perimeter compromise of federated credentials or unauthorized backdoor access set by an attacker. If confirmed malicious, this activity could allow attackers to manipulate identity federation,
author: Patrick Bareiss, Splunk
logsource:
  product: aws
detection:
  selection:
    operation: UpdateSAMLProvider
  condition: selection
tags:
  - attack.t1078
references:
  - https://www.cisa.gov/uscert/ncas/alerts/aa21-008a
  - https://www.splunk.com/en_us/blog/security/a-golden-saml-journey-solarwinds-continued.html
  - https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/wp-m-unc2452-2021-000343-01.pdf
  - https://www.cyberark.com/resources/threat-research-blog/golden-saml-newly-discovered-attack-technique-forges-authentication-to-cloud-apps
custom_attributes:
  original_rule_id: 635c26cc-0fd1-4098-8ec9-824bf9544b11
  source_format: splunk_spl