title: ASL AWS ECR Container Upload Outside Business Hours
id: 3e76afaf-a938-5e07-9e0d-d9ae1ca90e0d
status: stable
level: medium
description: |
  The following analytic detects the upload of new containers to AWS Elastic Container Service (ECR) outside of standard business hours through AWS CloudTrail events. It identifies this behavior by monitoring for `PutImage` events occurring before 8 AM or after 8 PM, as well as any uploads on weekends. This activity is significant for a SOC to investigate as it may indicate unauthorized access or malicious deployments, potentially leading to compromised services or data breaches. Identifying and a
author: Patrick Bareiss, Splunk
logsource:
  product: aws
detection:
  selection:
    operation: PutImage
    weekday:
      - Saturday
      - Sunday
  condition: selection
tags:
  - attack.t1204.003
references:
  - https://attack.mitre.org/techniques/T1204/003/
custom_attributes:
  original_rule_id: 739ed682-27e9-4ba0-80e5-a91b97698213
  source_format: splunk_spl