title: ASL AWS Disable Bucket Versioning
id: ccaf1a12-425c-55c8-b65e-6610f175427e
status: stable
level: medium
description: |
  The following analytic detects when AWS S3 bucket versioning is suspended by a user. It leverages AWS CloudTrail logs to identify `PutBucketVersioning` events with the `VersioningConfiguration.Status` set to `Suspended`. This activity is significant because disabling versioning can prevent recovery of deleted or modified data, which is a common tactic in ransomware attacks. If confirmed malicious, this action could lead to data loss and hinder recovery efforts, severely impacting data integrity 
author: Patrick Bareiss, Splunk
logsource:
  product: aws
detection:
  selection:
    operation: PutBucketVersioning
    output:
      - Status
      - bucketName
    path: bucketName
    status: Suspended
  condition: selection
tags:
  - attack.t1490
references:
  - https://invictus-ir.medium.com/ransomware-in-the-cloud-7f14805bbe82
  - https://bleemb.medium.com/data-exfiltration-with-native-aws-s3-features-c94ae4d13436
custom_attributes:
  original_rule_id: f32598bb-fa5f-4afd-8ab3-0263cc28efbc
  source_format: splunk_spl