title: ASL AWS EC2 Snapshot Shared Externally
id: 12c10c56-0428-50b0-993c-c78bd6fba8bd
status: stable
level: high
description: |
  The following analytic detects when an EC2 snapshot is shared publicly by analyzing AWS CloudTrail events. This detection method leverages CloudTrail logs to identify modifications in snapshot permissions, specifically when the snapshot is shared outside the originating AWS account. This activity is significant as it may indicate an attempt to exfiltrate sensitive data stored in the snapshot. If confirmed malicious, an attacker could gain unauthorized access to the snapshot's data, potentially l
author: Patrick Bareiss, Splunk
logsource:
  product: aws
detection:
  selection:
    operation: ModifySnapshotAttribute
    output: group
    group: all
  condition: selection
tags:
  - attack.t1537
references:
  - https://labs.nettitude.com/blog/how-to-exfiltrate-aws-ec2-data/
  - https://stratus-red-team.cloud/attack-techniques/AWS/aws.exfiltration.ec2-share-ebs-snapshot/
  - https://hackingthe.cloud/aws/enumeration/loot_public_ebs_snapshots/
custom_attributes:
  original_rule_id: 00af8f7f-e004-446b-9bba-2732f717ae27
  source_format: splunk_spl