title: ASL AWS Create Access Key
id: 077e44f3-e189-5c53-95ff-7fbe085ad673
status: stable
level: low
description: |
  The following analytic identifies the creation of AWS IAM access keys by a user for another user, which can indicate privilege escalation. It leverages AWS CloudTrail logs to detect instances where the user creating the access key is different from the user for whom the key is created. This activity is significant because unauthorized access key creation can allow attackers to establish persistence or exfiltrate data via AWS APIs. If confirmed malicious, this could lead to unauthorized access to
author: Patrick Bareiss, Splunk
logsource:
  product: aws
  category: file_event
detection:
  selection:
    operation: CreateAccessKey
  condition: selection
tags:
  - attack.t1136.003
references:
  - https://bishopfox.com/blog/privilege-escalation-in-aws
  - https://rhinosecuritylabs.com/aws/aws-privilege-escalation-methods-mitigation-part-2/
custom_attributes:
  original_rule_id: 81a9f2fe-1697-473c-af1d-086b0d8b63c8
  source_format: splunk_spl