title: ASL AWS Defense Evasion PutBucketLifecycle
id: 9b9f7748-6eb4-5407-a57e-43198b197ec6
status: stable
level: low
description: |
  The following analytic detects `PutBucketLifecycle` events in AWS CloudTrail logs where a user sets a lifecycle rule for an S3 bucket with an expiration period of fewer than three days. This detection leverages CloudTrail logs to identify suspicious lifecycle configurations. This activity is significant because attackers may use it to delete CloudTrail logs quickly, thereby evading detection and impairing forensic investigations. If confirmed malicious, this could allow attackers to cover their 
author: Patrick Bareiss, Splunk
logsource:
  product: aws
detection:
  selection:
    operation: PutBucketLifecycle
    output: NoncurrentDays
  condition: selection
tags:
  - attack.t1485.001
  - attack.t1562.008
references:
  - https://stratus-red-team.cloud/attack-techniques/AWS/aws.defense-evasion.cloudtrail-lifecycle-rule/
custom_attributes:
  original_rule_id: 986565a2-7707-48ea-9590-37929cebc938
  source_format: splunk_spl