title: ASL AWS UpdateLoginProfile
id: 75e2bfad-4ea3-5b5d-80ec-0206aaf209af
status: stable
level: high
description: |
  The following analytic detects an AWS CloudTrail event where a user with permissions updates the login profile of another user. It leverages CloudTrail logs to identify instances where the user making the change is different from the user whose profile is being updated. This activity is significant because it can indicate privilege escalation attempts, where an attacker uses a compromised account to gain higher privileges. If confirmed malicious, this could allow the attacker to escalate their p
author: Patrick Bareiss, Splunk
logsource:
  product: aws
  category: file_event
detection:
  selection:
    operation: UpdateLoginProfile
  condition: selection
tags:
  - attack.t1136.003
references:
  - https://bishopfox.com/blog/privilege-escalation-in-aws
  - https://rhinosecuritylabs.com/aws/aws-privilege-escalation-methods-mitigation-part-2/
custom_attributes:
  original_rule_id: 5b3f63a3-865b-4637-9941-f98bd1a50c0d
  source_format: splunk_spl