title: ASL AWS IAM Delete Policy
id: 6db5e2ae-e65c-5984-b7cf-64f3e1bacf4b
status: stable
level: low
description: |
  The following analytic identifies when a policy is deleted in AWS. It leverages Amazon Security Lake logs to detect the DeletePolicy API operation. Monitoring policy deletions is crucial as it can indicate unauthorized attempts to weaken security controls. If confirmed malicious, this activity could allow an attacker to remove critical security policies, potentially leading to privilege escalation or unauthorized access to sensitive resources.
author: Patrick Bareiss, Splunk
logsource:
  product: aws
  category: file_event
detection:
  selection:
    operation: DeletePolicy
  condition: selection
tags:
  - attack.t1098
references:
  - https://docs.aws.amazon.com/IAM/latest/APIReference/API_DeletePolicy.html
  - https://docs.aws.amazon.com/cli/latest/reference/iam/delete-policy.html
custom_attributes:
  original_rule_id: 609ced68-d420-4ff7-8164-ae98b4b4018c
  source_format: splunk_spl