title: ASL AWS IAM Failure Group Deletion
id: 9a3d4baf-29cd-5d28-85fa-ce44649cce04
status: stable
level: medium
description: |
  The following analytic detects failed attempts to delete AWS IAM groups, triggered by access denial, conflicts, or non-existent groups. It operates by monitoring CloudTrail logs for specific error codes related to deletion failures. This behavior is significant for a SOC as it may indicate unauthorized attempts to modify access controls or disrupt operations by removing groups. Such actions could be part of a larger attack aiming to escalate privileges or impair security protocols. Identifying t
author: Patrick Bareiss, Splunk
logsource:
  product: aws
detection:
  selection:
    operation: DeleteGroup
    status: Failure
  condition: selection
tags:
  - attack.t1098
references:
  - https://awscli.amazonaws.com/v2/documentation/api/latest/reference/iam/delete-group.html
  - https://docs.aws.amazon.com/IAM/latest/APIReference/API_DeleteGroup.html
custom_attributes:
  original_rule_id: 8d12f268-c567-4557-9813-f8389e235c06
  source_format: splunk_spl