title: ASL AWS Credential Access GetPasswordData
id: 5b26dd17-11b9-59ac-8d66-d5951b025534
status: stable
level: medium
description: |
  The following analytic identifiesGetPasswordData API calls in your AWS account. It leverages  CloudTrail logs from Amazon Security Lake to detect this activity by counting the distinct instance IDs accessed. This behavior is significant as it may indicate an attempt to retrieve encrypted administrator passwords for running Windows instances, which is a critical security concern. If confirmed malicious, attackers could gain unauthorized access to administrative credentials, potentially leading to
author: Patrick Bareiss, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    operation: GetPasswordData
  condition: selection
tags:
  - attack.t1110.001
  - attack.t1586.003
references:
  - https://attack.mitre.org/techniques/T1552/
  - https://stratus-red-team.cloud/attack-techniques/AWS/aws.credential-access.ec2-get-password-data/
custom_attributes:
  original_rule_id: a79b607a-50cc-4704-bb9d-eff280cb78c2
  source_format: splunk_spl