title: ASL AWS IAM Assume Role Policy Brute Force
id: 2069cf0d-7018-5dc4-b3b1-70dcd13e2e64
status: stable
level: high
description: |
  The following analytic detects multiple failed attempts to assume an AWS IAM role, indicating a potential brute force attack. It leverages AWS CloudTrail logs to identify `MalformedPolicyDocumentException` errors with a status of `failure` and filters out legitimate AWS services. This activity is significant as repeated failures to assume roles can indicate an adversary attempting to guess role names, which is a precursor to unauthorized access. If confirmed malicious, this could lead to unautho
author: Patrick Bareiss, Splunk
logsource:
  product: aws
detection:
  selection:
    operation: AssumeRole
    span: 1h
  condition: selection
tags:
  - attack.t1580
  - attack.t1110
references:
  - https://www.praetorian.com/blog/aws-iam-assume-role-vulnerabilities/
  - https://rhinosecuritylabs.com/aws/assume-worst-aws-assume-role-enumeration/
  - https://www.elastic.co/guide/en/security/current/aws-iam-brute-force-of-assume-role-policy.html
custom_attributes:
  original_rule_id: 726959fe-316d-445c-a584-fa187d64e295
  source_format: splunk_spl