title: Attacker Tools On Endpoint
id: c5ec3a32-8171-5384-b3e1-7fe6f3b3a6f5
status: stable
level: high
description: |
  The following analytic detects the execution of tools commonly exploited by cybercriminals, such as those used for unauthorized access, network scanning, or data exfiltration. It leverages process activity data from Endpoint Detection and Response (EDR) agents, focusing on known attacker tool names. This activity is significant because it serves as an early warning system for potential security incidents, enabling prompt response. If confirmed malicious, this activity could lead to unauthorized 
author: Bhavin Patel, Splunk, sventec, Github Community
logsource:
  product: splunk
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1003
  - attack.t1036.005
  - attack.t1595
custom_attributes:
  original_rule_id: a51bfe1a-94f0-48cc-b4e4-16a110145893
  source_format: splunk_spl