title: AWS UpdateLoginProfile
id: 3d352695-b1ca-55d1-ac78-14b30fd86e1f
status: stable
level: high
description: |
  The following analytic detects an AWS CloudTrail event where a user with permissions updates the login profile of another user. It leverages CloudTrail logs to identify instances where the user making the change is different from the user whose profile is being updated. This activity is significant because it can indicate privilege escalation attempts, where an attacker uses a compromised account to gain higher privileges. If confirmed malicious, this could allow the attacker to escalate their p
author: Bhavin Patel, Splunk
logsource:
  product: aws
  category: file_event
detection:
  selection:
    eventname: UpdateLoginProfile
    errorcode: success
    match: 0
  condition: selection
tags:
  - attack.t1136.003
references:
  - https://bishopfox.com/blog/privilege-escalation-in-aws
  - https://rhinosecuritylabs.com/aws/aws-privilege-escalation-methods-mitigation-part-2/
custom_attributes:
  original_rule_id: 2a9b80d3-6a40-4115-11ad-212bf3d0d111
  source_format: splunk_spl