title: AWS Bedrock Delete Knowledge Base
id: e8c397a8-2d50-51e8-8f0d-aafaa76561ea
status: stable
level: high
description: |
  The following analytic identifies attempts to delete AWS Bedrock Knowledge Bases, which are resources that store and manage domain-specific information for AI models. It monitors AWS CloudTrail logs for DeleteKnowledgeBase API calls. This activity could indicate an adversary attempting to remove knowledge bases after compromising credentials, potentially to disrupt business operations or remove traces of data access. Deleting knowledge bases could impact model performance, remove critical busine
author: Bhavin Patel, Splunk
logsource:
  product: aws
  category: file_event
detection:
  selection:
    eventname: DeleteKnowledgeBase
  condition: selection
tags:
  - attack.t1485
references:
  - https://www.sumologic.com/blog/defenders-guide-to-aws-bedrock/
  - https://attack.mitre.org/techniques/T1562/
custom_attributes:
  original_rule_id: 8b4e3d62-f743-11ee-9f6e-acde48001123
  source_format: splunk_spl