title: AWS Credential Access GetPasswordData
id: c5086c52-e88c-572b-be80-055d09069199
status: stable
level: medium
description: |
  The following analytic identifies more than 10 GetPasswordData API calls within a 5-minute window in your AWS account. It leverages AWS CloudTrail logs to detect this activity by counting the distinct instance IDs accessed. This behavior is significant as it may indicate an attempt to retrieve encrypted administrator passwords for running Windows instances, which is a critical security concern. If confirmed malicious, attackers could gain unauthorized access to administrative credentials, potent
author: Bhavin Patel, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    eventname: GetPasswordData
    span: 5m
  condition: selection
tags:
  - attack.t1110.001
  - attack.t1586.003
references:
  - https://attack.mitre.org/techniques/T1552/
  - https://stratus-red-team.cloud/attack-techniques/AWS/aws.credential-access.ec2-get-password-data/
custom_attributes:
  original_rule_id: 4d347c4a-306e-41db-8d10-b46baf71b3e2
  source_format: splunk_spl