title: AWS Unusual Number of Failed Authentications From Ip
id: a402f2fb-3487-523b-9f0a-0f056f0acf4f
status: stable
level: medium
description: |
  The following analytic identifies a single source IP failing to authenticate into the AWS Console with multiple valid users. It uses CloudTrail logs and calculates the standard deviation for source IP, leveraging the 3-sigma rule to detect unusual numbers of failed authentication attempts. This behavior is significant as it may indicate a Password Spraying attack, where an adversary attempts to gain initial access or elevate privileges. If confirmed malicious, this activity could lead to unautho
author: Bhavin Patel, Splunk
logsource:
  product: aws
  category: authentication
detection:
  selection:
    eventname: ConsoleLogin
    action: failure
    span: 10m
    isoutlier: 1
  condition: selection
tags:
  - attack.t1110.003
  - attack.t1110.004
  - attack.t1586.003
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://www.whiteoaksecurity.com/blog/goawsconsolespray-password-spraying-tool/
  - https://softwaresecuritydotblog.wordpress.com/2019/09/28/how-to-protect-against-credential-stuffing-on-aws/
custom_attributes:
  original_rule_id: 0b5c9c2b-e2cb-4831-b4f1-af125ceb1386
  source_format: splunk_spl