title: AWS CreateAccessKey
id: c3ffa848-3298-5a18-a782-2c7d7af73fb3
status: stable
level: low
description: |
  The following analytic identifies the creation of AWS IAM access keys by a user for another user, which can indicate privilege escalation. It leverages AWS CloudTrail logs to detect instances where the user creating the access key is different from the user for whom the key is created. This activity is significant because unauthorized access key creation can allow attackers to establish persistence or exfiltrate data via AWS APIs. If confirmed malicious, this could lead to unauthorized access to
author: Bhavin Patel, Splunk
logsource:
  product: aws
  category: file_event
detection:
  selection:
    eventname: CreateAccessKey
    errorcode: success
    match: 0
  condition: selection
tags:
  - attack.t1136.003
references:
  - https://bishopfox.com/blog/privilege-escalation-in-aws
  - https://rhinosecuritylabs.com/aws/aws-privilege-escalation-methods-mitigation-part-2/
custom_attributes:
  original_rule_id: 2a9b80d3-6340-4345-11ad-212bf3d0d111
  source_format: splunk_spl