title: AWS Credential Access RDS Password reset
id: c71b1efe-142d-59dd-87f8-06c989388179
status: stable
level: high
description: |
  The following analytic detects the resetting of the master user password for an Amazon RDS DB instance. It leverages AWS CloudTrail logs to identify events where the `ModifyDBInstance` API call includes a new `masterUserPassword` parameter. This activity is significant because unauthorized password resets can grant attackers access to sensitive data stored in production databases, such as credit card information, PII, and healthcare data. If confirmed malicious, this could lead to data breaches,
author: Gowthamaraj Rajendran, Splunk
logsource:
  product: aws
  category: authentication
detection:
  selection:
    eventsource: rds.amazonaws.com
    eventname: ModifyDBInstance
  condition: selection
tags:
  - attack.t1110
  - attack.t1586.003
references:
  - https://aws.amazon.com/premiumsupport/knowledge-center/reset-master-user-password-rds
custom_attributes:
  original_rule_id: 6153c5ea-ed30-4878-81e6-21ecdb198189
  source_format: splunk_spl