title: AWS ECR Container Upload Unknown User
id: 92679dce-c735-5490-9ea5-8c01428057e9
status: stable
level: medium
description: |
  The following analytic detects the upload of a new container image to AWS Elastic Container Registry (ECR) by an unknown user. It leverages AWS CloudTrail logs to identify `PutImage` events from the ECR service, filtering out known users. This activity is significant because container uploads should typically be performed by a limited set of authorized users. If confirmed malicious, this could indicate unauthorized access, potentially leading to the deployment of malicious containers, data exfil
author: Patrick Bareiss, Splunk
logsource:
  product: windows
detection:
  selection:
    eventname: PutImage
  condition: selection
tags:
  - attack.t1204.003
references:
  - https://attack.mitre.org/techniques/T1204/003/
custom_attributes:
  original_rule_id: 300688e4-365c-4486-a065-7c884462b31d
  source_format: splunk_spl