title: AWS Disable Bucket Versioning
id: 83e08269-a582-56d8-8304-5c701fee0c26
status: stable
level: medium
description: |
  The following analytic detects when AWS S3 bucket versioning is suspended by a user. It leverages AWS CloudTrail logs to identify `PutBucketVersioning` events with the `VersioningConfiguration.Status` set to `Suspended`. This activity is significant because disabling versioning can prevent recovery of deleted or modified data, which is a common tactic in ransomware attacks. If confirmed malicious, this action could lead to data loss and hinder recovery efforts, severely impacting data integrity 
author: Bhavin Patel, Splunk
logsource:
  product: aws
detection:
  selection:
    eventname: PutBucketVersioning
  condition: selection
tags:
  - attack.t1490
references:
  - https://invictus-ir.medium.com/ransomware-in-the-cloud-7f14805bbe82
  - https://bleemb.medium.com/data-exfiltration-with-native-aws-s3-features-c94ae4d13436
custom_attributes:
  original_rule_id: 657902a9-987d-4879-a1b2-e7a65512824b
  source_format: splunk_spl