title: AWS IAM Assume Role Policy Brute Force
id: f6daf522-1e70-5a85-b6b7-cd1a19356fc6
status: stable
level: high
description: |
  The following analytic detects multiple failed attempts to assume an AWS IAM role, indicating a potential brute force attack. It leverages AWS CloudTrail logs to identify `MalformedPolicyDocumentException` errors with a status of `failure` and filters out legitimate AWS services. This activity is significant as repeated failures to assume roles can indicate an adversary attempting to guess role names, which is a precursor to unauthorized access. If confirmed malicious, this could lead to unautho
author: Michael Haag, Splunk
logsource:
  product: aws
detection:
  selection:
    status: failure
  condition: selection
tags:
  - attack.t1580
  - attack.t1110
references:
  - https://www.praetorian.com/blog/aws-iam-assume-role-vulnerabilities/
  - https://rhinosecuritylabs.com/aws/assume-worst-aws-assume-role-enumeration/
  - https://www.elastic.co/guide/en/security/current/aws-iam-brute-force-of-assume-role-policy.html
custom_attributes:
  original_rule_id: f19e09b0-9308-11eb-b7ec-acde48001122
  source_format: splunk_spl