title: AWS Defense Evasion Delete CloudWatch Log Group
id: e7121b6a-81ed-5319-ac01-c8e6dbe4b734
status: stable
level: high
description: |
  The following analytic detects the deletion of CloudWatch log groups in AWS, identified through `DeleteLogGroup` events in CloudTrail logs. This detection leverages CloudTrail data to monitor for successful log group deletions, excluding console-based actions. This activity is significant as it indicates potential attempts to evade logging and monitoring, which is crucial for maintaining visibility into AWS activities. If confirmed malicious, this could allow attackers to hide their tracks, maki
author: Gowthamaraj Rajendran, Splunk
logsource:
  product: aws
  category: file_event
detection:
  selection:
    eventname: DeleteLogGroup
    errorcode: success
  condition: selection
tags:
  - attack.t1562.008
references:
  - https://attack.mitre.org/techniques/T1562/008/
custom_attributes:
  original_rule_id: d308b0f1-edb7-4a62-a614-af321160710f
  source_format: splunk_spl