title: AWS Bedrock High Number List Foundation Model Failures
id: 41cd744d-ad60-5ebc-a029-47ac6ea24aff
status: stable
level: high
description: |
  The following analytic identifies an high number of AccessDenied attempts to list AWS Bedrock foundation models. It leverages AWS CloudTrail logs to detect when a user or service experiences multiple failures when calling the ListFoundationModels API. This activity is significant as it may indicate an adversary performing reconnaissance of available AI models after compromising credentials with limited permissions. Repeated failures could suggest brute force attempts to enumerate accessible reso
author: Bhavin Patel, Splunk
logsource:
  product: aws
detection:
  selection:
    eventname: ListFoundationModels
    errorcode: AccessDenied
  condition: selection
tags:
  - attack.t1580
references:
  - https://docs.aws.amazon.com/bedrock/latest/APIReference/API_ListFoundationModels.html
  - https://trustoncloud.com/blog/exposing-the-weakness-how-we-identified-a-flaw-in-bedrocks-foundation-model-access-control/
  - https://attack.mitre.org/techniques/T1595/
custom_attributes:
  original_rule_id: e84b3c74-f742-11ee-9f6e-acde48001122
  source_format: splunk_spl