title: AWS Password Policy Changes
id: 43370ce4-ecd3-5006-a6c9-d3a0e3cf8680
status: stable
level: low
description: |
  The following analytic detects successful API calls to view, update, or delete the password policy in an AWS organization. It leverages AWS CloudTrail logs to identify events such as "UpdateAccountPasswordPolicy," "GetAccountPasswordPolicy," and "DeleteAccountPasswordPolicy." This activity is significant because it is uncommon for regular users to perform these actions, and such changes can indicate an adversary attempting to understand or weaken password defenses. If confirmed malicious, this c
author: Bhavin Patel, Splunk
logsource:
  product: aws
  category: authentication
detection:
  selection:
    errorcode: success
    eventname:
      - UpdateAccountPasswordPolicy
      - GetAccountPasswordPolicy
      - DeleteAccountPasswordPolicy
  condition: selection
tags:
  - attack.t1201
references:
  - https://www.trendmicro.com/cloudoneconformity/knowledge-base/aws/IAM/password-policy.html
custom_attributes:
  original_rule_id: aee4a575-7064-4e60-b511-246f9baf9895
  source_format: splunk_spl