title: AWS Defense Evasion PutBucketLifecycle
id: f448225c-6020-5eb3-830d-8b046aaae123
status: stable
level: low
description: |
  The following analytic detects `PutBucketLifecycle` events in AWS CloudTrail logs where a user sets a lifecycle rule for an S3 bucket with an expiration period of fewer than three days. This detection leverages CloudTrail logs to identify suspicious lifecycle configurations. This activity is significant because attackers may use it to delete CloudTrail logs quickly, thereby evading detection and impairing forensic investigations. If confirmed malicious, this could allow attackers to cover their 
author: Bhavin Patel
logsource:
  product: aws
detection:
  selection:
    eventname: PutBucketLifecycle
    user_type: IAMUser
    errorcode: success
    output:
      - expiration_days
      - bucket_name
  condition: selection
tags:
  - attack.t1485.001
  - attack.t1562.008
references:
  - https://stratus-red-team.cloud/attack-techniques/AWS/aws.defense-evasion.cloudtrail-lifecycle-rule/
custom_attributes:
  original_rule_id: ce1c0e2b-9303-4903-818b-0d9002fc6ea4
  source_format: splunk_spl