title: AWS High Number Of Failed Authentications From Ip
id: 5b58b45f-5140-5228-b3bb-9b9a7dd92c41
status: stable
level: medium
description: |
  The following analytic detects an IP address with 20 or more failed authentication attempts to the AWS Web Console within a 5-minute window. This detection leverages CloudTrail logs, aggregating failed login events by IP address and time span. This activity is significant as it may indicate a brute force attack aimed at gaining unauthorized access or escalating privileges within an AWS environment. If confirmed malicious, this could lead to unauthorized access, data breaches, or further exploita
author: Bhavin Patel, Splunk
logsource:
  product: aws
  category: authentication
detection:
  selection:
    eventname: ConsoleLogin
    action: failure
    span: 10m
  condition: selection
tags:
  - attack.t1110.003
  - attack.t1110.004
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://www.whiteoaksecurity.com/blog/goawsconsolespray-password-spraying-tool/
  - https://softwaresecuritydotblog.wordpress.com/2019/09/28/how-to-protect-against-credential-stuffing-on-aws/
custom_attributes:
  original_rule_id: f75b7f1a-b8eb-4975-a214-ff3e0a944757
  source_format: splunk_spl