title: AWS Multiple Failed MFA Requests For User
id: 5be119e5-e60c-539a-9200-0d6c53f7df59
status: stable
level: medium
description: |
  The following analytic identifies multiple failed multi-factor authentication (MFA) requests to an AWS Console for a single user. It leverages AWS CloudTrail logs, specifically the `additionalEventData` field, to detect more than 10 failed MFA prompts within 5 minutes. This activity is significant as it may indicate an adversary attempting to bypass MFA by bombarding the user with repeated authentication requests. If confirmed malicious, this could lead to unauthorized access to the AWS environm
author: Bhavin Patel
logsource:
  product: aws
detection:
  selection:
    errormessage: Failed authentication
    eventname: ConsoleLogin
    span: 5m
  condition: selection
tags:
  - attack.t1586.003
  - attack.t1621
references:
  - https://attack.mitre.org/techniques/T1621/
  - https://aws.amazon.com/what-is/mfa/
custom_attributes:
  original_rule_id: 1fece617-e614-4329-9e61-3ba228c0f353
  source_format: splunk_spl