title: AWS New MFA Method Registered For User
id: 812eb60f-6f7c-5649-b28c-d76968b7c761
status: stable
level: high
description: |
  The following analytic detects the registration of a new Multi-Factor Authentication (MFA) method for an AWS account. It leverages AWS CloudTrail logs to identify the `CreateVirtualMFADevice` event. This activity is significant because adversaries who gain unauthorized access to an AWS account may register a new MFA method to maintain persistence. If confirmed malicious, this could allow attackers to secure their access, making it difficult to detect and remove their presence, potentially leadin
author: Bhavin Patel, Splunk
logsource:
  product: aws
detection:
  selection:
    eventname: CreateVirtualMFADevice
  condition: selection
tags:
  - attack.t1556.006
references:
  - https://aws.amazon.com/blogs/security/you-can-now-assign-multiple-mfa-devices-in-iam/
  - https://attack.mitre.org/techniques/T1556/
  - https://attack.mitre.org/techniques/T1556/006/
  - https://twitter.com/jhencinski/status/1618660062352007174
custom_attributes:
  original_rule_id: 4e3c26f2-4fb9-4bd7-ab46-1b76ffa2a23b
  source_format: splunk_spl