title: AWS ECR Container Scanning Findings Low Informational Unknown
id: 181ed248-715f-56ec-944f-f3dc0a9fc674
status: stable
level: medium
description: |
  The following analytic identifies low, informational, or unknown severity findings from AWS Elastic Container Registry (ECR) image scans. It leverages AWS CloudTrail logs, specifically the DescribeImageScanFindings event, to detect these findings. This activity is significant for a SOC as it helps in early identification of potential vulnerabilities or misconfigurations in container images, which could be exploited if left unaddressed. If confirmed malicious, these findings could lead to unautho
author: Patrick Bareiss, Eric McGinnis Splunk
logsource:
  product: windows
detection:
  selection:
    eventname: DescribeImageScanFindings
    output: findings
    input: findings
    severity:
      - LOW
      - INFORMATIONAL
      - UNKNOWN
  condition: selection
tags:
  - attack.t1204.003
references:
  - https://docs.aws.amazon.com/AmazonECR/latest/userguide/image-scanning.html
custom_attributes:
  original_rule_id: cbc95e44-7c22-443f-88fd-0424478f5589
  source_format: splunk_spl