title: AWS Exfiltration via EC2 Snapshot
id: a2f7715d-2de5-59c7-a077-1c43a8a2dcd7
status: stable
level: high
description: |
  The following analytic detects a series of AWS API calls related to EC2 snapshots within a short time window, indicating potential exfiltration via EC2 Snapshot modifications. It leverages AWS CloudTrail logs to identify actions such as creating, describing, and modifying snapshot attributes. This activity is significant as it may indicate an attacker attempting to exfiltrate data by sharing EC2 snapshots externally. If confirmed malicious, the attacker could gain access to sensitive information
author: Bhavin Patel, Splunk
logsource:
  product: aws
detection:
  selection:
    span: 5m
    eventname:
      - CreateSnapshot
      - DescribeSnapshotAttribute
      - ModifySnapshotAttribute
      - DeleteSnapshot
  filter:
    src_ip: guardduty.amazonaws.com
  condition: selection and not filter
tags:
  - attack.t1537
references:
  - https://labs.nettitude.com/blog/how-to-exfiltrate-aws-ec2-data/
  - https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_ModifySnapshotAttribute.html
  - https://bleemb.medium.com/data-exfiltration-with-native-aws-s3-features-c94ae4d13436
  - https://stratus-red-team.cloud/attack-techniques/list/
custom_attributes:
  original_rule_id: ac90b339-13fc-4f29-a18c-4abbba1f2171
  source_format: splunk_spl