title: AWS AMI Attribute Modification for Exfiltration
id: 481fcdaa-65b8-5d15-bdc7-52902458bef2
status: stable
level: high
description: |
  The following analytic detects suspicious modifications to AWS AMI attributes, such as sharing an AMI with another AWS account or making it publicly accessible. It leverages AWS CloudTrail logs to identify these changes by monitoring specific API calls. This activity is significant because adversaries can exploit these modifications to exfiltrate sensitive data stored in AWS resources. If confirmed malicious, this could lead to unauthorized access and potential data breaches, compromising the co
author: Bhavin Patel, Splunk
logsource:
  product: aws
detection:
  selection:
    eventname: ModifyImageAttribute
  condition: selection
tags:
  - attack.t1537
references:
  - https://labs.nettitude.com/blog/how-to-exfiltrate-aws-ec2-data/
  - https://stratus-red-team.cloud/attack-techniques/AWS/aws.exfiltration.ec2-share-ami/
  - https://hackingthe.cloud/aws/enumeration/loot_public_ebs_snapshots/
custom_attributes:
  original_rule_id: f2132d74-cf81-4c5e-8799-ab069e67dc9f
  source_format: splunk_spl