title: AWS S3 Exfiltration Behavior Identified
id: 3a12f7a2-0a57-58d4-950f-e42fcd27cf08
status: stable
level: medium
description: |
  The following analytic identifies potential AWS S3 exfiltration behavior by correlating multiple risk events related to Collection and Exfiltration techniques. It leverages risk events from AWS sources, focusing on instances where two or more unique analytics and distinct MITRE ATT&CK IDs are triggered for a specific risk object. This activity is significant as it may indicate an ongoing data exfiltration attempt, which is critical for security teams to monitor. If confirmed malicious, this coul
author: Bhavin Patel, Splunk
logsource:
  product: aws
detection:
  selection:
    mitre_tactic:
      - collection
      - exfiltration
  condition: selection
tags:
  - attack.t1537
references:
  - https://labs.nettitude.com/blog/how-to-exfiltrate-aws-ec2-data/
  - https://stratus-red-team.cloud/attack-techniques/AWS/aws.exfiltration.ec2-share-ebs-snapshot/
  - https://hackingthe.cloud/aws/enumeration/loot_public_ebs_snapshots/
custom_attributes:
  original_rule_id: 85096389-a443-42df-b89d-200efbb1b560
  source_format: splunk_spl