title: AWS Credential Access Failed Login
id: 5b08849d-de6c-5df8-adda-98026c55dcf1
status: stable
level: high
description: |
  The following analytic identifies unsuccessful login attempts to the AWS Management Console using a specific user identity. It leverages AWS CloudTrail logs to detect failed authentication events associated with the AWS ConsoleLogin action. This activity is significant for a SOC because repeated failed login attempts may indicate a brute force attack or unauthorized access attempts. If confirmed malicious, an attacker could potentially gain access to AWS account services and resources, leading t
author: Gowthamaraj Rajendran, Bhavin Patel, Splunk
logsource:
  product: aws
  category: authentication
detection:
  selection:
    errormessage: Failed authentication
    eventname: ConsoleLogin
  condition: selection
tags:
  - attack.t1110.001
  - attack.t1586.003
references:
  - https://attack.mitre.org/techniques/T1110/001/
custom_attributes:
  original_rule_id: a19b354d-0d7f-47f3-8ea6-1a7c36434968
  source_format: splunk_spl