title: AWS Successful Single-Factor Authentication
id: 1ff29151-263c-50bb-bb3c-587ed8316e8d
status: stable
level: high
description: |
  The following analytic identifies a successful Console Login authentication event for an AWS IAM user account without Multi-Factor Authentication (MFA) enabled. It leverages AWS CloudTrail logs to detect instances where MFA was not used during login. This activity is significant as it may indicate a misconfiguration, policy violation, or potential account takeover attempt. If confirmed malicious, an attacker could gain unauthorized access to the AWS environment, potentially leading to data exfil
author: Bhavin Patel, Splunk
logsource:
  product: aws
  category: authentication
detection:
  selection:
    eventname: ConsoleLogin
    errorcode: success
  condition: selection
tags:
  - attack.t1078.004
  - attack.t1586.003
references:
  - https://attack.mitre.org/techniques/T1621/
  - https://attack.mitre.org/techniques/T1078/004/
  - https://aws.amazon.com/what-is/mfa/
custom_attributes:
  original_rule_id: a520b1fe-cc9e-4f56-b762-18354594c52f
  source_format: splunk_spl