title: AWS EC2 Snapshot Shared Externally
id: 0264bdb4-f29a-56f6-942c-83100c11aa25
status: stable
level: high
description: |
  The following analytic detects when an EC2 snapshot is shared with an external AWS account by analyzing AWS CloudTrail events. This detection method leverages CloudTrail logs to identify modifications in snapshot permissions, specifically when the snapshot is shared outside the originating AWS account. This activity is significant as it may indicate an attempt to exfiltrate sensitive data stored in the snapshot. If confirmed malicious, an attacker could gain unauthorized access to the snapshot's
author: Bhavin Patel, Splunk
logsource:
  product: aws
detection:
  selection:
    match: No Match
    eventname: ModifySnapshotAttribute
  condition: selection
tags:
  - attack.t1537
references:
  - https://labs.nettitude.com/blog/how-to-exfiltrate-aws-ec2-data/
  - https://stratus-red-team.cloud/attack-techniques/AWS/aws.exfiltration.ec2-share-ebs-snapshot/
  - https://hackingthe.cloud/aws/enumeration/loot_public_ebs_snapshots/
custom_attributes:
  original_rule_id: 2a9b80d3-6340-4345-b5ad-290bf3d222c4
  source_format: splunk_spl