title: AWS SetDefaultPolicyVersion
id: 0e62e085-1bc3-5149-a73e-e074702e3532
status: stable
level: high
description: |
  The following analytic detects when a user sets a default policy version in AWS. It leverages AWS CloudTrail logs to identify the `SetDefaultPolicyVersion` event from the IAM service. This activity is significant because attackers may exploit this technique for privilege escalation, especially if previous policy versions grant more extensive permissions than the current one. If confirmed malicious, this could allow an attacker to gain elevated access to AWS resources, potentially leading to unau
author: Bhavin Patel, Splunk
logsource:
  product: aws
detection:
  selection:
    eventname: SetDefaultPolicyVersion
  condition: selection
tags:
  - attack.t1078.004
references:
  - https://bishopfox.com/blog/privilege-escalation-in-aws
  - https://rhinosecuritylabs.com/aws/aws-privilege-escalation-methods-mitigation-part-2/
custom_attributes:
  original_rule_id: 2a9b80d3-6340-4345-11ad-212bf3d0dac4
  source_format: splunk_spl