title: AWS IAM Failure Group Deletion
id: 1ceb264b-2e06-5195-848d-a99da83e57eb
status: stable
level: medium
description: |
  The following analytic identifies failed attempts to delete AWS IAM groups. It leverages AWS CloudTrail logs to detect events where the DeleteGroup action fails due to errors like NoSuchEntityException, DeleteConflictException, or AccessDenied. This activity is significant as it may indicate unauthorized attempts to modify IAM group configurations, which could be a precursor to privilege escalation or other malicious actions. If confirmed malicious, this could allow an attacker to disrupt IAM po
author: Michael Haag, Splunk
logsource:
  product: aws
detection:
  selection:
    eventname: DeleteGroup
    errorcode:
      - NoSuchEntityException
      - DeleteConflictException
      - AccessDenied
  condition: selection
tags:
  - attack.t1098
references:
  - https://awscli.amazonaws.com/v2/documentation/api/latest/reference/iam/delete-group.html
  - https://docs.aws.amazon.com/IAM/latest/APIReference/API_DeleteGroup.html
custom_attributes:
  original_rule_id: 723b861a-92eb-11eb-93b8-acde48001122
  source_format: splunk_spl