title: AWS Exfiltration via Anomalous GetObject API Activity
id: 368e0c46-2084-54a1-affc-f7033f4ad1bd
status: stable
level: medium
description: |
  The following analytic identifies anomalous GetObject API activity in AWS, indicating potential data exfiltration attempts. It leverages AWS CloudTrail logs and uses the `anomalydetection` command to detect unusual patterns in the frequency of GetObject API calls by analyzing fields such as "count," "user_type," and "user_arn" within a 10-minute window. This activity is significant as it may indicate unauthorized data access or exfiltration from S3 buckets. If confirmed malicious, attackers coul
author: Bhavin Patel, Splunk
logsource:
  product: aws
detection:
  selection:
    eventname: GetObject
    span: 10m
    action: annotate
  condition: selection
tags:
  - attack.t1119
references:
  - https://labs.nettitude.com/blog/how-to-exfiltrate-aws-ec2-data/
  - https://help.splunk.com/en/splunk-enterprise/search/spl-search-reference/9.4/search-commands/anomalydetection
  - https://www.vectra.ai/blogpost/abusing-the-replicator-silently-exfiltrating-data-with-the-aws-s3-replication-service
custom_attributes:
  original_rule_id: e4384bbf-5835-4831-8d85-694de6ad2cc6
  source_format: splunk_spl