title: AWS ECR Container Upload Outside Business Hours
id: 76239218-e276-5326-9eff-1f46624de2f4
status: stable
level: medium
description: |
  The following analytic detects the upload of a new container image to AWS Elastic Container Registry (ECR) outside of standard business hours. It leverages AWS CloudTrail logs to identify `PutImage` events occurring between 8 PM and 8 AM or on weekends. This activity is significant because container uploads outside business hours can indicate unauthorized or suspicious activity, potentially pointing to a compromised account or insider threat. If confirmed malicious, this could allow an attacker 
author: Patrick Bareiss, Splunk
logsource:
  product: windows
detection:
  selection:
    eventname: PutImage
    date_wday:
      - saturday
      - sunday
  condition: selection
tags:
  - attack.t1204.003
references:
  - https://attack.mitre.org/techniques/T1204/003/
custom_attributes:
  original_rule_id: d4c4d4eb-3994-41ca-a25e-a82d64e125bb
  source_format: splunk_spl