title: AWS Detect Users creating keys with encrypt policy without MFA
id: 57090876-bc5c-5b51-be83-928856dd631c
status: stable
level: high
description: |
  The following analytic detects the creation of AWS KMS keys with an encryption policy accessible to everyone, including external entities. It leverages AWS CloudTrail logs to identify `CreateKey` or `PutKeyPolicy` events where the `kms:Encrypt` action is granted to all principals. This activity is significant as it may indicate a compromised account, allowing an attacker to misuse the encryption key to target other organizations. If confirmed malicious, this could lead to unauthorized data encry
author: Rod Soto, Patrick Bareiss Splunk
logsource:
  product: aws
detection:
  selection:
    key_policy_action: 'kms:Encrypt'
    key_policy_principal: '*'
    eventname:
      - CreateKey
      - PutKeyPolicy
    output:
      - key_policy_statements
      - key_policy_action_1
      - key_policy_action_2
      - key_policy_principal
    input:
      - key_policy_statements
      - key_policy_statements
      - key_policy_statements
    path: Action
  condition: selection
tags:
  - attack.t1486
references:
  - https://rhinosecuritylabs.com/aws/s3-ransomware-part-1-attack-vector/
  - https://github.com/d1vious/git-wild-hunt
  - https://www.youtube.com/watch?v=PgzNib37g0M
custom_attributes:
  original_rule_id: c79c164f-4b21-4847-98f9-cf6a9f49179e
  source_format: splunk_spl