title: AWS ECR Container Scanning Findings High
id: 9d7b6a29-6ced-5131-8239-7b2f68292378
status: stable
level: high
description: |
  The following analytic identifies high-severity findings from AWS Elastic Container Registry (ECR) image scans. It detects these activities by analyzing AWS CloudTrail logs for the DescribeImageScanFindings event, specifically filtering for findings with a high severity level. This activity is significant for a SOC because high-severity vulnerabilities in container images can lead to potential exploitation if not addressed. If confirmed malicious, attackers could exploit these vulnerabilities to
author: Patrick Bareiss, Splunk
logsource:
  product: windows
detection:
  selection:
    eventname: DescribeImageScanFindings
    output: findings
    input: findings
    severity: HIGH
  condition: selection
tags:
  - attack.t1204.003
references:
  - https://docs.aws.amazon.com/AmazonECR/latest/userguide/image-scanning.html
custom_attributes:
  original_rule_id: 30a0e9f8-f1dd-4f9d-8fc2-c622461d781c
  source_format: splunk_spl