title: Azure AD Multiple AppIDs and UserAgents Authentication Spike
id: 71ecc179-00c7-541d-b962-3cc978d9784d
status: stable
level: medium
description: |
  The following analytic detects unusual authentication activity in Azure AD, specifically when a single user account has over 8 authentication attempts using 3+ unique application IDs and 5+ unique user agents within a short period. It leverages Azure AD audit logs, focusing on authentication events and using statistical thresholds. This behavior is significant as it may indicate an adversary probing for MFA requirements. If confirmed malicious, it suggests a compromised account, potentially lead
author: Mauricio Velazco, Splunk
logsource:
  product: azure
  category: authentication
detection:
  selection:
    operationname: Sign-in activity
    authenticationrequirement:
      - multiFactorAuthentication
      - singleFactorAuthentication
    additionaldetails: MFA required in Azure AD
    category: SignInLogs
    span: 5m
  condition: selection
tags:
  - attack.t1078
references:
  - https://attack.mitre.org/techniques/T1078/
  - https://www.blackhillsinfosec.com/exploiting-mfa-inconsistencies-on-microsoft-services/
  - https://github.com/dafthack/MFASweep
  - https://www.youtube.com/watch?v=SK1zgqaAZ2E
custom_attributes:
  original_rule_id: 5d8bb1f0-f65a-4b4e-af2e-fcdb88276314
  source_format: splunk_spl