title: Azure AD PIM Role Assigned
id: ac85475a-5f25-56bf-9ef6-c37cfbc3659f
status: stable
level: high
description: |
  The following analytic detects the assignment of an Azure AD Privileged Identity Management (PIM) role. It leverages Azure Active Directory events to identify when a user is added as an eligible member to a PIM role. This activity is significant because PIM roles grant elevated privileges, and their assignment should be closely monitored to prevent unauthorized access. If confirmed malicious, an attacker could exploit this to gain privileged access, potentially leading to unauthorized actions, d
author: Mauricio Velazco, Splunk
logsource:
  product: azure
detection:
  selection:
    operationname: Add eligible member to role in PIM completed*
  condition: selection
tags:
  - attack.t1098.003
references:
  - https://learn.microsoft.com/en-us/azure/active-directory/privileged-identity-management/pim-configure
  - https://learn.microsoft.com/en-us/azure/active-directory/privileged-identity-management/pim-how-to-activate-role
  - https://microsoft.github.io/Azure-Threat-Research-Matrix/PrivilegeEscalation/AZT401/AZT401/
custom_attributes:
  original_rule_id: fcd6dfeb-191c-46a0-a29c-c306382145ab
  source_format: splunk_spl