title: Azure AD Privileged Graph API Permission Assigned
id: 3ecc2ef7-fee1-5289-b551-5c7d20e55dea
status: stable
level: high
description: |
  The following analytic detects the assignment of high-risk Graph API permissions in Azure AD, specifically Application.ReadWrite.All, AppRoleAssignment.ReadWrite.All, and RoleManagement.ReadWrite.Directory. It uses azure_monitor_aad data to scan AuditLogs for 'Update application' operations, identifying when these permissions are assigned. This activity is significant as it grants broad control over Azure AD, including application and directory settings. If confirmed malicious, it could lead to 
author: Mauricio Velazco, Splunk
logsource:
  product: azure
detection:
  selection:
    operationname: Update application
    permissions: {}.RequiredAppPermissions{}.EntitlementId
    category: AuditLogs
    input: newvalue
  condition: selection
tags:
  - attack.t1003.002
references:
  - https://cloudbrothers.info/en/azure-attack-paths/
  - https://github.com/mandiant/Mandiant-Azure-AD-Investigator/blob/master/MandiantAzureADInvestigator.json
  - https://learn.microsoft.com/en-us/graph/permissions-reference
  - https://www.microsoft.com/en-us/security/blog/2024/01/25/midnight-blizzard-guidance-for-responders-on-nation-state-attack/
  - https://posts.specterops.io/azure-privilege-escalation-via-azure-api-permissions-abuse-74aee1006f48
custom_attributes:
  original_rule_id: 5521f8c5-1aa3-473c-9eb7-853701924a06
  source_format: splunk_spl