title: Azure AD Service Principal New Client Credentials
id: 2cff9828-a7db-59da-9b18-e65b7e9fdfcd
status: stable
level: high
description: |
  The following analytic detects the addition of new credentials to Service Principals and Applications in Azure AD. It leverages Azure AD AuditLogs, specifically monitoring the "Update application*Certificates and secrets management" operation. This activity is significant as it may indicate an adversary attempting to maintain persistent access or escalate privileges within the Azure environment. If confirmed malicious, attackers could use these new credentials to log in as the service principal,
author: Mauricio Velazco, Gowthamaraj Rajendran, Splunk
logsource:
  product: azure
  category: authentication
detection:
  selection:
    operationname: Update application*Certificates and secrets management 
    category: AuditLogs
  condition: selection
tags:
  - attack.t1098.001
references:
  - https://attack.mitre.org/techniques/T1098/001/
  - https://microsoft.github.io/Azure-Threat-Research-Matrix/Persistence/AZT501/AZT501-2/
  - https://hausec.com/2021/10/26/attacking-azure-azure-ad-part-ii/
  - https://www.inversecos.com/2021/10/how-to-backdoor-azure-applications-and.html
  - https://www.mandiant.com/resources/blog/apt29-continues-targeting-microsoft
custom_attributes:
  original_rule_id: e3adc0d3-9e4b-4b5d-b662-12cec1adff2a
  source_format: splunk_spl