title: Azure AD High Number Of Failed Authentications For User
id: 4824531f-4320-5291-be13-b64657079145
status: stable
level: high
description: |
  The following analytic identifies an Azure AD account experiencing more than 20 failed authentication attempts within a 10-minute window. This detection leverages Azure SignInLogs data, specifically monitoring for error code 50126 and unsuccessful authentication attempts. This behavior is significant as it may indicate a brute force attack targeting the account. If confirmed malicious, an attacker could potentially gain unauthorized access, leading to data breaches or further exploitation within
author: Mauricio Velazco, Splunk
logsource:
  product: azure
  category: authentication
detection:
  selection:
    category: SignInLogs
    errorcode: 50126
    succeeded: 'false'
    span: 10m
    value: 'null'
  condition: selection
tags:
  - attack.t1110.001
references:
  - https://attack.mitre.org/techniques/T1110/
  - https://attack.mitre.org/techniques/T1110/001/
custom_attributes:
  original_rule_id: 630b1694-210a-48ee-a450-6f79e7679f2c
  source_format: splunk_spl