title: Azure AD Multiple Users Failing To Authenticate From Ip
id: d277eed6-12cd-54fa-b54a-4ebcf4c3d933
status: stable
level: medium
description: |
  The following analytic detects a single source IP failing to authenticate with 30 unique valid users within 5 minutes in Azure Active Directory. It leverages Azure AD SignInLogs with error code 50126, indicating invalid passwords. This behavior is significant as it may indicate a Password Spraying attack, where an adversary attempts to gain initial access or elevate privileges by trying common passwords across many accounts. If confirmed malicious, this activity could lead to unauthorized access
author: Mauricio Velazco, Gowthamaraj Rajendran, Splunk
logsource:
  product: azure
  category: authentication
detection:
  selection:
    category: SignInLogs
    errorcode: 50126
    succeeded: 'false'
    span: 5m
  condition: selection
tags:
  - attack.t1110.003
  - attack.t1110.004
  - attack.t1586.003
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://docs.microsoft.com/en-us/security/compass/incident-response-playbook-password-spray
  - https://www.cisa.gov/uscert/ncas/alerts/aa21-008a
  - https://docs.microsoft.com/azure/active-directory/reports-monitoring/reference-sign-ins-error-codes
custom_attributes:
  original_rule_id: 94481a6a-8f59-4c86-957f-55a71e3612a6
  source_format: splunk_spl