title: Azure AD Privileged Role Assigned
id: 9f0d3f08-e371-500b-bb3c-62bd0c3ab0e8
status: stable
level: high
description: |
  The following analytic detects the assignment of privileged Azure Active Directory roles to a user. It leverages Azure AD audit logs, specifically monitoring the "Add member to role" operation. This activity is significant as adversaries may assign privileged roles to compromised accounts to maintain persistence within the Azure AD environment. If confirmed malicious, this could allow attackers to escalate privileges, access sensitive information, and maintain long-term control over the Azure AD
author: Mauricio Velazco, Gowthamaraj Rajendran, Splunk
logsource:
  product: azure
detection:
  selection:
    isprvilegedadrole: 'True'
  condition: selection
tags:
  - attack.t1098.003
references:
  - https://docs.microsoft.com/en-us/azure/active-directory/roles/concept-understand-roles
  - https://docs.microsoft.com/en-us/azure/active-directory/roles/permissions-reference
  - https://adsecurity.org/?p=4277
  - https://www.mandiant.com/resources/detecting-microsoft-365-azure-active-directory-backdoors
  - https://docs.microsoft.com/en-us/azure/active-directory/roles/security-planning
custom_attributes:
  original_rule_id: a28f0bc3-3400-4a6e-a2da-89b9e95f0d2a
  source_format: splunk_spl