title: Azure AD Tenant Wide Admin Consent Granted
id: 5c75c7d1-0295-5929-8264-46faab7c3f28
status: stable
level: high
description: |
  The following analytic identifies instances where admin consent is granted to an application within an Azure AD tenant. It leverages Azure AD audit logs, specifically events related to the admin consent action within the ApplicationManagement category. This activity is significant because admin consent allows applications to access data across the entire tenant, potentially exposing vast amounts of organizational data. If confirmed malicious, an attacker could gain extensive and persistent acces
author: Mauricio Velazco, Splunk
logsource:
  product: azure
detection:
  selection:
    operationname: Consent to application
    consenttype: '*AllPrincipals*'
    field:
      - new_field
      - new_field
  condition: selection
tags:
  - attack.t1098.003
references:
  - https://attack.mitre.org/techniques/T1098/003/
  - https://www.mandiant.com/resources/blog/remediation-and-hardening-strategies-for-microsoft-365-to-defend-against-unc2452
  - https://learn.microsoft.com/en-us/security/operations/incident-response-playbook-app-consent
  - https://learn.microsoft.com/en-us/azure/active-directory/manage-apps/grant-admin-consent?pivots=portal
  - https://microsoft.github.io/Azure-Threat-Research-Matrix/Persistence/AZT501/AZT501-2/
custom_attributes:
  original_rule_id: dc02c0ee-6ac0-4c7f-87ba-8ce43a4e4418
  source_format: splunk_spl