title: Azure AD Service Principal Authentication
id: 644ea752-a6c3-5666-9257-2fa39a7a1654
status: stable
level: high
description: |
  The following analytic identifies authentication events of service principals in Azure Active Directory. It leverages the `azure_monitor_aad` data source, specifically targeting "Sign-in activity" within ServicePrincipalSignInLogs. This detection gathers details such as sign-in frequency, timing, source IPs, and accessed resources. Monitoring these events is significant for SOC teams to distinguish between normal application authentication and potential anomalies, which could indicate compromise
author: Mauricio Velazco, Splunk
logsource:
  product: azure
  category: authentication
detection:
  selection:
    operationname: Sign-in activity
    category: ServicePrincipalSignInLogs
  condition: selection
tags:
  - attack.t1078.004
references:
  - https://attack.mitre.org/techniques/T1078/004/
  - https://learn.microsoft.com/en-us/entra/identity/monitoring-health/concept-sign-ins#service-principal-sign-ins
custom_attributes:
  original_rule_id: 5a2ec401-60bb-474e-b936-1e66e7aa4060
  source_format: splunk_spl