title: Azure AD New Federated Domain Added
id: e6632bb3-8ff3-5c8c-858a-2577083a2854
status: stable
level: high
description: |
  The following analytic detects the addition of a new federated domain within an Azure Active Directory tenant. It leverages Azure AD AuditLogs to identify successful "Set domain authentication" operations. This activity is significant as it may indicate the use of the Azure AD identity federation backdoor technique, allowing an adversary to establish persistence. If confirmed malicious, the attacker could impersonate any user, bypassing password and MFA requirements, potentially leading to unaut
author: Mauricio Velazco, Gowthamaraj Rajendran, Splunk
logsource:
  product: azure
detection:
  selection:
    operationname: Set domain authentication
  condition: selection
tags:
  - attack.t1484.002
references:
  - https://www.mandiant.com/resources/remediation-and-hardening-strategies-microsoft-365-defend-against-apt29-v13
  - https://o365blog.com/post/federation-vulnerability/
  - https://www.inversecos.com/2021/11/how-to-detect-azure-active-directory.html
  - https://www.mandiant.com/resources/blog/detecting-microsoft-365-azure-active-directory-backdoors
  - https://attack.mitre.org/techniques/T1484/002/
custom_attributes:
  original_rule_id: a87cd633-076d-4ab2-9047-977751a3c1a0
  source_format: splunk_spl