title: Azure AD Global Administrator Role Assigned
id: eccfe4c1-ad6f-5386-92c3-365050d21288
status: stable
level: high
description: |
  The following analytic detects the assignment of the Azure AD Global Administrator role to a user. It leverages Azure Active Directory AuditLogs to identify when the "Add member to role" operation includes the "Global Administrator" role. This activity is significant because the Global Administrator role grants extensive access to data, resources, and settings, similar to a Domain Administrator in traditional AD environments. If confirmed malicious, this could allow an attacker to establish pers
author: Gowthamaraj Rajendran, Mauricio Velazco, Splunk
logsource:
  product: azure
detection:
  selection:
    operationname: Add member to role
    newvalue: '*Global Administrator*'
  condition: selection
tags:
  - attack.t1098.003
references:
  - https://o365blog.com/post/admin/
  - https://adsecurity.org/?p=4277
  - https://www.mandiant.com/resources/detecting-microsoft-365-azure-active-directory-backdoors
  - https://docs.microsoft.com/en-us/azure/active-directory/roles/security-planning
  - https://docs.microsoft.com/en-us/azure/role-based-access-control/elevate-access-global-admin
custom_attributes:
  original_rule_id: 825fed20-309d-4fd1-8aaf-cd49c1bb093c
  source_format: splunk_spl