title: Azure AD PIM Role Assignment Activated
id: 55b0e993-12b1-5b0a-9e3d-3678faedf0e8
status: stable
level: high
description: |
  The following analytic detects the activation of an Azure AD Privileged Identity Management (PIM) role. It leverages Azure Active Directory events to identify when a user activates a PIM role assignment, indicated by the "Add member to role completed (PIM activation)" operation. Monitoring this activity is crucial as PIM roles grant elevated privileges, and unauthorized activation could indicate an adversary attempting to gain privileged access. If confirmed malicious, this could lead to unautho
author: Mauricio Velazco, Splunk
logsource:
  product: azure
detection:
  selection:
    operationname: Add member to role completed (PIM activation)
  condition: selection
tags:
  - attack.t1098.003
references:
  - https://learn.microsoft.com/en-us/azure/active-directory/privileged-identity-management/pim-configure
  - https://learn.microsoft.com/en-us/azure/active-directory/privileged-identity-management/pim-how-to-activate-role
  - https://microsoft.github.io/Azure-Threat-Research-Matrix/PrivilegeEscalation/AZT401/AZT401/
custom_attributes:
  original_rule_id: 952e80d0-e343-439b-83f4-808c3e6fbf2e
  source_format: splunk_spl