title: Azure AD User Enabled And Password Reset
id: 553698a9-1869-5e9f-a562-374e7c2c6510
status: stable
level: high
description: |
  The following analytic detects an Azure AD user enabling a previously disabled account and resetting its password within 2 minutes. It uses Azure Active Directory events to identify this sequence of actions. This activity is significant because it may indicate an adversary with administrative access attempting to establish a backdoor identity within the Azure AD tenant. If confirmed malicious, this could allow the attacker to maintain persistent access, escalate privileges, and potentially exfil
author: Mauricio Velazco, Gowthamaraj Rajendran, Splunk
logsource:
  product: azure
  category: authentication
detection:
  selection:
    operationname:
      - Enable account
      - Reset password (by admin)
      - Update user
      - Enable account
      - Reset password (by admin)
    maxspan: 2m
  condition: selection
tags:
  - attack.t1098
references:
  - https://attack.mitre.org/techniques/T1098/
custom_attributes:
  original_rule_id: 1347b9e8-2daa-4a6f-be73-b421d3d9e268
  source_format: splunk_spl