title: Azure AD Privileged Role Assigned to Service Principal
id: 0b18349b-d94c-5e4d-8925-bd3f1bece724
status: stable
level: high
description: |
  The following analytic detects the assignment of privileged roles to service principals in Azure Active Directory (AD). It leverages the AuditLogs log category from ingested Azure AD events. This activity is significant because assigning elevated permissions to non-human entities can lead to unauthorized access or malicious activities. If confirmed malicious, attackers could exploit these service principals to gain elevated access to Azure resources, potentially compromising sensitive data and c
author: Mauricio Velazco, Splunk
logsource:
  product: azure
detection:
  selection:
    operationname: Add member to role
    isprvilegedadrole: 'True'
  condition: selection
tags:
  - attack.t1098.003
references:
  - https://posts.specterops.io/azure-privilege-escalation-via-service-principal-abuse-210ae2be2a5
custom_attributes:
  original_rule_id: 5dfaa3d3-e2e4-4053-8252-16d9ee528c41
  source_format: splunk_spl