title: Azure AD Service Principal Created
id: 1cf11ed5-ace3-51fa-9b1a-1811af4cb309
status: stable
level: high
description: |
  The following analytic detects the creation of a Service Principal in an Azure AD environment. It leverages Azure Active Directory events ingested through EventHub, specifically monitoring the "Add service principal" operation. This activity is significant because Service Principals can be used by adversaries to establish persistence and bypass multi-factor authentication and conditional access policies. If confirmed malicious, this could allow attackers to maintain single-factor access to the A
author: Gowthamaraj Rajendran, Mauricio Velazco, Splunk
logsource:
  product: azure
  category: file_event
detection:
  selection:
    operationname: Add service principal
  condition: selection
tags:
  - attack.t1136.003
references:
  - https://docs.microsoft.com/en-us/azure/active-directory/develop/app-objects-and-service-principals
  - https://docs.microsoft.com/en-us/powershell/azure/create-azure-service-principal-azureps?view=azps-8.2.0
  - https://www.truesec.com/hub/blog/using-a-legitimate-application-to-create-persistence-and-initiate-email-campaigns
  - https://www.inversecos.com/2021/10/how-to-backdoor-azure-applications-and.html
  - https://attack.mitre.org/techniques/T1136/003/
custom_attributes:
  original_rule_id: f8ba49e7-ffd3-4b53-8f61-e73974583c5d
  source_format: splunk_spl