title: Azure Automation Runbook Created
id: 4b95b29c-7a38-5bd2-8d4d-ee4cc65c87d8
status: stable
level: high
description: |
  The following analytic detects the creation of a new Azure Automation Runbook within an Azure tenant. It leverages Azure Audit events, specifically the Azure Activity log category, to identify when a new Runbook is created or updated. This activity is significant because adversaries with privileged access can use Runbooks to maintain persistence, escalate privileges, or execute malicious code. If confirmed malicious, this could lead to unauthorized actions such as creating Global Administrators,
author: Mauricio Velazco, Brian Serocki, Splunk
logsource:
  product: azure
  category: file_event
detection:
  selection:
    value:
      - Microsoft.Automation/automationAccounts/runbooks/write
      - Succeeded
  condition: selection
tags:
  - attack.t1136.003
references:
  - https://docs.microsoft.com/en-us/azure/automation/overview
  - https://docs.microsoft.com/en-us/azure/automation/automation-runbook-types
  - https://docs.microsoft.com/en-us/azure/automation/manage-runbooks
  - https://www.inversecos.com/2021/12/how-to-detect-malicious-azure.html
  - https://www.netspi.com/blog/technical/cloud-penetration-testing/maintaining-azure-persistence-via-automation-accounts/
custom_attributes:
  original_rule_id: 178d696d-6dc6-4ee8-9d25-93fee34eaf5b
  source_format: splunk_spl