title: Azure AD User ImmutableId Attribute Updated
id: 074af666-fa96-53c5-b0a4-216965f0157a
status: stable
level: high
description: |
  The following analytic identifies the modification of the SourceAnchor (ImmutableId) attribute for an Azure Active Directory user. This detection leverages Azure AD audit logs, specifically monitoring the "Update user" operation and changes to the SourceAnchor attribute. This activity is significant as it is a step in setting up an Azure AD identity federation backdoor, allowing an adversary to establish persistence. If confirmed malicious, the attacker could impersonate any user, bypassing pass
author: Mauricio Velazco, Gowthamaraj Rajendran, Splunk
logsource:
  product: azure
detection:
  selection:
    operationname: Update user
    displayname: SourceAnchor
  condition: selection
tags:
  - attack.t1098
references:
  - https://docs.microsoft.com/en-us/azure/active-directory/hybrid/plan-connect-design-concepts
  - https://www.mandiant.com/resources/remediation-and-hardening-strategies-microsoft-365-defend-against-apt29-v13
  - https://o365blog.com/post/federation-vulnerability/
  - https://www.inversecos.com/2021/11/how-to-detect-azure-active-directory.html
  - https://www.mandiant.com/resources/blog/detecting-microsoft-365-azure-active-directory-backdoors
custom_attributes:
  original_rule_id: 0c0badad-4536-4a84-a561-5ff760f3c00e
  source_format: splunk_spl