title: Azure AD Block User Consent For Risky Apps Disabled
id: b8e0602d-c25c-5d92-b2f3-ddb49e97aa6b
status: stable
level: high
description: |
  The following analytic detects when the risk-based step-up consent security setting in Azure AD is disabled. It monitors Azure Active Directory logs for the "Update authorization policy" operation, specifically changes to the "AllowUserConsentForRiskyApps" setting. This activity is significant because disabling this feature can expose the organization to OAuth phishing threats by allowing users to grant consent to potentially malicious applications. If confirmed malicious, attackers could gain u
author: Mauricio Velazco, Splunk
logsource:
  product: azure
detection:
  selection:
    operationname: Update authorization policy
    allowuserconsentforriskyapps: [true]
  condition: selection
tags:
  - attack.t1562
references:
  - https://attack.mitre.org/techniques/T1562/
  - https://goodworkaround.com/2020/10/19/a-look-behind-the-azure-ad-permission-classifications-preview/
  - https://learn.microsoft.com/en-us/entra/identity/enterprise-apps/configure-risk-based-step-up-consent
  - https://learn.microsoft.com/en-us/defender-cloud-apps/investigate-risky-oauth
custom_attributes:
  original_rule_id: 875de3d7-09bc-4916-8c0a-0929f4ced3d8
  source_format: splunk_spl