title: Azure AD Successful Single-Factor Authentication
id: c6619485-93c7-5baf-abcd-10f4dce2301a
status: stable
level: high
description: |
  The following analytic identifies a successful single-factor authentication event against Azure Active Directory. It leverages Azure SignInLogs data, specifically focusing on events where single-factor authentication succeeded. This activity is significant as it may indicate a misconfiguration, policy violation, or potential account takeover attempt. If confirmed malicious, an attacker could gain unauthorized access to the account, potentially leading to data breaches, privilege escalation, or f
author: Mauricio Velazco, Gowthamaraj Rajendran, Splunk
logsource:
  product: azure
  category: authentication
detection:
  selection:
    category: SignInLogs
    authenticationrequirement: singleFactorAuthentication
    succeeded: 'true'
  condition: selection
tags:
  - attack.t1078.004
  - attack.t1586.003
references:
  - https://attack.mitre.org/techniques/T1078/004/
  - https://docs.microsoft.com/en-us/azure/active-directory/authentication/concept-mfa-howitworks*
  - https://www.forbes.com/sites/daveywinder/2020/07/08/new-dark-web-audit-reveals-15-billion-stolen-logins-from-100000-breaches-passwords-hackers-cybercrime/?sh=69927b2a180f
custom_attributes:
  original_rule_id: a560e7f6-1711-4353-885b-40be53101fcd
  source_format: splunk_spl