title: Azure AD New MFA Method Registered
id: 9914447e-c23c-50e9-8ccc-4fb1730378e2
status: stable
level: high
description: |
  The following analytic detects the registration of a new Multi-Factor Authentication (MFA) method for a user account in Azure Active Directory. It leverages Azure AD audit logs to identify changes in MFA configurations. This activity is significant because adding a new MFA method can indicate an attacker's attempt to maintain persistence on a compromised account. If confirmed malicious, the attacker could bypass existing security measures, solidify their access, and potentially escalate privileg
author: Mauricio Velazco, Splunk
logsource:
  product: azure
detection:
  selection:
    operationname: Update user
    propertyname: StrongAuthenticationMethod
    field:
      - newvalue
      - oldvalue
    max_match:
      - 0
      - 0
  condition: selection
tags:
  - attack.t1098.005
references:
  - https://attack.mitre.org/techniques/T1098/005/
  - https://www.microsoft.com/en-us/security/blog/2023/06/08/detecting-and-mitigating-a-multi-stage-aitm-phishing-and-bec-campaign/
  - https://www.csoonline.com/article/573451/sophisticated-bec-scammers-bypass-microsoft-365-multi-factor-authentication.html
custom_attributes:
  original_rule_id: 0488e814-eb81-42c3-9f1f-b2244973e3a3
  source_format: splunk_spl