title: Batch File Write to System32
id: 815b531d-0767-5a5d-9a54-c95daca670f4
status: stable
level: high
description: |
  The following analytic detects the creation of a batch file (.bat) within the Windows system directory tree, specifically in the System32 or SysWOW64 folders. It leverages data from the Endpoint datamodel, focusing on process and filesystem events to identify this behavior. This activity is significant because writing batch files to system directories can be indicative of malicious intent, such as persistence mechanisms or system manipulation. If confirmed malicious, this could allow an attacker
author: Steven Dick, Michael Haag, Rico Valdez, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    file_name: '*.bat'
    file_path:
      - '*\\system32\\*'
      - '*\\syswow64\\*'
  condition: selection
tags:
  - attack.t1204.002
custom_attributes:
  original_rule_id: 503d17cb-9eab-4cf8-a20e-01d5c6987ae3
  source_format: splunk_spl