title: BITS Job Persistence
id: 1698f271-75ae-5425-b96f-90a28d2377a4
status: stable
level: high
description: |
  The following analytic detects the use of `bitsadmin.exe` to schedule a BITS job for persistence on an endpoint. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on specific command-line parameters such as `create`, `addfile`, and `resume`. This activity is significant because BITS jobs can be used by attackers to maintain persistence, download malicious payloads, or exfiltrate data. If confirmed malicious, this could allow an attacker to persist in the environment, 
author: Michael Haag, Splunk
logsource:
  product: splunk
detection:
  selection:
    process:
      - '*create*'
      - '*addfile*'
      - '*setnotifyflags*'
      - '*setnotifycmdline*'
      - '*setminretrydelay*'
      - '*setcustomheaders*'
      - '*resume*'
  condition: selection
tags:
  - attack.t1197
references:
  - https://attack.mitre.org/techniques/T1197/
  - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/bitsadmin
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1197/T1197.md#atomic-test-3---persist-download--execute
  - https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
custom_attributes:
  original_rule_id: e97a5ffe-90bf-11eb-928a-acde48001122
  source_format: splunk_spl