title: Certutil exe certificate extraction
id: 44350f1d-3fb3-5906-a2cf-464adc5b0a31
status: stable
level: high
description: |
  The following analytic identifies the use of certutil.exe with arguments indicating the manipulation or extraction of certificates. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line arguments. This activity is significant because extracting certificates can allow attackers to sign new authentication tokens, particularly in federated environments like Windows ADFS. If confirmed malicious, this could enable attackers to forge authentica
author: Rod Soto, Splunk
logsource:
  product: windows
detection:
  selection:
    process: '*-exportPFX*'
  condition: selection
references:
  - https://blog.sygnia.co/detection-and-hunting-of-golden-saml-attack
  - https://strontic.github.io/xcyclopedia/library/certutil.exe-09A8A29BAA3A451713FD3D07943B4A43.html
custom_attributes:
  original_rule_id: 337a46be-600f-11eb-ae93-0242ac130002
  source_format: splunk_spl