title: CHCP Command Execution
id: 64929959-5d84-5fef-95ae-59bcba697664
status: stable
level: medium
description: |
  The following analytic detects the execution of the chcp.com utility, which is used to change the active code page of the console. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process creation events. This activity is significant because it can indicate the presence of malware, such as IcedID, which uses this technique to determine the locale region, language, or country of the compromised host. If confirmed malicious, this could lead to further sy
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1059
references:
  - https://ss64.com/nt/chcp.html
  - https://twitter.com/tccontre18/status/1419941156633329665?s=20
custom_attributes:
  original_rule_id: 21d236ec-eec1-11eb-b23e-acde48001122
  source_format: splunk_spl