title: Child Processes of Spoolsv exe
id: 61ecddc8-3da1-5ed6-a3cc-c787824694d4
status: experimental
level: high
description: |
  The following analytic identifies child processes spawned by spoolsv.exe, the Print Spooler service in Windows, which typically runs with SYSTEM privileges. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and parent process relationships. Monitoring this activity is crucial as it can indicate exploitation attempts, such as those associated with CVE-2018-8440, which can lead to privilege escalation. If confirmed malicious, attackers could gain 
author: Rico Valdez, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1068
custom_attributes:
  original_rule_id: aa0c4aeb-5b18-41c4-8c07-f1442d7599df
  source_format: splunk_spl