title: Circle CI Disable Security Step
id: 47c13964-22e7-515e-9650-d06c64a31353
status: experimental
level: medium
description: |
  The following analytic detects the disablement of security steps in a CircleCI pipeline. It leverages CircleCI logs, using field renaming, joining, and statistical analysis to identify instances where mandatory security steps are not executed. This activity is significant because disabling security steps can introduce vulnerabilities, unauthorized changes, or malicious code into the pipeline. If confirmed malicious, this could lead to potential attacks, data breaches, or compromised infrastructu
author: Patrick Bareiss, Splunk
logsource:
  product: splunk
detection:
  selection:
    phase: build
    mandatory_step_executed: 0
    field: url
  condition: selection
tags:
  - attack.t1554
custom_attributes:
  original_rule_id: 72cb9de9-e98b-4ac9-80b2-5331bba6ea97
  source_format: splunk_spl