title: Circle CI Disable Security Job
id: 68ecec17-16d8-5869-b28f-47b731cc6365
status: stable
level: medium
description: |
  The following analytic detects the disabling of security jobs in CircleCI pipelines. It leverages CircleCI log data, renaming and extracting fields such as job names, workflow IDs, user information, commit messages, URLs, and branches. The detection identifies mandatory jobs for each workflow and checks if they were executed. This activity is significant because disabling security jobs can allow malicious code to bypass security checks, leading to potential data breaches, system downtime, and re
author: Patrick Bareiss, Splunk
logsource:
  product: splunk
detection:
  selection:
    phase: build
    mandatory_job_executed: 0
    field: url
  condition: selection
tags:
  - attack.t1554
custom_attributes:
  original_rule_id: 4a2fdd41-c578-4cd4-9ef7-980e352517f2
  source_format: splunk_spl