title: Cisco Duo Policy Skip 2FA for Other Countries
id: 0f8793ee-dff3-5c20-9b3d-5a8aa3f0e97b
status: stable
level: high
description: |
  The following analytic detects when a Duo policy is created or updated to allow access without two-factor authentication (2FA)  for users in countries other than the default. It identifies this behavior by searching Duo administrator activity logs for policy  creation or update actions where the policy description indicates that access is permitted without 2FA for certain user locations.  This is achieved by parsing the relevant fields in the logs and filtering for the specific condition of 'All
author: Patrick Bareiss, Splunk
logsource:
  product: splunk
detection:
  selection:
    user_locations_default_action: Allow access without 2FA
    action:
      - policy_update
      - policy_create
    input: description
  condition: selection
tags:
  - attack.t1556
references:
  - https://splunkbase.splunk.com/app/7404
custom_attributes:
  original_rule_id: ab59d5ee-8694-4832-a332-cefcf66a9057
  source_format: splunk_spl