title: Cisco Secure Firewall - Snort Rule Triggered Across Multiple Hosts
id: 58570b68-4416-5240-b762-9cc281a43215
status: stable
level: medium
description: |
  This analytic identifies Snort intrusion signatures that have been triggered by ten or more distinct internal IP addresses within a one-hour window. It leverages Cisco Secure Firewall Threat Defense logs and focuses on the IntrusionEvent event type to detect activity that may indicate broad targeting or mass exploitation attempts. This behavior is often associated with opportunistic scanning, worm propagation, or automated exploitation of known vulnerabilities across multiple systems. If confirm
author: Nasreddine Bencherchali, Splunk
logsource:
  product: splunk
detection:
  selection:
    eventtype: IntrusionEvent
    span: 1h
  condition: selection
tags:
  - attack.t1105
  - attack.t1027
references:
  - https://www.cisco.com/c/en/us/td/docs/security/firepower/741/api/FQE/secure_firewall_estreamer_fqe_guide_740.pdf
custom_attributes:
  original_rule_id: a4c76d0a-56b6-44be-814b-939746c4d406
  source_format: splunk_spl