title: Cisco NVM - Suspicious Network Connection Initiated via MsXsl
id: bb62d66f-341b-56a7-b5ae-9d738f3dcf02
status: stable
level: medium
description: |
  This analytic identifies the use of `msxsl.exe` initiating a network connection to a non-private IP address. Although `msxsl.exe` is a legitimate Microsoft utility used to apply XSLT transformations, adversaries can abuse it to execute arbitrary code or load external resources in an evasive manner. This detection leverages Cisco NVM telemetry to identify potentially malicious use of `msxsl.exe` making network connections that may indicate command and control (C2) or data exfiltration activity.
author: Nasreddine Bencherchali, Splunk
logsource:
  product: splunk
  category: network_connection
detection:
  selection:
    process_name: msxsl.exe
    dest:
      - 10.0.0.0/8
      - 172.16.0.0/12
      - 192.168.0.0/16
      - 100.64.0.0/10
      - 127.0.0.0/8
      - 169.254.0.0/16
      - 192.0.0.0/24
      - 192.0.0.0/29
      - 192.0.0.8/32
      - 192.0.0.9/32
      - 192.0.0.10/32
      - 192.0.0.170/32
      - 192.0.0.171/32
      - 192.0.2.0/24
      - 192.31.196.0/24
      - 192.52.193.0/24
      - 192.88.99.0/24
      - 224.0.0.0/4
      - 192.175.48.0/24
      - 198.18.0.0/15
      - 198.51.100.0/24
      - 203.0.113.0/24
      - 240.0.0.0/4
      - '::1'
  condition: selection
tags:
  - attack.t1220
references:
  - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Msxsl/
custom_attributes:
  original_rule_id: 1cbcf75f-0e45-4f29-8c1b-7fcd7e55cc55
  source_format: splunk_spl