title: Cisco Secure Firewall - Citrix NetScaler Memory Overread Attempt
id: 6df23ea3-3c79-5fd8-8964-1e09215cebd8
status: stable
level: high
description: |
  This analytic detects exploitation activity of CVE-2025-5777 using Cisco Secure Firewall Intrusion Events. It leverages Cisco Secure Firewall Threat Defense IntrusionEvent logs to identify cases where Snort signature 65118 (Citrix NetScaler memory overread attempt) is triggered If confirmed malicious, this behavior is highly indicative of a potential exploitation of CVE-2025-5777.
author: Michael Haag, Nasreddine Bencherchali, Splunk, Talos NTDR
logsource:
  product: splunk
detection:
  selection:
    eventtype: IntrusionEvent
    signature_id: 65118
  condition: selection
tags:
  - attack.t1203
  - attack.t1059
references:
  - https://support.citrix.com/support-home/kbsearch/article?articleNumber=CTX693420
  - https://support.citrix.com/support-home/kbsearch/article?articleNumber=CTX693420
  - https://www.netscaler.com/blog/news/critical-security-updates-for-netscaler-netscaler-gateway-and-netscaler-console/
  - https://github.com/mingshenhk/CitrixBleed-2-CVE-2025-5777-PoC-
  - https://horizon3.ai/attack-research/attack-blogs/cve-2025-5777-citrixbleed-2-write-up-maybe/
custom_attributes:
  original_rule_id: 93db24a0-fd21-45d7-9daf-84afd5a8cca2
  source_format: splunk_spl