title: Cisco Duo Bypass Code Generation
id: 4b082f68-cd97-5177-a273-7fa4edfd8522
status: stable
level: high
description: |
  The following analytic detects when a Duo user generates a bypass code, which allows them to circumvent multi-factor authentication (2FA) protections.  It works by monitoring Duo activity logs for the 'bypass_create' action, renaming the affected object as the user, and aggregating events to identify  instances where a bypass code is issued. This behavior is significant for a Security Operations Center (SOC) because generating a bypass code can enable  attackers, malicious insiders, or unauthori
author: Patrick Bareiss, Splunk
logsource:
  product: splunk
detection:
  selection:
    action: bypass_create
  condition: selection
tags:
  - attack.t1556
references:
  - https://splunkbase.splunk.com/app/7404
custom_attributes:
  original_rule_id: 446e81ff-ce06-4925-9c7d-4073f9b5abf5
  source_format: splunk_spl