title: Cisco Secure Firewall - Lumma Stealer Outbound Connection Attempt
id: ea7f1c13-93ac-5ad8-a35f-e02107b2a4cb
status: stable
level: medium
description: |
  This analytic detects Lumma Stealer outbound connection attempts using Cisco Secure Firewall Intrusion Events.  It leverages Cisco Secure Firewall Threat Defense IntrusionEvent logs to identify cases where Snort signatures with IDs 64797, 64798, 64799, 64800, 64801, 64167, 64168, 64169, 62709 have been triggered. If confirmed malicious, this behavior could indicate an active infection of Lumma Stealer.
author: Nasreddine Bencherchali, Splunk, Talos NTDR
logsource:
  product: splunk
  category: network_connection
detection:
  selection:
    eventtype: IntrusionEvent
    signature_id:
      - 64797
      - 64798
      - 64799
      - 64800
      - 64801
      - 64167
      - 64168
      - 64169
      - 62709
  condition: selection
tags:
  - attack.t1041
  - attack.t1573.002
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.lumma
custom_attributes:
  original_rule_id: 66f22f52-fbae-4be7-a263-561dacb63612
  source_format: splunk_spl