title: Cisco Secure Firewall - Connection to File Sharing Domain
id: 8cfaf75c-ee45-500c-8351-8002ef62ea6b
status: stable
level: medium
description: |
  The following analytic detects outbound connections to commonly abused file sharing and pastebin-style hosting domains. It leverages Cisco Secure Firewall Threat Defense logs and focuses on allowed connections (action=Allow) where the url field matches a list of known data hosting or temporary storage services. While many of these platforms serve legitimate purposes, they are frequently leveraged by adversaries for malware delivery, data exfiltration, command and control (C2) beacons, or staging
author: Nasreddine Bencherchali, Splunk
logsource:
  product: splunk
  category: network_connection
detection:
  selection:
    eventtype: ConnectionEvent
    action:
      - Trust
      - Allow
      - allowed
    url:
      - '*//objects.githubusercontent.com*'
      - '*anonfiles.com*'
      - '*cdn.discordapp.com*'
      - '*ddns.net*'
      - '*dl.dropboxusercontent.com*'
      - '*ghostbin.co*'
      - '*glitch.me*'
      - '*gofile.io*'
      - '*hastebin.com*'
      - '*mediafire.com*'
      - '*mega.nz*'
      - '*onrender.com*'
      - '*pages.dev*'
      - '*paste.ee*'
      - '*pastebin.com*'
      - '*pastebin.pl*'
      - '*pastetext.net*'
      - '*privatlab.com*'
      - '*privatlab.net*'
      - '*send.exploit.in*'
      - '*sendspace.com*'
      - '*storage.googleapis.com*'
      - '*storjshare.io*'
      - '*supabase.co*'
      - '*temp.sh*'
      - '*transfer.sh*'
      - '*trycloudflare.com*'
      - '*ufile.io*'
      - '*w3spaces.com*'
      - '*workers.dev*'
  condition: selection
tags:
  - attack.t1071.001
  - attack.t1090.002
  - attack.t1105
  - attack.t1567.002
  - attack.t1588.002
references:
  - https://www.cisco.com/c/en/us/td/docs/security/firepower/741/api/FQE/secure_firewall_estreamer_fqe_guide_740.pdf
custom_attributes:
  original_rule_id: f7e5e792-d907-46c1-a58e-4ff974dc462a
  source_format: splunk_spl