title: Cisco Duo Policy Allow Tampered Devices
id: bb90ed32-66dc-5774-b37f-a2e23121d364
status: stable
level: high
description: |
  The following analytic detects when a Duo policy is created or updated to allow tampered or rooted devices, such as jailbroken smartphones,  to access protected resources. It identifies this behavior by searching Duo administrator activity logs for policy changes where the allow_rooted_devices  setting is enabled. This is accomplished by filtering for policy creation or update actions and parsing the policy description for the relevant configuration.  Allowing tampered devices poses a significan
author: Patrick Bareiss, Splunk
logsource:
  product: splunk
detection:
  selection:
    action:
      - policy_update
      - policy_create
    input: description
    allow_rooted_devices: 'true'
  condition: selection
tags:
  - attack.t1556
references:
  - https://splunkbase.splunk.com/app/7404
custom_attributes:
  original_rule_id: 6b813efd-8859-406f-b677-719458387fac
  source_format: splunk_spl