title: Cisco NVM - Rundll32 Abuse of MSHTML.DLL for Payload Download
id: 380055a6-f777-5ae9-bcf7-22b7eb2930f5
status: stable
level: medium
description: |
  This analytic detects suspicious use of `rundll32.exe` in combination with `mshtml.dll` and the export `RunHTMLApplication`. This behavior is often observed in malware to execute JavaScript or VBScript in memory, enabling payload staging or bypassing script execution policies and bypassing the usage of the "mshta.exe" binary. The detection leverages Cisco Network Visibility Module telemetry which offers network flow activity along with process information such as command-line arguments If confir
author: Nasreddine Bencherchali, Splunk
logsource:
  product: splunk
detection:
  selection:
    process_name: rundll32.exe
    process_arguments:
      - '*135*'
      - '*RunHTMLApplication*'
  condition: selection
tags:
  - attack.t1218.005
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Rundll32/
  - https://redcanary.com/blog/threat-detection/threat-research-questions/
  - https://twitter.com/n1nj4sec/status/1421190238081277959
  - https://hyp3rlinx.altervista.org/advisories/MICROSOFT_WINDOWS_DEFENDER_TROJAN.WIN32.POWESSERE.G_MITIGATION_BYPASS_PART2.txt
  - http://hyp3rlinx.altervista.org/advisories/MICROSOFT_WINDOWS_DEFENDER_DETECTION_BYPASS.txt
custom_attributes:
  original_rule_id: 18f0d27d-569e-4bc4-96e1-09b214fa73c0
  source_format: splunk_spl