title: Cisco ASA - Reconnaissance Command Activity
id: d2eba98b-13a0-59bb-a5b7-7c5683ab6060
status: stable
level: medium
description: |
  This analytic detects potential reconnaissance activities on Cisco ASA devices by identifying execution of multiple information-gathering "show" commands within a short timeframe. Adversaries who gain initial access to network infrastructure devices typically perform systematic reconnaissance to understand the device configuration, network topology, security policies, connected systems, and potential attack paths. This reconnaissance phase involves executing multiple "show" commands to enumerate
author: Nasreddine Bencherchali, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    span: 5m
    message_id:
      - 111009
    command:
      - show access-list*
      - show capture*
      - show conn*
      - show cpu*
      - show crypto*
      - show eigrp*
      - show failover*
      - show flow*
      - show interface*
      - show inventory*
      - show ip*
      - show license*
      - show memory*
      - show nat*
      - show ospf*
      - show process*
      - show running-config*
      - show startup-config*
      - show version*
      - show vpn-sessiondb*
      - show xlate*
  condition: selection
tags:
  - attack.t1082
  - attack.t1590.001
  - attack.t1590.005
references:
  - https://www.cisco.com/c/en/us/td/docs/security/asa/asa-cli-reference/S/asa-command-ref-S/sa-shov-commands.html
custom_attributes:
  original_rule_id: 6e9d4f7a-3c8b-4a9e-8d2f-7b5c9e1a6f3d
  source_format: splunk_spl