title: Cisco Duo Policy Allow Old Java
id: a1445bbc-44c0-521e-80a1-6b0660200cd4
status: stable
level: high
description: |
  The following analytic detects when a Duo policy is created or updated to allow the use of outdated Java versions, which can introduce significant  security risks. It works by searching Duo administrator activity logs for policy creation or update actions where the policy explicitly sets  'java_remediation' to 'no remediation', indicating that no restrictions are enforced against old Java. The analytic aggregates relevant details  such as the user, admin email, and action context for further inv
author: Patrick Bareiss, Splunk
logsource:
  product: splunk
detection:
  selection:
    java_remediation: no remediation
    action:
      - policy_update
      - policy_create
    input: description
  condition: selection
tags:
  - attack.t1556
references:
  - https://splunkbase.splunk.com/app/7404
custom_attributes:
  original_rule_id: ff56d843-57de-4a87-b726-13b145f6bf96
  source_format: splunk_spl