title: Cisco Secure Firewall - Blocked Connection
id: beedbc29-8294-59db-85b4-5aeeb7d6220a
status: stable
level: medium
description: |
  The following analytic detects a blocked connection event by identifying a "Block" value in the action field. It leverages logs from Cisco Secure Firewall Threat Defense devices. This activity is significant as it can identify attempts from users or applications initiating network connection to explicitly or implicitly blocked range or zones. If confirmed malicious, attackers could be attempting to perform a forbidden action on the network such as data exfiltration, lateral movement, or network 
author: Nasreddine Bencherchali, Splunk
logsource:
  product: splunk
  category: network_connection
detection:
  selection:
    eventtype: ConnectionEvent
    action:
      - Block with reset
      - Block
      - blocked
  condition: selection
tags:
  - attack.t1018
  - attack.t1046
  - attack.t1110
  - attack.t1203
  - attack.t1595.002
references:
  - https://www.cisco.com/c/en/us/td/docs/security/firepower/741/api/FQE/secure_firewall_estreamer_fqe_guide_740.pdf
custom_attributes:
  original_rule_id: 17e9b764-3a2b-4d36-9751-32d13ce4718b
  source_format: splunk_spl