title: Cisco Secure Firewall - Possibly Compromised Host
id: 88f22def-71dd-5295-a6f2-f149192e5df5
status: experimental
level: medium
description: |
  The following analytic highlights high-impact intrusion events assigned by Cisco Secure Firewall. This detection leverages Cisco Secure Firewall Threat Defense logs and specifically the IntrusionEvent event type and `Impact` field assigned by Cisco Secure Firewall looking for an impact score of 1 or 2. If confirmed malicious this may indicate a potential compromised host.
author: Nasreddine Bencherchali, Splunk
logsource:
  product: splunk
detection:
  selection:
    eventtype: IntrusionEvent
    impact:
      - 1
      - 2
  condition: selection
tags:
  - attack.t1203
  - attack.t1059
  - attack.t1587.001
references:
  - https://www.cisco.com/c/en/us/td/docs/security/firepower/741/api/FQE/secure_firewall_estreamer_fqe_guide_740.pdf
custom_attributes:
  original_rule_id: 244a77bb-3b2a-46f1-bf2c-b4f7cd29276d
  source_format: splunk_spl