title: Clop Ransomware Known Service Name
id: 95a6878d-6269-515b-bd4e-bd4101335b74
status: stable
level: high
description: |
  The following analytic identifies the creation of a service with a known name used by CLOP ransomware for persistence and high-privilege code execution. It detects this activity by monitoring Windows Event Logs (EventCode 7045) for specific service names ("SecurityCenterIBM", "WinCheckDRVs"). This activity is significant because the creation of such services is a common tactic used by ransomware to maintain control over infected systems. If confirmed malicious, this could allow attackers to exec
author: Teoderick Contreras
logsource:
  product: windows
detection:
  selection:
    eventcode: 7045
    servicename:
      - SecurityCenterIBM
      - WinCheckDRVs
  condition: selection
tags:
  - attack.t1543
references:
  - https://www.mandiant.com/resources/fin11-email-campaigns-precursor-for-ransomware-data-theft
  - https://blog.virustotal.com/2020/11/keep-your-friends-close-keep-ransomware.html
custom_attributes:
  original_rule_id: 07e08a12-870c-11eb-b5f9-acde48001122
  source_format: splunk_spl