title: Cloud Provisioning Activity From Previously Unseen IP Address
id: 78f3052f-0d9c-527d-9b42-1e533bfe2f84
status: stable
level: medium
description: |
  The following analytic detects cloud provisioning activities originating from previously unseen IP addresses. It leverages cloud infrastructure logs to identify events where resources are created or started, and cross-references these with a baseline of known IP addresses. This activity is significant as it may indicate unauthorized access or potential misuse of cloud resources. If confirmed malicious, an attacker could gain unauthorized control over cloud resources, leading to data breaches, se
author: Rico Valdez, Splunk
logsource:
  product: splunk
detection:
  selection:
    datamodel: Change
    action: started
    status: success
    enough_data: 1
  condition: selection
tags:
  - attack.t1078
custom_attributes:
  original_rule_id: f86a8ec9-b042-45eb-92f4-e9ed1d781078
  source_format: splunk_spl