title: Cloud Provisioning Activity From Previously Unseen Region
id: 180c880e-71d3-52e1-9c00-43adcb7aa594
status: stable
level: medium
description: |
  The following analytic detects cloud provisioning activities originating from previously unseen regions. It leverages cloud infrastructure logs to identify events where resources are started or created, and cross-references these with a baseline of known regions. This activity is significant as it may indicate unauthorized access or misuse of cloud resources from unfamiliar locations. If confirmed malicious, this could lead to unauthorized resource creation, potential data exfiltration, or furth
author: Rico Valdez, Bhavin Patel, Splunk
logsource:
  product: splunk
detection:
  selection:
    datamodel: Change
    action: started
    status: success
    enough_data: 1
  condition: selection
tags:
  - attack.t1078
custom_attributes:
  original_rule_id: 5aba1860-9617-4af9-b19d-aecac16fe4f2
  source_format: splunk_spl