title: Cloud Compute Instance Created With Previously Unseen Image
id: 522ad736-1960-50d5-adab-6f1998075207
status: stable
level: medium
description: |
  The following analytic detects the creation of cloud compute instances using previously unseen image IDs. It leverages cloud infrastructure logs to identify new image IDs that have not been observed before. This activity is significant because it may indicate unauthorized or suspicious activity, such as the deployment of malicious payloads or unauthorized access to sensitive information. If confirmed malicious, this could lead to data breaches, unauthorized access, or further compromise of the c
author: David Dorsey, Splunk
logsource:
  product: splunk
  category: file_event
detection:
  selection:
    datamodel: Change
    action: created
    enough_data: 1
  filter:
    image_id: unknown
  condition: selection and not filter
custom_attributes:
  original_rule_id: bc24922d-987c-4645-b288-f8c73ec194c4
  source_format: splunk_spl