title: Cloud Compute Instance Created With Previously Unseen Instance Type
id: 08c33afd-069e-5c5d-ad2e-4dbef8c2d6d9
status: stable
level: medium
description: |
  The following analytic detects the creation of EC2 instances with previously unseen instance types. It leverages Splunk's tstats command to analyze data from the Change data model, identifying instance types that have not been previously recorded. This activity is significant for a SOC because it may indicate unauthorized or suspicious activity, such as an attacker attempting to create instances for malicious purposes. If confirmed malicious, this could lead to unauthorized access, data exfiltra
author: David Dorsey, Splunk
logsource:
  product: aws
  category: file_event
detection:
  selection:
    datamodel: Change
    action: created
    enough_data: 1
  filter:
    instance_type: unknown
  condition: selection and not filter
custom_attributes:
  original_rule_id: c6ddbf53-9715-49f3-bb4c-fb2e8a309cda
  source_format: splunk_spl