title: Cloud Instance Modified By Previously Unseen User
id: ca3be098-7287-5a46-94c7-c4585000bc3c
status: stable
level: medium
description: |
  The following analytic identifies cloud instances being modified by users who have not previously modified them. It leverages data from the Change data model, focusing on successful modifications of EC2 instances. This activity is significant because it can indicate unauthorized or suspicious changes by potentially compromised or malicious users. If confirmed malicious, this could lead to unauthorized access, configuration changes, or potential disruption of cloud services, posing a significant 
author: Rico Valdez, Splunk
logsource:
  product: aws
detection:
  selection:
    datamodel: Change
    action: modified
    change_type: EC2
    status: success
    enough_data: 1
  condition: selection
tags:
  - attack.t1078.004
custom_attributes:
  original_rule_id: 7fb15084-b14e-405a-bd61-a6de15a40722
  source_format: splunk_spl