title: CMLUA Or CMSTPLUA UAC Bypass
id: 7dad7d64-5bca-5912-a030-f13e93eb57ec
status: stable
level: high
description: |
  The following analytic detects the use of COM objects like CMLUA or CMSTPLUA to bypass User Account Control (UAC). It leverages Sysmon EventCode 7 to identify the loading of specific DLLs (CMLUA.dll, CMSTPLUA.dll, CMLUAUTIL.dll) by processes not typically associated with these libraries. This activity is significant as it indicates an attempt to gain elevated privileges, a common tactic used by ransomware adversaries. If confirmed malicious, this could allow attackers to execute code with admini
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 7
    imageloaded:
      - '*\\CMLUA.dll'
      - '*\\CMSTPLUA.dll'
      - '*\\CMLUAUTIL.dll'
    process_name:
      - CMSTP.exe
      - CMMGR32.exe
    image:
      - '*\\windows\\*'
      - '*\\program files*'
  condition: selection
tags:
  - attack.t1218.003
references:
  - https://attack.mitre.org/techniques/T1218/003/
custom_attributes:
  original_rule_id: f87b5062-b405-11eb-a889-acde48001122
  source_format: splunk_spl