title: ConnectWise ScreenConnect Path Traversal Windows SACL
id: a650b3c8-7413-5160-9b30-1c84195cb6fb
status: stable
level: high
description: |
  The following analytic detects attempts to exploit the ConnectWise ScreenConnect CVE-2024-1708 vulnerability using Windows SACL EventCode 4663. It identifies path traversal attacks by monitoring file system events related to the ScreenConnect service. This activity is significant as it allows unauthorized access to sensitive files and directories, potentially leading to data exfiltration or arbitrary code execution. If confirmed malicious, attackers could gain unauthorized access to critical dat
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 4663
    file_path:
      - '*\\ScreenConnect\\App_Extensions\\*'
    file_name:
      - '*.aspx'
      - '*.ashx'
  condition: selection
tags:
  - attack.t1190
references:
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4663
  - https://www.huntress.com/blog/a-catastrophe-for-control-understanding-the-screenconnect-authentication-bypass
  - https://www.huntress.com/blog/detection-guidance-for-connectwise-cwe-288-2
  - https://www.connectwise.com/company/trust/security-bulletins/connectwise-screenconnect-23.9.8
custom_attributes:
  original_rule_id: 4e127857-1fc9-4c95-9d69-ba24c91d52d7
  source_format: splunk_spl