title: ConnectWise ScreenConnect Authentication Bypass
id: 17842af6-93e3-5ff3-b8a6-007ac9fa3d53
status: stable
level: high
description: |
  The following analytic detects attempts to exploit the ConnectWise ScreenConnect CVE-2024-1709 vulnerability, which allows attackers to bypass authentication via an alternate path or channel. It leverages web request logs to identify access to the SetupWizard.aspx page, indicating potential exploitation. This activity is significant as it can lead to unauthorized administrative access and remote code execution. If confirmed malicious, attackers could create administrative users and gain full con
author: Michael Haag, Splunk
logsource:
  product: splunk
  category: authentication
detection:
  selection:
    datamodel: Web
    status: 200
    http_method: POST
    url:
      - '*/SetupWizard.aspx/*'
      - '*/SetupWizard/'
  condition: selection
tags:
  - attack.t1190
references:
  - https://www.huntress.com/blog/a-catastrophe-for-control-understanding-the-screenconnect-authentication-bypass
  - https://www.huntress.com/blog/detection-guidance-for-connectwise-cwe-288-2
  - https://www.connectwise.com/company/trust/security-bulletins/connectwise-screenconnect-23.9.8
custom_attributes:
  original_rule_id: d3f7a803-e802-448b-8eb2-e796b223bfff
  source_format: splunk_spl