title: Control Loading from World Writable Directory
id: f8ec0be9-36d0-5fd5-99c5-248845cfadb5
status: stable
level: high
description: |
  The following analytic identifies instances of control.exe loading a .cpl or .inf file from a writable directory, which is related to CVE-2021-40444. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions mapped to the `Processes` node of the `Endpoint` data model. This activity is significant as it may indicate an attempt to exploit a known vulnerability, potentially leading to unauthorized code execution. If confir
author: Michael Haag, Splunk
logsource:
  product: splunk
detection:
  selection:
    process:
      - '*\\appdata\\*'
      - '*\\windows\\temp\\*'
      - '*\\programdata\\*'
  condition: selection
tags:
  - attack.t1218.002
references:
  - https://strontic.github.io/xcyclopedia/library/rundll32.exe-111474C61232202B5B588D2B512CBB25.html
  - https://app.any.run/tasks/36c14029-9df8-439c-bba0-45f2643b0c70/
  - https://attack.mitre.org/techniques/T1218/011/
  - https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-40444
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.002/T1218.002.yaml
custom_attributes:
  original_rule_id: 10423ac4-10c9-11ec-8dc4-acde48001122
  source_format: splunk_spl