title: Create Remote Thread into LSASS
id: 9b49e545-e944-5800-9a92-7c3819f14200
status: stable
level: high
description: |
  The following analytic detects the creation of a remote thread in the Local Security Authority Subsystem Service (LSASS). This behavior is identified using Sysmon EventID 8 logs, focusing on processes that create remote threads in lsass.exe. This activity is significant because it is commonly associated with credential dumping, a tactic used by adversaries to steal user authentication credentials. If confirmed malicious, this could allow attackers to gain unauthorized access to sensitive informa
author: Patrick Bareiss, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    eventid: 8
  condition: selection
tags:
  - attack.t1003.001
references:
  - https://2017.zeronights.org/wp-content/uploads/materials/ZN17_Kheirkhabarov_Hunting_for_Credentials_Dumping_in_Windows_Environment.pdf
custom_attributes:
  original_rule_id: 67d4dbef-9564-4699-8da8-03a151529edc
  source_format: splunk_spl