title: Creation of lsass Dump with Taskmgr
id: 649c4296-b598-5ea8-9248-0827cfdf60fa
status: stable
level: high
description: |
  The following analytic detects the creation of an lsass.exe process dump using Windows Task Manager. It leverages Sysmon EventID 11 to identify file creation events where the target filename matches *lsass*.dmp. This activity is significant because creating an lsass dump can be a precursor to credential theft, as the dump file contains sensitive information such as user passwords. If confirmed malicious, an attacker could use the lsass dump to extract credentials and escalate privileges, potenti
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    eventid: 11
  condition: selection
tags:
  - attack.t1003.001
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.001/T1003.001.md#atomic-test-5---dump-lsassexe-memory-using-windows-task-manager
  - https://attack.mitre.org/techniques/T1003/001/
  - https://2017.zeronights.org/wp-content/uploads/materials/ZN17_Kheirkhabarov_Hunting_for_Credentials_Dumping_in_Windows_Environment.pdf
custom_attributes:
  original_rule_id: b2fbe95a-9c62-4c12-8a29-24b97e84c0cd
  source_format: splunk_spl