title: Crowdstrike Medium Identity Risk Severity
id: 1f08d605-c674-5cfd-b458-812581f08ac2
status: stable
level: high
description: |
  The following analytic detects CrowdStrike alerts for Medium Identity Risk Severity with a risk score of 55 or higher. These alerts indicate significant vulnerabilities in user identities, such as suspicious behavior or compromised credentials. Promptly investigating and addressing these alerts is crucial to prevent potential security breaches and ensure the integrity and protection of sensitive information and systems.
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
detection:
  selection:
    riskscoreseverity: MEDIUM
  condition: selection
tags:
  - attack.t1110
references:
  - https://www.crowdstrike.com/wp-content/uploads/2022/12/CrowdStrike-Falcon-Event-Streams-Add-on-Guide-v3.pdf
custom_attributes:
  original_rule_id: c23b425c-9024-4bd7-b526-c18a4a51d93e
  source_format: splunk_spl