title: Crowdstrike Admin Weak Password Policy
id: 1f5edf65-6084-51a7-ab94-af1cebde3f6d
status: stable
level: high
description: |
  The following analytic detects CrowdStrike alerts for admin weak password policy violations, identifying instances where administrative passwords do not meet security standards. These alerts highlight significant vulnerabilities that could be exploited by attackers to gain unauthorized access. Promptly addressing these alerts is crucial for maintaining robust security and protecting critical systems and data from potential threats.
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
  category: authentication
detection:
  selection:
    primarydisplayname: '*admin*'
    risk_type: WEAK_PASSWORD_POLICY
  condition: selection
tags:
  - attack.t1110
references:
  - https://www.crowdstrike.com/wp-content/uploads/2022/12/CrowdStrike-Falcon-Event-Streams-Add-on-Guide-v3.pdf
custom_attributes:
  original_rule_id: bb1481fd-23c0-4195-b6a0-94d746c9637c
  source_format: splunk_spl