title: Crowdstrike Multiple LOW Severity Alerts
id: bae07442-dbcb-59c9-92f4-76a88f276fa7
status: stable
level: medium
description: |
  The following analytic detects multiple CrowdStrike LOW severity alerts, indicating a series of minor suspicious activities or policy violations. These alerts are not immediately critical but should be reviewed to prevent potential threats. They often highlight unusual behavior or low-level risks that, if left unchecked, could escalate into more significant security issues. Regular monitoring and analysis of these alerts are essential for maintaining robust security.
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
detection:
  selection:
    tag: alert
    severityname: LOW
  condition: selection
tags:
  - attack.t1110
references:
  - https://www.crowdstrike.com/wp-content/uploads/2022/12/CrowdStrike-Falcon-Event-Streams-Add-on-Guide-v3.pdf
custom_attributes:
  original_rule_id: 5c2c02d8-bee7-4f5c-9dea-e3e1012daddb
  source_format: splunk_spl