title: Crowdstrike Privilege Escalation For Non-Admin User
id: cd6fad41-a01c-588b-9241-484a934bcb68
status: stable
level: medium
description: |
  The following analytic detects CrowdStrike alerts for privilege escalation attempts by non-admin users. These alerts indicate unauthorized efforts by regular users to gain elevated permissions, posing a significant security risk. Detecting and addressing these attempts promptly helps prevent potential breaches and ensures that user privileges remain properly managed, maintaining the integrity of the organization's security protocols.
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
detection:
  selection:
    tag: alert
  condition: selection
tags:
  - attack.t1110
references:
  - https://www.crowdstrike.com/wp-content/uploads/2022/12/CrowdStrike-Falcon-Event-Streams-Add-on-Guide-v3.pdf
custom_attributes:
  original_rule_id: 69e2860c-0e4b-40ae-9dc4-bf9e3bf2a548
  source_format: splunk_spl