title: Crowdstrike Admin With Duplicate Password
id: d4c03fc5-f586-50e4-a3e0-164ab7a1b931
status: stable
level: high
description: |
  The following analytic detects CrowdStrike alerts for admin accounts with duplicate password risk, identifying instances where administrative users share the same password. This practice significantly increases the risk of unauthorized access and potential breaches. Addressing these alerts promptly is crucial for maintaining strong security protocols, ensuring each admin account uses a unique, secure password to protect critical systems and data.
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
  category: authentication
detection:
  selection:
    primarydisplayname: '*admin*'
    risk_type: DUPLICATE_PASSWORD
  condition: selection
tags:
  - attack.t1110
references:
  - https://www.crowdstrike.com/wp-content/uploads/2022/12/CrowdStrike-Falcon-Event-Streams-Add-on-Guide-v3.pdf
custom_attributes:
  original_rule_id: b8bccfbf-6ac2-40f2-83b6-e72b7efaa7d4
  source_format: splunk_spl