title: Crowdstrike User with Duplicate Password
id: 332d2338-5216-5c18-abf0-338948c5bad3
status: stable
level: medium
description: |
  The following analytic detects CrowdStrike alerts for non-admin accounts with duplicate password risk, identifying instances where multiple non-admin users share the same password. This practice weakens security and increases the potential for unauthorized access. Addressing these alerts is essential to ensure each user account has a unique, strong password, thereby enhancing overall security and protecting sensitive information.
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
  category: authentication
detection:
  selection:
    risk_type: DUPLICATE_PASSWORD
  filter:
    primarydisplayname: '*admin*'
  condition: selection and not filter
tags:
  - attack.t1110
references:
  - https://www.crowdstrike.com/wp-content/uploads/2022/12/CrowdStrike-Falcon-Event-Streams-Add-on-Guide-v3.pdf
custom_attributes:
  original_rule_id: 386dd914-16e5-400b-9bf6-25572cc4415a
  source_format: splunk_spl