title: Crowdstrike User Weak Password Policy
id: 0db7e383-e308-52c9-bcb0-3c06d796ffb8
status: stable
level: medium
description: |
  The following analytic detects CrowdStrike alerts for weak password policy violations, identifying instances where passwords do not meet the required security standards. These alerts highlight potential vulnerabilities that could be exploited by attackers, emphasizing the need for stronger password practices. Addressing these alerts promptly helps to enhance overall security and protect sensitive information from unauthorized access.
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
  category: authentication
detection:
  selection:
    risk_type: WEAK_PASSWORD_POLICY
  filter:
    primarydisplayname: '*admin*'
  condition: selection and not filter
tags:
  - attack.t1110
references:
  - https://www.crowdstrike.com/wp-content/uploads/2022/12/CrowdStrike-Falcon-Event-Streams-Add-on-Guide-v3.pdf
custom_attributes:
  original_rule_id: b49b6ef4-57cd-4d42-bd7e-64e00f11cc87
  source_format: splunk_spl