title: Crowdstrike High Identity Risk Severity
id: 910e443a-4f11-57ae-b951-d12289336ab1
status: stable
level: high
description: |
  The following analytic detects CrowdStrike alerts for High Identity Risk Severity with a risk score of 70 or higher. These alerts indicate significant vulnerabilities in user identities, such as suspicious behavior or compromised credentials. Promptly investigating and addressing these alerts is crucial to prevent potential security breaches and ensure the integrity and protection of sensitive information and systems.
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
detection:
  selection:
    riskscoreseverity: HIGH
  condition: selection
tags:
  - attack.t1110
references:
  - https://www.crowdstrike.com/wp-content/uploads/2022/12/CrowdStrike-Falcon-Event-Streams-Add-on-Guide-v3.pdf
custom_attributes:
  original_rule_id: 0df524ad-6d78-4883-9987-d29418928103
  source_format: splunk_spl