title: CrushFTP Server Side Template Injection
id: de95725e-545e-556c-a844-d3e195eaa07d
status: stable
level: high
description: |
  This analytic is designed to identify attempts to exploit a server-side template injection vulnerability in CrushFTP, designated as CVE-2024-4040. This severe vulnerability enables unauthenticated remote attackers to access and read files beyond the VFS Sandbox, circumvent authentication protocols, and execute arbitrary commands on the affected server. The issue impacts all versions of CrushFTP up to 10.7.1 and 11.1.0 on all supported platforms. It is highly recommended to apply patches immediat
author: Michael Haag, Splunk
logsource:
  product: splunk
detection:
  selection:
    field: _raw
  condition: selection
tags:
  - attack.t1190
references:
  - https://github.com/airbus-cert/CVE-2024-4040
  - https://www.bleepingcomputer.com/news/security/crushftp-warns-users-to-patch-exploited-zero-day-immediately/
custom_attributes:
  original_rule_id: ccf6b7a3-bd39-4bc9-a949-143a8d640dbc
  source_format: splunk_spl