title: Delete ShadowCopy With PowerShell
id: 25520adc-2478-5594-b364-d69f11b44dcb
status: stable
level: high
description: |
  The following analytic detects the use of PowerShell to delete shadow copies via the WMIC PowerShell module. It leverages EventCode 4104 and searches for specific keywords like "ShadowCopy," "Delete," or "Remove" within the ScriptBlockText. This activity is significant because deleting shadow copies is a common tactic used by ransomware, such as DarkSide, to prevent data recovery. If confirmed malicious, this action could lead to irreversible data loss and hinder recovery efforts, significantly 
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    scriptblocktext:
      - '*ShadowCopy*'
      - '*Delete*'
      - '*Remove*'
    eventcode: 4104
  condition: selection
tags:
  - attack.t1490
references:
  - https://www.mandiant.com/resources/shining-a-light-on-darkside-ransomware-operations
  - https://www.techtarget.com/searchwindowsserver/tutorial/Set-up-PowerShell-script-block-logging-for-added-security
custom_attributes:
  original_rule_id: 5ee2bcd0-b2ff-11eb-bb34-acde48001122
  source_format: splunk_spl