title: Detect Rare Executables
id: a88d3f5a-e7df-5b78-8c8b-46648366433d
status: stable
level: medium
description: |
  The following analytic detects the execution of rare processes that appear only once across the network within a specified timeframe. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs. This activity is significant for a SOC as it helps identify potentially malicious activities or unauthorized software, which could indicate a security breach or ongoing attack. If confirmed malicious, such rare processes could lead to data theft, privilege esca
author: Bhavin Patel, Splunk
logsource:
  product: splunk
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1204
custom_attributes:
  original_rule_id: 44fddcb2-8d3b-454c-874e-7c6de5a4f7ac
  source_format: splunk_spl