title: Detect Renamed WinRAR
id: fe9f5bc6-90bb-58dd-b9d6-fae95d6382f6
status: stable
level: low
description: |
  The following analytic identifies instances where `WinRAR.exe` has been renamed and executed. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and original file names within the Endpoint data model. This activity is significant because renaming executables is a common tactic used by attackers to evade detection. If confirmed malicious, this could indicate an attempt to bypass security controls, potentially leading to unauthorized data extraction or f
author: Michael Haag, Splunk
logsource:
  product: splunk
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1560.001
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1560.001/T1560.001.md
custom_attributes:
  original_rule_id: 1b7bfb2c-b8e6-11eb-99ac-acde48001122
  source_format: splunk_spl