title: Detect GCP Storage access from a new IP
id: ea25e458-3dd4-53b6-8dd2-186d498aca23
status: experimental
level: medium
description: |
  The following analytic identifies access to GCP Storage buckets from new or previously unseen remote IP addresses. It leverages GCP Storage bucket-access logs ingested via Cloud Pub/Sub and compares current access events against a lookup table of previously seen IP addresses. This activity is significant as it may indicate unauthorized access or potential reconnaissance by an attacker. If confirmed malicious, this could lead to data exfiltration, unauthorized data manipulation, or further compro
author: Shannon Davis, Splunk
logsource:
  product: gcp
detection:
  selection:
    status: \
    append: t
    newip: 1
  condition: selection
tags:
  - attack.t1530
custom_attributes:
  original_rule_id: ccc3246a-daa1-11ea-87d0-0242ac130022
  source_format: splunk_spl