title: Detect Web Access to Decommissioned S3 Bucket
id: 99715ef9-7142-56ee-b698-d992035761cc
status: experimental
level: medium
description: |
  This detection identifies web requests to domains that match previously decommissioned S3 buckets through web proxy logs. This activity is significant because attackers may attempt to access or recreate deleted S3 buckets that were previously public to hijack them for malicious purposes. If successful, this could allow attackers to host malicious content or exfiltrate data through compromised bucket names that may still be referenced by legitimate applications.
author: Jose Hernandez, Splunk
logsource:
  product: aws
detection:
  selection:
    datamodel: Web
  condition: selection
tags:
  - attack.t1485
references:
  - https://docs.aws.amazon.com/AmazonS3/latest/userguide/access-control-block-public-access.html
  - https://labs.watchtowr.com/8-million-requests-later-we-made-the-solarwinds-supply-chain-attack-look-amateur/
custom_attributes:
  original_rule_id: 3a1d8f62-5b9c-4e7d-b8f3-9d6a8e2f5e1f
  source_format: splunk_spl