title: Detect Remote Access Software Usage FileInfo
id: 92530434-9569-58f3-b1b3-0ba823173eb1
status: stable
level: medium
description: |
  The following analytic detects the execution of processes with file or code signing attributes from known remote access software within the environment. It leverages Sysmon EventCode 1 data and cross-references a lookup table of remote access utilities such as AnyDesk, GoToMyPC, LogMeIn, and TeamViewer. This activity is significant as adversaries often use these tools to maintain unauthorized remote access. If confirmed malicious, this could allow attackers to persist in the environment, potenti
author: Steven Dick
logsource:
  product: windows
  category: file_event
detection:
  selection:
    eventcode: 1
    isutility: 'True'
  condition: selection
tags:
  - attack.t1219
references:
  - https://attack.mitre.org/techniques/T1219/
  - https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
  - https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/
custom_attributes:
  original_rule_id: ccad96d7-a48c-4f13-8b9c-9f6a31cba454
  source_format: splunk_spl