title: Detect Remote Access Software Usage Traffic
id: 2a83e5ec-713e-54c3-a2de-fdbe2bfcc9e7
status: stable
level: medium
description: |
  The following analytic detects network traffic associated with known remote access software applications, such as AnyDesk, GoToMyPC, LogMeIn, and TeamViewer. It leverages Palo Alto traffic logs mapped to the Network_Traffic data model in Splunk. This activity is significant because adversaries often use remote access tools to maintain unauthorized access to compromised environments. If confirmed malicious, this activity could allow attackers to control systems remotely, exfiltrate data, or deplo
author: Steven Dick
logsource:
  product: splunk
detection:
  selection:
    datamodel: Network_Traffic
    isutility: 'True'
  condition: selection
tags:
  - attack.t1219
references:
  - https://attack.mitre.org/techniques/T1219/
  - https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
  - https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/
  - https://applipedia.paloaltonetworks.com/
custom_attributes:
  original_rule_id: 885ea672-07ee-475a-879e-60d28aa5dd42
  source_format: splunk_spl