title: Detect Password Spray Attack Behavior From Source
id: 7f660944-7e78-5d4e-bd1a-dbe0571266d3
status: stable
level: high
description: |
  The following analytic identifies one source failing to authenticate with 10 or more unique users. This behavior could represent an adversary performing a Password Spraying attack to obtain initial access or elevate privileges. This logic can be used for real time security monitoring as well as threat hunting exercises and works well against any number of data sources ingested into the CIM datamodel. Environments can be very different depending on the organization. Test and customize this detect
author: Steven Dick
logsource:
  product: splunk
  category: authentication
detection:
  selection:
    action:
      - success
      - success
      - failure
      - failure
  condition: selection
tags:
  - attack.t1110.003
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://www.microsoft.com/en-us/security/blog/2020/04/23/protecting-organization-password-spray-attacks/
  - https://github.com/MarkoH17/Spray365
custom_attributes:
  original_rule_id: b6391b15-e913-4c2c-8949-9eecc06efacc
  source_format: splunk_spl