title: Detect Software Download To Network Device
id: 9c99677c-cf65-58ce-b64e-09cb82cf9630
status: experimental
level: high
description: |
  The following analytic identifies unauthorized software downloads to network devices via TFTP, FTP, or SSH/SCP. It detects this activity by analyzing network traffic events on specific ports (69, 21, 22) from devices categorized as network, router, or switch. This activity is significant because adversaries may exploit netbooting to load unauthorized operating systems, potentially compromising network integrity. If confirmed malicious, this could lead to unauthorized control over network devices
author: Mikael Bjerkeland, Splunk
logsource:
  product: linux
  category: network_connection
detection:
  selection:
    datamodel: Network_Traffic
    transport:
      - udp
      - tcp
      - tcp
    src_category:
      - network
      - router
      - switch
  condition: selection
tags:
  - attack.t1542.005
custom_attributes:
  original_rule_id: cc590c66-f65f-48f2-986a-4797244762f8
  source_format: splunk_spl