title: Detect PsExec With accepteula Flag
id: 05030b00-47e3-59ac-9771-04a86b3498ac
status: stable
level: high
description: |
  The following analytic identifies the execution of `PsExec.exe` with the `accepteula` flag in the command line. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs and command-line arguments. This activity is significant because PsExec is commonly used by threat actors to execute code on remote systems, and the `accepteula` flag indicates first-time usage, which could signify initial compromise. If confirmed malicious, this activity could allow
author: Bhavin Patel, Splunk
logsource:
  product: splunk
detection:
  selection:
    original_file_name: psexec.c
    process_name:
      - psexec.exe
      - psexec64.exe
  condition: selection
tags:
  - attack.t1021.002
references:
  - https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF
custom_attributes:
  original_rule_id: 27c3a83d-cada-47c6-9042-67baf19d2574
  source_format: splunk_spl