title: Detect Password Spray Attack Behavior On User
id: f030224a-3460-5725-b3bf-f67741992cca
status: stable
level: high
description: |
  The following analytic identifies any user failing to authenticate from 10 or more unique sources. This behavior could represent an adversary performing a Password Spraying attack to obtain initial access or elevate privileges. This logic can be used for real time security monitoring as well as threat hunting exercises. Environments can be very different depending on the organization. Test and customize this detections thresholds as needed
author: Steven Dick
logsource:
  product: splunk
  category: authentication
detection:
  selection:
    action:
      - success
      - success
      - failure
      - failure
  condition: selection
tags:
  - attack.t1110.003
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://www.microsoft.com/en-us/security/blog/2020/04/23/protecting-organization-password-spray-attacks/
  - https://github.com/MarkoH17/Spray365
custom_attributes:
  original_rule_id: a7539705-7183-4a12-9b6a-b6eef645a6d7
  source_format: splunk_spl