title: Detect Spike in S3 Bucket deletion
id: 5fc20f0f-3014-5757-a530-07161273ee1a
status: experimental
level: medium
description: |
  The following analytic identifies a spike in API activity related to the deletion of S3 buckets in your AWS environment. It leverages AWS CloudTrail logs to detect anomalies by comparing current deletion activity against a historical baseline. This activity is significant as unusual spikes in S3 bucket deletions could indicate malicious actions such as data exfiltration or unauthorized data destruction. If confirmed malicious, this could lead to significant data loss, disruption of services, and
author: Bhavin Patel, Splunk
logsource:
  product: aws
detection:
  selection:
    eventname:
      - DeleteBucket
      - DeleteBucket
    output:
      - arn
      - user
      - bucketName
    append: t
    newavgapicalls: avgApiCalls
    deviationthreshold: 3
    isspike: 1
  condition: selection
tags:
  - attack.t1530
custom_attributes:
  original_rule_id: e733a326-59d2-446d-b8db-14a17151aa68
  source_format: splunk_spl