title: Detect IPv6 Network Infrastructure Threats
id: 92575251-dca3-5131-a9c1-cf0b1c251480
status: experimental
level: high
description: |
  The following analytic detects IPv6 network infrastructure threats by identifying suspicious activities such as IP and MAC address theft or packet drops. It leverages logs from Cisco network devices configured with First Hop Security measures like RA Guard and DHCP Guard. This activity is significant as it can indicate attempts to compromise network integrity and security. If confirmed malicious, attackers could manipulate network traffic, leading to potential data interception, unauthorized acc
author: Mikael Bjerkeland, Splunk
logsource:
  product: splunk
  category: network_connection
detection:
  selection:
    facility: SISF
    mnemonic:
      - IP_THEFT
      - MAC_THEFT
      - MAC_AND_IP_THEFT
      - PAK_DROP
  condition: selection
tags:
  - attack.t1200
  - attack.t1498
  - attack.t1557.002
references:
  - https://www.ciscolive.com/c/dam/r/ciscolive/emea/docs/2020/pdf/BRKSEC-3200.pdf
  - https://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ipv6_fhsec/configuration/xe-16-12/ip6f-xe-16-12-book/ip6-ra-guard.html
  - https://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ipv6_fhsec/configuration/xe-16-12/ip6f-xe-16-12-book/ip6-snooping.html
  - https://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ipv6_fhsec/configuration/xe-16-12/ip6f-xe-16-12-book/ip6-dad-proxy.html
  - https://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ipv6_fhsec/configuration/xe-16-12/ip6f-xe-16-12-book/ip6-nd-mcast-supp.html
custom_attributes:
  original_rule_id: c3be767e-7959-44c5-8976-0e9c12a91ad2
  source_format: splunk_spl