title: Detect Credential Dumping through LSASS access
id: 39591f5a-05eb-5c52-8916-aa9b8778e713
status: stable
level: high
description: |
  The following analytic detects attempts to read LSASS memory, indicative of credential dumping. It leverages Sysmon EventCode 10, filtering for specific access permissions (0x1010 and 0x1410) on the lsass.exe process. This activity is significant because it suggests an attacker is trying to extract credentials from LSASS memory, potentially leading to unauthorized access, data breaches, and compromise of sensitive information. If confirmed malicious, this could enable attackers to escalate privi
author: Patrick Bareiss, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    eventcode: 10
    grantedaccess: 0x1010
  condition: selection
tags:
  - attack.t1003.001
custom_attributes:
  original_rule_id: 2c365e57-4414-4540-8dc0-73ab10729996
  source_format: splunk_spl