title: Detect S3 access from a new IP
id: 933f97e4-632e-55f2-abd1-ba257b4652ea
status: experimental
level: medium
description: |
  The following analytic identifies access to an S3 bucket from a new or previously unseen remote IP address. It leverages S3 bucket-access logs, specifically focusing on successful access events (http_status=200). This activity is significant because access from unfamiliar IP addresses could indicate unauthorized access or potential data exfiltration attempts. If confirmed malicious, this activity could lead to unauthorized data access, data theft, or further exploitation of the compromised S3 bu
author: Bhavin Patel, Splunk
logsource:
  product: aws
detection:
  selection:
    http_status:
      - 200
      - 200
    append: t
    newip: 1
  condition: selection
tags:
  - attack.t1530
custom_attributes:
  original_rule_id: e6f1bb1b-f441-492b-9126-902acda217da
  source_format: splunk_spl