title: Detect mshta inline hta execution
id: 0b03f46a-788e-5ee1-bc85-647633ae2b0b
status: stable
level: high
description: |
  The following analytic detects the execution of "mshta.exe" with inline protocol handlers such as "JavaScript", "VBScript", and "About". It leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line arguments and process details. This activity is significant because mshta.exe can be exploited to execute malicious scripts, potentially leading to unauthorized code execution. If confirmed malicious, this could allow an attacker to execute arbitrary code, escalate pri
author: Bhavin Patel, Michael Haag, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1218.005
references:
  - https://github.com/redcanaryco/AtomicTestHarnesses
  - https://redcanary.com/blog/introducing-atomictestharnesses/
  - https://docs.microsoft.com/en-us/windows/win32/search/-search-3x-wds-extidx-prot-implementing
custom_attributes:
  original_rule_id: a0873b32-5b68-11eb-ae93-0242ac130002
  source_format: splunk_spl