title: Detect Path Interception By Creation Of program exe
id: 47f719f7-3cf0-5643-bcfe-44b9b2d003f7
status: stable
level: high
description: |
  The following analytic identifies the creation of a program executable in an unquoted service path, a common technique for privilege escalation. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process creation events where the parent process is 'services.exe'. This activity is significant because unquoted service paths can be exploited by attackers to execute arbitrary code with elevated privileges. If confirmed malicious, this could allow an attacker to gain hig
author: Patrick Bareiss, Splunk
logsource:
  product: splunk
detection:
  selection:
    field: process
  condition: selection
tags:
  - attack.t1574.009
references:
  - https://medium.com/@SumitVerma101/windows-privilege-escalation-part-1-unquoted-service-path-c7a011a8d8ae
custom_attributes:
  original_rule_id: cbef820c-e1ff-407f-887f-0a9240a2d477
  source_format: splunk_spl