title: Detect Password Spray Attempts
id: dcf929f0-c108-5a83-bc8c-9b017f1dd57a
status: stable
level: high
description: |
  This analytic employs the 3-sigma approach to detect an unusual volume of failed authentication attempts from a single source. A password spray attack is a type of brute force attack where an attacker tries a few common passwords across many different accounts to avoid detection and account lockouts. By utilizing the Authentication Data Model, this detection is effective for all CIM-mapped authentication events, providing comprehensive coverage and enhancing security against these attacks.
author: Dean Luxton
logsource:
  product: splunk
  category: authentication
detection:
  selection:
    action: failure
    span:
      - 5m
      - 5m
    limit: 0
    value: 0
    isoutlier: 1
    src:
      - '-'
      - unknown
  condition: selection
tags:
  - attack.t1110.003
references:
  - https://attack.mitre.org/techniques/T1110/003/
custom_attributes:
  original_rule_id: 086ab581-8877-42b3-9aee-4a7ecb0923af
  source_format: splunk_spl