title: Detect Traffic Mirroring
id: 65e4f082-3def-5fae-bc92-480f1efb3372
status: experimental
level: high
description: |
  The following analytic detects the initiation of traffic mirroring sessions on Cisco network devices. It leverages logs with specific mnemonics and facilities related to traffic mirroring, such as "ETH_SPAN_SESSION_UP" and "PKTCAP_START." This activity is significant because adversaries may use traffic mirroring to exfiltrate data by duplicating and forwarding network traffic to an external destination. If confirmed malicious, this could allow attackers to capture sensitive information, monitor 
author: Mikael Bjerkeland, Splunk
logsource:
  product: splunk
detection:
  selection:
    facility:
      - MIRROR
      - SPAN
      - SPAN
    mnemonic:
      - ETH_SPAN_SESSION_UP
      - SESSION_UP
      - PKTCAP_START
      - CFGLOG_LOGGEDCMD
    command: monitor session*
  condition: selection
tags:
  - attack.t1020.001
  - attack.t1200
  - attack.t1498
custom_attributes:
  original_rule_id: 42b3b753-5925-49c5-9742-36fa40a73990
  source_format: splunk_spl