title: Detect SNICat SNI Exfiltration
id: e90588a9-0048-50bb-8a72-c74fbe5f41ee
status: experimental
level: high
description: |
  The following analytic identifies the use of SNICat tool commands within the TLS SNI field, indicating potential data exfiltration attempts. It leverages Zeek SSL data to detect specific SNICat commands such as LIST, LS, SIZE, LD, CB, EX, ALIVE, EXIT, WHERE, and finito in the server_name field. This activity is significant as SNICat is a known tool for covert data exfiltration using TLS. If confirmed malicious, this could allow attackers to exfiltrate sensitive data undetected, posing a severe t
author: Shannon Davis, Splunk
logsource:
  product: splunk
detection:
  selection:
    field: server_name
  condition: selection
tags:
  - attack.t1041
references:
  - https://www.mnemonic.io/resources/blog/introducing-snicat/
  - https://github.com/mnemonic-no/SNIcat
  - https://attack.mitre.org/techniques/T1041/
custom_attributes:
  original_rule_id: 82d06410-134c-11eb-adc1-0242ac120002
  source_format: splunk_spl