title: Detect suspicious DNS TXT records using pretrained model in DSDL
id: 6b289a07-2108-57db-ad06-4712184f1740
status: experimental
level: medium
description: |
  The following analytic identifies suspicious DNS TXT records using a pre-trained deep learning model. It leverages DNS response data from the Network Resolution data model, categorizing TXT records into known types via regular expressions. Records that do not match known patterns are flagged as suspicious. This activity is significant as DNS TXT records can be used for data exfiltration or command-and-control communication. If confirmed malicious, attackers could use these records to covertly tr
author: Abhinav Mishra, Kumar Sharad and Namratha Sreekanta, Splunk
logsource:
  product: splunk
  category: network_connection
detection:
  selection:
    datamodel: Network_Resolution
    message_type: response
    record_type: TXT
  condition: selection
tags:
  - attack.t1568.002
references:
  - https://attack.mitre.org/techniques/T1071/004/
  - https://unit42.paloaltonetworks.com/dns-tunneling-how-dns-can-be-abused-by-malicious-actors/
  - https://en.wikipedia.org/wiki/TXT_record
custom_attributes:
  original_rule_id: 92f65c3a-968c-11ed-a1eb-0242ac120002
  source_format: splunk_spl