title: Detect SharpHound Command-Line Arguments
id: c1b88e46-e16f-5a4f-9d29-d245fec55b31
status: stable
level: high
description: |
  The following analytic detects the execution of SharpHound command-line arguments, specifically `-collectionMethod` and `invoke-bloodhound`. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant as SharpHound is commonly used for Active Directory enumeration, which can be a precursor to lateral movement or privilege escalation. If confirmed malicious, this activity could allow an attacker to map ou
author: Michael Haag, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    process:
      - '*-collectionMethod*'
      - '*invoke-bloodhound*'
  condition: selection
tags:
  - attack.t1069.001
  - attack.t1069.002
  - attack.t1087.001
  - attack.t1087.002
  - attack.t1482
references:
  - https://attack.mitre.org/software/S0521/
  - https://thedfirreport.com/?s=bloodhound
  - https://github.com/BloodHoundAD/BloodHound/tree/master/Collectors
  - https://github.com/BloodHoundAD/SharpHound3
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1059.001/T1059.001.md#atomic-test-2---run-bloodhound-from-local-disk
custom_attributes:
  original_rule_id: a0bdd2f6-c2ff-11eb-b918-acde48001122
  source_format: splunk_spl