title: Detect AWS Console Login by User from New City
id: 34034c34-fcd3-5d25-8e56-04fc0384afa3
status: stable
level: low
description: |
  The following analytic identifies AWS console login events by users from a new city within the last hour. It leverages AWS CloudTrail events and compares them against a lookup file of previously seen user locations. This activity is significant for a SOC as it may indicate unauthorized access or credential compromise, especially if the login originates from an unusual location. If confirmed malicious, this could lead to unauthorized access to AWS resources, data exfiltration, or further exploita
author: Bhavin Patel, Eric McGinnis Splunk
logsource:
  product: aws
  category: authentication
detection:
  selection:
    usercity: New City
    datamodel: Authentication
    signature: ConsoleLogin
    type: outer
  condition: selection
tags:
  - attack.t1535
  - attack.t1586.003
custom_attributes:
  original_rule_id: 121b0b11-f8ac-4ed6-a132-3800ca4fc07a
  source_format: splunk_spl