title: Detect Zerologon via Zeek
id: 44e9b385-ad40-5a6a-8205-3ebc1f6a6ca1
status: experimental
level: high
description: |
  The following analytic detects attempts to exploit the Zerologon CVE-2020-1472 vulnerability via Zeek RPC. It leverages Zeek DCE-RPC data to identify specific operations: NetrServerPasswordSet2, NetrServerReqChallenge, and NetrServerAuthenticate3. This activity is significant because it indicates an attempt to gain unauthorized access to a domain controller, potentially leading to a complete takeover of an organization's IT infrastructure. If confirmed malicious, the impact could be severe, incl
author: Shannon Davis, Splunk
logsource:
  product: splunk
detection:
  selection:
    span: 5m
    opscount: 3
    operation:
      - NetrServerPasswordSet2
      - NetrServerReqChallenge
      - NetrServerAuthenticate3
  condition: selection
tags:
  - attack.t1190
references:
  - https://www.secura.com/blog/zero-logon
  - https://github.com/SecuraBV/CVE-2020-1472
  - https://msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2020-1472
  - https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-319a
custom_attributes:
  original_rule_id: bf7a06ec-f703-11ea-adc1-0242ac120002
  source_format: splunk_spl