title: Detect Remote Access Software Usage DNS
id: 3cb5a47a-2ae3-547d-830d-0ae809e74b46
status: stable
level: medium
description: |
  The following analytic detects DNS queries to domains associated with known remote access software such as AnyDesk, GoToMyPC, LogMeIn, and TeamViewer. This detection is crucial as adversaries often use these tools to maintain access and control over compromised environments. Identifying such behavior is vital for a Security Operations Center (SOC) because unauthorized remote access can lead to data breaches, ransomware attacks, and other severe impacts if these threats are not mitigated promptly
author: Steven Dick
logsource:
  product: splunk
  category: network_connection
detection:
  selection:
    datamodel: Network_Resolution
    dest: query
    isutility: 'True'
  condition: selection
tags:
  - attack.t1219
references:
  - https://attack.mitre.org/techniques/T1219/
  - https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
  - https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/
custom_attributes:
  original_rule_id: a16b797d-e309-41bd-8ba0-5067dae2e4be
  source_format: splunk_spl