title: Detect Spike in AWS Security Hub Alerts for EC2 Instance
id: d4554ca1-7506-5c5c-a965-94f99364f9e3
status: stable
level: medium
description: |
  The following analytic identifies a spike in the number of AWS Security Hub alerts for an EC2 instance within a 4-hour interval. It leverages AWS Security Hub findings data, calculating the average and standard deviation of alerts to detect anomalies. This activity is significant for a SOC as a sudden increase in alerts may indicate potential security incidents or misconfigurations requiring immediate attention. If confirmed malicious, this could signify an ongoing attack, leading to unauthorize
author: Bhavin Patel, Splunk
logsource:
  product: aws
detection:
  selection:
    span: 4h
    threshold_value: 3
    isoutlier: 1
  condition: selection
custom_attributes:
  original_rule_id: 2a9b80d3-6340-4345-b5ad-290bf5d0d222
  source_format: splunk_spl