title: Detect Exchange Web Shell
id: 9fdd81a6-e08d-5d49-bf4c-cd6ee3a2d3b7
status: stable
level: high
description: |
  The following analytic identifies the creation of suspicious .aspx files in known drop locations for Exchange exploitation, specifically targeting paths associated with HAFNIUM group and vulnerabilities like ProxyShell and ProxyNotShell. It leverages data from the Endpoint datamodel, focusing on process and filesystem events. This activity is significant as it may indicate a web shell deployment, a common method for persistent access and remote code execution. If confirmed malicious, attackers c
author: Michael Haag, Shannon Davis, David Dorsey, Splunk
logsource:
  product: splunk
detection:
  selection:
    file_path:
      - '*\\HttpProxy\\owa\\auth\\*'
      - '*\\inetpub\\wwwroot\\aspnet_client\\*'
      - '*\\HttpProxy\\OAB\\*'
    file_name:
      - '*.aspx'
      - '*.ashx'
  condition: selection
tags:
  - attack.t1133
  - attack.t1190
  - attack.t1505.003
references:
  - https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/Sample%20Data/Feeds/MSTICIoCs-ExchangeServerVulnerabilitiesDisclosedMarch2021.csv
  - https://www.zerodayinitiative.com/blog/2021/8/17/from-pwn2own-2021-a-new-attack-surface-on-microsoft-exchange-proxyshell
  - https://www.youtube.com/watch?v=FC6iHw258RI
  - https://www.huntress.com/blog/rapid-response-microsoft-exchange-servers-still-vulnerable-to-proxyshell-exploit#what-should-you-do
custom_attributes:
  original_rule_id: 8c14eeee-2af1-4a4b-bda8-228da0f4862a
  source_format: splunk_spl