title: Detect DNS Query to Decommissioned S3 Bucket
id: d4010e2b-8393-5bac-8f3e-17ca7efd0ea2
status: experimental
level: medium
description: |
  This detection identifies DNS queries to domains that match previously decommissioned S3 buckets. This activity is significant because attackers may attempt to recreate deleted S3 buckets that were previously public to hijack them for malicious purposes. If successful, this could allow attackers to host malicious content or exfiltrate data through compromised bucket names that may still be referenced by legitimate applications.
author: Jose Hernandez, Splunk
logsource:
  product: aws
  category: network_connection
detection:
  selection:
    datamodel: Network_Resolution
    message_type: QUERY
  condition: selection
tags:
  - attack.t1485
references:
  - https://docs.aws.amazon.com/AmazonS3/latest/userguide/access-control-block-public-access.html
  - https://labs.watchtowr.com/8-million-requests-later-we-made-the-solarwinds-supply-chain-attack-look-amateur/
custom_attributes:
  original_rule_id: 2f1c5fd1-4b8a-4f5d-a0e9-7d6a8e2f5e1e
  source_format: splunk_spl