title: Detect HTML Help Spawn Child Process
id: 3841641f-18cf-56bc-8da9-c046104fac6e
status: stable
level: high
description: |
  The following analytic detects the execution of hh.exe (HTML Help) spawning a child process, indicating the use of a Compiled HTML Help (CHM) file to execute Windows script code. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process creation events where hh.exe is the parent process. This activity is significant as it may indicate an attempt to execute malicious scripts via CHM files, a known technique for bypassing security controls. If confirmed m
author: Michael Haag, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1218.001
references:
  - https://attack.mitre.org/techniques/T1218/001/
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.001/T1218.001.md
  - https://lolbas-project.github.io/lolbas/Binaries/Hh/
  - https://gist.github.com/mgeeky/cce31c8602a144d8f2172a73d510e0e7
  - https://web.archive.org/web/20220119133748/https://cyberforensicator.com/2019/01/20/silence-dissecting-malicious-chm-files-and-performing-forensic-analysis/
custom_attributes:
  original_rule_id: 723716de-ee55-4cd4-9759-c44e7e55ba4b
  source_format: splunk_spl