title: Detect suspicious processnames using pretrained model in DSDL
id: 8c20b12b-f96a-5d5f-a047-3de2b8f011a7
status: experimental
level: medium
description: |
  The following analytic identifies suspicious process names using a pre-trained Deep Learning model. It leverages Endpoint Detection and Response (EDR) telemetry to analyze process names and predict their likelihood of being malicious. The model, a character-level Recurrent Neural Network (RNN), classifies process names as benign or suspicious based on a threshold score of 0.5. This detection is significant as it helps identify malware, such as TrickBot, which often uses randomly generated filena
author: Abhinav Mishra, Kumar Sharad and Namratha Sreekanta, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1059
references:
  - https://www.cisa.gov/uscert/ncas/alerts/aa20-302a
  - https://www.splunk.com/en_us/blog/security/random-words-on-entropy-and-dns.html
custom_attributes:
  original_rule_id: a15f8977-ad7d-4669-92ef-b59b97219bf5
  source_format: splunk_spl