title: Detect Regasm Spawning a Process
id: ca803be9-214e-58dd-9334-8bbbf110dc34
status: stable
level: high
description: |
  The following analytic detects regasm.exe spawning a child process. This behavior is identified using data from Endpoint Detection and Response (EDR) agents, focusing on process creation events where regasm.exe is the parent process. This activity is significant because regasm.exe spawning a process is rare and can indicate an attempt to bypass application control mechanisms. If confirmed malicious, this could allow an attacker to execute arbitrary code, potentially leading to privilege escalati
author: Michael Haag, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    process_name:
      - conhost.exe
  condition: selection
tags:
  - attack.t1218.009
references:
  - https://attack.mitre.org/techniques/T1218/009/
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.009/T1218.009.md
  - https://lolbas-project.github.io/lolbas/Binaries/Regsvcs/
  - https://lolbas-project.github.io/lolbas/Binaries/Regasm/
custom_attributes:
  original_rule_id: 72170ec5-f7d2-42f5-aefb-2b8be6aad15f
  source_format: splunk_spl