title: Detect Remote Access Software Usage File
id: ef5e448a-6ab3-526a-a218-7ac680d36e59
status: stable
level: medium
description: |
  The following analytic detects the writing of files from known remote access software to disk within the environment. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on file path, file name, and user information. This activity is significant as adversaries often use remote access tools like AnyDesk, GoToMyPC, LogMeIn, and TeamViewer to maintain unauthorized access. If confirmed malicious, this could allow attackers to persist in the environment, potentially leading 
author: Steven Dick
logsource:
  product: splunk
  category: file_event
detection:
  selection:
    isutility: 'TRUE'
  condition: selection
tags:
  - attack.t1219
references:
  - https://attack.mitre.org/techniques/T1219/
  - https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
  - https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/
custom_attributes:
  original_rule_id: 3bf5541a-6a45-4fdc-b01d-59b899fff961
  source_format: splunk_spl