title: Detect Regsvcs Spawning a Process
id: 63f1fced-0bfc-5694-940f-073a1aace7a6
status: stable
level: high
description: |
  The following analytic identifies regsvcs.exe spawning a child process. This behavior is detected using Endpoint Detection and Response (EDR) telemetry, focusing on process creation events where the parent process is regsvcs.exe. This activity is significant because regsvcs.exe rarely spawns child processes, and such behavior can indicate an attempt to bypass application control mechanisms. If confirmed malicious, this could allow an attacker to execute arbitrary code, potentially leading to pri
author: Michael Haag, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1218.009
references:
  - https://attack.mitre.org/techniques/T1218/009/
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.009/T1218.009.md
  - https://lolbas-project.github.io/lolbas/Binaries/Regsvcs/
custom_attributes:
  original_rule_id: bc477b57-5c21-4ab6-9c33-668772e7f114
  source_format: splunk_spl