title: Detect New Open S3 buckets
id: 15ae0a50-82a0-553a-90be-b90efe523bba
status: stable
level: high
description: |
  The following analytic identifies the creation of open/public S3 buckets in AWS. It detects this activity by analyzing AWS CloudTrail events for `PutBucketAcl` actions where the access control list (ACL) grants permissions to all users or authenticated users. This activity is significant because open S3 buckets can expose sensitive data to unauthorized access, leading to data breaches. If confirmed malicious, an attacker could read, write, or fully control the contents of the bucket, potentially
author: Bhavin Patel, Patrick Bareiss, Splunk
logsource:
  product: aws
detection:
  selection:
    eventname: PutBucketAcl
    field: _raw
    input:
      - json_field
      - grantees
      - grantees
    output:
      - grantees
      - uri
      - permission
    path: Permission
    uri:
      - 'http://acs.amazonaws.com/groups/global/AllUsers'
      - 'http://acs.amazonaws.com/groups/global/AuthenticatedUsers'
    permission:
      - READ
      - READ_ACP
      - WRITE
      - WRITE_ACP
      - FULL_CONTROL
  condition: selection
tags:
  - attack.t1530
custom_attributes:
  original_rule_id: 2a9b80d3-6340-4345-b5ad-290bf3d0dac4
  source_format: splunk_spl