title: Detect New Open S3 Buckets over AWS CLI
id: 3f82521e-2db0-5b8d-bef7-f3309400f5cc
status: stable
level: high
description: |
  The following analytic detects the creation of open/public S3 buckets via the AWS CLI. It leverages AWS CloudTrail logs to identify events where a user has set bucket permissions to allow access to "AuthenticatedUsers" or "AllUsers." This activity is significant because open S3 buckets can expose sensitive data to unauthorized users, leading to data breaches. If confirmed malicious, an attacker could gain unauthorized access to potentially sensitive information stored in the S3 bucket, posing a 
author: Patrick Bareiss, Splunk
logsource:
  product: aws
detection:
  selection:
    eventsource: s3.amazonaws.com
    useragent: [aws-cli*
    eventname: PutBucketAcl
    acp:
      - '*AuthenticatedUsers'
      - '*AllUsers'
    write:
      - '*AuthenticatedUsers'
      - '*AllUsers'
    control:
      - '*AuthenticatedUsers'
      - '*AllUsers'
  condition: selection
tags:
  - attack.t1530
custom_attributes:
  original_rule_id: 39c61d09-8b30-4154-922b-2d0a694ecc22
  source_format: splunk_spl