title: Detect Distributed Password Spray Attempts
id: 6f9f8fc7-93db-5ee1-aac7-67c2cc656117
status: stable
level: low
description: |
  This analytic employs the 3-sigma approach to identify distributed password spray attacks. A distributed password spray attack is a type of brute force attack where the attacker attempts a few common passwords against many different accounts, connecting from multiple IP addresses to avoid detection. By utilizing the Authentication Data Model, this detection is effective for all CIM-mapped authentication events, providing comprehensive coverage and enhancing security against these attacks.
author: Dean Luxton
logsource:
  product: splunk
  category: authentication
detection:
  selection:
    action: failure
    user_agent: '*'
    span:
      - 10m
      - 10m
    limit: 0
    value: 0
    isoutlier: 1
    src:
      - '-'
      - unknown
  condition: selection
tags:
  - attack.t1110.003
references:
  - https://attack.mitre.org/techniques/T1110/003/
custom_attributes:
  original_rule_id: b1a82fc8-8a9f-4344-9ec2-bde5c5331b57
  source_format: splunk_spl