title: Detect attackers scanning for vulnerable JBoss servers
id: d246ad69-8e8e-50e2-b89d-47ba13758dfb
status: experimental
level: high
description: |
  The following analytic identifies specific GET or HEAD requests to web servers that indicate reconnaissance attempts to find vulnerable JBoss servers. It leverages data from the Web data model, focusing on HTTP methods and URLs associated with JBoss management interfaces. This activity is significant because it often precedes exploitation attempts using tools like JexBoss, which can compromise the server. If confirmed malicious, attackers could gain unauthorized access, execute arbitrary code, o
author: Bhavin Patel, Splunk
logsource:
  product: splunk
detection:
  selection:
    http_method:
      - GET
      - HEAD
    url:
      - '*/web-console/ServerInfo.jsp*'
      - '*web-console*'
      - '*jmx-console*'
      - '*invoker*'
    datamodel: Web
  condition: selection
tags:
  - attack.t1082
  - attack.t1133
custom_attributes:
  original_rule_id: 104658f4-afdc-499e-9719-17243f982681
  source_format: splunk_spl