title: Detect AWS Console Login by User from New Country
id: d375248c-6ed4-53b8-9fd8-1ddfcb6a1418
status: stable
level: low
description: |
  The following analytic identifies AWS console login events by users from a new country. It leverages AWS CloudTrail events and compares them against a lookup file of previously seen users and their login locations. This activity is significant because logins from new countries can indicate potential unauthorized access or compromised accounts. If confirmed malicious, this could lead to unauthorized access to AWS resources, data exfiltration, or further exploitation within the AWS environment.
author: Bhavin Patel, Eric McGinnis Splunk
logsource:
  product: aws
  category: authentication
detection:
  selection:
    usercountry: New Country
    datamodel: Authentication
    signature: ConsoleLogin
    type: outer
  condition: selection
tags:
  - attack.t1535
  - attack.t1586.003
custom_attributes:
  original_rule_id: 67bd3def-c41c-4bf6-837b-ae196b4257c6
  source_format: splunk_spl