title: Detect Certify Command Line Arguments
id: 163283d3-ea93-5100-b5c4-4191b4fb8990
status: stable
level: high
description: |
  The following analytic detects the use of Certify or Certipy tools to enumerate Active Directory Certificate Services (AD CS) environments. It leverages Endpoint Detection and Response (EDR) data, focusing on specific command-line arguments associated with these tools. This activity is significant because it indicates potential reconnaissance or exploitation attempts targeting AD CS, which could lead to unauthorized access or privilege escalation. If confirmed malicious, attackers could gain ins
author: Steven Dick
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    process:
      - '* /vulnerable*'
      - '* /enrolleeSuppliesSubject *'
      - '* /json /outfile*'
      - '* /ca*'
      - '* -username *'
      - '* -u *'
  condition: selection
tags:
  - attack.t1649
  - attack.t1105
references:
  - https://github.com/GhostPack/Certify
  - https://github.com/ly4k/Certipy
  - https://specterops.io/wp-content/uploads/sites/3/2022/06/Certified_Pre-Owned.pdf
custom_attributes:
  original_rule_id: e6d2dc61-a8b9-4b03-906c-da0ca75d71b8
  source_format: splunk_spl