title: Disable Security Logs Using MiniNt Registry
id: dd9adec3-cdb7-534b-8761-2121f3fee6d7
status: stable
level: high
description: |
  The following analytic detects a suspicious registry modification aimed at disabling security audit logs by adding a specific registry entry. It leverages data from the Endpoint.Registry data model, focusing on changes to the "Control\\MiniNt" registry path. This activity is significant because it can prevent Windows from logging any events to the Security Log, effectively blinding security monitoring efforts. If confirmed malicious, this technique could allow an attacker to operate undetected, 
author: Teoderick Contreras, Splunk, Steven Dick
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*\\Control\\MiniNt\\*'
  condition: selection
tags:
  - attack.t1112
references:
  - https://twitter.com/0gtweet/status/1182516740955226112
custom_attributes:
  original_rule_id: 39ebdc68-25b9-11ec-aec7-acde48001122
  source_format: splunk_spl