title: Disable Logs Using WevtUtil
id: 42f0b27e-405d-568b-9948-a730cfecbbbc
status: stable
level: high
description: |
  The following analytic detects the execution of "wevtutil.exe" with parameters to disable event logs. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line arguments. This activity is significant because disabling event logs is a common tactic used by ransomware to evade detection and hinder forensic investigations. If confirmed malicious, this action could allow attackers to operate undetected, making it difficult to trace their activiti
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
detection:
  selection:
    process_name: wevtutil.exe
    process:
      - '*sl*'
      - '*set-log*'
      - '*/e:false*'
  condition: selection
tags:
  - attack.t1070.001
references:
  - https://www.bleepingcomputer.com/news/security/new-ransom-x-ransomware-used-in-texas-txdot-cyberattack/
custom_attributes:
  original_rule_id: 236e7c8e-c9d9-11eb-a824-acde48001122
  source_format: splunk_spl