title: Disable ETW Through Registry
id: 5c7d0586-cd43-5163-8d7d-07a611a7bc71
status: stable
level: high
description: |
  The following analytic detects modifications to the registry that disable the Event Tracing for Windows (ETW) feature. It leverages data from the Endpoint.Registry data model, specifically monitoring changes to the registry path "*\\SOFTWARE\\Microsoft\\.NETFramework\\ETWEnabled" with a value set to "0x00000000". This activity is significant because disabling ETW can allow attackers to evade detection mechanisms, making it harder for security tools to monitor malicious activities. If confirmed m
author: Teoderick Contreras, Splunk, Steven Dick
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*\\SOFTWARE\\Microsoft\\.NETFramework\\ETWEnabled'
    registry_value_data: 0x00000000
  condition: selection
tags:
  - attack.t1562.001
references:
  - https://app.any.run/tasks/c0f98850-af65-4352-9746-fbebadee4f05/
custom_attributes:
  original_rule_id: f0eacfa4-d33f-11eb-8f9d-acde48001122
  source_format: splunk_spl