title: Disable Windows SmartScreen Protection
id: 31e3637b-15f0-54f7-b1e6-083cf09e9ca5
status: stable
level: high
description: |
  The following analytic detects modifications to the Windows registry that disable SmartScreen protection. It leverages data from the Endpoint.Registry data model, specifically monitoring changes to registry paths associated with SmartScreen settings. This activity is significant because SmartScreen provides an early warning system against phishing and malware. Disabling it can indicate malicious intent, often seen in Remote Access Trojans (RATs) to evade detection while downloading additional pa
author: Teoderick Contreras, Splunk, Steven Dick
logsource:
  product: windows
detection:
  selection:
    registry_path:
      - '*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\SmartScreenEnabled'
      - '*\\Microsoft\\Windows\\System\\EnableSmartScreen'
    registry_value_data:
      - Off
      - 0
  condition: selection
tags:
  - attack.t1562.001
references:
  - https://tccontre.blogspot.com/2020/01/remcos-rat-evading-windows-defender-av.html
custom_attributes:
  original_rule_id: 664f0fd0-91ff-11eb-a56f-acde48001122
  source_format: splunk_spl