title: Disable Defender MpEngine Registry
id: 31293e3b-005c-56c4-b1f7-27e494f37d03
status: stable
level: high
description: |
  The following analytic detects the modification of the Windows Defender MpEngine registry value, specifically setting MpEnablePus to 0x00000000. This detection leverages endpoint registry logs, focusing on changes within the path "*\\Policies\\Microsoft\\Windows Defender\\MpEngine*". This activity is significant as it indicates an attempt to disable key Windows Defender features, potentially allowing malware to evade detection. If confirmed malicious, this could lead to undetected malware execut
author: Teoderick Contreras, Splunk, Steven Dick
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*\\Policies\\Microsoft\\Windows Defender\\MpEngine*'
    registry_value_name: MpEnablePus
  condition: selection
tags:
  - attack.t1562.001
references:
  - https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
custom_attributes:
  original_rule_id: cc391750-3024-11ec-955a-acde48001122
  source_format: splunk_spl