title: Disable AMSI Through Registry
id: 7583cc8a-c3f8-552e-8a30-e15fc4deab1d
status: stable
level: high
description: |
  The following analytic detects modifications to the Windows registry that disable the Antimalware Scan Interface (AMSI) by setting the "AmsiEnable" value to "0x00000000". This detection leverages data from the Endpoint.Registry data model, specifically monitoring changes to the registry path "*\\SOFTWARE\\Microsoft\\Windows Script\\Settings\\AmsiEnable". Disabling AMSI is significant as it is a common technique used by ransomware, Remote Access Trojans (RATs), and Advanced Persistent Threats (AP
author: Teoderick Contreras, Splunk, Steven Dick
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*\\SOFTWARE\\Microsoft\\Windows Script\\Settings\\AmsiEnable'
    registry_value_data: 0x00000000
  condition: selection
tags:
  - attack.t1562.001
references:
  - https://blog.f-secure.com/hunting-for-amsi-bypasses/
  - https://gist.github.com/rxwx/8955e5abf18dc258fd6b43a3a7f4dbf9
custom_attributes:
  original_rule_id: 9c27ec42-d338-11eb-9044-acde48001122
  source_format: splunk_spl