title: Download Files Using Telegram
id: a81a95fe-28bc-5bb6-aedc-a83e9f46f1f8
status: stable
level: high
description: |
  The following analytic detects suspicious file downloads by the Telegram application on a Windows system. It leverages Sysmon EventCode 15 to identify instances where Telegram.exe creates files with a Zone.Identifier, indicating a download. This activity is significant as it may indicate an adversary using Telegram to download malicious tools, such as network scanners, for further exploitation. If confirmed malicious, this behavior could lead to network mapping, lateral movement, and potential c
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    process_name: telegram.exe
    targetfilename: '*:Zone.Identifier'
    eventcode: 15
  condition: selection
tags:
  - attack.t1105
references:
  - https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
custom_attributes:
  original_rule_id: 58194e28-ae5e-11eb-8912-acde48001122
  source_format: splunk_spl