title: Dump LSASS via procdump
id: 8e9afb59-9871-5625-a794-f582528cc6f4
status: stable
level: high
description: |
  The following analytic detects the use of procdump.exe to dump the LSASS process, specifically looking for the -mm and -ma command-line arguments. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names, command-line executions, and parent processes. This activity is significant because dumping LSASS can expose sensitive credentials, posing a severe security risk. If confirmed malicious, an attacker could obtain credentials, escalate privileges, and move la
author: Michael Haag, Splunk
logsource:
  product: splunk
detection:
  selection:
    original_file_name: procdump
    process_name:
      - procdump.exe
      - procdump64.exe
      - procdump64a.exe
    process:
      - '* ls*'
      - '* keyiso*'
      - '* samss*'
  condition: selection
tags:
  - attack.t1003.001
references:
  - https://attack.mitre.org/techniques/T1003/001/
  - https://docs.microsoft.com/en-us/sysinternals/downloads/procdump
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.001/T1003.001.md#atomic-test-2---dump-lsassexe-memory-using-procdump
  - https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
  - https://x.com/wietze/status/1958302556033065292?s=12
custom_attributes:
  original_rule_id: 3742ebfe-64c2-11eb-ae93-0242ac130002
  source_format: splunk_spl