title: Email files written outside of the Outlook directory
id: ad42d426-a9b0-5d10-831f-135db50e9e22
status: experimental
level: high
description: |
  The following analytic detects email files (.pst or .ost) being created outside the standard Outlook directories. It leverages the Endpoint.Filesystem data model to identify file creation events and filters for email files not located in "C:\Users\*\My Documents\Outlook Files\*" or "C:\Users\*\AppData\Local\Microsoft\Outlook*". This activity is significant as it may indicate data exfiltration or unauthorized access to email data. If confirmed malicious, an attacker could potentially access sensi
author: Bhavin Patel, Splunk
logsource:
  product: splunk
  category: file_event
detection:
  selection:
    _spl_reference: true
  filter:
    file_path: 'C:\\Users\\*\\AppData\\Local\\Microsoft\\Outlook*'
  condition: selection and not filter
tags:
  - attack.t1114.001
custom_attributes:
  original_rule_id: 8d52cf03-ba25-4101-aa78-07994aed4f74
  source_format: splunk_spl