title: Email servers sending high volume traffic to hosts
id: 87b66bf3-f1dd-5632-b994-94ff2c0303f9
status: experimental
level: medium
description: |
  The following analytic identifies a significant increase in data transfers from your email server to client hosts. It leverages the Network_Traffic data model to monitor outbound traffic from email servers, using statistical analysis to detect anomalies based on average and standard deviation metrics. This activity is significant as it may indicate a malicious actor exfiltrating data via your email server. If confirmed malicious, this could lead to unauthorized data access and potential data bre
author: Bhavin Patel, Splunk
logsource:
  product: splunk
detection:
  selection:
    datamodel: Network_Traffic
    src_category: email_server
    span: 1d
    deviation_threshold: 3
  condition: selection
tags:
  - attack.t1114.002
custom_attributes:
  original_rule_id: 7f5fb3e1-4209-4914-90db-0ec21b556378
  source_format: splunk_spl