title: Enable WDigest UseLogonCredential Registry
id: 1262fc2f-b479-5c4b-94c4-4049d8735b29
status: stable
level: high
description: |
  The following analytic detects a suspicious registry modification that enables the plain text credential feature in Windows by setting the "UseLogonCredential" value to 1 in the WDigest registry path. This detection leverages data from the Endpoint.Registry data model, focusing on specific registry paths and values. This activity is significant because it is commonly used by malware and tools like Mimikatz to dump plain text credentials, indicating a potential credential dumping attempt. If conf
author: Teoderick Contreras, Splunk, Steven Dick
logsource:
  product: windows
  category: authentication
detection:
  selection:
    registry_path: '*\\System\\CurrentControlSet\\Control\\SecurityProviders\\WDigest\\*'
    registry_value_name: UseLogonCredential
  condition: selection
tags:
  - attack.t1112
  - attack.t1003
references:
  - https://www.csoonline.com/article/3438824/how-to-detect-and-halt-credential-theft-via-windows-wdigest.html
custom_attributes:
  original_rule_id: 0c7d8ffe-25b1-11ec-9f39-acde48001122
  source_format: splunk_spl