title: Enumerate Users Local Group Using Telegram
id: c52cafa9-2ff6-5b88-b1de-fcb353774c58
status: stable
level: high
description: |
  The following analytic detects a Telegram process enumerating all network users in a local group. It leverages EventCode 4798, which is generated when a process enumerates a user's security-enabled local groups on a computer or device. This activity is significant as it may indicate an attempt to gather information on user accounts, a common precursor to further malicious actions. If confirmed malicious, this behavior could allow an attacker to map out user accounts, potentially leading to privi
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
detection:
  selection:
    callerprocessname: '*\\telegram.exe'
    eventcode: 4798
  condition: selection
tags:
  - attack.t1087
references:
  - https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4798
custom_attributes:
  original_rule_id: fcd74532-ae54-11eb-a5ab-acde48001122
  source_format: splunk_spl