title: ESXi Sensitive Files Accessed
id: 33107985-f78e-5826-bcd4-dc597e373334
status: stable
level: high
description: |
  This detection identifies access to sensitive system and configuration files on an ESXi host, including authentication data, service configurations, and VMware-specific management settings. Interaction with these files may indicate adversary reconnaissance, credential harvesting, or preparation for privilege escalation, lateral movement, or persistence.
author: Raven Tait, Splunk
logsource:
  product: splunk
  category: file_event
detection:
  selection:
    message:
      - '*/etc/shadow*'
      - '*/etc/vmware/hostd/hostd.xml*'
      - '*/etc/vmware/vpxa/vpxa.cfg*'
      - '*/etc/sfcb/sfcb.cfg*'
      - '*/etc/security/*'
      - '*/etc/likewise/krb5-affinity.conf*'
      - '*/etc/vmware-vpx/vcdb.properties*'
    field:
      - _raw
      - _raw
  condition: selection
tags:
  - attack.t1003.008
  - attack.t1005
custom_attributes:
  original_rule_id: 6fa0073d-6ca0-4f93-913d-fb420c9de15b
  source_format: splunk_spl