title: ESXi SSH Enabled
id: e7d88245-78d8-5055-8d54-4d4d6cdee4c3
status: stable
level: high
description: |
  This detection identifies SSH being enabled on ESXi hosts, which can be an early indicator of malicious activity. Threat actors often use SSH to gain persistent remote access after compromising credentials or exploiting vulnerabilities.
author: Raven Tait, Splunk
logsource:
  product: linux
detection:
  selection:
    message: '*SSH access has been enabled'
    field: _raw
  condition: selection
tags:
  - attack.t1021.004
custom_attributes:
  original_rule_id: b8003567-c5b6-445b-8966-ecdacc81c24d
  source_format: splunk_spl