title: ESXi External Root Login Activity
id: 8efb5f18-007c-5153-a4a8-72b70e59f970
status: stable
level: medium
description: |
  This detection identifies instances where the ESXi UI is accessed using the root account instead of a delegated administrative user. Direct root access to the UI bypasses role-based access controls and auditing practices, and may indicate risky behavior, misconfiguration, or unauthorized activity by a malicious actor using compromised credentials.
author: Raven Tait, Splunk
logsource:
  product: splunk
  category: authentication
detection:
  selection:
    message:
      - '*root*'
      - '*logged in*'
    field:
      - _raw
      - _raw
  filter:
    srcipaddr: 127.0.0.1
  condition: selection and not filter
tags:
  - attack.t1078
custom_attributes:
  original_rule_id: 218bf991-6c63-4c26-a682-6ac1a53ad8f8
  source_format: splunk_spl