title: ESXi Malicious VIB Forced Install
id: ffa43201-0544-5279-b471-04f6f6bbda98
status: stable
level: high
description: |
  Detects potentially malicious installation of VMware Installation Bundles (VIBs) using the --force flag. The --force option bypasses signature and compatibility checks, allowing unsigned, community-supported, or incompatible VIBs to be installed on an ESXi host. This behavior is uncommon in normal administrative operations and is often observed in post-compromise scenarios where adversaries attempt to install backdoored or unauthorized kernel modules, drivers, or monitoring tools to establish pe
author: Raven Tait, Splunk
logsource:
  product: splunk
detection:
  selection:
    message:
      - '* image profile with validation disabled. *'
      - '* image profile bypassing signing and acceptance level verification. *'
      - '* vib without valid signature, *'
    field: _raw
  condition: selection
tags:
  - attack.t1505.006
references:
  - https://detect.fyi/detecting-and-responding-to-esxi-compromise-with-splunk-f33998ce7823
custom_attributes:
  original_rule_id: 5d4d2cd2-7b65-4474-97cf-e9b203bcd770
  source_format: splunk_spl