title: ESXi VM Exported via Remote Tool
id: 5a5ebf33-72b9-56f5-bbbb-e76ced68a556
status: stable
level: high
description: |
  This detection identifies the use of a remote tool to download virtual machine disk files from a datastore. The NFC protocol is used by management tools to transfer files to and from ESXi hosts, but it can also be abused by attackers or insiders to exfiltrate full virtual disk images
author: Raven Tait, Splunk
logsource:
  product: splunk
detection:
  selection:
    message:
      - '*File download from path*'
      - '*was initiated from*'
    field:
      - _raw
      - _raw
      - _raw
  condition: selection
tags:
  - attack.t1005
custom_attributes:
  original_rule_id: 2e155547-aaac-49d3-b0ef-ceabc31fd364
  source_format: splunk_spl