title: ETW Registry Disabled
id: ee793b8f-32cc-534c-8050-d165f441c564
status: stable
level: high
description: |
  The following analytic detects a registry modification that disables the ETW for the .NET Framework. It leverages data from the Endpoint.Registry data model, specifically monitoring changes to the ETWEnabled registry value under the .NETFramework path. This activity is significant because disabling ETW can allow attackers to evade Endpoint Detection and Response (EDR) tools and hide their execution from audit logs. If confirmed malicious, this action could enable attackers to operate undetected,
author: Teoderick Contreras, Splunk, Steven Dick
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*\\SOFTWARE\\Microsoft\\.NETFramework*'
    registry_value_name: ETWEnabled
  condition: selection
tags:
  - attack.t1127
  - attack.t1562.006
references:
  - https://gist.github.com/Cyb3rWard0g/a4a115fd3ab518a0e593525a379adee3
  - https://blog.xpnsec.com/hiding-your-dotnet-complus-etwenabled/
custom_attributes:
  original_rule_id: 8ed523ac-276b-11ec-ac39-acde48001122
  source_format: splunk_spl