title: Excessive Usage Of SC Service Utility
id: 638511a9-3e4a-50a7-a81d-c7df4eafbd45
status: stable
level: medium
description: |
  The following analytic detects excessive usage of the `sc.exe` service utility on a host machine. It leverages Sysmon EventCode 1 logs to identify instances where `sc.exe` is executed more frequently than normal within a 15-minute window. This behavior is significant as it is commonly associated with ransomware, cryptocurrency miners, and other malware attempting to create, modify, delete, or disable services, potentially related to security applications or for privilege escalation. If confirmed
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    process_name: sc.exe
    span: 15m
    isoutlier: 1
  condition: selection
tags:
  - attack.t1569.002
references:
  - https://app.any.run/tasks/c0f98850-af65-4352-9746-fbebadee4f05/
custom_attributes:
  original_rule_id: cb6b339e-d4c6-11eb-a026-acde48001122
  source_format: splunk_spl