title: Excessive DNS Failures
id: 86e0511d-c77e-5814-9aba-03896fa3143f
status: experimental
level: medium
description: |
  The following analytic identifies excessive DNS query failures by counting DNS responses that do not indicate success, triggering when there are more than 50 occurrences. It leverages the Network_Resolution data model, focusing on DNS reply codes that signify errors. This activity is significant because a high number of DNS failures can indicate potential network misconfigurations, DNS poisoning attempts, or malware communication issues. If confirmed malicious, this activity could lead to disrup
author: bowesmana, Bhavin Patel, Splunk
logsource:
  product: splunk
  category: network_connection
detection:
  selection:
    datamodel: Network_Resolution
    nodename: DNS
    update: 'true'
  filter:
    reply_code: unknown
  condition: selection and not filter
tags:
  - attack.t1071.004
custom_attributes:
  original_rule_id: 104658f4-afdc-499e-9719-17243f9826f1
  source_format: splunk_spl