title: F5 TMUI Authentication Bypass
id: eaf2426f-b187-5794-afe9-82b908c45e51
status: stable
level: high
description: |
  The following analytic detects attempts to exploit the CVE-2023-46747 vulnerability, an authentication bypass flaw in F5 BIG-IP's Configuration utility (TMUI). It identifies this activity by monitoring for specific URI paths such as "*/mgmt/tm/auth/user/*" with the PATCH method and a 200 status code. This behavior is significant for a SOC as it indicates potential unauthorized access attempts, leading to remote code execution. If confirmed malicious, an attacker could gain unauthorized access, e
author: Michael Haag, Splunk
logsource:
  product: splunk
  category: authentication
detection:
  selection:
    datamodel: Web
    http_method: PATCH
    status: 200
    url:
      - '*/mgmt/tm/auth/user/*'
  condition: selection
references:
  - https://www.praetorian.com/blog/refresh-compromising-f5-big-ip-with-request-smuggling-cve-2023-46747/
  - https://github.com/projectdiscovery/nuclei-templates/blob/3b0bb71bd627c6c3139e1d06c866f8402aa228ae/http/cves/2023/CVE-2023-46747.yaml
custom_attributes:
  original_rule_id: 88bf127c-613e-4579-99e4-c4d4b02f3840
  source_format: splunk_spl