title: File with Samsam Extension
id: fb16d0dd-eaba-598a-b671-cd70cec4f473
status: stable
level: high
description: |
  The following analytic detects file writes with extensions indicative of a SamSam ransomware attack. It leverages file-system activity data to identify file names ending in .stubbin, .berkshire, .satoshi, .sophos, or .keyxml. This activity is significant because SamSam ransomware is highly destructive, leading to file encryption and ransom demands. If confirmed malicious, the impact includes significant financial losses, operational disruptions, and reputational damage. Immediate actions should 
author: Rico Valdez, Splunk
logsource:
  product: splunk
  category: file_event
detection:
  selection:
    field: file_name
  condition: selection
custom_attributes:
  original_rule_id: 02c6cfc2-ae66-4735-bfc7-6291da834cbf
  source_format: splunk_spl