title: First Time Seen Child Process of Zoom
id: c5b10f3a-092d-58c7-9bd7-779a40c62b3b
status: experimental
level: medium
description: |
  The following analytic identifies the first-time execution of child processes spawned by Zoom (zoom.exe or zoom.us). It leverages Endpoint Detection and Response (EDR) data, specifically monitoring process creation events and comparing them against previously seen child processes. This activity is significant because the execution of unfamiliar child processes by Zoom could indicate malicious exploitation or misuse of the application. If confirmed malicious, this could lead to unauthorized code 
author: David Dorsey, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1068
custom_attributes:
  original_rule_id: e91bd102-d630-4e76-ab73-7e3ba22c5961
  source_format: splunk_spl