title: GCP Authentication Failed During MFA Challenge
id: a6556f43-add0-5fd8-9aaa-bb53068a9df4
status: stable
level: high
description: |
  The following analytic detects failed authentication attempts during the Multi-Factor Authentication (MFA) challenge on a Google Cloud Platform (GCP) tenant. It uses Google Workspace login failure events to identify instances where MFA methods were challenged but not successfully completed. This activity is significant as it may indicate an adversary attempting to access an account with compromised credentials despite MFA protection. If confirmed malicious, this could lead to unauthorized access
author: Bhavin Patel, Mauricio Velazco, Splunk
logsource:
  product: gcp
  category: authentication
detection:
  selection:
    name: login_failure
  condition: selection
tags:
  - attack.t1078.004
  - attack.t1586.003
  - attack.t1621
references:
  - https://attack.mitre.org/techniques/T1621/
  - https://attack.mitre.org/techniques/T1078/004/
custom_attributes:
  original_rule_id: 345f7e1d-a3fe-4158-abd8-e630f9878323
  source_format: splunk_spl