title: GCP Multiple Failed MFA Requests For User
id: ec1d89a4-6708-5280-a67d-42cbda491e0d
status: stable
level: high
description: |
  The following analytic detects multiple failed multi-factor authentication (MFA) requests for a single user within a Google Cloud Platform (GCP) tenant. It triggers when 10 or more MFA prompts fail within a 5-minute window, using Google Workspace login failure events. This behavior is significant as it may indicate an adversary attempting to bypass MFA by bombarding the user with repeated authentication requests. If confirmed malicious, this activity could lead to unauthorized access, allowing a
author: Mauricio Velazco, Splunk
logsource:
  product: gcp
detection:
  selection:
    name: login_failure
    span: 5m
  condition: selection
tags:
  - attack.t1078.004
  - attack.t1586.003
  - attack.t1621
references:
  - https://www.mandiant.com/resources/blog/russian-targeting-gov-business
  - https://arstechnica.com/information-technology/2022/03/lapsus-and-solar-winds-hackers-both-use-the-same-old-trick-to-bypass-mfa/
  - https://therecord.media/russian-hackers-bypass-2fa-by-annoying-victims-with-repeated-push-notifications/
  - https://attack.mitre.org/techniques/T1621/
  - https://attack.mitre.org/techniques/T1078/004/
custom_attributes:
  original_rule_id: cbb3cb84-c06f-4393-adcc-5cb6195621f1
  source_format: splunk_spl