title: GCP Detect gcploit framework
id: 1b12cdc9-368a-57f5-b13e-8b5d34792563
status: experimental
level: high
description: |
  The following analytic identifies the use of the GCPloit exploitation framework within Google Cloud Platform (GCP). It detects specific GCP Pub/Sub messages with a function timeout of 539 seconds, which is indicative of GCPloit activity. This detection is significant as GCPloit can be used to escalate privileges and facilitate lateral movement from compromised high-privilege accounts. If confirmed malicious, this activity could allow attackers to gain unauthorized access, escalate their privileg
author: Rod Soto, Splunk
logsource:
  product: gcp
detection:
  selection:
    timeout: 539s
  condition: selection
tags:
  - attack.t1078
references:
  - https://github.com/dxa4481/gcploit
  - https://www.youtube.com/watch?v=Ml09R38jpok
custom_attributes:
  original_rule_id: a1c5a85e-a162-410c-a5d9-99ff639e5a52
  source_format: splunk_spl