title: GCP Successful Single-Factor Authentication
id: 6a425db7-6b04-5f90-bd85-6a4cbbdde5d4
status: stable
level: high
description: |
  The following analytic identifies a successful single-factor authentication event against Google Cloud Platform (GCP) for an account without Multi-Factor Authentication (MFA) enabled. It uses Google Workspace login event data to detect instances where MFA is not utilized. This activity is significant as it may indicate a misconfiguration, policy violation, or potential account takeover attempt. If confirmed malicious, an attacker could gain unauthorized access to GCP resources, potentially leadi
author: Bhavin Patel, Mauricio Velazco, Splunk
logsource:
  product: gcp
  category: authentication
detection:
  selection:
    name: login_success
  condition: selection
tags:
  - attack.t1078.004
  - attack.t1586.003
references:
  - https://attack.mitre.org/techniques/T1078/004/
  - https://support.google.com/a/answer/175197?hl=en
  - https://www.forbes.com/sites/daveywinder/2020/07/08/new-dark-web-audit-reveals-15-billion-stolen-logins-from-100000-breaches-passwords-hackers-cybercrime/?sh=69927b2a180f
custom_attributes:
  original_rule_id: 40e17d88-87da-414e-b253-8dc1e4f9555b
  source_format: splunk_spl