title: GCP Kubernetes cluster pod scan detection
id: 5fea6712-61eb-51f3-b4d0-6a6562db8663
status: experimental
level: low
description: |
  The following analytic identifies unauthenticated requests to Kubernetes cluster pods. It detects this activity by analyzing GCP Pub/Sub messages for audit logs where the response status code is 401, indicating unauthorized access attempts. This activity is significant for a SOC because it may indicate reconnaissance or scanning attempts by an attacker trying to identify vulnerable pods. If confirmed malicious, this activity could lead to unauthorized access, allowing the attacker to exploit vul
author: Rod Soto, Splunk
logsource:
  product: gcp
detection:
  selection:
    code: 401
  condition: selection
tags:
  - attack.t1526
custom_attributes:
  original_rule_id: 19b53215-4a16-405b-8087-9e6acf619842
  source_format: splunk_spl