title: Gdrive suspicious file sharing
id: 7bb5d537-9c0b-5276-a03a-2e8b28c33534
status: experimental
level: low
description: |
  The following analytic identifies suspicious file-sharing activity on Google Drive, where internal users share documents with more than 50 external recipients. It leverages GSuite Drive logs, focusing on changes in user access and filtering for emails outside the organization's domain. This activity is significant as it may indicate compromised accounts or intentional data exfiltration. If confirmed malicious, this behavior could lead to unauthorized access to sensitive information, data leaks, 
author: Rod Soto, Teoderick Contreras
logsource:
  product: splunk
  category: file_event
detection:
  selection:
    email: '*@yourdomain.com'
    name: change_user_access
  filter:
    target_user: '*@yourdomain.com'
  condition: selection and not filter
tags:
  - attack.t1566
references:
  - https://www.splunk.com/en_us/blog/security/investigating-gsuite-phishing-attacks-with-splunk.html
custom_attributes:
  original_rule_id: a7131dae-34e3-11ec-a2de-acde48001122
  source_format: splunk_spl