title: Get ADDefaultDomainPasswordPolicy with Powershell Script Block
id: ed15f3fa-923a-531b-9e0d-c2e11fd9160e
status: stable
level: low
description: |
  The following analytic detects the execution of the `Get-ADDefaultDomainPasswordPolicy` PowerShell cmdlet, which is used to retrieve the password policy in a Windows domain. This detection leverages PowerShell Script Block Logging (EventCode=4104) to identify the specific command execution. Monitoring this activity is significant as it can indicate an attempt to gather domain policy information, which is often a precursor to further malicious actions. If confirmed malicious, this activity could 
author: Teoderick Contreras, Mauricio Velazco, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    scriptblocktext: '*Get-ADDefaultDomainPasswordPolicy*'
    eventcode: 4104
  condition: selection
tags:
  - attack.t1201
references:
  - https://github.com/S1ckB0y1337/Active-Directory-Exploitation-Cheat-Sheet
  - https://attack.mitre.org/techniques/T1201/
  - https://docs.microsoft.com/en-us/powershell/module/activedirectory/get-addefaultdomainpasswordpolicy?view=windowsserver2019-ps
custom_attributes:
  original_rule_id: 1ff7ccc8-065a-11ec-91e4-acde48001122
  source_format: splunk_spl