title: Get ADUserResultantPasswordPolicy with Powershell Script Block
id: c4bab01a-89bf-558b-bf75-7c018eca38d7
status: stable
level: high
description: |
  The following analytic detects the execution of the `Get-ADUserResultantPasswordPolicy` PowerShell cmdlet, which is used to obtain the password policy in a Windows domain. It leverages PowerShell Script Block Logging (EventCode=4104) to identify this activity. Monitoring this behavior is significant as it may indicate an attempt to enumerate domain policies, a common tactic used by adversaries for situational awareness and Active Directory discovery. If confirmed malicious, this activity could a
author: Teoderick Contreras, Mauricio Velazco, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    scriptblocktext: '*Get-ADUserResultantPasswordPolicy*'
    eventcode: 4104
  condition: selection
tags:
  - attack.t1201
references:
  - https://github.com/S1ckB0y1337/Active-Directory-Exploitation-Cheat-Sheet
  - https://attack.mitre.org/techniques/T1201/
  - https://docs.microsoft.com/en-us/powershell/module/activedirectory/get-aduserresultantpasswordpolicy?view=windowsserver2019-ps
custom_attributes:
  original_rule_id: 737e1eb0-065a-11ec-921a-acde48001122
  source_format: splunk_spl