title: Get ADUserResultantPasswordPolicy with Powershell
id: 8b84a7f6-c6e2-5dbb-ab26-d8b63e63f792
status: stable
level: high
description: |
  The following analytic detects the execution of `powershell.exe` running the `Get-ADUserResultantPasswordPolicy` cmdlet, which is used to obtain the password policy in a Windows domain. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant as it indicates potential enumeration of domain policies, a common tactic for situational awareness and Active Directory discovery by adversaries. If confirmed m
author: Teoderick Contreras, Mauricio Velazco, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    process_name:
      - cmd.exe
      - powershell*
    process: '*Get-ADUserResultantPasswordPolicy*'
  condition: selection
tags:
  - attack.t1201
references:
  - https://github.com/S1ckB0y1337/Active-Directory-Exploitation-Cheat-Sheet
  - https://attack.mitre.org/techniques/T1201/
  - https://docs.microsoft.com/en-us/powershell/module/activedirectory/get-aduserresultantpasswordpolicy?view=windowsserver2019-ps
custom_attributes:
  original_rule_id: 8b5ef342-065a-11ec-b0fc-acde48001122
  source_format: splunk_spl