title: Get ADDefaultDomainPasswordPolicy with Powershell
id: f69e9bf8-9079-5655-aa95-3c965304f929
status: stable
level: low
description: |
  The following analytic detects the execution of `powershell.exe` running the `Get-ADDefaultDomainPasswordPolicy` cmdlet, which is used to retrieve the password policy in a Windows domain. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. Monitoring this activity is crucial as it can indicate attempts by adversaries to gather information about domain policies for situational awareness and Active Directory discov
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    process_name:
      - cmd.exe
      - powershell*
    process: '*Get-ADDefaultDomainPasswordPolicy*'
  condition: selection
tags:
  - attack.t1201
references:
  - https://github.com/S1ckB0y1337/Active-Directory-Exploitation-Cheat-Sheet
  - https://attack.mitre.org/techniques/T1201/
  - https://docs.microsoft.com/en-us/powershell/module/activedirectory/get-addefaultdomainpasswordpolicy?view=windowsserver2019-ps
custom_attributes:
  original_rule_id: 36e46ebe-065a-11ec-b4c7-acde48001122
  source_format: splunk_spl