title: GetDomainGroup with PowerShell
id: 5177e95d-bb20-5f72-b9f3-017482fb9ec8
status: stable
level: high
description: |
  The following analytic detects the execution of `powershell.exe` with command-line arguments that query for domain groups using `Get-DomainGroup`. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions mapped to the `Processes` node of the `Endpoint` data model. Monitoring this activity is crucial as `Get-DomainGroup` is part of PowerView, a tool often used by adversaries for domain enumeration and situational awaren
author: Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    process_name: powershell.exe
  condition: selection
tags:
  - attack.t1069.002
references:
  - https://attack.mitre.org/techniques/T1069/002/
  - https://powersploit.readthedocs.io/en/latest/Recon/Get-DomainGroup/
custom_attributes:
  original_rule_id: 93c94be3-bead-4a60-860f-77ca3fe59903
  source_format: splunk_spl