title: GetDomainGroup with PowerShell Script Block
id: 21b5b21c-bc0f-57f6-8d0a-f9af30aa3abc
status: stable
level: high
description: |
  The following analytic detects the execution of the `Get-DomainGroup` cmdlet using PowerShell Script Block Logging (EventCode=4104). This cmdlet, part of the PowerView tool, is used to enumerate domain groups within a Windows domain. The detection leverages script block text to identify this specific command. Monitoring this activity is crucial as it may indicate an adversary or Red Team performing reconnaissance to gain situational awareness and map out Active Directory structures. If confirmed
author: Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    scriptblocktext: '*Get-DomainGroup*'
    eventcode: 4104
  condition: selection
tags:
  - attack.t1069.002
references:
  - https://attack.mitre.org/techniques/T1069/002/
  - https://powersploit.readthedocs.io/en/latest/Recon/Get-DomainGroup/
custom_attributes:
  original_rule_id: 09725404-a44f-4ed3-9efa-8ed5d69e4c53
  source_format: splunk_spl