title: GetDomainComputer with PowerShell
id: 2c27ef5a-7703-5845-a4f5-dba83687f929
status: stable
level: high
description: |
  The following analytic detects the execution of `powershell.exe` with command-line arguments that utilize `Get-DomainComputer` to discover remote systems. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant as `Get-DomainComputer` is part of PowerView, a tool often used by adversaries for domain enumeration and situational awareness. If confirmed malicious, this activity could allow a
author: Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    process_name: powershell.exe
  condition: selection
tags:
  - attack.t1018
references:
  - https://attack.mitre.org/techniques/T1018/
custom_attributes:
  original_rule_id: ed550c19-712e-43f6-bd19-6f58f61b3a5e
  source_format: splunk_spl