title: GetDomainController with PowerShell
id: 30353868-0f8f-58c6-a354-a92b70891a2d
status: stable
level: low
description: |
  The following analytic detects the execution of `powershell.exe` with the `Get-DomainController` command, which is used to discover remote systems within a Windows domain. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line arguments. Monitoring this activity is crucial as it may indicate an attempt to enumerate domain controllers, a common tactic in Active Directory discovery. If confirmed malicious, this activity could all
author: Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    process_name: powershell.exe
  condition: selection
tags:
  - attack.t1018
references:
  - https://attack.mitre.org/techniques/T1018/
  - https://powersploit.readthedocs.io/en/latest/Recon/Get-DomainController/
custom_attributes:
  original_rule_id: 868ee0e4-52ab-484a-833a-6d85b7c028d0
  source_format: splunk_spl