title: GetLocalUser with PowerShell Script Block
id: e1842eb9-c239-51d9-9c59-50b27d01b9c2
status: stable
level: low
description: |
  The following analytic detects the execution of the `Get-LocalUser` PowerShell commandlet using PowerShell Script Block Logging (EventCode=4104). This commandlet lists all local users on a system. The detection leverages script block text from PowerShell logs to identify this activity. Monitoring this behavior is significant as adversaries and Red Teams may use it to enumerate local users for situational awareness and Active Directory discovery. If confirmed malicious, this activity could lead t
author: Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    scriptblocktext: '*Get-LocalUser*'
    eventcode: 4104
  condition: selection
tags:
  - attack.t1059.001
  - attack.t1087.001
references:
  - https://attack.mitre.org/techniques/T1087/001/
  - https://www.splunk.com/en_us/blog/security/hunting-for-malicious-powershell-using-script-block-logging.html
custom_attributes:
  original_rule_id: 2e891cbe-0426-11ec-9c9c-acde48001122
  source_format: splunk_spl