title: GetLocalUser with PowerShell
id: efc16718-a227-54af-a88a-9eaa46a09086
status: stable
level: low
description: |
  The following analytic detects the execution of `powershell.exe` with the `Get-LocalUser` commandlet, which is used to query local user accounts. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line arguments. Monitoring this activity is significant because adversaries and Red Teams may use it to enumerate local users for situational awareness and Active Directory discovery. If confirmed malicious, this activity could allow a
author: Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    process_name: powershell.exe
  condition: selection
tags:
  - attack.t1087.001
references:
  - https://attack.mitre.org/techniques/T1087/001/
custom_attributes:
  original_rule_id: 85fae8fa-0427-11ec-8b78-acde48001122
  source_format: splunk_spl