title: GetNetTcpconnection with PowerShell Script Block
id: 38b6f925-5d79-5edc-a4e0-7c417cf6902e
status: stable
level: low
description: |
  The following analytic detects the execution of the `Get-NetTcpconnection` PowerShell cmdlet using PowerShell Script Block Logging (EventCode=4104). This cmdlet lists network connections on a system, which adversaries may use for situational awareness and Active Directory discovery. Monitoring this activity is crucial as it can indicate reconnaissance efforts by an attacker. If confirmed malicious, this behavior could allow an attacker to map the network, identify critical systems, and plan furt
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    scriptblocktext: '*Get-NetTcpconnection*'
    eventcode: 4104
  condition: selection
tags:
  - attack.t1049
references:
  - https://attack.mitre.org/techniques/T1049/
  - https://docs.microsoft.com/en-us/powershell/module/nettcpip/get-nettcpconnection?view=windowsserver2019-ps
custom_attributes:
  original_rule_id: 091712ff-b02a-4d43-82ed-34765515d95d
  source_format: splunk_spl