title: GetNetTcpconnection with PowerShell
id: 108aa2ca-d09d-5b25-8ccd-a9e7affe7b21
status: stable
level: low
description: |
  The following analytic identifies the execution of `powershell.exe` with the `Get-NetTcpConnection` command, which lists current TCP connections on a system. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. Monitoring this activity is significant as it may indicate an adversary or Red Team performing network reconnaissance or situational awareness. If confirmed malicious, this activity could allow attackers to
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    process_name: powershell.exe
  condition: selection
tags:
  - attack.t1049
references:
  - https://attack.mitre.org/techniques/T1049/
  - https://docs.microsoft.com/en-us/powershell/module/nettcpip/get-nettcpconnection?view=windowsserver2019-ps
custom_attributes:
  original_rule_id: e02af35c-1de5-4afe-b4be-f45aba57272b
  source_format: splunk_spl