title: GetWmiObject DS User with PowerShell Script Block
id: 4e1d9997-1336-5409-a82b-20b67e21f727
status: stable
level: high
description: |
  The following analytic detects the execution of the `Get-WmiObject` cmdlet with the `DS_User` class parameter via PowerShell Script Block Logging (EventCode=4104). It leverages logs to identify attempts to query all domain users using WMI. This activity is significant as it may indicate an adversary or Red Team operation attempting to enumerate domain users for situational awareness and Active Directory discovery. If confirmed malicious, this behavior could lead to further reconnaissance, enabli
author: Teoderick Contreras, Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    scriptblocktext:
      - '*get-wmiobject*'
      - '*ds_user*'
      - '*-namespace*'
      - '*root\\directory\\ldap*'
    eventcode: 4104
  condition: selection
tags:
  - attack.t1087.002
references:
  - https://www.blackhillsinfosec.com/red-blue-purple/
  - https://docs.microsoft.com/en-us/windows/win32/wmisdk/describing-the-ldap-namespace
custom_attributes:
  original_rule_id: fabd364e-04f3-11ec-b34b-acde48001122
  source_format: splunk_spl