title: GetWmiObject Ds Group with PowerShell Script Block
id: 3843b9b2-e3a8-58d2-b8d7-cd8ddc24c4bb
status: stable
level: high
description: |
  The following analytic detects the execution of the `Get-WmiObject` commandlet with the `DS_Group` parameter via PowerShell Script Block Logging (EventCode=4104). This method leverages WMI to query all domain groups. Monitoring this activity is crucial as adversaries and Red Teams may use it for domain group enumeration, aiding in situational awareness and Active Directory discovery. If confirmed malicious, this activity could allow attackers to map out the domain structure, potentially leading 
author: Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    scriptblocktext:
      - '*namespace root\\directory\\ldap*'
      - '*class ds_group*'
    eventcode: 4104
  condition: selection
tags:
  - attack.t1069.002
references:
  - https://attack.mitre.org/techniques/T1069/002/
  - https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.management/get-wmiobject?view=powershell-5.1
custom_attributes:
  original_rule_id: 67740bd3-1506-469c-b91d-effc322cc6e5
  source_format: splunk_spl