title: GetWmiObject DS User with PowerShell
id: 8f2aa9ed-eb3a-57ef-bee8-b844241efa4a
status: stable
level: high
description: |
  The following analytic detects the execution of `powershell.exe` with command-line arguments used to query domain users via the `Get-WmiObject` cmdlet and `-class ds_user` parameter. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant as it indicates potential reconnaissance efforts by adversaries to enumerate domain users, which is a common step in Active Directory Discovery. If conf
author: Teoderick Contreras, Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    process_name:
      - cmd.exe
      - powershell*
    process:
      - '*get-wmiobject*'
      - '*ds_user*'
      - '*root\\directory\\ldap*'
      - '*-namespace*'
  condition: selection
tags:
  - attack.t1087.002
references:
  - https://jpcertcc.github.io/ToolAnalysisResultSheet/details/dsquery.htm
custom_attributes:
  original_rule_id: 22d3b118-04df-11ec-8fa3-acde48001122
  source_format: splunk_spl