title: GitHub Organizations Disable Classic Branch Protection Rule
id: 003e3c3d-a33f-56a0-9000-8a82a5956288
status: stable
level: medium
description: |
  The following analytic detects when classic branch protection rules are disabled in GitHub Organizations. The detection monitors GitHub Organizations audit logs for branch protection removal events by tracking actor details, repository information, and associated metadata. For a SOC, identifying disabled branch protection is critical as it could indicate attempts to bypass code review requirements and security controls. Branch protection rules are essential security controls that enforce code re
author: Patrick Bareiss, Splunk
logsource:
  product: github
detection:
  selection:
    user: actor
  condition: selection
tags:
  - attack.t1562.001
  - attack.t1195
references:
  - https://splunk.github.io/splunk-add-on-for-github-audit-log-monitoring/Install/
  - https://www.googlecloudcommunity.com/gc/Community-Blog/Monitoring-for-Suspicious-GitHub-Activity-with-Google-Security/ba-p/763610
custom_attributes:
  original_rule_id: 33cffee0-41ee-402e-a238-d37825f2d788
  source_format: splunk_spl