title: GitHub Enterprise Repository Archived
id: 332c9b5b-28cb-5f9c-844d-c0fd66518890
status: stable
level: medium
description: |
  The following analytic detects when a repository is archived in GitHub Enterprise. The detection monitors GitHub Enterprise audit logs for repository archival events by tracking actor details, repository information, and associated metadata. For a SOC, identifying repository archival is important as it could indicate attempts to make critical code inaccessible or preparation for repository deletion. While archiving is a legitimate feature, unauthorized archival of active repositories could signa
author: Patrick Bareiss, Splunk
logsource:
  product: github
detection:
  selection:
    user: actor
  condition: selection
tags:
  - attack.t1485
  - attack.t1195
references:
  - https://www.googlecloudcommunity.com/gc/Community-Blog/Monitoring-for-Suspicious-GitHub-Activity-with-Google-Security/ba-p/763610
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-streaming-to-splunk
custom_attributes:
  original_rule_id: 8367cb99-bae1-4748-ae3b-0927bb381424
  source_format: splunk_spl