title: GitHub Enterprise Register Self Hosted Runner
id: dde7bfca-3bc3-50e3-a2e5-3629e79aac65
status: stable
level: medium
description: |
  The following analytic identifies when a self-hosted runner is created in GitHub Enterprise. The detection monitors GitHub Enterprise audit logs for actions related to creating new self-hosted runners at the organization or enterprise level. his behavior warrants monitoring because self-hosted runners execute workflow jobs on customer-controlled infrastructure, which could be exploited by attackers to execute malicious code, access sensitive data, or pivot to other systems. While self-hosted run
author: Patrick Bareiss, Splunk
logsource:
  product: github
detection:
  selection:
    user: actor
  condition: selection
tags:
  - attack.t1562.001
  - attack.t1195
references:
  - https://www.wiz.io/blog/shai-hulud-2-0-ongoing-supply-chain-attack
  - https://www.googlecloudcommunity.com/gc/Community-Blog/Monitoring-for-Suspicious-GitHub-Activity-with-Google-Security/ba-p/763610
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-streaming-to-splunk
custom_attributes:
  original_rule_id: b27685a2-8826-4123-ab78-2d9d0d419ed0
  source_format: splunk_spl