title: GitHub Enterprise Disable 2FA Requirement
id: 6fcb2c4b-40de-5a92-901c-77ca43981598
status: stable
level: medium
description: |
  The following analytic detects when two-factor authentication (2FA) requirements are disabled in GitHub Enterprise. The detection monitors GitHub Enterprise audit logs for 2FA requirement changes by tracking actor details, organization information, and associated metadata. For a SOC, identifying disabled 2FA requirements is critical as it could indicate attempts to weaken account security controls. Two-factor authentication is a fundamental security control that helps prevent unauthorized access
author: Patrick Bareiss, Splunk
logsource:
  product: github
detection:
  selection:
    user: actor
  condition: selection
tags:
  - attack.t1562.001
  - attack.t1195
references:
  - https://www.googlecloudcommunity.com/gc/Community-Blog/Monitoring-for-Suspicious-GitHub-Activity-with-Google-Security/ba-p/763610
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-streaming-to-splunk
custom_attributes:
  original_rule_id: 5a773226-ebd7-480c-a819-fccacfeddcd9
  source_format: splunk_spl