title: GitHub Enterprise Modify Audit Log Event Stream
id: 17b19415-e9d4-5c0f-a88b-93b619e532b6
status: stable
level: medium
description: |
  The following analytic detects when a user modifies or disables audit log event streaming in GitHub Enterprise. The detection monitors GitHub Enterprise audit logs for configuration changes that affect the audit log streaming functionality, which is used to send audit events to security monitoring platforms. This behavior could indicate an attacker attempting to prevent their malicious activities from being logged and detected by tampering with the audit trail. For a SOC, identifying modificatio
author: Patrick Bareiss, Splunk
logsource:
  product: github
detection:
  selection:
    user: actor
  condition: selection
tags:
  - attack.t1562.008
  - attack.t1195
references:
  - https://www.googlecloudcommunity.com/gc/Community-Blog/Monitoring-for-Suspicious-GitHub-Activity-with-Google-Security/ba-p/763610
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-streaming-to-splunk
custom_attributes:
  original_rule_id: 99abf2e1-863c-4ec6-82f8-714391590a4c
  source_format: splunk_spl