title: GitHub Enterprise Pause Audit Log Event Stream
id: 3b715492-e182-587d-953e-1938fa634f86
status: stable
level: medium
description: |
  The following analytic detects when a user pauses audit log event streaming in GitHub Enterprise. The detection monitors GitHub Enterprise audit logs for configuration changes that temporarily suspend the audit log streaming functionality, which is used to send audit events to security monitoring platforms. This behavior could indicate an attacker attempting to prevent their malicious activities from being logged and detected by temporarily disabling the audit trail. For a SOC, identifying the p
author: Patrick Bareiss, Splunk
logsource:
  product: github
detection:
  selection:
    reason: User initiated pause
    user: actor
  condition: selection
tags:
  - attack.t1562.008
  - attack.t1195
references:
  - https://www.googlecloudcommunity.com/gc/Community-Blog/Monitoring-for-Suspicious-GitHub-Activity-with-Google-Security/ba-p/763610
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-streaming-to-splunk
custom_attributes:
  original_rule_id: 21083dcb-276d-4ef9-8f7e-2113ca5e8094
  source_format: splunk_spl