title: GitHub Organizations Delete Branch Ruleset
id: c557a36d-4b82-55cd-97ef-bdfe07a736f3
status: stable
level: medium
description: |
  The following analytic detects when branch rulesets are deleted in GitHub Organizations. The detection monitors GitHub Organizations audit logs for branch ruleset deletion events by tracking actor details, repository information, and associated metadata. For a SOC, identifying deleted branch rulesets is critical as it could indicate attempts to bypass code review requirements and security controls. Branch rulesets are essential security controls that enforce code review, prevent force pushes, an
author: Patrick Bareiss, Splunk
logsource:
  product: github
  category: file_event
detection:
  selection:
    user: actor
  condition: selection
tags:
  - attack.t1562.001
  - attack.t1195
references:
  - https://splunk.github.io/splunk-add-on-for-github-audit-log-monitoring/Install/
  - https://www.googlecloudcommunity.com/gc/Community-Blog/Monitoring-for-Suspicious-GitHub-Activity-with-Google-Security/ba-p/763610
custom_attributes:
  original_rule_id: 8e454f64-4bd6-45e6-8a94-1b482593d721
  source_format: splunk_spl