title: GitHub Organizations Disable 2FA Requirement
id: f5e8ff20-b344-5979-8f95-b1f3ef3f8b9b
status: stable
level: medium
description: |
  The following analytic detects when two-factor authentication (2FA) requirements are disabled in GitHub Organizations. The detection monitors GitHub Organizations audit logs for 2FA requirement changes by tracking actor details, organization information, and associated metadata. For a SOC, identifying disabled 2FA requirements is critical as it could indicate attempts to weaken account security controls. Two-factor authentication is a fundamental security control that helps prevent unauthorized 
author: Patrick Bareiss, Splunk
logsource:
  product: github
detection:
  selection:
    user: actor
  condition: selection
tags:
  - attack.t1562.001
  - attack.t1195
references:
  - https://splunk.github.io/splunk-add-on-for-github-audit-log-monitoring/Install/
  - https://www.googlecloudcommunity.com/gc/Community-Blog/Monitoring-for-Suspicious-GitHub-Activity-with-Google-Security/ba-p/763610
custom_attributes:
  original_rule_id: 3ed0d6ba-4791-4fa8-a1ef-403e438c7033
  source_format: splunk_spl