title: GitHub Enterprise Repository Deleted
id: bf060f46-36b1-527c-bcb7-43a300832c6d
status: stable
level: medium
description: |
  The following analytic detects when a user deletes a repository in GitHub Enterprise. The detection monitors GitHub Enterprise audit logs for repository deletion events, which could indicate unauthorized removal of critical source code and project resources. For a SOC, identifying repository deletions is crucial as it may signal account compromise, insider threats, or malicious attempts to destroy intellectual property and disrupt development operations. The impact could be severe, potentially r
author: Patrick Bareiss, Splunk
logsource:
  product: github
  category: file_event
detection:
  selection:
    user: actor
  condition: selection
tags:
  - attack.t1485
  - attack.t1195
references:
  - https://www.googlecloudcommunity.com/gc/Community-Blog/Monitoring-for-Suspicious-GitHub-Activity-with-Google-Security/ba-p/763610
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-streaming-to-splunk
custom_attributes:
  original_rule_id: f709e736-3e6c-492f-b865-bc7696cc24a7
  source_format: splunk_spl