title: Gsuite Suspicious Shared File Name
id: ded0c8fa-a8c2-551b-9b25-9c0f26db1cb1
status: experimental
level: medium
description: |
  The following analytic detects shared files in Google Drive with suspicious filenames commonly used in spear phishing campaigns. It leverages GSuite Drive logs to identify documents with titles that include keywords like "dhl," "ups," "invoice," and "shipment." This activity is significant because such filenames are often used to lure users into opening malicious documents or clicking harmful links. If confirmed malicious, this activity could lead to unauthorized access, data theft, or further c
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
  category: file_event
detection:
  selection:
    source_domain: internal_test_email.com
    dest_domain: internal_test_email.com
    phase: plan
    severity: low
    owner_is_team_drive: 'false'
    doc_type:
      - document
      - pdf
      - msexcel
      - msword
      - spreadsheet
      - presentation
  filter:
    source_domain: internal_test_email.com
  condition: selection and not filter
tags:
  - attack.t1566.001
references:
  - https://www.redhat.com/en/topics/devops/what-is-devsecops
  - https://www.mandiant.com/resources/top-words-used-in-spear-phishing-attacks
custom_attributes:
  original_rule_id: 07eed200-03f5-11ec-98fb-acde48001122
  source_format: splunk_spl