title: Gsuite Drive Share In External Email
id: cadc9aaf-e843-56a4-b612-4831ac8775f8
status: experimental
level: medium
description: |
  The following analytic detects Google Drive or Google Docs files shared externally from an internal domain. It leverages GSuite Drive logs, extracting and comparing the source and destination email domains to identify external sharing. This activity is significant as it may indicate potential data exfiltration by an attacker or insider. If confirmed malicious, this could lead to unauthorized access to sensitive information, data leakage, and potential compliance violations. Monitoring this behav
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
detection:
  selection:
    src_domain: internal_test_email.com
    dest_domain: internal_test_email.com
    phase: plan
    severity: low
    output: owner
    field:
      - owner
      - email
    email:
      - ''
      - 'null'
  filter:
    dest_domain: internal_test_email.com
  condition: selection and not filter
tags:
  - attack.t1567.002
references:
  - https://www.redhat.com/en/topics/devops/what-is-devsecops
custom_attributes:
  original_rule_id: f6ee02d6-fea0-11eb-b2c2-acde48001122
  source_format: splunk_spl