title: GSuite Email Suspicious Attachment
id: 5b504da9-6287-5914-82c5-a165a6683c5d
status: stable
level: medium
description: |
  The following analytic detects suspicious attachment file extensions in GSuite emails, potentially indicating a spear-phishing attack. It leverages GSuite Gmail logs to identify emails with attachments having file extensions commonly associated with malware, such as .exe, .bat, and .js. This activity is significant as these file types are often used to deliver malicious payloads, posing a risk of compromising targeted machines. If confirmed malicious, this could lead to unauthorized code executi
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
detection:
  selection:
    phase: plan
    severity: medium
  condition: selection
tags:
  - attack.t1566.001
references:
  - https://www.redhat.com/en/topics/devops/what-is-devsecops
custom_attributes:
  original_rule_id: 6d663014-fe92-11eb-ab07-acde48001122
  source_format: splunk_spl