title: Gsuite Email With Known Abuse Web Service Link
id: 04ee54ea-c1ae-5b9b-8a0b-b6eeedf25f61
status: stable
level: medium
description: |
  The following analytic detects emails in Gsuite containing links to known abuse web services such as Pastebin, Telegram, and Discord. It leverages Gsuite Gmail logs to identify emails with these specific domains in their links. This activity is significant because these services are commonly used by attackers to deliver malicious payloads. If confirmed malicious, this could lead to the delivery of malware, phishing attacks, or other harmful activities, potentially compromising sensitive informat
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
detection:
  selection:
    source_domain: internal_test_email.com
    dest_domain: internal_test_email.com
    phase: plan
    severity: low
  filter:
    source_domain: internal_test_email.com
  condition: selection and not filter
tags:
  - attack.t1566.001
references:
  - https://news.sophos.com/en-us/2021/07/22/malware-increasingly-targets-discord-for-abuse/
custom_attributes:
  original_rule_id: 8630aa22-042b-11ec-af39-acde48001122
  source_format: splunk_spl