title: Hiding Files And Directories With Attrib exe
id: 6c4e8d88-7184-57a8-8766-73bc362e4183
status: stable
level: high
description: |
  The following analytic detects the use of the Windows binary attrib.exe to hide files or directories by marking them with specific flags. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line arguments that include the "+h" flag. This activity is significant because hiding files can be a tactic used by attackers to conceal malicious files or tools from users and security software. If confirmed malicious, this behavior could allow an attacker to persist in 
author: Bhavin Patel, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1222.001
custom_attributes:
  original_rule_id: 6e5a3ae4-90a3-462d-9aa6-0119f638c0f1
  source_format: splunk_spl