title: High Volume of Bytes Out to Url
id: 88d72ba9-b05a-532a-8aad-b053cb2aeae3
status: stable
level: medium
description: |
  The following analytic detects a high volume of outbound web traffic, specifically over 1GB of data sent to a URL within a 2-minute window. It leverages the Web data model to identify significant uploads by analyzing the sum of bytes out. This activity is significant as it may indicate potential data exfiltration by malware or malicious insiders. If confirmed as malicious, this behavior could lead to unauthorized data transfer, resulting in data breaches and loss of sensitive information. Immedi
author: Bhavin Patel, Splunk
logsource:
  product: splunk
detection:
  selection:
    datamodel: Web
    span: 2m
  condition: selection
tags:
  - attack.t1567
references:
  - https://attack.mitre.org/techniques/T1567/
  - https://www.trendmicro.com/en_us/research/20/l/pawn-storm-lack-of-sophistication-as-a-strategy.html
  - https://www.bleepingcomputer.com/news/security/hacking-group-s-new-malware-abuses-google-and-facebook-services/
custom_attributes:
  original_rule_id: c8a6b56d-16dd-4e9c-b4bd-527742ead98d
  source_format: splunk_spl