title: High Number of Login Failures from a single source
id: 00c68f72-ccf1-56e7-9769-00e18b9bc915
status: stable
level: medium
description: |
  The following analytic detects multiple failed login attempts in Office365 Azure Active Directory from a single source IP address. It leverages Office365 management activity logs, specifically AzureActiveDirectoryStsLogon records, aggregating these logs in 5-minute intervals to count failed login attempts. This activity is significant as it may indicate brute-force attacks or password spraying, which are critical to monitor. If confirmed malicious, an attacker could gain unauthorized access to O
author: Bhavin Patel, Mauricio Velazco, Splunk
logsource:
  product: azure
  category: authentication
detection:
  selection:
    workload: AzureActiveDirectory
    operation: UserLoginFailed
    record_type: AzureActiveDirectoryStsLogon
    span: 5m
  condition: selection
tags:
  - attack.t1110.001
references:
  - https://attack.mitre.org/techniques/T1110/001/
  - https://docs.microsoft.com/en-us/security/compass/incident-response-playbook-password-spray
  - https://www.cisa.gov/uscert/ncas/alerts/aa21-008a
  - https://docs.microsoft.com/azure/active-directory/reports-monitoring/reference-sign-ins-error-codes
custom_attributes:
  original_rule_id: 7f398cfb-918d-41f4-8db8-2e2474e02222
  source_format: splunk_spl