title: Hosts receiving high volume of network traffic from email server
id: b478f4ee-04c9-5abf-8f69-9ac162e429b4
status: experimental
level: medium
description: |
  The following analytic identifies hosts receiving an unusually high volume of network traffic from an email server. It leverages the Network_Traffic data model to sum incoming bytes to clients from email servers, comparing current traffic against historical averages and standard deviations. This activity is significant as it may indicate data exfiltration by a malicious actor using the email server. If confirmed malicious, this could lead to unauthorized data access and potential data breaches, 
author: Bhavin Patel, Splunk
logsource:
  product: splunk
  category: network_connection
detection:
  selection:
    datamodel: Network_Traffic
    dest_category: email_server
    span: 1d
    deviation_threshold: 3
  condition: selection
tags:
  - attack.t1114.002
custom_attributes:
  original_rule_id: 7f5fb3e1-4209-4914-90db-0ec21b556368
  source_format: splunk_spl