title: HTTP Possible Request Smuggling
id: 8a5243ea-6703-54df-b00a-1fb0ebf58cd4
status: stable
level: high
description: |
  HTTP request smuggling is a technique for interfering with the way a web site processes sequences of HTTP requests that are received from one or more users. Request smuggling vulnerabilities are often critical in nature, allowing an attacker to bypass security controls, gain unauthorized access to sensitive data, and directly compromise other application users. This detection identifies a common request smuggling technique of using both Content-Length and Transfer-Encoding headers to cause a par
author: Raven Tait, Splunk
logsource:
  product: splunk
  category: network_connection
detection:
  selection:
    name:
      - '*Content-Length*'
      - '*Transfer-Encoding*'
      - '*Content-Length*'
      - '*Transfer-Encoding*'
      - '*Content-Length*'
    value:
      - '*Transfer-Encoding*'
      - '*Content-Length*'
      - 0
    field: _raw
  condition: selection
tags:
  - attack.t1071.001
references:
  - https://portswigger.net/web-security/request-smuggling#what-is-http-request-smuggling
  - https://portswigger.net/research/http1-must-die
  - https://www.vaadata.com/blog/what-is-http-request-smuggling-exploitations-and-security-best-practices/
  - https://www.securityweek.com/new-http-request-smuggling-attacks-impacted-cdns-major-orgs-millions-of-websites/
custom_attributes:
  original_rule_id: 97d85f98-9d15-41a0-8682-7030454875e7
  source_format: splunk_spl