title: HTTP Rapid POST with Mixed Status Codes
id: ea41a8c1-747d-5453-80ee-644f790b4012
status: stable
level: medium
description: |
  This detection identifies rapid-fire POST request attacks where an attacker sends more than 20 POST requests within a 5-second window, potentially attempting to exploit race conditions or overwhelm request handling. The pattern is particularly suspicious when responses vary in size or status codes, indicating successful exploitation attempts or probing for vulnerable endpoints.
author: Raven Tait, Splunk
logsource:
  product: splunk
  category: network_connection
detection:
  selection:
    http_method: POST
    span: 5s
  condition: selection
tags:
  - attack.t1071.001
  - attack.t1190
  - attack.t1595
references:
  - https://portswigger.net/web-security/request-smuggling#what-is-http-request-smuggling
  - https://portswigger.net/research/http1-must-die
  - https://www.vaadata.com/blog/what-is-http-request-smuggling-exploitations-and-security-best-practices/
  - https://www.securityweek.com/new-http-request-smuggling-attacks-impacted-cdns-major-orgs-millions-of-websites/
custom_attributes:
  original_rule_id: c8c987d6-3a1a-4555-9a52-eea0741b6113
  source_format: splunk_spl