title: Hunting 3CXDesktopApp Software
id: 77e0f494-ea57-562e-a0b3-853713bdcef9
status: stable
level: low
description: |
  The following analytic detects the presence of any version of the 3CXDesktopApp, also known as the 3CX Desktop App, on Mac or Windows systems. It leverages the Endpoint data model's Processes node to identify instances of the application running, although it does not provide file version information. This activity is significant because 3CX has identified vulnerabilities in versions 18.12.407 and 18.12.416, which could be exploited by attackers. If confirmed malicious, this could lead to unautho
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    process_name: 3CX Desktop App
  condition: selection
tags:
  - attack.t1195.002
references:
  - https://www.sentinelone.com/blog/smoothoperator-ongoing-campaign-trojanizes-3cx-software-in-software-supply-chain-attack/
  - https://www.cisa.gov/news-events/alerts/2023/03/30/supply-chain-attack-against-3cxdesktopapp
  - https://www.reddit.com/r/crowdstrike/comments/125r3uu/20230329_situational_awareness_crowdstrike/
  - https://www.3cx.com/community/threads/crowdstrike-endpoint-security-detection-re-3cx-desktop-app.119934/page-2#post-558898
  - https://www.3cx.com/community/threads/3cx-desktopapp-security-alert.119951/
custom_attributes:
  original_rule_id: 553d0429-1a1c-44bf-b3f5-a8513deb9ee5
  source_format: splunk_spl