title: IcedID Exfiltrated Archived File Creation
id: 6eab0107-7599-5aef-a6b9-68600d1eb1ce
status: stable
level: low
description: |
  The following analytic detects the creation of suspicious files named passff.tar and cookie.tar, which are indicative of archived stolen browser information such as history and cookies on a machine compromised with IcedID. It leverages Sysmon EventCode 11 to identify these specific filenames. This activity is significant because it suggests that sensitive browser data has been exfiltrated, which could lead to further exploitation or data breaches. If confirmed malicious, this could allow attacke
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    file_path:
      - '*\\passff.tar'
      - '*\\cookie.tar'
  condition: selection
tags:
  - attack.t1560.001
references:
  - https://www.cisecurity.org/insights/white-papers/security-primer-icedid
custom_attributes:
  original_rule_id: 0db4da70-f14b-11eb-8043-acde48001122
  source_format: splunk_spl