title: Internal Vertical Port Scan
id: 2e7a552a-7605-55b9-b3ee-7b488cbe0926
status: stable
level: high
description: |
  This analytic detects instances where an internal host attempts to communicate with over 500 ports on a single destination IP address. It includes filtering criteria to exclude applications performing scans over ephemeral port ranges, focusing on potential reconnaissance or scanning activities. Monitoring network traffic logs allows for timely detection and response to such behavior, enhancing network security by identifying and mitigating potential threats promptly.
author: Dean Luxton, Splunk
logsource:
  product: splunk
detection:
  selection:
    transport:
      - tcp
      - tcp
      - udp
      - udp
    datamodel: Network_Traffic
    span:
      - 1s
      - 1h
    gtime: _time
    src_ip:
      - 10.0.0.0/8
      - 172.16.0.0/12
      - 192.168.0.0/16
  condition: selection
tags:
  - attack.t1046
custom_attributes:
  original_rule_id: 40d2dc41-9bbf-421a-a34b-8611271a6770
  source_format: splunk_spl