title: Ivanti Connect Secure System Information Access via Auth Bypass
id: d54cda87-4bd3-5adf-a488-9b9812bc9cac
status: stable
level: medium
description: |
  The following analytic identifies attempts to exploit the CVE-2023-46805 and CVE-2024-21887 vulnerabilities in Ivanti Connect Secure. It detects GET requests to the /api/v1/totp/user-backup-code/../../system/system-information URI, which leverage an authentication bypass to access system information. The detection uses the Web datamodel to identify requests with a 200 OK response, indicating a successful exploit attempt. This activity is significant as it reveals potential unauthorized access to
author: Michael Haag, Splunk
logsource:
  product: splunk
  category: authentication
detection:
  selection:
    url: '*/api/v1/totp/user-backup-code/../../system/system-information*'
    datamodel: Web
    http_method: GET
    status: 200
  condition: selection
tags:
  - attack.t1190
references:
  - https://github.com/RootUp/PersonalStuff/blob/master/http-vuln-cve2023-46805_2024_21887.nse
  - https://github.com/projectdiscovery/nuclei-templates/blob/c6b351e71b0fb0e40e222e97038f1fe09ac58194/http/misconfiguration/ivanti/CVE-2023-46085-CVE-2024-21887-mitigation-not-applied.yaml
  - https://github.com/rapid7/metasploit-framework/pull/18708/files
custom_attributes:
  original_rule_id: d51c13dd-a232-4c83-a2bb-72ab36233c5d
  source_format: splunk_spl