title: Ivanti VTM New Account Creation
id: ad8ddf12-6519-5366-a9dd-d355d11eed2f
status: stable
level: high
description: |
  This analytic detects potential exploitation of the Ivanti Virtual Traffic Manager (vTM) authentication bypass vulnerability (CVE-2024-7593) to create new administrator accounts. The vulnerability allows unauthenticated remote attackers to bypass authentication on the admin panel and create new admin users. This detection looks for suspicious new account creation events in the Ivanti vTM audit logs that lack expected authentication details, which may indicate exploitation attempts.
author: Michael Haag, Splunk
logsource:
  product: splunk
detection:
  selection:
    operation: adduser
    modgroup: admin
    ip: '!!ABSENT!!'
  condition: selection
tags:
  - attack.t1190
references:
  - https://www.ivanti.com/security/security-advisories/ivanti-virtual-traffic-manager-vtm-cve-2024-7593
  - https://nvd.nist.gov/vuln/detail/CVE-2024-7593
custom_attributes:
  original_rule_id: b04be6e5-2002-4349-8742-52285635b8f5
  source_format: splunk_spl