title: Java Writing JSP File
id: cbb10878-1f16-52e0-b1db-b612f1a16bfc
status: stable
level: high
description: |
  The following analytic detects the Java process writing a .jsp file to disk, which may indicate a web shell being deployed. It leverages data from the Endpoint datamodel, specifically monitoring process and filesystem activities. This activity is significant because web shells can provide attackers with remote control over the compromised server, leading to further exploitation. If confirmed malicious, this could allow unauthorized access, data exfiltration, or further compromise of the affected
author: Michael Haag, Splunk
logsource:
  product: splunk
  category: file_event
detection:
  selection:
    file_name: '*.jsp*'
    process_name:
      - java
      - java.exe
      - javaw.exe
  condition: selection
tags:
  - attack.t1190
  - attack.t1133
references:
  - https://www.microsoft.com/security/blog/2022/04/04/springshell-rce-vulnerability-guidance-for-protecting-against-and-detecting-cve-2022-22965/
  - https://github.com/TheGejr/SpringShell
  - https://www.tenable.com/blog/spring4shell-faq-spring-framework-remote-code-execution-vulnerability
custom_attributes:
  original_rule_id: eb65619c-4f8d-4383-a975-d352765d344b
  source_format: splunk_spl