title: JetBrains TeamCity RCE Attempt
id: 005a1b0f-07a6-572a-90b0-e3df63803b98
status: stable
level: high
description: |
  The following analytic detects attempts to exploit the CVE-2023-42793 vulnerability in JetBrains TeamCity On-Premises. It identifies suspicious POST requests to /app/rest/users/id:1/tokens/RPC2, leveraging the Web datamodel to monitor specific URL patterns and HTTP methods. This activity is significant as it may indicate an unauthenticated attacker attempting to gain administrative access via Remote Code Execution (RCE). If confirmed malicious, this could allow the attacker to execute arbitrary 
author: Michael Haag, Splunk
logsource:
  product: splunk
detection:
  selection:
    datamodel: Web
    status: 200
    http_method: POST
    url:
      - '/app/rest/users/id:1/tokens/RPC2*'
  condition: selection
tags:
  - attack.t1190
references:
  - https://blog.jetbrains.com/teamcity/2023/09/critical-security-issue-affecting-teamcity-on-premises-update-to-2023-05-4-now/
  - https://www.sonarsource.com/blog/teamcity-vulnerability/
  - https://github.com/rapid7/metasploit-framework/pull/18408
  - https://attackerkb.com/topics/1XEEEkGHzt/cve-2023-42793/rapid7-analysis
custom_attributes:
  original_rule_id: 89a58e5f-1365-4793-b45c-770abbb32b6c
  source_format: splunk_spl