title: Kerberoasting spn request with RC4 encryption
id: 20588524-2464-593b-817e-91b65a21acd1
status: stable
level: high
description: |
  The following analytic detects potential Kerberoasting attacks by identifying Kerberos service ticket requests with RC4 encryption through Event ID 4769. It leverages specific Ticket_Options values commonly used by Kerberoasting tools. This activity is significant as Kerberoasting allows attackers to request service tickets for domain accounts, typically service accounts, and crack them offline to gain privileged access. If confirmed malicious, this could lead to unauthorized access, privilege e
author: Jose Hernandez, Patrick Bareiss, Mauricio Velazco, Dean Luxton, Splunk
logsource:
  product: splunk
detection:
  selection:
    eventcode: 4769
    ticketoptions:
      - 0x40810000
      - 0x40800000
    ticketencryptiontype: 0x17
  filter:
    servicename: '*$'
  condition: selection and not filter
tags:
  - attack.t1558.003
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/4e3e9c8096dde00639a6b98845ec349135554ed5/atomics/T1208/T1208.md
  - https://www.hub.trimarcsecurity.com/post/trimarc-research-detecting-kerberoasting-activity
custom_attributes:
  original_rule_id: 5cc67381-44fa-4111-8a37-7a230943f027
  source_format: splunk_spl