title: Kubernetes Abuse of Secret by Unusual User Group
id: 56e93237-d641-5abe-83f5-5ba617071a23
status: stable
level: medium
description: |
  The following analytic detects unauthorized access or misuse of Kubernetes Secrets by unusual user groups. It leverages Kubernetes Audit logs to identify anomalies in access patterns by analyzing the source of requests and user groups. This activity is significant for a SOC as Kubernetes Secrets store sensitive information like passwords, OAuth tokens, and SSH keys. If confirmed malicious, this behavior could indicate an attacker attempting to exfiltrate or misuse these secrets, potentially lead
author: Patrick Bareiss, Splunk
logsource:
  product: linux
detection:
  selection:
    resource: secrets
    verb: get
  condition: selection
tags:
  - attack.t1552.007
references:
  - https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
custom_attributes:
  original_rule_id: b6f45bbc-4ea9-4068-b3bc-0477f6997ae2
  source_format: splunk_spl