title: Kubernetes Abuse of Secret by Unusual User Name
id: d4569881-b1c0-5b97-9f90-9054ab1d4e65
status: stable
level: medium
description: |
  The following analytic detects unauthorized access or misuse of Kubernetes Secrets by unusual user names. It leverages Kubernetes Audit logs to identify anomalies in access patterns by analyzing the source of requests based on user names. This activity is significant for a SOC as Kubernetes Secrets store sensitive information like passwords, OAuth tokens, and SSH keys, making them critical assets. If confirmed malicious, this activity could lead to unauthorized access to sensitive systems or dat
author: Patrick Bareiss, Splunk
logsource:
  product: linux
detection:
  selection:
    resource: secrets
    verb: get
  condition: selection
tags:
  - attack.t1552.007
references:
  - https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
custom_attributes:
  original_rule_id: df6e9cae-5257-4a34-8f3a-df49fa0f5c46
  source_format: splunk_spl