title: Kubernetes Nginx Ingress RFI
id: 19629854-adec-5754-b26b-f0ad590b8ded
status: stable
level: high
description: |
  The following analytic detects remote file inclusion (RFI) attacks targeting Kubernetes Nginx ingress controllers. It leverages Kubernetes logs from the Nginx ingress controller, parsing fields such as `remote_addr`, `request`, and `url` to identify suspicious activity. This activity is significant because RFI attacks can allow attackers to execute arbitrary code or access sensitive files on the server. If confirmed malicious, this could lead to unauthorized access, data exfiltration, or further
author: Patrick Bareiss, Splunk
logsource:
  product: kubernetes
detection:
  selection:
    phase: operate
    severity: medium
    field:
      - _raw
      - request
      - url
  condition: selection
tags:
  - attack.t1212
references:
  - https://github.com/splunk/splunk-connect-for-kubernetes
  - https://www.invicti.com/blog/web-security/remote-file-inclusion-vulnerability/
custom_attributes:
  original_rule_id: fc5531ae-62fd-4de6-9c36-b4afdae8ca95
  source_format: splunk_spl