title: Kubernetes Pod With Host Network Attachment
id: 2ad2ed92-809e-5f01-9bbe-b8e854a87859
status: stable
level: medium
description: |
  The following analytic detects the creation or update of a Kubernetes pod with host network attachment. It leverages Kubernetes Audit logs to identify pods configured with host network settings. This activity is significant for a SOC as it could allow an attacker to monitor all network traffic on the node, potentially capturing sensitive information and escalating privileges. If confirmed malicious, this could lead to unauthorized access, data breaches, and service disruptions, severely impactin
author: Patrick Bareiss, Splunk
logsource:
  product: kubernetes
  category: network_connection
detection:
  selection:
    resource: pods
    verb:
      - create
      - update
  condition: selection
tags:
  - attack.t1204
references:
  - https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
custom_attributes:
  original_rule_id: cce357cf-43a4-494a-814b-67cea90fe990
  source_format: splunk_spl