title: Kubernetes Node Port Creation
id: 6c653bb9-5516-5c97-81bd-bbc6325ee536
status: stable
level: medium
description: |
  The following analytic detects the creation of a Kubernetes NodePort service, which exposes a service to the external network. It identifies this activity by monitoring Kubernetes Audit logs for the creation of NodePort services. This behavior is significant for a SOC as it could allow an attacker to access internal services, posing a threat to the Kubernetes infrastructure's integrity and security. If confirmed malicious, this activity could lead to data breaches, service disruptions, or unauth
author: Patrick Bareiss, Splunk
logsource:
  product: kubernetes
detection:
  selection:
    verb: create
    type: NodePort
  condition: selection
tags:
  - attack.t1204
references:
  - https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
custom_attributes:
  original_rule_id: d7fc865e-b8a1-4029-a960-cf4403b821b6
  source_format: splunk_spl