title: Kubernetes Scanner Image Pulling
id: 8e04554c-ce95-5421-8ede-438cd529ff4a
status: stable
level: high
description: |
  The following analytic detects the pulling of known Kubernetes security scanner images such as kube-hunter, kube-bench, and kube-recon. It leverages Kubernetes logs ingested through Splunk Connect for Kubernetes, specifically monitoring for messages indicating the pulling of these images. This activity is significant because the use of security scanners can indicate an attempt to identify vulnerabilities within the Kubernetes environment. If confirmed malicious, this could lead to the discovery 
author: Patrick Bareiss, Splunk
logsource:
  product: kubernetes
detection:
  selection:
    phase: operate
    severity: high
    message:
      - Pulling image *kube-hunter*
      - Pulling image *kube-bench*
      - Pulling image *kube-recon*
      - Pulling image *kube-recon*
  condition: selection
tags:
  - attack.t1526
references:
  - https://github.com/splunk/splunk-connect-for-kubernetes
custom_attributes:
  original_rule_id: 4890cd6b-0112-4974-a272-c5c153aee551
  source_format: splunk_spl