title: Kubernetes Cron Job Creation
id: a80afc9c-3a3f-5344-bd97-90fe049a71e2
status: stable
level: medium
description: |
  The following analytic detects the creation of a Kubernetes cron job, which is a task scheduled to run automatically at specified intervals. It identifies this activity by monitoring Kubernetes Audit logs for the creation events of cron jobs. This behavior is significant for a SOC as it could allow an attacker to execute malicious tasks repeatedly and automatically, posing a threat to the Kubernetes infrastructure. If confirmed malicious, this activity could lead to persistent attacks, service d
author: Patrick Bareiss, Splunk
logsource:
  product: linux
detection:
  selection:
    verb: create
  condition: selection
tags:
  - attack.t1053.007
references:
  - https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
custom_attributes:
  original_rule_id: 5984dbe8-572f-47d7-9251-3dff6c3f0c0d
  source_format: splunk_spl