title: Kubernetes Abuse of Secret by Unusual User Agent
id: eb74b218-9c42-5b2d-b684-f3076cf9a5e5
status: stable
level: medium
description: |
  The following analytic detects unauthorized access or misuse of Kubernetes Secrets by unusual user agents. It leverages Kubernetes Audit logs to identify anomalies in access patterns by analyzing the source of requests based on user agents. This activity is significant for a SOC because Kubernetes Secrets store sensitive information like passwords, OAuth tokens, and SSH keys, making them critical assets. If confirmed malicious, this activity could lead to unauthorized access to sensitive systems
author: Patrick Bareiss, Splunk
logsource:
  product: linux
detection:
  selection:
    resource: secrets
    verb: get
  condition: selection
tags:
  - attack.t1552.007
references:
  - https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
custom_attributes:
  original_rule_id: 096ab390-05ca-462c-884e-343acd5b9240
  source_format: splunk_spl