title: Kubernetes Anomalous Outbound Network Activity from Process
id: 05e99f65-5d38-5474-975f-c8a807818e98
status: experimental
level: medium
description: |
  The following analytic identifies anomalously high outbound network activity from processes running within containerized workloads in a Kubernetes environment. It leverages Network Performance Monitoring metrics collected via an OTEL collector and pulled from Splunk Observability Cloud. The detection compares recent network metrics (tcp.bytes, tcp.new_sockets, tcp.packets, udp.bytes, udp.packets) over the last hour with the average metrics over the past 30 days. This activity is significant as i
author: Matthew Moore, Splunk
logsource:
  product: kubernetes
  category: process_creation
detection:
  selection:
    key:
      - source.workload.name
      - source.workload.name
    span: 10s
    type: left
  condition: selection
tags:
  - attack.t1204
references:
  - https://github.com/signalfx/splunk-otel-collector-chart
custom_attributes:
  original_rule_id: dd6afee6-e0a3-4028-a089-f47dd2842c22
  source_format: splunk_spl