title: Kubernetes Anomalous Inbound to Outbound Network IO Ratio
id: 82e7c557-5e85-5284-bd89-ceabb4a01dae
status: experimental
level: medium
description: |
  The following analytic identifies significant changes in network communication behavior within Kubernetes containers by examining the inbound to outbound network IO ratios. It leverages process metrics from an OTEL collector and Kubelet Stats Receiver, along with data from Splunk Observability Cloud. Anomalies are detected using a lookup table containing average and standard deviation values for network IO, triggering an event if the anomaly persists for over an hour. This activity is significan
author: Matthew Moore, Splunk
logsource:
  product: kubernetes
  category: network_connection
detection:
  selection:
    key: k8s.cluster.name
    direction:
      - transmit
      - receive
    span: 10s
  condition: selection
tags:
  - attack.t1204
references:
  - https://github.com/signalfx/splunk-otel-collector-chart
custom_attributes:
  original_rule_id: 9d8f6e3f-39df-46d8-a9d4-96173edc501f
  source_format: splunk_spl