title: Kubernetes Process with Resource Ratio Anomalies
id: 2e8604c9-82e0-5de4-a205-218e954bad8c
status: experimental
level: medium
description: |
  The following analytic detects anomalous changes in resource utilization ratios for processes running on a Kubernetes node. It leverages process metrics collected via an OTEL collector and hostmetrics receiver, analyzed through Splunk Observability Cloud. The detection uses a lookup table containing average and standard deviation values for various resource ratios (e.g., CPU:memory, CPU:disk operations). Significant deviations from these baselines may indicate compromised processes, malicious ac
author: Matthew Moore, Splunk
logsource:
  product: kubernetes
  category: process_creation
detection:
  selection:
    mem: process.cpu.utilization
    disk:
      - process.cpu.utilization
      - process.memory.utilization
    threads:
      - process.cpu.utilization
      - process.disk.operations
    key: k8s.cluster.name
    span: 10s
  condition: selection
tags:
  - attack.t1204
references:
  - https://github.com/signalfx/splunk-otel-collector-chart
custom_attributes:
  original_rule_id: 0d42b295-0f1f-4183-b75e-377975f47c65
  source_format: splunk_spl