title: Kubernetes Process with Anomalous Resource Utilisation
id: 39d20428-5bf2-58f1-a573-4a461342ae29
status: experimental
level: medium
description: |
  The following analytic identifies high resource utilization anomalies in Kubernetes processes. It leverages process metrics from an OTEL collector and hostmetrics receiver, fetched via the Splunk Infrastructure Monitoring Add-on. The detection uses a lookup table with average and standard deviation values to spot anomalies. This activity is significant as high resource utilization can indicate security threats like cryptojacking, unauthorized data exfiltration, or compromised containers. If conf
author: Matthew Moore, Splunk
logsource:
  product: kubernetes
  category: process_creation
detection:
  selection:
    key: k8s.cluster.name
    span: 10s
  condition: selection
tags:
  - attack.t1204
references:
  - https://github.com/signalfx/splunk-otel-collector-chart
custom_attributes:
  original_rule_id: 25ca9594-7a0d-4a95-a5e5-3228d7398ec8
  source_format: splunk_spl