title: Kubernetes Anomalous Inbound Network Activity from Process
id: 8c9ba3c2-d603-58a4-9b89-6a7d365dccf3
status: experimental
level: medium
description: |
  The following analytic identifies anomalous inbound network traffic volumes from processes within containerized workloads. It leverages Network Performance Monitoring metrics collected via an OTEL collector and pulled from Splunk Observability Cloud. The detection compares recent metrics (tcp.bytes, tcp.new_sockets, tcp.packets, udp.bytes, udp.packets) over the last hour with the average over the past 30 days. This activity is significant as it may indicate unauthorized data reception, potential
author: Matthew Moore, Splunk
logsource:
  product: kubernetes
  category: process_creation
detection:
  selection:
    key:
      - dest.workload.name
      - dest.workload.name
    span: 10s
    type: left
  condition: selection
tags:
  - attack.t1204
references:
  - https://github.com/signalfx/splunk-otel-collector-chart
custom_attributes:
  original_rule_id: 10442d8b-0701-4c25-911d-d67b906e713c
  source_format: splunk_spl