title: Kubernetes Abuse of Secret by Unusual Location
id: 79da2331-6b83-560e-8da2-e8a32780e43a
status: stable
level: medium
description: |
  The following analytic detects unauthorized access or misuse of Kubernetes Secrets from unusual locations. It leverages Kubernetes Audit logs to identify anomalies in access patterns by analyzing the source of requests by country. This activity is significant for a SOC as Kubernetes Secrets store sensitive information like passwords, OAuth tokens, and SSH keys, making them critical assets. If confirmed malicious, this behavior could indicate an attacker attempting to exfiltrate or misuse these s
author: Patrick Bareiss, Splunk
logsource:
  product: linux
detection:
  selection:
    resource: secrets
    verb: get
  condition: selection
tags:
  - attack.t1552.007
references:
  - https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
custom_attributes:
  original_rule_id: 40a064c1-4ec1-4381-9e35-61192ba8ef82
  source_format: splunk_spl