title: Large Volume of DNS ANY Queries
id: 80abf96f-c345-5081-ac61-9080f4f560a4
status: experimental
level: medium
description: |
  The following analytic identifies a large volume of DNS ANY queries, which may indicate a DNS amplification attack. It leverages the Network_Resolution data model to count DNS queries of type "ANY" directed to specific destinations. This activity is significant because DNS amplification attacks can overwhelm network resources, leading to Denial of Service (DoS) conditions. If confirmed malicious, this activity could disrupt services, degrade network performance, and potentially be part of a larg
author: Bhavin Patel, Splunk
logsource:
  product: splunk
  category: network_connection
detection:
  selection:
    datamodel: Network_Resolution
    nodename: DNS
  condition: selection
tags:
  - attack.t1498.002
custom_attributes:
  original_rule_id: 8fa891f7-a533-4b3c-af85-5aa2e7c1f1eb
  source_format: splunk_spl