title: Linux Stop Services
id: 9d76f9e9-1faa-5b4a-89ef-da017f1b75c4
status: stable
level: high
description: |
  The following analytic detects attempts to stop or clear a service on Linux systems. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on processes like "systemctl," "service," and "svcadm" executing stop commands. This activity is significant as adversaries often terminate security or critical services to disable defenses or disrupt operations, as seen in malware like Industroyer2. If confirmed malicious, this could lead to the disabling of security mechanisms, allow
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    process: '*stop*'
    process_name:
      - systemctl
      - service
      - svcadm
  condition: selection
tags:
  - attack.t1489
references:
  - https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/
  - https://cert.gov.ua/article/39518
custom_attributes:
  original_rule_id: d05204a5-9f1c-4946-a7f3-4fa58d76d5fd
  source_format: splunk_spl