title: Linux Hardware Addition SwapOff
id: 721f0257-3ea1-5fcc-bf3c-1d6755ca5a78
status: stable
level: medium
description: |
  The following analytic detects the execution of the "swapoff" command, which disables the swapping of paging devices on a Linux system. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs. This activity is significant because disabling swap can be a tactic used by malware, such as Awfulshred, to evade detection and hinder forensic analysis. If confirmed malicious, this action could allow an attacker to manipulate system memory management, poten
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    process_name: swapoff
  condition: selection
tags:
  - attack.t1200
references:
  - https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/overview-of-the-cyber-weapons-used-in-the-ukraine-russia-war/
custom_attributes:
  original_rule_id: c1eea697-99ed-44c2-9b70-d8935464c499
  source_format: splunk_spl