title: Linux Auditd Sudo Or Su Execution
id: 87b41f38-c081-5e5e-a1f0-0f155f612403
status: stable
level: medium
description: |
  The following analytic detects the execution of the "sudo" or "su" command on a Linux operating system. It leverages data from Linux Auditd, focusing on process names and parent process names. This activity is significant because "sudo" and "su" commands are commonly used by adversaries to elevate privileges, potentially leading to unauthorized access or control over the system. If confirmed malicious, this activity could allow attackers to execute commands with root privileges, leading to sever
author: Teoderick Contreras, Splunk
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    proctitle:
      - '*sudo *'
      - '*su *'
  condition: selection
tags:
  - attack.t1548.003
references:
  - https://attack.mitre.org/techniques/T1548/003/
custom_attributes:
  original_rule_id: 817a5c89-5b92-4818-a22d-aa35e1361afe
  source_format: splunk_spl