title: Linux Auditd Service Restarted
id: 1a0aac7b-9e74-501a-abf4-af2bdc44c799
status: stable
level: medium
description: |
  The following analytic detects the restarting or re-enabling of services on Linux systems using the `systemctl` or `service` commands. It leverages data from Linux Auditd, focusing on process and command-line execution logs. This activity is significant as adversaries may use it to maintain persistence or execute unauthorized actions. If confirmed malicious, this behavior could lead to repeated execution of malicious payloads, unauthorized access, or data destruction. Security analysts should in
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    proctitle:
      - '*restart*'
      - '*reenable*'
      - '*reload*'
  condition: selection
tags:
  - attack.t1053.006
references:
  - https://attack.mitre.org/techniques/T1543/003/
custom_attributes:
  original_rule_id: 8eb3e858-18d3-44a4-a514-52cfa39f154a
  source_format: splunk_spl