title: Linux Cpulimit Privilege Escalation
id: 2d6ce008-be14-5470-b3c7-1cb08697a00a
status: stable
level: medium
description: |
  The following analytic detects the use of the 'cpulimit' command with specific flags ('-l', '-f') executed with 'sudo' privileges. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process command-line arguments and execution details. This activity is significant because if 'cpulimit' is granted sudo rights, a user can potentially execute system commands as root, leading to privilege escalation. If confirmed malicious, this could allow an attacker to gain root acce
author: Gowthamaraj Rajendran, Splunk
logsource:
  product: linux
detection:
  selection:
    process:
      - '*cpulimit*'
      - '*-l*'
      - '*-f*'
      - '*sudo*'
  condition: selection
tags:
  - attack.t1548.003
references:
  - https://gtfobins.github.io/gtfobins/cpulimit/
  - http://cpulimit.sourceforge.net/
custom_attributes:
  original_rule_id: d4e40b7e-aad3-4a7d-aac8-550ea5222be5
  source_format: splunk_spl