title: Linux Deletion of SSL Certificate
id: c26c56d4-a4ae-5d5c-8151-3d57ead7f390
status: stable
level: medium
description: |
  The following analytic detects the deletion of SSL certificates on a Linux machine. It leverages filesystem event logs to identify when files with extensions .pem or .crt are deleted from the /etc/ssl/certs/ directory. This activity is significant because attackers may delete or modify SSL certificates to disable security features or evade defenses on a compromised system. If confirmed malicious, this behavior could indicate an attempt to disrupt secure communications, evade detection, or execut
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    file_path:
      - '*.pem'
      - '*.crt'
    action: deleted
  condition: selection
tags:
  - attack.t1070.004
  - attack.t1485
references:
  - https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe/
custom_attributes:
  original_rule_id: 839ab790-a60a-4f81-bfb3-02567063f615
  source_format: splunk_spl