title: Linux Install Kernel Module Using Modprobe Utility
id: 8f79d46f-24b4-5c0c-ac2b-f6ad1b3ab474
status: stable
level: medium
description: |
  The following analytic detects the installation of a Linux kernel module using the modprobe utility. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant because installing a kernel module can indicate an attempt to deploy a rootkit or other malicious kernel-level code, potentially leading to elevated privileges and bypassing security detections. If confirmed malicious, this could allow an attacke
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    process_name:
      - kmod
      - sudo
  condition: selection
tags:
  - attack.t1547.006
references:
  - https://docs.fedoraproject.org/en-US/fedora/rawhide/system-administrators-guide/kernel-module-driver-configuration/Working_with_Kernel_Modules/
  - https://security.stackexchange.com/questions/175953/how-to-load-a-malicious-lkm-at-startup
  - https://0x00sec.org/t/kernel-rootkits-getting-your-hands-dirty/1485
custom_attributes:
  original_rule_id: 387b278a-6326-11ec-aa2c-acde48001122
  source_format: splunk_spl