title: Linux Doas Tool Execution
id: 6b70d084-0539-5745-b168-807e9eb99dd1
status: stable
level: medium
description: |
  The following analytic detects the execution of the 'doas' tool on a Linux host. This tool allows standard users to perform tasks with root privileges, similar to 'sudo'. The detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant as 'doas' can be exploited by adversaries to gain elevated privileges on a compromised host. If confirmed malicious, this could lead to unauthorized administrative a
author: Teoderick Contreras, Splunk
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    process_name: doas
  condition: selection
tags:
  - attack.t1548.003
references:
  - https://wiki.gentoo.org/wiki/Doas
  - https://www.makeuseof.com/how-to-install-and-use-doas/
custom_attributes:
  original_rule_id: d5a62490-6e09-11ec-884e-acde48001122
  source_format: splunk_spl