title: Linux Deleting Critical Directory Using RM Command
id: 33a2c059-261b-597e-8dc8-30ee4a61c8db
status: stable
level: high
description: |
  The following analytic detects the deletion of critical directories on a Linux machine using the `rm` command with argument rf. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions targeting directories like /boot, /var/log, /etc, and /dev. This activity is significant because deleting these directories can severely disrupt system operations and is often associated with destructive campaigns like Industroyer2. If confirmed malicious, this actio
author: Teoderick Contreras, Splunk
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    process:
      - '*/boot/*'
      - '*/var/log/*'
      - '*/etc/*'
      - '*/dev/*'
    process_name: rm
  condition: selection
tags:
  - attack.t1485
references:
  - https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/
  - https://cert.gov.ua/article/39518
custom_attributes:
  original_rule_id: 33f89303-cc6f-49ad-921d-2eaea38a6f7a
  source_format: splunk_spl