title: Linux Auditd Doas Tool Execution
id: affd6060-6502-5a5a-a8a4-fe513d589f7a
status: stable
level: medium
description: |
  The following analytic detects the execution of the 'doas' tool on a Linux host. This tool allows standard users to perform tasks with root privileges, similar to 'sudo'. The detection leverages data from Linux Auditd, focusing on process names and command-line executions. This activity is significant as 'doas' can be exploited by adversaries to gain elevated privileges on a compromised host. If confirmed malicious, this could lead to unauthorized administrative access, potentially compromising 
author: Teoderick Contreras, Splunk
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    type: SYSCALL
    comm: doas
  condition: selection
tags:
  - attack.t1548.003
references:
  - https://wiki.gentoo.org/wiki/Doas
  - https://www.makeuseof.com/how-to-install-and-use-doas/
custom_attributes:
  original_rule_id: 91b8ca78-f205-4826-a3ef-cd8d6b24e97b
  source_format: splunk_spl