title: Linux Auditd Kernel Module Enumeration
id: 2a84208b-0029-5c16-ad36-dc8957181b42
status: stable
level: medium
description: |
  The following analytic identifies the use of the 'kmod' process to list kernel modules on a Linux system. This detection leverages data from Linux Auditd, focusing on process names and command-line executions. While listing kernel modules is not inherently malicious, it can be a precursor to loading unauthorized modules using 'insmod'. If confirmed malicious, this activity could allow an attacker to load kernel modules, potentially leading to privilege escalation, persistence, or other malicious
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    type: SYSCALL
    comm: lsmod
  condition: selection
tags:
  - attack.t1082
  - attack.t1014
references:
  - https://man7.org/linux/man-pages/man8/kmod.8.html
custom_attributes:
  original_rule_id: d1b088de-c47a-4572-9339-bdcc26493b32
  source_format: splunk_spl