title: Linux Auditd Doas Conf File Creation
id: e7ce51b1-7bea-5381-bca1-ef61df8caf21
status: stable
level: high
description: |
  The following analytic detects the creation of the doas.conf file on a Linux host. This file is used by the doas utility to allow standard users to perform tasks as root, similar to sudo. The detection leverages Linux Auditd data, focusing on the creation of the doas.conf file. This activity is significant because it can indicate an attempt to gain elevated privileges, potentially by an adversary. If confirmed malicious, this could allow an attacker to execute commands with root commands with ro
author: Teoderick Contreras, Nasreddine Bencherchali, Splunk
logsource:
  product: linux
  category: file_event
detection:
  selection:
    nametype: CREATE
    type:
      - PATH
      - CWD
  condition: selection
tags:
  - attack.t1548.003
references:
  - https://wiki.gentoo.org/wiki/Doas
  - https://www.makeuseof.com/how-to-install-and-use-doas/
custom_attributes:
  original_rule_id: 61059783-574b-40d2-ac2f-69b898afd6b4
  source_format: splunk_spl