title: Linux Auditd Hardware Addition Swapoff
id: de8feb90-747d-568e-ab48-33deabee5bd1
status: stable
level: medium
description: |
  The following analytic detects the execution of the "swapoff" command, which disables the swapping of paging devices on a Linux system. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs. This activity is significant because disabling swap can be a tactic used by malware, such as Awfulshred, to evade detection and hinder forensic analysis. If confirmed malicious, this action could allow an attacker to manipulate system memory management, poten
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    proctitle:
      - '*swapoff*'
      - '*-a*'
  condition: selection
tags:
  - attack.t1200
references:
  - https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/overview-of-the-cyber-weapons-used-in-the-ukraine-russia-war/
custom_attributes:
  original_rule_id: 5728bb16-1a0b-4b66-bce2-0074ac839770
  source_format: splunk_spl