title: Linux Insert Kernel Module Using Insmod Utility
id: dab74233-7c9b-5b9e-b07a-0aef626840fb
status: stable
level: medium
description: |
  The following analytic detects the insertion of a Linux kernel module using the insmod utility. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs that include process names and command-line details. This activity is significant as it may indicate the installation of a rootkit or malicious kernel module, potentially allowing an attacker to gain elevated privileges and bypass security detections. If confirmed malicious, this could lead to unaut
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    process_name:
      - kmod
      - sudo
  condition: selection
tags:
  - attack.t1547.006
references:
  - https://docs.fedoraproject.org/en-US/fedora/rawhide/system-administrators-guide/kernel-module-driver-configuration/Working_with_Kernel_Modules/
  - https://security.stackexchange.com/questions/175953/how-to-load-a-malicious-lkm-at-startup
  - https://0x00sec.org/t/kernel-rootkits-getting-your-hands-dirty/1485
custom_attributes:
  original_rule_id: 18b5a1a0-6326-11ec-943a-acde48001122
  source_format: splunk_spl