title: Linux Auditd Insert Kernel Module Using Insmod Utility
id: 9899c720-b7fd-53cb-8f80-a433b4dcf3fe
status: stable
level: medium
description: |
  The following analytic detects the insertion of a Linux kernel module using the insmod utility. It leverages data from Linux Auditd, focusing on process execution logs that include process names and command-line details. This activity is significant as it may indicate the installation of a rootkit or malicious kernel module, potentially allowing an attacker to gain elevated privileges and bypass security detections. If confirmed malicious, this could lead to unauthorized code execution, persiste
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    type: SYSCALL
    comm: insmod
  condition: selection
tags:
  - attack.t1547.006
references:
  - https://docs.fedoraproject.org/en-US/fedora/rawhide/system-administrators-guide/kernel-module-driver-configuration/Working_with_Kernel_Modules/
  - https://security.stackexchange.com/questions/175953/how-to-load-a-malicious-lkm-at-startup
  - https://0x00sec.org/t/kernel-rootkits-getting-your-hands-dirty/1485
custom_attributes:
  original_rule_id: bc0ca53f-dea6-4906-9b12-09c396fdf1d3
  source_format: splunk_spl