title: Linux Auditd Possible Append Cronjob Entry On Existing Cronjob File
id: 750cb17e-c4e5-5589-a74e-bb117c2d8e73
status: stable
level: low
description: |
  The following analytic detects potential tampering with cronjob files on a Linux system. It leverages logs from Linux Auditd, focusing on events of type PATH or CWD. This activity could be significant because adversaries often use it for persistence or privilege escalation. Correlate this with related EXECVE or PROCTITLE events to identify the process or user responsible for the access or modification. If confirmed malicious, this could allow attackers to execute unauthorized code automatically,
author: Teoderick Contreras, Splunk
logsource:
  product: linux
  category: file_event
detection:
  selection:
    type: PATH
  condition: selection
tags:
  - attack.t1053.003
references:
  - https://attack.mitre.org/techniques/T1053/003/
  - https://blog.aquasec.com/threat-alert-kinsing-malware-container-vulnerability
  - https://www.intezer.com/blog/research/kaiji-new-chinese-linux-malware-turning-to-golang/
custom_attributes:
  original_rule_id: fea71cf0-fa10-4ef6-9202-9682b2e0c477
  source_format: splunk_spl