title: Linux Auditd Base64 Decode Files
id: 999f90d3-33d4-52a6-b450-c915a10ea9d6
status: stable
level: medium
description: |
  The following analytic detects suspicious Base64 decode operations that may indicate malicious activity, such as data exfiltration or execution of encoded commands. Base64 is commonly used to encode data for safe transmission, but attackers may abuse it to conceal malicious payloads. This detection focuses on identifying unusual or unexpected Base64 decoding processes, particularly when associated with critical files or directories. By monitoring these activities, the analytic helps uncover pote
author: Teoderick Contreras, Splunk
logsource:
  product: linux
  category: file_event
detection:
  selection:
    execve_command:
      - '*-d*'
      - '* --d*'
  condition: selection
tags:
  - attack.t1140
references:
  - https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
  - https://gtfobins.github.io/gtfobins/dd/
custom_attributes:
  original_rule_id: 5890ba10-4e48-4dc0-8a40-3e1ebe75e737
  source_format: splunk_spl