title: Linux Auditd Private Keys and Certificate Enumeration
id: f1f248d9-aa4b-5818-a43c-f906e2730f6c
status: stable
level: medium
description: |
  The following analytic detects suspicious attempts to find private keys, which may indicate an attacker's effort to access sensitive cryptographic information. Private keys are crucial for securing encrypted communications and data, and unauthorized access to them can lead to severe security breaches, including data decryption and identity theft. By monitoring for unusual or unauthorized searches for private keys, this analytic helps identify potential threats to cryptographic security, enabling
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    execve_command:
      - '*.pem*'
      - '*.cer*'
      - '*.crt*'
      - '*.pgp*'
      - '*.key*'
      - '*.gpg*'
      - '*.ppk*'
      - '*.p12*'
      - '*.pfx*'
      - '*.p7b*'
  condition: selection
tags:
  - attack.t1552.004
references:
  - https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
  - https://github.com/peass-ng/PEASS-ng/tree/master/linPEAS
custom_attributes:
  original_rule_id: 892eb674-3344-4143-8e52-4775b1daf3f1
  source_format: splunk_spl