title: Linux Auditd Clipboard Data Copy
id: 1f19572e-6a70-53b2-89c2-6d7fda94d217
status: stable
level: medium
description: |
  The following analytic detects the use of the Linux 'xclip' command to copy data from the clipboard. It leverages Linux Auditd telemetry, focusing on process names and command-line arguments related to clipboard operations. This activity is significant because adversaries can exploit clipboard data to capture sensitive information such as passwords or IP addresses. If confirmed malicious, this technique could lead to unauthorized data exfiltration, compromising sensitive information and potentia
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    execve_command:
      - '*-o*'
      - '*-selection *'
      - '*-sel *'
  condition: selection
tags:
  - attack.t1115
references:
  - https://attack.mitre.org/techniques/T1115/
  - https://linux.die.net/man/1/xclip
custom_attributes:
  original_rule_id: 9ddfe470-c4d0-4e60-8668-7337bd699edd
  source_format: splunk_spl