title: Linux Possible Ssh Key File Creation
id: fa68bdf5-74e3-540f-acf7-88be67cfdaa4
status: stable
level: medium
description: |
  The following analytic detects the creation of SSH key files in the ~/.ssh/ directory. It leverages filesystem data to identify new files in this specific path. This activity is significant because threat actors often create SSH keys to gain persistent access and escalate privileges on a compromised host. If confirmed malicious, this could allow attackers to remotely access the machine using the OpenSSH daemon service, leading to potential unauthorized control and data exfiltration.
author: Teoderick Contreras, Splunk
logsource:
  product: linux
  category: file_event
detection:
  selection:
    file_path:
      - '*/.ssh*'
  condition: selection
tags:
  - attack.t1098.004
references:
  - https://www.hackingarticles.in/ssh-penetration-testing-port-22/
  - https://attack.mitre.org/techniques/T1098/004/
custom_attributes:
  original_rule_id: c04ef40c-72da-11ec-8eac-acde48001122
  source_format: splunk_spl