title: Linux Auditd File Permission Modification Via Chmod
id: 72d997fa-16d0-5d8c-be6c-749ad7e42977
status: stable
level: medium
description: |
  The following analytic detects suspicious file permission modifications using the `chmod` command, which may indicate an attacker attempting to alter access controls on critical files or directories. Such modifications can be used to grant unauthorized users elevated privileges or to conceal malicious activities by restricting legitimate access. By monitoring for unusual or unauthorized `chmod` usage, this analytic helps identify potential security breaches, allowing security teams to respond pr
author: Teoderick Contreras, Splunk, Ivar Nygård
logsource:
  product: linux
  category: file_event
detection:
  selection:
    proctitle:
      - '* 777 *'
      - '* 755 *'
      - '*+*x*'
      - '* 754 *'
  condition: selection
tags:
  - attack.t1222.002
references:
  - https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
custom_attributes:
  original_rule_id: 5f1d2ea7-eec0-4790-8b24-6875312ad492
  source_format: splunk_spl