title: Linux Gem Privilege Escalation
id: 9319f59d-041f-5fae-ad28-2a963f2b50a9
status: stable
level: medium
description: |
  The following analytic detects the execution of the RubyGems utility with elevated privileges, specifically when it is used to run system commands as root. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions that include "gem open -e" and "sudo". This activity is significant because it indicates a potential privilege escalation attempt, allowing a user to execute commands as the root user. If confirmed malicious, this could lead to
author: Gowthamaraj Rajendran, Splunk
logsource:
  product: linux
detection:
  selection:
    process:
      - '*gem*open*-e*'
      - '*-c*'
      - '*sudo*'
  condition: selection
tags:
  - attack.t1548.003
references:
  - https://gtfobins.github.io/gtfobins/gem/
  - https://en.wikipedia.org/wiki/RubyGems
custom_attributes:
  original_rule_id: 0115482a-5dcb-4bb0-bcca-5d095d224236
  source_format: splunk_spl