title: Linux Auditd Auditd Daemon Start
id: c9295977-00e2-5218-b358-25466cbe0d97
status: stable
level: medium
description: |
  The following analytic detects the (re)initialization of the Linux audit daemon (auditd) by identifying log entries of type DAEMON_START. This event indicates that the audit subsystem has resumed logging after being stopped or has started during system boot. While DAEMON_START may be expected during reboots or legitimate configuration changes, it can also signal attempts to re-enable audit logging after evasion, or restarts with modified or reduced rule sets. Monitoring this event in correlation
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    type: DAEMON_START
  condition: selection
tags:
  - attack.t1562.012
references:
  - https://docs.redhat.com/en/documentation/red_hat_enterprise_linux/6/html/security_guide/sec-audit_record_types
custom_attributes:
  original_rule_id: 6b0cb0ff-9a7e-4475-a687-43827fdb31d6
  source_format: splunk_spl