title: Linux Obfuscated Files or Information Base64 Decode
id: 5ec246e9-3308-5d19-a081-bc9121ea7314
status: stable
level: medium
description: |
  The following analytic detects the use of the base64 decode command on Linux systems, which is often used to deobfuscate files. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions that include "base64 -d" or "base64 --decode". This activity is significant as it may indicate an attempt to hide malicious payloads or scripts. If confirmed malicious, an attacker could use this technique to execute hidden code, potentially leading to unauthorized a
author: Michael Haag, Splunk
logsource:
  product: linux
  category: file_event
detection:
  selection:
    process_path: '*/base64'
    process: '*-d*'
  condition: selection
tags:
  - attack.t1027
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1027/T1027.md#atomic-test-1---decode-base64-data-into-script
  - https://redcanary.com/blog/lateral-movement-with-secure-shell/
  - https://linux.die.net/man/1/base64
custom_attributes:
  original_rule_id: 303b38b2-c03f-44e2-8f41-4594606fcfc7
  source_format: splunk_spl