title: Linux Auditd Find Credentials From Password Stores
id: d540939e-35b3-5563-8029-2f9847217f46
status: stable
level: high
description: |
  The following analytic detects suspicious attempts to find credentials stored in password stores, indicating a potential attacker's effort to access sensitive login information. Password stores are critical repositories that contain valuable credentials, and unauthorized access to them can lead to significant security breaches. By monitoring for unusual or unauthorized activities related to password store access, this analytic helps identify potential credential theft attempts, allowing security
author: Teoderick Contreras, Splunk
logsource:
  product: linux
  category: authentication
detection:
  selection:
    execve_command:
      - '*password*'
      - '*pass *'
      - '*credential*'
      - '*creds*'
  condition: selection
tags:
  - attack.t1555.005
references:
  - https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
  - https://github.com/peass-ng/PEASS-ng/tree/master/linPEAS
custom_attributes:
  original_rule_id: 4de73044-9a1d-4a51-a1c2-85267d8dcab3
  source_format: splunk_spl