title: Linux Add Files In Known Crontab Directories
id: c25ab5f2-2138-5ada-9ef5-4a0b3bddcb06
status: stable
level: medium
description: |
  The following analytic detects unauthorized file creation in known crontab directories on Unix-based systems. It leverages filesystem data to identify new files in directories such as /etc/cron* and /var/spool/cron/*. This activity is significant as it may indicate an attempt by threat actors or malware to establish persistence on a compromised host. If confirmed malicious, this could allow attackers to execute arbitrary code at scheduled intervals, potentially leading to further system compromi
author: Teoderick Contreras, Splunk
logsource:
  product: linux
  category: file_event
detection:
  selection:
    file_path:
      - '*/etc/cron*'
      - '*/var/spool/cron/*'
  condition: selection
tags:
  - attack.t1053.003
references:
  - https://www.sandflysecurity.com/blog/detecting-cronrat-malware-on-linux-instantly/
  - https://www.cyberciti.biz/faq/how-do-i-add-jobs-to-cron-under-linux-or-unix-oses/
custom_attributes:
  original_rule_id: 023f3452-5f27-11ec-bf00-acde48001122
  source_format: splunk_spl