title: Linux Auditd Nopasswd Entry In Sudoers File
id: 6c06b17e-a5a8-5be0-b720-eb6bf72b92dd
status: stable
level: medium
description: |
  The following analytic detects the addition of NOPASSWD entries to the /etc/sudoers file on Linux systems. It leverages Linux Auditd data to identify command lines containing "NOPASSWD:". This activity is significant because it allows users to execute commands with elevated privileges without requiring a password, which can be exploited by adversaries to maintain persistent, privileged access. If confirmed malicious, this could lead to unauthorized privilege escalation, persistent access, and po
author: Teoderick Contreras, Splunk
logsource:
  product: linux
  category: file_event
detection:
  selection:
    proctitle: '*NOPASSWD*'
  condition: selection
tags:
  - attack.t1548.003
references:
  - https://askubuntu.com/questions/334318/sudoers-file-enable-nopasswd-for-user-all-commands
  - https://help.ubuntu.com/community/Sudoers
custom_attributes:
  original_rule_id: 651df959-ad17-4b73-a323-90cb96d5fa1b
  source_format: splunk_spl