title: Linux Auditd Add User Account Type
id: 6fe12abd-61bb-5bb9-89e3-6bfe7164d33d
status: stable
level: medium
description: |
  The following analytic detects the suspicious add user account type. This behavior is critical for a SOC to monitor because it may indicate attempts to gain unauthorized access or maintain control over a system. Such actions could be signs of malicious activity. If confirmed, this could lead to serious consequences, including a compromised system, unauthorized access to sensitive data, or even a wider breach affecting the entire network. Detecting and responding to these signs early is essential
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    type: ADD_USER
  condition: selection
tags:
  - attack.t1136.001
references:
  - https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
custom_attributes:
  original_rule_id: f8c325ea-506e-4105-8ccf-da1492e90115
  source_format: splunk_spl