title: Linux Possible Access To Sudoers File
id: 380a936d-a6bc-5c65-880d-0f86d65065f2
status: stable
level: medium
description: |
  The following analytic detects potential access or modification of the /etc/sudoers file on a Linux system. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on processes like "cat," "nano," "vim," and "vi" accessing the /etc/sudoers file. This activity is significant because the sudoers file controls user permissions for executing commands with elevated privileges. If confirmed malicious, an attacker could gain persistence or escalate privileges, compromising the sec
author: Teoderick Contreras, Splunk
logsource:
  product: linux
  category: file_event
detection:
  selection:
    process_name:
      - cat
      - nano*
      - vim*
      - vi*
    process:
      - '*/etc/sudoers*'
  condition: selection
tags:
  - attack.t1548.003
references:
  - https://attack.mitre.org/techniques/T1548/003/
  - https://web.archive.org/web/20210708035426/https://www.cobaltstrike.com/downloads/csmanual43.pdf
custom_attributes:
  original_rule_id: 4479539c-71fc-11ec-b2e2-acde48001122
  source_format: splunk_spl