title: Linux Preload Hijack Library Calls
id: 8e1b9fe1-bea5-5c3e-a90f-cbbec21963a4
status: stable
level: high
description: |
  The following analytic detects the use of the LD_PRELOAD environment variable to hijack or hook library functions on a Linux platform. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs that include command-line details. This activity is significant because adversaries, malware authors, and red teamers commonly use this technique to gain elevated privileges and establish persistence on a compromised machine. If confirmed malicious, this behavi
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    process: '*LD_PRELOAD*'
  condition: selection
tags:
  - attack.t1574.006
references:
  - https://compilepeace.medium.com/memory-malware-part-0x2-writing-userland-rootkits-via-ld-preload-30121c8343d5
custom_attributes:
  original_rule_id: cbe2ca30-631e-11ec-8670-acde48001122
  source_format: splunk_spl