title: Linux Auditd Find Credentials From Password Managers
id: 0bddc0ff-a7e7-5bd8-994b-4fbfa52c2201
status: stable
level: high
description: |
  The following analytic detects suspicious attempts to find credentials stored in password managers, which may indicate an attacker's effort to retrieve sensitive login information. Password managers are often targeted by adversaries seeking to access stored passwords for further compromise or lateral movement within a network. By monitoring for unusual or unauthorized access to password manager files or processes, this analytic helps identify potential credential theft attempts, enabling securit
author: Teoderick Contreras, Splunk
logsource:
  product: linux
  category: authentication
detection:
  selection:
    execve_command:
      - '*.kdbx*'
      - '*KeePass*'
      - '*.enforced*'
      - '*.lpdb*'
      - '*.opvault*'
      - '*.agilekeychain*'
      - '*.dashlane*'
      - '*.rfx*'
      - '*passbolt*'
      - '*.spdb*'
      - '*StickyPassword*'
      - '*.walletx*'
      - '*enpass*'
      - '*vault*'
      - '*.kdb*'
  condition: selection
tags:
  - attack.t1555.005
references:
  - https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
  - https://github.com/peass-ng/PEASS-ng/tree/master/linPEAS
custom_attributes:
  original_rule_id: 784241aa-85a5-4782-a503-d071bd3446f9
  source_format: splunk_spl