title: Linux Auditd Possible Access To Credential Files
id: 5b1df0b6-bb33-5ee0-b81b-6308b1484215
status: stable
level: medium
description: |
  The following analytic detects attempts to access or dump the contents of /etc/passwd and /etc/shadow files on Linux systems. It leverages data from Linux Auditd, focusing on processes like 'cat', 'nano', 'vim', and 'vi' accessing these files. This activity is significant as it may indicate credential dumping, a technique used by adversaries to gain persistence or escalate privileges. If confirmed malicious, privileges. If confirmed malicious, attackers could obtain hashed passwords for offline 
author: Teoderick Contreras, Splunk
logsource:
  product: linux
  category: file_event
detection:
  selection:
    proctitle:
      - '*cat *'
      - '*nano *'
      - '*vim *'
      - '*vi *'
  condition: selection
tags:
  - attack.t1003.008
references:
  - https://askubuntu.com/questions/445361/what-is-difference-between-etc-shadow-and-etc-passwd
  - https://attack.mitre.org/techniques/T1003/008/
custom_attributes:
  original_rule_id: 0419cb7a-57ea-467b-974f-77c303dfe2a3
  source_format: splunk_spl