title: Linux Auditd Preload Hijack Library Calls
id: 78aa69d5-f986-5a37-97da-2e9d8ad366ff
status: stable
level: high
description: |
  The following analytic detects the use of the LD_PRELOAD environment variable to hijack or hook library functions on a Linux platform. It leverages data from Linux Auditd, focusing on process execution logs that include command-line details. This activity is significant because adversaries, malware authors, and red teamers commonly use this technique to gain elevated privileges and establish persistence on a compromised machine. If confirmed malicious, this behavior could allow attackers to exec
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    execve_command: '*LD_PRELOAD*'
  condition: selection
tags:
  - attack.t1574.006
references:
  - https://compilepeace.medium.com/memory-malware-part-0x2-writing-userland-rootkits-via-ld-preload-30121c8343d5
custom_attributes:
  original_rule_id: 35c50572-a70b-452f-afa9-bebdf3c3ce36
  source_format: splunk_spl