title: Linux Setuid Using Setcap Utility
id: 06d10df3-b40b-59fc-966c-8e48f7d9f7a3
status: stable
level: medium
description: |
  The following analytic detects the execution of the 'setcap' utility to enable the SUID bit on Linux systems. It leverages Endpoint Detection and Response (EDR) data, focusing on process names and command-line arguments that indicate the use of 'setcap' with specific capabilities. This activity is significant because setting the SUID bit allows a user to temporarily gain root access, posing a substantial security risk. If confirmed malicious, an attacker could escalate privileges, execute arbitr
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    process:
      - '* cap_setuid=ep *'
      - '* cap_setuid+ep *'
      - '* cap_net_bind_service+p *'
      - '* cap_net_raw+ep *'
      - '* cap_dac_read_search+ep *'
    process_name: setcap
    cap_setuid: ep
  condition: selection
tags:
  - attack.t1548.001
references:
  - https://www.hackingarticles.in/linux-privilege-escalation-using-capabilities/
custom_attributes:
  original_rule_id: 9d96022e-6250-11ec-9a19-acde48001122
  source_format: splunk_spl