title: Linux Visudo Utility Execution
id: 3673c42e-eadc-5c9f-9cce-5f9741dd1457
status: stable
level: medium
description: |
  The following analytic detects the execution of the 'visudo' utility to modify the /etc/sudoers file on a Linux system. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs. This activity is significant because unauthorized changes to the /etc/sudoers file can grant elevated privileges to users, potentially allowing adversaries to execute commands as root. If confirmed malicious, this could lead to full system compromise, privilege escalation, a
author: Teoderick Contreras, Splunk
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    process_name: visudo
  condition: selection
tags:
  - attack.t1548.003
references:
  - https://askubuntu.com/questions/334318/sudoers-file-enable-nopasswd-for-user-all-commands
custom_attributes:
  original_rule_id: 08c41040-624c-11ec-a71f-acde48001122
  source_format: splunk_spl