title: Linux Data Destruction Command
id: 747d3d37-f7a4-5504-9de8-0aaa87cd39b3
status: stable
level: high
description: |
  The following analytic detects the execution of a Unix shell command designed to wipe root directories on a Linux host. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on the 'rm' command with force recursive deletion and the '--no-preserve-root' option. This activity is significant as it indicates potential data destruction attempts, often associated with malware like Awfulshred. If confirmed malicious, this behavior could lead to severe data loss, system instabili
author: Teoderick Contreras, Splunk
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    process_name: rm
    process:
      - '* -rf*'
      - '* -fr*'
  condition: selection
tags:
  - attack.t1485
references:
  - https://cert.gov.ua/article/3718487
  - https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/overview-of-the-cyber-weapons-used-in-the-ukraine-russia-war/
custom_attributes:
  original_rule_id: b11d3979-b2f7-411b-bb1a-bd00e642173b
  source_format: splunk_spl