title: Linux Persistence and Privilege Escalation Risk Behavior
id: ebf82763-0776-5d0e-9181-3630e279cef7
status: stable
level: medium
description: |
  The following analytic identifies potential Linux persistence and privilege escalation activities. It leverages risk scores and event counts from various Linux-related data sources, focusing on tactics associated with persistence and privilege escalation. This activity is significant for a SOC because it highlights behaviors that could allow an attacker to maintain access or gain elevated privileges on a Linux system. If confirmed malicious, this activity could enable an attacker to execute code
author: Michael Haag, Splunk
logsource:
  product: linux
detection:
  selection:
    risk_object_type: system
    analyticstories:
      - Linux Privilege Escalation
      - Linux Persistence Techniques
    mitre_tactic:
      - persistence
      - privilege-escalation
  condition: selection
tags:
  - attack.t1548
references:
  - https://attack.mitre.org/tactics/TA0004/
custom_attributes:
  original_rule_id: ad5ac21b-3b1e-492c-8e19-ea5d5e8e5cf1
  source_format: splunk_spl