title: Linux Auditd Add User Account
id: efe99084-0375-5a05-879a-df21623ddb04
status: stable
level: medium
description: |
  The following analytic detects the creation of new user accounts on Linux systems using commands like "useradd" or "adduser." It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant as adversaries often create new user accounts to establish persistence on compromised hosts. If confirmed malicious, this could allow attackers to maintain access, escalate privileges, and further compromise the system, p
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    proctitle:
      - '*useradd*'
      - '*adduser*'
  condition: selection
tags:
  - attack.t1136.001
references:
  - https://linuxize.com/post/how-to-create-users-in-linux-using-the-useradd-command/
custom_attributes:
  original_rule_id: aae66dc0-74b4-4807-b480-b35f8027abb4
  source_format: splunk_spl