title: Linux Auditd Auditd Daemon Abort
id: a50c87ce-7aa3-50b7-83d1-7398f3f47b0b
status: stable
level: medium
description: |
  The following analytic detects the abnormal termination of the Linux audit daemon (auditd) by identifying DAEMON_ABORT events in audit logs. These terminations suggest a serious failure of the auditing subsystem, potentially due to resource exhaustion, corruption, or malicious interference. Unlike a clean shutdown, DAEMON_ABORT implies that audit logging may have been disabled without system administrator intent. Alerts should be generated on detection and correlated with DAEMON_START, DAEMON_EN
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    type: DAEMON_ABORT
  condition: selection
tags:
  - attack.t1562.012
references:
  - https://docs.redhat.com/en/documentation/red_hat_enterprise_linux/6/html/security_guide/sec-audit_record_types
custom_attributes:
  original_rule_id: 76d6573f-c4ab-4fa1-8390-c036416d4add
  source_format: splunk_spl