title: Linux Auditd Setuid Using Chmod Utility
id: 430f44cd-ebb9-5351-bc3f-491d48948e4e
status: stable
level: medium
description: |
  The following analytic detects the execution of the chmod utility to set the SUID or SGID bit on files, which can allow users to temporarily gain root or group-level access. This detection leverages data from Linux Auditd, focusing on process names and command-line arguments related to chmod. This activity is significant as it can indicate an attempt to escalate privileges or maintain persistence on a system. If confirmed malicious, an attacker could gain elevated access, potentially compromisin
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    proctitle:
      - '* u+s *'
      - '* g+s *'
      - '* 4777 *'
      - '* 4577 *'
  condition: selection
tags:
  - attack.t1548.001
references:
  - https://www.hackingarticles.in/linux-privilege-escalation-using-capabilities/
custom_attributes:
  original_rule_id: 8230c407-1b47-4d95-ac2e-718bd6381386
  source_format: splunk_spl