title: Linux SSH Remote Services Script Execute
id: 72c8c454-aba8-5ba8-becf-f131afa07e81
status: stable
level: high
description: |
  The following analytic detects the use of SSH to move laterally and execute a script or file on a remote host. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on specific SSH command-line parameters and URLs. This activity is significant as it may indicate an attacker attempting to execute remote commands or scripts, potentially leading to unauthorized access or control over additional systems. If confirmed malicious, this could result in lateral movement, privilege
author: Michael Haag, Splunk
logsource:
  product: linux
detection:
  selection:
    process_name: ssh
    process:
      - '*http:*'
      - '*https:*'
  condition: selection
tags:
  - attack.t1021.004
references:
  - https://redcanary.com/blog/lateral-movement-with-secure-shell/
custom_attributes:
  original_rule_id: aa1748dd-4a5c-457a-9cf6-ca7b4eb711b3
  source_format: splunk_spl