title: Linux Auditd File And Directory Discovery
id: ac7840b7-804c-585e-bd68-a6e4f27a6bc3
status: stable
level: medium
description: |
  The following analytic detects suspicious file and directory discovery activities, which may indicate an attacker's effort to locate sensitive documents and files on a compromised system. This behavior often precedes data exfiltration, as adversaries seek to identify valuable or confidential information for theft. By identifying unusual or unauthorized attempts to browse or enumerate files and directories, this analytic helps security teams detect potential reconnaissance or preparatory actions 
author: Teoderick Contreras, Splunk
logsource:
  product: linux
  category: file_event
detection:
  selection:
    execve_command:
      - '*.tif*'
      - '*.tiff*'
      - '*.gif*'
      - '*.jpeg*'
      - '*.jpg*'
      - '*.jif*'
      - '*.jfif*'
      - '*.jp2*'
      - '*.jpx*'
      - '*.j2k*'
      - '*.j2c*'
      - '*.fpx*'
      - '*.pcd*'
      - '*.png*'
      - '*.flv*'
      - '*.pdf*'
      - '*.mp4*'
      - '*.mp3*'
      - '*.gifv*'
      - '*.avi*'
      - '*.mov*'
      - '*.mpeg*'
      - '*.wav*'
      - '*.doc*'
      - '*.docx*'
      - '*.xls*'
      - '*.xlsx*'
      - '*.svg*'
  condition: selection
tags:
  - attack.t1083
references:
  - https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
  - https://github.com/peass-ng/PEASS-ng/tree/master/linPEAS
custom_attributes:
  original_rule_id: 0bbfb79c-a755-49a5-a38a-1128d0a452f1
  source_format: splunk_spl