title: Linux Auditd Stop Services
id: 6c0abd5f-b60b-5a4c-b924-b1114e07f400
status: stable
level: low
description: |
  The following analytic detects attempts to stop a service on Linux systems. It leverages data from Linux Auditd. This activity is significant as adversaries often stop or terminate security or critical services to disable defenses or disrupt operations, as seen in malware like Industroyer2. If confirmed malicious, this could lead to the disabling of security mechanisms, allowing attackers to persist, escalate privileges, or deploy destructive payloads, severely impacting system integrity and ava
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    type: SERVICE_STOP
  condition: selection
tags:
  - attack.t1489
references:
  - https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/
  - https://cert.gov.ua/article/39518
custom_attributes:
  original_rule_id: 43bc9281-753b-4743-b4b7-60af84f085f3
  source_format: splunk_spl