title: Linux Auditd Find Ssh Private Keys
id: 4c283110-a178-5465-9e6a-365ac82656fd
status: stable
level: medium
description: |
  The following analytic detects suspicious attempts to find SSH private keys, which may indicate an attacker's effort to compromise secure access to systems. SSH private keys are essential for secure authentication, and unauthorized access to these keys can enable attackers to gain unauthorized access to servers and other critical infrastructure. By monitoring for unusual or unauthorized searches for SSH private keys, this analytic helps identify potential threats to network security, allowing se
author: Teoderick Contreras, Splunk
logsource:
  product: linux
detection:
  selection:
    execve_command:
      - '*id_rsa*'
      - '*id_dsa*'
      - '*.key*'
      - '*ssh_key*'
      - '*authorized_keys*'
  condition: selection
tags:
  - attack.t1552.004
references:
  - https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
  - https://github.com/peass-ng/PEASS-ng/tree/master/linPEAS
custom_attributes:
  original_rule_id: e2d2bd10-dcd1-4b2f-8a76-0198eab32ba5
  source_format: splunk_spl