title: Loading Of Dynwrapx Module
id: 6b9a5e71-1700-5ed0-8803-32c7780b8ff3
status: stable
level: high
description: |
  The following analytic detects the loading of the dynwrapx.dll module, which is associated with the DynamicWrapperX ActiveX component. This detection leverages Sysmon EventCode 7 to identify processes that load or register dynwrapx.dll. This activity is significant because DynamicWrapperX can be used to call Windows API functions in scripts, making it a potential tool for malicious actions. If confirmed malicious, this could allow an attacker to execute arbitrary code, escalate privileges, or ma
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    imageloaded: '*\\dynwrapx.dll'
    originalfilename: dynwrapx.dll
    product: DynamicWrapperX
    eventcode: 7
  condition: selection
tags:
  - attack.t1055.001
references:
  - https://blog.f-secure.com/hunting-for-koadic-a-com-based-rootkit/
  - https://www.script-coding.com/dynwrapx_eng.html
  - https://bohops.com/2018/06/28/abusing-com-registry-structure-clsid-localserver32-inprocserver32/
  - https://tria.ge/210929-ap75vsddan
  - https://www.virustotal.com/gui/file/cb77b93150cb0f7fe65ce8a7e2a5781e727419451355a7736db84109fa215a89
custom_attributes:
  original_rule_id: eac5e8ba-4857-11ec-9371-acde48001122
  source_format: splunk_spl