title: MacOS AMOS Stealer - Virtual Machine Check Activity
id: 166be39b-e4a5-591d-9f7e-9b0ae1d052e8
status: stable
level: medium
description: |
  The following analytic detects AMOS Stealer VM check activity on macOS. It leverages osquery to monitor process events and identifies the execution of the "osascript" command along with specific commandline strings. This activity is significant as AMOS stealer was seen using this pattern in order to check if the host is a Virtual Machine or not. If confirmed malicious, this behavior indicate that the host is already infected by the AMOS stealer, which could allow attackers to execute arbitrary c
author: Nasreddine Bencherchali, Splunk, Alex Karkins
logsource:
  product: macos
detection:
  selection:
    cmdline:
      - '*VMware*'
      - '*QEMU*'
    name: es_process_events
  condition: selection
tags:
  - attack.t1059.002
references:
  - https://osquery.readthedocs.io/en/stable/deployment/process-auditing/
  - https://www.virustotal.com/gui/search/behaviour_processes%253A%2522osascript%2520-e%2520set%2522%2520AND%2520behaviour_processes%253A%2522system_profiler%2522%2520AND%2520(behaviour_processes%253A%2522VMware%2522%2520OR%2520behaviour_processes%253A%2522QEMU%2522)?type=files
custom_attributes:
  original_rule_id: 4e41ad21-9761-426d-8aa1-083712ff9f30
  source_format: splunk_spl