title: Malicious InProcServer32 Modification
id: 29b42d05-ad25-5325-9f77-27283c3fba47
status: stable
level: high
description: |
  The following analytic detects a process modifying the registry with a known malicious CLSID under InProcServer32. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on registry modifications within the HKLM or HKCU Software Classes CLSID paths. This activity is significant as it may indicate an attempt to load a malicious DLL, potentially leading to code execution. If confirmed malicious, this could allow an attacker to persist in the environment, execute arbitrary co
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    registry_path: '*\\CLSID\\{89565275-A714-4a43-912E-978B935EDCCC}\\InProcServer32\\(Default)'
  condition: selection
tags:
  - attack.t1218.010
  - attack.t1112
references:
  - https://bohops.com/2018/06/28/abusing-com-registry-structure-clsid-localserver32-inprocserver32/
  - https://tria.ge/210929-ap75vsddan
  - https://www.virustotal.com/gui/file/cb77b93150cb0f7fe65ce8a7e2a5781e727419451355a7736db84109fa215a89
custom_attributes:
  original_rule_id: 127c8d08-25ff-11ec-9223-acde48001122
  source_format: splunk_spl