title: Malicious Powershell Executed As A Service
id: c5b4c827-ad07-5dbd-ae7e-129f713cc52c
status: stable
level: high
description: |
  The following analytic identifies the execution of malicious PowerShell commands or payloads via the Windows SC.exe utility. It detects this activity by analyzing Windows System logs (EventCode 7045) and filtering for specific PowerShell-related patterns in the ImagePath field. This behavior is significant because it indicates potential abuse of the Windows Service Control Manager to run unauthorized or harmful scripts, which could lead to system compromise. If confirmed malicious, this activity
author: Ryan Becwar
logsource:
  product: windows
detection:
  selection:
    l_imagepath:
      - powershell[.\s]|powershell_ise[.\s]|pwsh[.\s]|psexec[.\s]
      - '-nop[rofile\s]+|-w[indowstyle]*\s+hid[den]*|-noe[xit\s]+|-enc[odedcommand\s]+'
    eventcode: 7045
  condition: selection
tags:
  - attack.t1569.002
references:
  - https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/dosfuscation-report.pdf
  - http://az4n6.blogspot.com/2017/
  - https://www.danielbohannon.com/blog-1/2017/3/12/powershell-execution-argument-obfuscation-how-it-can-make-detection-easier
custom_attributes:
  original_rule_id: 8e204dfd-cae0-4ea8-a61d-e972a1ff2ff8
  source_format: splunk_spl