title: Malicious PowerShell Process - Execution Policy Bypass
id: 1af65e03-735d-5e27-8e7e-501f3209630c
status: stable
level: medium
description: |
  The following analytic detects PowerShell processes initiated with parameters that bypass the local execution policy for scripts. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions containing specific flags like "-ex" or "bypass." This activity is significant because bypassing execution policies is a common tactic used by attackers to run malicious scripts undetected. If confirmed malicious, this could allow an attacker to execute arbitrary c
author: Rico Valdez, Mauricio Velazco, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    process:
      - '* -ex*'
      - '* bypass *'
  condition: selection
tags:
  - attack.t1059.001
references:
  - https://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/
custom_attributes:
  original_rule_id: 9be56c82-b1cc-4318-87eb-d138afaaca39
  source_format: splunk_spl