title: Microsoft Intune Manual Device Management
id: b97d43c0-5e99-59a2-9841-6422b29c2bab
status: stable
level: low
description: |
  Microsoft Intune device management configuration policies, scripts & apps are a all tools administrators can use to remotely manage intune managed devices. Instead of waiting for the devices to poll for changes to polciies, the policies can be manually pushed to expidite delivery.  This may be useful in a pinch, it may also be a sign of an impatient attacker trying to speed up the delivery of their payload.  This detection identifies when a device management configuration policy sync events, on-
author: Dean Luxton
logsource:
  product: splunk
detection:
  selection:
    operationname: '*ManagedDevice*'
    field: operationName
  condition: selection
tags:
  - attack.t1021.007
  - attack.t1072
  - attack.t1529
references:
  - https://posts.specterops.io/death-from-above-lateral-movement-from-azure-to-on-prem-ad-d18cb3959d4d
  - https://securityintelligence.com/x-force/detecting-intune-lateral-movement/
  - https://posts.specterops.io/maestro-9ed71d38d546
custom_attributes:
  original_rule_id: 5ca7ebee-4ee7-4cf2-b3be-0ea26a00d822
  source_format: splunk_spl