title: Microsoft Defender Incident Alerts
id: b8da8dfa-1943-5f25-9555-8ecf24f9e7e9
status: stable
level: high
description: |
  The following analytic is to leverage alerts from Microsoft Defender O365 Incidents. This query aggregates and summarizes all alerts from Microsoft Defender O365 Incidents, providing details such as the destination, file name, severity, process command line, ip address, registry key, signature, description, unique id, and timestamps. This detection is not intended to detect new activity from raw data, but leverages Microsoft provided alerts to be correlated with other data as part of risk based 
author: Bryan Pluta, Bhavin Patel, Splunk, lyonheart14, Github Community
logsource:
  product: windows
detection:
  selection:
    severity:
      - informational
      - low
      - medium
      - high
  condition: selection
references:
  - https://learn.microsoft.com/en-us/defender-xdr/api-list-incidents?view=o365-worldwide
  - https://learn.microsoft.com/en-us/graph/api/resources/security-alert?view=graph-rest-1.0
  - https://splunkbase.splunk.com/app/6207
  - https://jasonconger.com/splunk-azure-gdi/
custom_attributes:
  original_rule_id: 13435b55-afd8-46d4-9045-7d5457f430a5
  source_format: splunk_spl