title: Microsoft Defender ATP Alerts
id: 6801154f-497c-5d58-8bcd-7423b0d84d1f
status: stable
level: high
description: |
  The following analytic is to leverage alerts from Microsoft Defender ATP Alerts. This query aggregates and summarizes all alerts from Microsoft Defender ATP Alerts, providing details such as the source, file name, severity, process command line, ip address, registry key, signature, description, unique id, and timestamps. This detection is not intended to detect new activity from raw data, but leverages Microsoft provided alerts to be correlated with other data as part of risk based alerting. The
author: Bryan Pluta, Bhavin Patel, Splunk
logsource:
  product: windows
detection:
  selection:
    severity:
      - informational
      - low
      - medium
      - high
    processcommandline: 'null'
    ipaddress: 'null'
    registrykey: 'null'
    url: 'null'
  condition: selection
references:
  - https://learn.microsoft.com/en-us/defender-xdr/api-list-incidents?view=o365-worldwide
  - https://learn.microsoft.com/en-us/graph/api/resources/security-alert?view=graph-rest-1.0
  - https://splunkbase.splunk.com/app/6207
  - https://jasonconger.com/splunk-azure-gdi/
custom_attributes:
  original_rule_id: 38f034ed-1598-46c8-95e8-14edf05fdf5d
  source_format: splunk_spl