title: Microsoft SharePoint Server Elevation of Privilege
id: 0c467add-75d1-57ed-9a68-077dea548cf5
status: stable
level: high
description: |
  The following analytic detects potential exploitation attempts against Microsoft SharePoint Server vulnerability CVE-2023-29357. It leverages the Web datamodel to monitor for specific API calls and HTTP methods indicative of privilege escalation attempts. This activity is significant as it may indicate an attacker is trying to gain unauthorized privileged access to the SharePoint environment. If confirmed malicious, the impact could include unauthorized access to sensitive data, potential data t
author: Michael Haag, Gowthamaraj Rajendran, Splunk
logsource:
  product: splunk
detection:
  selection:
    datamodel: Web
    status: 200
    http_method: GET
    url:
      - /_api/web/siteusers*
      - /_api/web/currentuser*
  condition: selection
tags:
  - attack.t1068
references:
  - https://socradar.io/microsoft-sharepoint-server-elevation-of-privilege-vulnerability-exploit-cve-2023-29357/
  - https://github.com/LuemmelSec/CVE-2023-29357/blob/main/CVE-2023-29357/Program.cs
custom_attributes:
  original_rule_id: fcf4bd3f-a79f-4b7a-83bf-2692d60b859d
  source_format: splunk_spl