title: Microsoft Intune Mobile Apps
id: 4d3ac6f5-4bb3-5e87-a866-8409efc3394b
status: experimental
level: low
description: |
  Microsoft Intune supports deploying packaged applications to support software deployment, this functionality can also be abused for deploying malicious payloads to intune managed devices.  This detection identifies when a new packaged application has been added, updated or deleted.
author: Dean Luxton
logsource:
  product: splunk
detection:
  selection:
    operationname: '*MobileApp*'
    field: operationName
  condition: selection
tags:
  - attack.t1072
  - attack.t1021.007
  - attack.t1202
  - attack.t1105
references:
  - https://posts.specterops.io/death-from-above-lateral-movement-from-azure-to-on-prem-ad-d18cb3959d4d
  - https://securityintelligence.com/x-force/detecting-intune-lateral-movement/
  - https://posts.specterops.io/maestro-9ed71d38d546
custom_attributes:
  original_rule_id: 98e6b389-2806-4426-a580-8a92cb0d9710
  source_format: splunk_spl