title: Mmc LOLBAS Execution Process Spawn
id: d7e84b9c-bd8c-531f-b9fd-bb66ffcc3cb7
status: stable
level: high
description: |
  The following analytic identifies `mmc.exe` spawning a LOLBAS execution process. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process creation events where `mmc.exe` is the parent process. This activity is significant because adversaries can abuse the DCOM protocol and MMC20 COM object to execute malicious code, using Windows native binaries documented by the LOLBAS project. If confirmed malicious, this behavior could indicate lateral movement, allowing attack
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    process_name:
      - Regsvcs.exe
      - Ftp.exe
      - OfflineScannerShell.exe
      - Rasautou.exe
      - Schtasks.exe
      - Xwizard.exe
      - Dllhost.exe
      - Pnputil.exe
      - Atbroker.exe
      - Pcwrun.exe
      - Ttdinject.exe
      - Mshta.exe
      - Bitsadmin.exe
      - Certoc.exe
      - Ieexec.exe
      - Microsoft.Workflow.Compiler.exe
      - Runscripthelper.exe
      - Forfiles.exe
      - Msbuild.exe
      - Register-cimprovider.exe
      - Tttracer.exe
      - Ie4uinit.exe
      - Bash.exe
      - Hh.exe
      - SettingSyncHost.exe
      - Cmstp.exe
      - Mmc.exe
      - Stordiag.exe
      - Scriptrunner.exe
      - Odbcconf.exe
      - Extexport.exe
      - Msdt.exe
      - WorkFolders.exe
      - Diskshadow.exe
      - Mavinject.exe
      - Regasm.exe
      - Gpscript.exe
      - Rundll32.exe
      - Regsvr32.exe
      - Msiexec.exe
      - Wuauclt.exe
      - Presentationhost.exe
      - Wmic.exe
      - Runonce.exe
      - Syncappvpublishingserver.exe
      - Verclsid.exe
      - Infdefaultinstall.exe
      - Explorer.exe
      - Installutil.exe
      - Netsh.exe
      - Wab.exe
      - Dnscmd.exe
      - At.exe
      - Pcalua.exe
      - Msconfig.exe
  condition: selection
tags:
  - attack.t1021.003
  - attack.t1218.014
references:
  - https://attack.mitre.org/techniques/T1021/003/
  - https://www.cybereason.com/blog/dcom-lateral-movement-techniques
  - https://lolbas-project.github.io/
custom_attributes:
  original_rule_id: f6601940-4c74-11ec-b9b7-3e22fbd008af
  source_format: splunk_spl