title: Modify ACL permission To Files Or Folder
id: 8ced5eb5-f76a-5dcf-a01c-7be7c4146914
status: stable
level: medium
description: |
  The following analytic detects the modification of ACL permissions to files or folders, making them accessible to everyone or to system account. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on processes like "cacls.exe," "icacls.exe," and "xcacls.exe" with specific command-line arguments. This activity is significant as it may indicate an adversary attempting to evade ACLs or access protected files. If confirmed malicious, this could allow unauthorized access to 
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
  category: file_event
detection:
  selection:
    process_name:
      - icacls.exe
      - cacls.exe
      - xcacls.exe
    process:
      - '* Everyone:*'
      - '* SYSTEM:*'
      - '* S-1-1-0:*'
  condition: selection
tags:
  - attack.t1222
references:
  - https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
custom_attributes:
  original_rule_id: 7e8458cc-acca-11eb-9e3f-acde48001122
  source_format: splunk_spl