title: Monitor Registry Keys for Print Monitors
id: fafca6ee-d38a-5380-832f-fb6c82ad049b
status: stable
level: high
description: |
  The following analytic detects modifications to the registry key `HKLM\SYSTEM\CurrentControlSet\Control\Print\Monitors`. It leverages data from the Endpoint.Registry data model, focusing on events where the registry path is modified. This activity is significant because attackers can exploit this registry key to load arbitrary .dll files, which will execute with elevated SYSTEM permissions and persist after a reboot. If confirmed malicious, this could allow attackers to maintain persistence, exe
author: Teoderick Contreras, Splunk, Steven Dick, Bhavin Patel
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*CurrentControlSet\\Control\\Print\\Monitors*'
    action: modified
  condition: selection
tags:
  - attack.t1547.010
custom_attributes:
  original_rule_id: f5f6af30-7ba7-4295-bfe9-07de87c01bbc
  source_format: splunk_spl