title: Monitor Email For Brand Abuse
id: 6dcc82d7-f29b-544c-9d4c-686e79c7b6d5
status: experimental
level: high
description: |
  The following analytic identifies emails claiming to be sent from a domain similar to one you are monitoring for potential abuse. It leverages email header data, specifically the sender's address, and cross-references it with a lookup table of known domain permutations generated by the "ESCU - DNSTwist Domain Names" search. This activity is significant as it can indicate phishing attempts or brand impersonation, which are common tactics used in social engineering attacks. If confirmed malicious,
author: David Dorsey, Splunk
logsource:
  product: splunk
detection:
  selection:
    datamodel: Email
    update: 'true'
    domain_abuse: 'true'
  condition: selection
custom_attributes:
  original_rule_id: b2ea1f38-3a3e-4b8a-9cf1-82760d86a6b8
  source_format: splunk_spl