title: Monitor Web Traffic For Brand Abuse
id: 2a126c5b-997b-56fc-b23d-a57166b7e944
status: experimental
level: high
description: |
  The following analytic identifies web requests to domains that closely resemble your monitored brand's domain, indicating potential brand abuse. It leverages data from web traffic sources, such as web proxies or network traffic analysis tools, and cross-references these with known domain permutations generated by the "ESCU - DNSTwist Domain Names" search. This activity is significant as it can indicate phishing attempts or other malicious activities targeting your brand. If confirmed malicious, 
author: David Dorsey, Splunk
logsource:
  product: splunk
detection:
  selection:
    datamodel: Web
    update: 'true'
    domain_abuse: 'true'
  condition: selection
custom_attributes:
  original_rule_id: 134da869-e264-4a8f-8d7e-fcd0ec88f301
  source_format: splunk_spl