title: MSI Module Loaded by Non-System Binary
id: 68fdc34a-903a-55ff-a020-6bc2f36209db
status: stable
level: low
description: |
  The following analytic detects the loading of `msi.dll` by a binary not located in `system32`, `syswow64`, `winsxs`, or `windows` directories. This is identified using Sysmon EventCode 7, which logs DLL loads, and filters out legitimate system paths. This activity is significant as it may indicate exploitation of CVE-2021-41379 or DLL side-loading attacks, both of which can lead to unauthorized system modifications. If confirmed malicious, this could allow an attacker to execute arbitrary code, 
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    imageloaded: '*\\msi.dll'
    eventcode: 7
    image:
      - '*\\System32\\*'
      - '*\\syswow64\\*'
      - '*\\windows\\*'
      - '*\\winsxs\\*'
  condition: selection
tags:
  - attack.t1574.001
references:
  - https://attackerkb.com/topics/7LstI2clmF/cve-2021-41379/rapid7-analysis
  - https://github.com/AlexandrVIvanov/InstallerFileTakeOver
  - https://github.com/mandiant/red_team_tool_countermeasures/blob/master/rules/PGF/supplemental/hxioc/msi.dll%20Hijack%20(Methodology).ioc
custom_attributes:
  original_rule_id: ccb98a66-5851-11ec-b91c-acde48001122
  source_format: splunk_spl