title: NLTest Domain Trust Discovery
id: 2d14da1c-2118-530b-9f68-3d358f08f212
status: stable
level: high
description: |
  The following analytic identifies the execution of `nltest.exe` with command-line arguments `/domain_trusts` or `/all_trusts` to query Domain Trust information. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs and command-line arguments. This activity is significant as it indicates potential reconnaissance efforts by adversaries to understand domain trust relationships, which can inform their lateral movement strategies. If confirmed malicio
author: Michael Haag, Splunk
logsource:
  product: splunk
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1482
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1482/T1482.md
  - https://malware.news/t/lets-learn-trickbot-implements-network-collector-module-leveraging-cmd-wmi-ldap/19104
  - https://attack.mitre.org/techniques/T1482/
  - https://owasp.org/www-pdf-archive/Red_Team_Operating_in_a_Modern_Environment.pdf
  - https://ss64.com/nt/nltest.html
custom_attributes:
  original_rule_id: c3e05466-5f22-11eb-ae93-0242ac130002
  source_format: splunk_spl