title: Non Chrome Process Accessing Chrome Default Dir
id: ddecf0ff-6a9c-5af2-a88b-dfcc84754ec6
status: stable
level: medium
description: |
  The following analytic detects a non-Chrome process accessing files in the Chrome user default folder. It leverages Windows Security Event logs, specifically event code 4663, to identify unauthorized access attempts. This activity is significant because the Chrome default folder contains sensitive user data such as login credentials, browsing history, and cookies. If confirmed malicious, this behavior could indicate an attempt to exfiltrate sensitive information, often associated with RATs, troj
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    objectname: '*\\Google\\Chrome\\User Data\\Default*'
    eventcode: 4663
    processname:
      - '*\\chrome.exe'
      - '*\\explorer.exe'
      - '*sql*'
      - '*\\dllhost.exe'
  condition: selection
tags:
  - attack.t1555.003
custom_attributes:
  original_rule_id: 81263de4-160a-11ec-944f-acde48001122
  source_format: splunk_spl