title: O365 Service Principal New Client Credentials
id: 58f4649a-6cc5-56f3-a254-92fdc05db106
status: stable
level: high
description: |
  The following analytic detects the addition of new credentials for Service Principals within an Office 365 tenant. It uses O365 audit logs, focusing on events related to credential modifications or additions in the AzureActiveDirectory workload. This activity is significant because Service Principals represent application identities, and their credentials allow applications to authenticate and access resources. If an attacker successfully adds or modifies these credentials, they can impersonate 
author: Mauricio Velazco, Splunk
logsource:
  product: azure
  category: authentication
detection:
  selection:
    operation: Update application*Certificates and secrets management 
    workload: AzureActiveDirectory
  condition: selection
tags:
  - attack.t1098.001
references:
  - https://attack.mitre.org/techniques/T1098/001/
  - https://www.mandiant.com/resources/blog/remediation-and-hardening-strategies-for-microsoft-365-to-defend-against-unc2452
  - https://microsoft.github.io/Azure-Threat-Research-Matrix/Persistence/AZT501/AZT501-2/
  - https://github.com/swisskyrepo/PayloadsAllTheThings/blob/master/Methodology%20and%20Resources/Cloud%20-%20Azure%20Pentest.md#add-credentials-to-all-enterprise-applications
custom_attributes:
  original_rule_id: a1b229e9-d962-4222-8c62-905a8a010453
  source_format: splunk_spl