title: O365 Email Transport Rule Changed
id: a7282196-4999-51f9-b8c2-534054e003c2
status: stable
level: medium
description: |
  The following analytic identifies when a user with sufficient access to Exchange Online alters the mail flow/transport rule configuration of the organization. Transport rules are a set of rules that can be used by attackers to modify or delete emails based on specific conditions, this activity could indicate an attacker hiding or exfiltrated data.
author: Steven Dick
logsource:
  product: splunk
detection:
  selection:
    operation:
      - Set-*
      - Disable-*
      - New-*
      - Remove-*
    workload: Exchange
  condition: selection
tags:
  - attack.t1114.003
  - attack.t1564.008
references:
  - https://attack.mitre.org/techniques/T1114/003/
  - https://cardinalops.com/blog/cardinalops-contributes-new-mitre-attck-techniques-related-to-abuse-of-mail-transport-rules/
  - https://www.microsoft.com/en-us/security/blog/2022/09/22/malicious-OAuth-applications-used-to-compromise-email-servers-and-spread-spam/
custom_attributes:
  original_rule_id: 11ebb7c2-46bd-41c9-81e1-d0b4b34583a2
  source_format: splunk_spl