title: O365 Email Password and Payroll Compromise Behavior
id: a34a985c-9ea8-59b8-b207-708b23121361
status: stable
level: high
description: |
  The following analytic identifies when an O365 email recipient receives and then deletes emails for the combination of both password and banking/payroll changes within a short period. This behavior may indicate a compromised account where the threat actor is attempting to redirect the victims payroll to an attacker controlled bank account.
author: Steven Dick
logsource:
  product: splunk
  category: authentication
detection:
  selection:
    mailtime: _time
    span:
      - 4hr
      - 4hr
    max: 0
    workload: Exchange
    output: AffectedItemSplit
    input: AffectedItemSplit
    deltime: _time
    subject:
      - '*password *'
      - '*passcode *'
      - '*OTP *'
      - '*MFA *'
      - '*Account Recovery*'
    operation:
      - SoftDelete
      - HardDelete
  condition: selection
tags:
  - attack.t1070.008
  - attack.t1485
  - attack.t1114.001
references:
  - https://attack.mitre.org/techniques/T1114/
  - https://www.hhs.gov/sites/default/files/help-desk-social-engineering-sector-alert-tlpclear.pdf
  - https://intelligence.abnormalsecurity.com/attack-library/threat-actor-convincingly-impersonates-employee-requesting-direct-deposit-update-in-likely-ai-generated-attack
custom_attributes:
  original_rule_id: e36de71a-6bdc-4002-98ff-e3e51b0d8f96
  source_format: splunk_spl