title: O365 Add App Role Assignment Grant User
id: a107b157-5a21-5657-951b-ef349869d47c
status: stable
level: high
description: |
  The following analytic detects the addition of an application role assignment grant to a user in Office 365. It leverages data from the `o365_management_activity` dataset, specifically monitoring the "Add app role assignment grant to user" operation. This activity is significant as it can indicate unauthorized privilege escalation or the assignment of sensitive roles to users. If confirmed malicious, this could allow an attacker to gain elevated permissions, potentially leading to unauthorized a
author: Rod Soto, Splunk
logsource:
  product: splunk
detection:
  selection:
    operation: Add app role assignment grant to user.
    workload: AzureActiveDirectory
  condition: selection
tags:
  - attack.t1136.003
references:
  - https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/wp-m-unc2452-2021-000343-01.pdf
  - https://www.cisa.gov/uscert/ncas/alerts/aa21-008a
custom_attributes:
  original_rule_id: b2c81cc6-6040-11eb-ae93-0242ac130002
  source_format: splunk_spl