title: O365 Mailbox Inbox Folder Shared with All Users
id: 022ef721-9259-5e67-bfdc-0011e0aa89b7
status: stable
level: high
description: |
  The following analytic detects instances where the inbox folder of an Office 365 mailbox is shared with all users within the tenant. It leverages Office 365 management activity events to identify when the 'Inbox' folder permissions are modified to include 'Everyone' with read rights. This activity is significant as it represents a potential security risk, allowing unauthorized access to sensitive emails. If confirmed malicious, this could lead to data breaches, exfiltration of confidential infor
author: Mauricio Velazco, Splunk
logsource:
  product: splunk
detection:
  selection:
    isreadrole: 'true'
    operation: ModifyFolderPermissions
    workload: Exchange
    object: Inbox
    memberupn: Everyone
  condition: selection
tags:
  - attack.t1114.002
references:
  - https://attack.mitre.org/techniques/T1114/002/
  - https://www.mandiant.com/sites/default/files/2022-08/remediation-hardening-strategies-for-m365-defend-against-apt29-white-paper.pdf
  - https://www.blackhillsinfosec.com/abusing-exchange-mailbox-permissions-mailsniper/
  - https://learn.microsoft.com/en-us/purview/audit-mailboxes
  - https://learn.microsoft.com/en-us/openspecs/exchange_server_protocols/ms-oxodlgt/5610c6e6-3268-44e3-adff-8804f5315946
custom_attributes:
  original_rule_id: 21421896-a692-4594-9888-5faeb8a53106
  source_format: splunk_spl