title: O365 Threat Intelligence Suspicious File Detected
id: 0724c579-1847-5fd5-9cc0-d4a5b8d7abef
status: stable
level: high
description: |
  The following analytic identifies when a malicious file is detected within the Microsoft Office 365 ecosystem through the Advanced Threat Protection engine. Attackers may stage and execute malicious files from within the Microsoft Office 365 ecosystem. Any detections from built-in Office 365 capabilities should be monitored and responded to appropriately. Certain premium Office 365 capabilities such as Safe Attachment and Safe Links further enhance these detection and response functions.
author: Steven Dick
logsource:
  product: splunk
  category: file_event
detection:
  selection:
    dest: NA
    src: NA
    workload: ThreatIntelligence
    operation: AtpDetection
  condition: selection
tags:
  - attack.t1204.002
references:
  - https://learn.microsoft.com/en-us/microsoft-365/security/office-365-security/threat-explorer-real-time-detections-about?view=o365-worldwide
  - https://learn.microsoft.com/en-us/microsoft-365/security/office-365-security/anti-malware-protection-for-spo-odfb-teams-about?view=o365-worldwide
custom_attributes:
  original_rule_id: 00958c7b-35db-4e7a-ad13-31550a7a7c64
  source_format: splunk_spl