title: O365 Email New Inbox Rule Created
id: b06b1f0d-8cd9-558f-9a3e-28559c4b4a54
status: stable
level: medium
description: |
  The following analytic identifies the creation of new email inbox rules in an Office 365 environment. It detects events logged under New-InboxRule and Set-InboxRule operations within the o365_management_activity data source, focusing on parameters that may indicate mail forwarding, removal, or obfuscation. Inbox rule creation is a typical end-user activity however attackers also leverage this technique for multiple reasons.
author: Steven Dick
logsource:
  product: splunk
  category: file_event
detection:
  selection:
    action: Parameters{}.Name
    workload: Exchange
    name:
      - SoftDeleteMessage
      - DeleteMessage
      - ForwardTo
      - ForwardAsAttachmentTo
      - RedirectTo
      - MoveToFolder
      - CopyToFolder
  condition: selection
tags:
  - attack.t1114.003
  - attack.t1564.008
references:
  - https://attack.mitre.org/techniques/T1114/
  - https://www.hhs.gov/sites/default/files/help-desk-social-engineering-sector-alert-tlpclear.pdf
  - https://intelligence.abnormalsecurity.com/attack-library/threat-actor-convincingly-impersonates-employee-requesting-direct-deposit-update-in-likely-ai-generated-attack
custom_attributes:
  original_rule_id: 449f525a-7b42-47be-96a7-d9724e336c19
  source_format: splunk_spl