title: O365 High Privilege Role Granted
id: 8c8409a7-16f2-5bb5-8333-90115e7434db
status: stable
level: high
description: |
  The following analytic detects when high-privilege roles such as "Exchange Administrator," "SharePoint Administrator," or "Global Administrator" are granted within Office 365. It leverages O365 audit logs to identify events where these roles are assigned to any user or service account. This activity is significant for SOCs as these roles provide extensive permissions, allowing broad access and control over critical resources and data. If confirmed malicious, this could enable attackers to gain s
author: Mauricio Velazco, Splunk
logsource:
  product: splunk
detection:
  selection:
    operation: Add member to role.
    workload: AzureActiveDirectory
    role_id:
      - 29232cdf-9323-42fd-ade2-1d097af3e4de
      - f28a1f50-f6e7-4571-818b-6a12f2af6b6c
      - 62e90394-69f5-4237-9190-012177145e10
  condition: selection
tags:
  - attack.t1098.003
references:
  - https://attack.mitre.org/techniques/T1098/003/
  - https://learn.microsoft.com/en-us/azure/active-directory/roles/permissions-reference
  - https://learn.microsoft.com/en-us/microsoft-365/admin/add-users/about-exchange-online-admin-role?view=o365-worldwide
  - https://learn.microsoft.com/en-us/sharepoint/sharepoint-admin-role
custom_attributes:
  original_rule_id: e78a1037-4548-4072-bb1b-ad99ae416426
  source_format: splunk_spl