title: O365 Excessive Authentication Failures Alert
id: b65b5e7a-ce2d-51bc-bced-b58abcfb1741
status: stable
level: medium
description: |
  The following analytic identifies an excessive number of authentication failures, including failed attempts against MFA prompt codes. It uses data from the `o365_management_activity` dataset, focusing on events where the authentication status is marked as failure. This behavior is significant as it may indicate a brute force attack or an attempt to compromise user accounts. If confirmed malicious, this activity could lead to unauthorized access, data breaches, or further exploitation within the 
author: Rod Soto, Splunk
logsource:
  product: splunk
  category: authentication
detection:
  selection:
    workload: AzureActiveDirectory
    status: failure
  condition: selection
tags:
  - attack.t1110
references:
  - https://attack.mitre.org/techniques/T1110/
custom_attributes:
  original_rule_id: d441364c-349c-453b-b55f-12eccab67cf9
  source_format: splunk_spl