title: O365 Exfiltration via File Sync Download
id: 3c40b744-57fb-547d-ada9-ef8d75ad1423
status: stable
level: medium
description: |
  The following analytic detects when an excessive number of files are sync from o365 by the same user over a short period of time. A malicious actor abuse the user-agent string through GUI or API access to evade triggering the FileDownloaded event. This behavior may indicate an attacker staging data for exfiltration or an insider threat removing organizational data. Additional attention should be taken with any Azure Guest (#EXT#) accounts.
author: Steven Dick
logsource:
  product: azure
  category: file_event
detection:
  selection:
    useragent: '*SkyDriveSync*'
    operation:
      - filesyncdownload*
  condition: selection
tags:
  - attack.t1567
  - attack.t1530
references:
  - https://attack.mitre.org/techniques/T1567/exfil
  - https://www.varonis.com/blog/sidestepping-detection-while-exfiltrating-sharepoint-data
  - https://thedfirjournal.com/posts/m365-data-exfiltration-rclone/
custom_attributes:
  original_rule_id: 350837b5-13d3-4c06-b688-db07afbe5050
  source_format: splunk_spl