title: O365 Compliance Content Search Started
id: 414f9ad0-4007-5557-91c2-53bc756fd781
status: stable
level: high
description: |
  The following analytic detects when a content search is initiated within the Office 365 Security and Compliance Center. It leverages the SearchCreated operation from the o365_management_activity logs under the SecurityComplianceCenter workload. This activity is significant as it may indicate an attempt to access sensitive organizational data, including emails and documents. If confirmed malicious, this could lead to unauthorized data access, potential data exfiltration, and compliance violations
author: Mauricio Velazco, Splunk
logsource:
  product: splunk
detection:
  selection:
    workload: SecurityComplianceCenter
    operation: SearchCreated
  condition: selection
tags:
  - attack.t1114.002
references:
  - https://attack.mitre.org/techniques/T1114/002/
  - https://learn.microsoft.com/en-us/purview/ediscovery-content-search-overview
  - https://learn.microsoft.com/en-us/purview/ediscovery-keyword-queries-and-search-conditions
  - https://learn.microsoft.com/en-us/purview/ediscovery-search-for-activities-in-the-audit-log
custom_attributes:
  original_rule_id: f4cabbc7-c19a-4e41-8be5-98daeaccbb50
  source_format: splunk_spl