title: O365 New MFA Method Registered
id: bb607edc-95f8-50e7-8398-6e58c2ef02b6
status: stable
level: high
description: |
  The following analytic detects the registration of a new Multi-Factor Authentication (MFA) method for a user account within Office 365. It leverages O365 audit logs to identify changes in MFA configurations. This activity is significant as it may indicate an attacker's attempt to maintain persistence on a compromised account. If confirmed malicious, the attacker could bypass existing security measures, solidify their access, and potentially escalate privileges or access sensitive data. Immediate
author: Mauricio Velazco, Splunk
logsource:
  product: splunk
detection:
  selection:
    operation: Update user.
    workload: AzureActiveDirectory
    propertyname: StrongAuthenticationMethod
    field:
      - newvalue
      - oldvalue
    max_match:
      - 0
      - 0
  condition: selection
tags:
  - attack.t1098.005
references:
  - https://attack.mitre.org/techniques/T1098/005/
  - https://www.microsoft.com/en-us/security/blog/2023/06/08/detecting-and-mitigating-a-multi-stage-aitm-phishing-and-bec-campaign/
  - https://www.csoonline.com/article/573451/sophisticated-bec-scammers-bypass-microsoft-365-multi-factor-authentication.html
custom_attributes:
  original_rule_id: 4e12db1f-f7c7-486d-8152-a221cad6ac2b
  source_format: splunk_spl