title: O365 Safe Links Detection
id: f85c79b5-4c93-5acc-b4cc-08812e6a592e
status: stable
level: high
description: |
  The following analytic detects when any Microsoft Safe Links alerting is triggered. This behavior may indicate when user has interacted with a phishing or otherwise malicious link within the Microsoft Office ecosystem.
author: Steven Dick
logsource:
  product: splunk
detection:
  selection:
    name: '*a potentially malicious URL*'
    operation: AlertEntityGenerated
  condition: selection
tags:
  - attack.t1566.001
references:
  - https://learn.microsoft.com/en-us/microsoft-365/security/office-365-security/safe-links-about?view=o365-worldwide
  - https://attack.mitre.org/techniques/T1566/
custom_attributes:
  original_rule_id: 711d9e8c-2cb0-45cf-8813-5f191ecb9b26
  source_format: splunk_spl