title: O365 Advanced Audit Disabled
id: d62dd54a-474b-59e1-8508-0d1a956bac80
status: stable
level: high
description: |
  The following analytic detects instances where the O365 advanced audit is disabled for a specific user within the Office 365 tenant. It uses O365 audit logs, focusing on events related to audit license changes in AzureActiveDirectory workloads. This activity is significant because the O365 advanced audit provides critical logging and insights into user and administrator activities. Disabling it can blind security teams to potential malicious actions. If confirmed malicious, attackers could opera
author: Mauricio Velazco, Michael Haag, Splunk
logsource:
  product: azure
detection:
  selection:
    operation: Change user license.
    property_name:
      - extendedAuditEventCategory
      - mvindex
    field: possible_plan
    disabledplans:
      - '*M365_ADVANCED_AUDITING*'
  condition: selection
tags:
  - attack.t1562.008
references:
  - https://attack.mitre.org/techniques/T1562/008/
  - https://www.mandiant.com/sites/default/files/2022-08/remediation-hardening-strategies-for-m365-defend-against-apt29-white-paper.pdf
  - https://www.csoonline.com/article/570381/microsoft-365-advanced-audit-what-you-need-to-know.html
custom_attributes:
  original_rule_id: 49862dd4-9cb2-4c48-a542-8c8a588d9361
  source_format: splunk_spl