title: O365 Cross-Tenant Access Change
id: 29bd369c-e761-573c-8899-9c69f54c0002
status: stable
level: high
description: |
  The following analytic identifies when cross-tenant access/synchronization policies are changed in an Azure tenant. Adversaries have been observed altering victim cross-tenant policies as a method of lateral movement or maintaining persistent access to compromised environments. These policies should be considered sensitive and monitored for changes and/or loose configuration.
author: Steven Dick
logsource:
  product: azure
detection:
  selection:
    workload: AzureActiveDirectory
    operation:
      - Add a partner to cross-tenant access setting.
      - Delete partner specific cross-tenant access setting.
  condition: selection
tags:
  - attack.t1484.002
references:
  - https://attack.mitre.org/techniques/T1484/002/
  - https://thehackernews.com/2023/08/emerging-attacker-exploit-microsoft.html
  - https://cyberaffairs.com/news/emerging-attacker-exploit-microsoft-cross-tenant-synchronization/
  - https://www.crowdstrike.com/blog/crowdstrike-defends-against-azure-cross-tenant-synchronization-attacks/
custom_attributes:
  original_rule_id: 7c0fa490-12b0-4d0b-b9f5-e101d1e0e06f
  source_format: splunk_spl