title: O365 OAuth App Mailbox Access via EWS
id: 9037f0f5-abee-5d4d-b1bf-3c6a1de79d77
status: stable
level: high
description: |
  The following analytic detects when emails are accessed in Office 365 Exchange via Exchange Web Services (EWS) using OAuth-authenticated applications. It leverages the ClientInfoString field to identify EWS interactions and aggregates metrics such as access counts, timing, and client IP addresses, categorized by user, ClientAppId, OperationCount, and AppId. Monitoring OAuth applications accessing emails through EWS is crucial for identifying potential abuse or unauthorized data access. If confir
author: Mauricio Velazco, Splunk
logsource:
  product: splunk
  category: authentication
detection:
  selection:
    clientinfostring: ^Client=WebServices;ExchangeWebServices
    workload: Exchange
    operation: MailItemsAccessed
  condition: selection
tags:
  - attack.t1114.002
references:
  - https://attack.mitre.org/techniques/T1114/002/
  - https://www.microsoft.com/en-us/security/blog/2024/01/25/midnight-blizzard-guidance-for-responders-on-nation-state-attack/
  - https://learn.microsoft.com/en-us/exchange/client-developer/exchange-web-services/ews-applications-and-the-exchange-architecture
custom_attributes:
  original_rule_id: e600cf1a-0bef-4426-b42e-00176d610a4d
  source_format: splunk_spl