title: O365 Email Security Feature Changed
id: 2d6dbef9-85fb-5305-b60a-0e11975b57ea
status: stable
level: high
description: |
  The following analytic identifies when specific O365 advanced security settings are altered within the Office 365 tenant. If an attacker successfully disables O365 security settings, they can operate within the tenant with reduced risk of detection. This can lead to unauthorized data access, data exfiltration, account compromise, or other malicious activities without leaving a detailed audit trail.
author: Steven Dick
logsource:
  product: splunk
detection:
  selection:
    workload: Exchange
    operation:
      - '*AntiPhish*'
      - '*SafeLink*'
      - '*SafeAttachment*'
      - '*Malware*'
  condition: selection
tags:
  - attack.t1562.001
  - attack.t1562.008
references:
  - https://learn.microsoft.com/en-us/entra/fundamentals/security-defaults
  - https://attack.mitre.org/techniques/T1562/008/
custom_attributes:
  original_rule_id: 4d28013d-3a0f-4d65-a33f-4e8009fee0ae
  source_format: splunk_spl