title: O365 Email Suspicious Search Behavior
id: 8adb17ba-4dee-50ec-b1c8-ce15ec377f53
status: stable
level: medium
description: |
  The following analytic identifies when Office 365 users search for suspicious keywords or have an excessive number of queries to a mailbox within a limited timeframe. This behavior may indicate that a malicious actor has gained control of a mailbox and is conducting discovery or enumeration activities.
author: Steven Dick
logsource:
  product: splunk
detection:
  selection:
    operation: SearchQueryInitiatedExchange
    span: 1hr
  filter:
    command: (*)
  condition: selection and not filter
tags:
  - attack.t1114.002
  - attack.t1552
references:
  - https://learn.microsoft.com/en-us/purview/audit-get-started#step-3-enable-searchqueryinitiated-events
  - https://www.cisa.gov/sites/default/files/2025-01/microsoft-expanded-cloud-logs-implementation-playbook-508c.pdf
  - https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-320a
  - https://attack.mitre.org/techniques/T1114/002/
custom_attributes:
  original_rule_id: 3b6e1d36-6916-4eec-a7d5-bc98953ba595
  source_format: splunk_spl