title: O365 Mailbox Folder Read Permission Granted
id: e17d7a6b-e855-5e3f-8c2c-47776f71e605
status: stable
level: high
description: |
  The following analytic identifies instances where read permissions are granted to mailbox folders within an Office 365 environment. It detects this activity by monitoring the `o365_management_activity` data source for the `Set-MailboxFolderPermission` and `Add-MailboxFolderPermission` operations. This behavior is significant as it may indicate unauthorized access or changes to mailbox folder permissions, potentially exposing sensitive email content. If confirmed malicious, an attacker could gain
author: Mauricio Velazco, Splunk
logsource:
  product: splunk
detection:
  selection:
    operation:
      - Set-MailboxFolderPermission
      - Add-MailboxFolderPermission
    isreadrole: 'true'
    workload: Exchange
  condition: selection
tags:
  - attack.t1098.002
references:
  - https://attack.mitre.org/techniques/T1098/002/
  - https://learn.microsoft.com/en-us/powershell/module/exchange/add-mailboxfolderpermission?view=exchange-ps
  - https://learn.microsoft.com/en-us/powershell/module/exchange/set-mailboxfolderpermission?view=exchange-ps
custom_attributes:
  original_rule_id: cd15c0a8-470e-4b12-9517-046e4927db30
  source_format: splunk_spl