title: O365 Exfiltration via File Download
id: 859a5028-136a-5dbf-91ee-ff43be3e77e8
status: stable
level: medium
description: |
  The following analytic detects when an excessive number of files are downloaded from o365 by the same user over a short period of time. O365 may bundle these files together as a ZIP file, however each file will have it's own download event. This behavior may indicate an attacker staging data for exfiltration or an insider threat removing organizational data. Additional attention should be taken with any Azure Guest (#EXT#) accounts.
author: Steven Dick
logsource:
  product: azure
  category: file_event
detection:
  selection:
    operation:
      - filedownloaded
  condition: selection
tags:
  - attack.t1567
  - attack.t1530
references:
  - https://attack.mitre.org/techniques/T1567/exfil
  - https://www.varonis.com/blog/sidestepping-detection-while-exfiltrating-sharepoint-data
  - https://thedfirjournal.com/posts/m365-data-exfiltration-rclone/
custom_attributes:
  original_rule_id: 06b23921-bfe2-4576-89dd-616f06e129da
  source_format: splunk_spl