title: O365 Multi-Source Failed Authentications Spike
id: 6836a961-c8d2-52f6-9e66-4480c1bbf27e
status: stable
level: low
description: |
  The following analytic identifies a spike in failed authentication attempts within an Office 365 environment, indicative of a potential distributed password spraying attack. It leverages UserLoginFailed events from O365 Management Activity logs, focusing on ErrorNumber 50126. This detection is significant as it highlights attempts to bypass security controls using multiple IP addresses and user agents. If confirmed malicious, this activity could lead to unauthorized access, data breaches, privil
author: Mauricio Velazco, Splunk
logsource:
  product: splunk
  category: authentication
detection:
  selection:
    workload: AzureActiveDirectory
    operation: UserLoginFailed
    errornumber: 50126
    span: 5m
    uniqueipusercombo: src_ip
  condition: selection
tags:
  - attack.t1110.003
  - attack.t1110.004
  - attack.t1586.003
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://docs.microsoft.com/en-us/security/compass/incident-response-playbook-password-spray
  - https://www.cisa.gov/uscert/ncas/alerts/aa21-008a
  - https://docs.microsoft.com/azure/active-directory/reports-monitoring/reference-sign-ins-error-codes
custom_attributes:
  original_rule_id: ea4e2c41-dbfb-4f5f-a7b6-9ac1b7f104aa
  source_format: splunk_spl