title: Okta Multiple Failed MFA Requests For User
id: 8707b96c-6bf6-5eef-b2af-99ce25de3492
status: stable
level: medium
description: |
  The following analytic identifies multiple failed multi-factor authentication (MFA) requests for a single user within an Okta tenant. It triggers when more than 10 MFA attempts fail within 5 minutes, using Okta event logs to detect this pattern. This activity is significant as it may indicate an adversary attempting to bypass MFA by bombarding the user with repeated authentication requests, a technique used by threat actors like Lapsus and APT29. If confirmed malicious, this could lead to unauth
author: Mauricio Velazco, Splunk
logsource:
  product: okta
detection:
  selection:
    result: FAILURE
    span: 5m
  condition: selection
tags:
  - attack.t1621
references:
  - https://attack.mitre.org/techniques/T1621/
custom_attributes:
  original_rule_id: 826dbaae-a1e6-4c8c-b384-d16898956e73
  source_format: splunk_spl