title: Okta Successful Single Factor Authentication
id: d85566bd-f35b-5f13-afe3-9f6f168644e2
status: stable
level: medium
description: |
  The following analytic identifies successful single-factor authentication events against the Okta Dashboard for accounts without Multi-Factor Authentication (MFA) enabled. It detects this activity by analyzing Okta logs for successful authentication events where "Okta Verify" is not used. This behavior is significant as it may indicate a misconfiguration, policy violation, or potential account takeover. If confirmed malicious, an attacker could gain unauthorized access to the account, potentiall
author: Bhavin Patel, Splunk
logsource:
  product: okta
  category: authentication
detection:
  selection:
    action: success
    src_user_type: User
  filter:
    targets: Okta Verify
  condition: selection and not filter
tags:
  - attack.t1078.004
  - attack.t1586.003
  - attack.t1621
references:
  - https://sec.okta.com/everythingisyes
  - https://attack.mitre.org/techniques/T1078/004/
custom_attributes:
  original_rule_id: 98f6ad4f-4325-4096-9d69-45dc8e638e82
  source_format: splunk_spl