title: Okta Phishing Detection with FastPass Origin Check
id: 37d14d97-eb9b-5069-a0cd-4fe0e47d7c1f
status: experimental
level: high
description: |
  The following analytic identifies failed user authentication attempts in Okta due to FastPass declining a phishing attempt. It leverages Okta logs, specifically looking for events where multi-factor authentication (MFA) fails with the reason "FastPass declined phishing attempt." This activity is significant as it indicates that attackers are targeting users with real-time phishing proxies, attempting to capture credentials. If confirmed malicious, this could lead to unauthorized access to user a
author: Okta, Inc, Michael Haag, Splunk
logsource:
  product: okta
detection:
  selection:
    eventtype: user.authentication.auth_via_mfa
    result: FAILURE
    reason: FastPass declined phishing attempt
  condition: selection
tags:
  - attack.t1078.001
  - attack.t1556
references:
  - https://sec.okta.com/fastpassphishingdetection
custom_attributes:
  original_rule_id: f4ca0057-cbf3-44f8-82ea-4e330ee901d3
  source_format: splunk_spl