title: Okta New API Token Created
id: 8fa05db7-b6c2-5b8f-8ebb-79230bfad7b5
status: stable
level: high
description: |
  The following analytic detects the creation of a new API token within an Okta tenant. It uses OktaIm2 logs ingested via the Splunk Add-on for Okta Identity Cloud to identify events where the `system.api_token.create` command is executed. This activity is significant because creating a new API token can indicate potential account takeover attempts or unauthorized access, allowing an adversary to maintain persistence. If confirmed malicious, this could enable attackers to execute API calls, access
author: Michael Haag, Mauricio Velazco, Splunk
logsource:
  product: okta
  category: file_event
detection:
  selection:
    datamodel: Change
    action: created
    span: 5m
  condition: selection
tags:
  - attack.t1078.001
references:
  - https://developer.okta.com/docs/reference/api/event-types/?q=security.threat.detected
  - https://splunkbase.splunk.com/app/6553
custom_attributes:
  original_rule_id: c3d22720-35d3-4da4-bd0a-740d37192bd4
  source_format: splunk_spl