title: Okta Non-Standard VPN Usage
id: 7ff5d07e-9c90-59a7-a5e0-c072e129c7f0
status: experimental
level: high
description: |
  Remote Employment Fraud (REF) actors will often use virtual private networks (VPNs) to conceal their true physical location. Threat actors mask their originating IP address and instead appear to be situated in any location where the VPN service has a node.
author: Marissa Bower, Raven Tait
logsource:
  product: okta
detection:
  selection:
    value: N/A
    tunnels:
      - '*Astrill*'
      - '*Azire*'
      - '*CyberGhost*'
      - '*Express*VPN'
      - '*HideMe*'
      - '*IPVanish*'
      - '*Mullvad*'
      - '*Nord*VPN*'
      - '*OVPN*'
      - '*PIA*VPN*'
      - '*Proton*VPN*'
      - '*Pure*VPN*'
      - '*Slick*VPN*'
      - '*Surf*Easy*'
      - '*SurfShark*'
      - '*Star*VPN*'
      - '*TorGuard*'
      - '*TorProxy*'
      - '*Tiger*VPN*'
      - '*TunnelBear*'
      - '*Unblock*VPN*'
      - '*Warp*VPN*'
      - '*WarpSpeed*'
      - '*VPNReactor*'
      - '*VPN*Shield*'
      - '*VPN*Super*VPN*'
      - '*ZenMate*'
  condition: selection
tags:
  - attack.t1078
  - attack.t1572
  - attack.t1090
custom_attributes:
  original_rule_id: 58eb9f80-896c-42f8-86c6-27ab59026c9c
  source_format: splunk_spl