title: Okta Authentication Failed During MFA Challenge
id: 9eda46df-573c-5689-bdc7-7d1eb0432a0f
status: stable
level: high
description: |
  The following analytic identifies failed authentication attempts during the Multi-Factor Authentication (MFA) challenge in an Okta tenant. It uses the Authentication datamodel to detect specific failed events where the authentication signature is `user.authentication.auth_via_mfa`. This activity is significant as it may indicate an adversary attempting to authenticate with compromised credentials on an account with MFA enabled. If confirmed malicious, this could suggest an ongoing attempt to byp
author: Bhavin Patel, Splunk
logsource:
  product: okta
  category: authentication
detection:
  selection:
    datamodel: Authentication
    action: failure
  condition: selection
tags:
  - attack.t1078.004
  - attack.t1586.003
  - attack.t1621
references:
  - https://sec.okta.com/everythingisyes
  - https://splunkbase.splunk.com/app/6553
custom_attributes:
  original_rule_id: e2b99e7d-d956-411a-a120-2b14adfdde93
  source_format: splunk_spl