title: Okta New Device Enrolled on Account
id: 81237685-06ff-5bcd-aaf2-bf6cbd6baffe
status: stable
level: high
description: |
  The following analytic identifies when a new device is enrolled on an Okta account. It uses OktaIm2 logs ingested via the Splunk Add-on for Okta Identity Cloud to detect the creation of new device enrollments. This activity is significant as it may indicate a legitimate user setting up a new device or an adversary adding a device to maintain unauthorized access. If confirmed malicious, this could lead to potential account takeover, unauthorized access, and persistent control over the compromised
author: Michael Haag, Mauricio Velazco, Splunk
logsource:
  product: okta
detection:
  selection:
    datamodel: Change
    action: created
    span: 5m
  condition: selection
tags:
  - attack.t1098.005
references:
  - https://attack.mitre.org/techniques/T1098/005/
  - https://developer.okta.com/docs/reference/api/event-types/?q=device.enrollment.create
custom_attributes:
  original_rule_id: bb27cbce-d4de-432c-932f-2e206e9130fb
  source_format: splunk_spl