title: Okta Multiple Users Failing To Authenticate From Ip
id: f3ab6b39-0932-5e22-b1a4-c04cbf12a08a
status: stable
level: medium
description: |
  The following analytic identifies instances where more than 10 unique user accounts have failed to authenticate from a single IP address within a 5-minute window in an Okta tenant. This detection uses OktaIm2 logs ingested via the Splunk Add-on for Okta Identity Cloud. Such activity is significant as it may indicate brute-force attacks or password spraying attempts. If confirmed malicious, this behavior suggests an external entity is attempting to compromise multiple user accounts, potentially l
author: Michael Haag, Mauricio Velazco, Splunk
logsource:
  product: okta
  category: authentication
detection:
  selection:
    action: failure
    datamodel: Authentication
    span: 5m
  condition: selection
tags:
  - attack.t1110.003
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://splunkbase.splunk.com/app/6553
custom_attributes:
  original_rule_id: de365ffa-42f5-46b5-b43f-fa72290b8218
  source_format: splunk_spl