title: Okta MFA Exhaustion Hunt
id: afed7501-9022-58d3-9f69-ed307e3ad654
status: stable
level: low
description: |
  The following analytic detects patterns of successful and failed Okta MFA push attempts to identify potential MFA exhaustion attacks. It leverages Okta event logs, specifically focusing on push verification events, and uses statistical evaluations to determine suspicious activity. This activity is significant as it may indicate an attacker attempting to bypass MFA by overwhelming the user with push notifications. If confirmed malicious, this could lead to unauthorized access, compromising the se
author: Michael Haag, Marissa Bower, Mauricio Velazco, Splunk
logsource:
  product: okta
detection:
  selection:
    legacyeventtype:
      - core.user.factor.attempt_success
      - core.user.factor.attempt_fail
    eventtype: system.push.send_factor_verify_push
    finding: Normal authentication pattern
  condition: selection
tags:
  - attack.t1110
references:
  - https://developer.okta.com/docs/reference/api/event-types/?q=user.acount.lock
  - https://sec.okta.com/everythingisyes
  - https://splunkbase.splunk.com/app/6553
custom_attributes:
  original_rule_id: 97e2fe57-3740-402c-988a-76b64ce04b8d
  source_format: splunk_spl