title: Okta Multiple Accounts Locked Out
id: ad822177-f9ae-5a28-91a2-33519723e0ae
status: stable
level: medium
description: |
  The following analytic detects multiple Okta accounts being locked out within a short period. It uses the user.account.lock event from Okta logs, aggregated over a 5-minute window, to identify this behavior. This activity is significant as it may indicate a brute force or password spraying attack, where an adversary attempts to guess passwords, leading to account lockouts. If confirmed malicious, this could result in potential account takeovers or unauthorized access to sensitive Okta accounts, 
author: Michael Haag, Mauricio Velazco, Splunk
logsource:
  product: okta
detection:
  selection:
    datamodel: Change
    change_type: AAA
    object_category: User
    action: lockout
    span: 5m
  condition: selection
tags:
  - attack.t1110
references:
  - https://attack.mitre.org/techniques/T1110/
  - https://splunkbase.splunk.com/app/6553
custom_attributes:
  original_rule_id: a511426e-184f-4de6-8711-cfd2af29d1e1
  source_format: splunk_spl