title: Ollama Possible Model Exfiltration Data Leakage
id: 2f751675-c931-5a18-a1f1-15b434bbe5c2
status: experimental
level: medium
description: |
  Detects data leakage and exfiltration attempts targeting Ollama model metadata and configuration endpoints. Adversaries repeatedly query /api/show, /api/tags, and /api/v1/models to systematically extract sensitive model information including architecture details, fine-tuning parameters, system paths, Modelfile configurations, and proprietary customizations. Multiple inspection attempts within a 15-minute window indicate automated exfiltration of valuable intellectual property such as custom mode
author: Rod Soto
logsource:
  product: splunk
detection:
  selection:
    attack_type: Potential Data Exfiltration
    field: _raw
    src: src_ip
    dest: uri_path
    span: 15m
  condition: selection
tags:
  - attack.t1048
references:
  - https://github.com/rosplk/ta-ollama
custom_attributes:
  original_rule_id: c9fd1a54-0eab-4470-8970-d5fcc3c740fb
  source_format: splunk_spl