title: Ollama Possible API Endpoint Scan Reconnaissance
id: bb26e8ab-e273-5fb7-b0f0-96adf7177ea6
status: experimental
level: medium
description: |
  Detects API reconnaissance and endpoint scanning activity against Ollama servers by identifying sources probing multiple API endpoints within short timeframes, particularly when using HEAD requests or accessing diverse endpoint paths, which indicates systematic enumeration to map the API surface, discover hidden endpoints, or identify vulnerabilities before launching targeted attacks.
author: Rod Soto
logsource:
  product: splunk
detection:
  selection:
    severity: medium
    attack_type: API Activity Surge
    span: 5m
  condition: selection
tags:
  - attack.t1595
references:
  - https://github.com/rosplk/ta-ollama
custom_attributes:
  original_rule_id: ad3f352a-0347-48ee-86b9-670b5025a548
  source_format: splunk_spl