title: Ollama Possible RCE via Model Loading
id: 4eacbf93-9c05-59cd-906d-a0cfefdb9e73
status: experimental
level: medium
description: |
  Detects Ollama server errors and failures during model loading operations that may indicate malicious model injection, path traversal attempts, or exploitation of model loading mechanisms to achieve remote code execution. Adversaries may attempt to load specially crafted malicious models or exploit vulnerabilities in the model loading process to execute arbitrary code on the server. This detection monitors error messages and failure patterns that could signal attempts to abuse model loading func
author: Rod Soto
logsource:
  product: splunk
detection:
  selection:
    attack_type: Suspicious Model Loading / Potential RCE
    level: ERROR
    field:
      - _raw
      - _raw
      - _raw
      - _raw
    span: 1h
  condition: selection
tags:
  - attack.t1190
references:
  - https://github.com/rosplk/ta-ollama
custom_attributes:
  original_rule_id: 3f28c930-5208-425d-a7b9-53d349756d91
  source_format: splunk_spl