title: Overwriting Accessibility Binaries
id: 69fbf364-0cdb-54e3-9531-f91dac2a44e8
status: stable
level: high
description: |
  The following analytic detects modifications to Windows accessibility binaries such as sethc.exe, utilman.exe, osk.exe, Magnify.exe, Narrator.exe, DisplaySwitch.exe, and AtBroker.exe. It leverages filesystem activity data from the Endpoint.Filesystem data model to identify changes to these specific files. This activity is significant because adversaries can exploit these binaries to gain unauthorized access or execute commands without logging in. If confirmed malicious, this could allow attacker
author: David Dorsey, Splunk
logsource:
  product: windows
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1546.008
custom_attributes:
  original_rule_id: 13c2f6c3-10c5-4deb-9ba1-7c4460ebe4ae
  source_format: splunk_spl