title: PaperCut NG Remote Web Access Attempt
id: d8b47479-a694-53db-a23c-c16de1aa4223
status: stable
level: high
description: |
  The following analytic detects potential exploitation attempts on publicly accessible PaperCut NG servers. It identifies connections from public IP addresses to the server, specifically monitoring URI paths commonly used in proof-of-concept scripts for exploiting PaperCut NG vulnerabilities. This detection leverages web traffic data from the `Web` datamodel, focusing on specific URI paths and excluding internal IP ranges. This activity is significant as it may indicate an attempt to exploit know
author: Michael Haag, Splunk
logsource:
  product: splunk
detection:
  selection:
    datamodel: Web
    url:
      - /app?service=page/SetupCompleted
      - /app
      - /app?service=page/PrinterList
      - /app?service=direct/1/PrinterList/selectPrinter&sp=*
      - /app?service=direct/1/PrinterDetails/printerOptionsTab.tab
    src:
      - 10.*.*.*
      - 172.16.*.*
      - 192.168.*.*
      - 169.254.*.*
      - 127.*.*.*
      - 'fc00::*'
      - 'fd00::*'
      - 'fe80::*'
  condition: selection
tags:
  - attack.t1190
  - attack.t1133
references:
  - https://www.cisa.gov/news-events/alerts/2023/05/11/cisa-and-fbi-release-joint-advisory-response-active-exploitation-papercut-vulnerability
  - https://www.papercut.com/kb/Main/PO-1216-and-PO-1219
  - https://www.horizon3.ai/papercut-cve-2023-27350-deep-dive-and-indicators-of-compromise/
  - https://www.bleepingcomputer.com/news/security/hackers-actively-exploit-critical-rce-bug-in-papercut-servers/
  - https://www.huntress.com/blog/critical-vulnerabilities-in-papercut-print-management-software
custom_attributes:
  original_rule_id: 9fcb214a-dc42-4ce7-a650-f1d2cab16a6a
  source_format: splunk_spl