title: Permission Modification using Takeown App
id: 0c3824d4-e668-5d27-aa71-3284db77ae55
status: stable
level: medium
description: |
  The following analytic detects the modification of file or directory permissions using the takeown.exe Windows application. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs that include process GUID, process name, and command-line details. This activity is significant because it is a common technique used by ransomware to take ownership of files or folders for encryption or deletion. If confirmed malicious, this could lead to unauthorized ac
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    process_name: takeown.exe
    process: '*/f*'
  condition: selection
tags:
  - attack.t1222
references:
  - https://research.nccgroup.com/2020/06/23/wastedlocker-a-new-ransomware-variant-developed-by-the-evil-corp-group/
custom_attributes:
  original_rule_id: fa7ca5c6-c9d8-11eb-bce9-acde48001122
  source_format: splunk_spl