title: PetitPotam Network Share Access Request
id: c07f0465-fdb1-5ca8-933d-74ec4137ccaa
status: stable
level: high
description: |
  The following analytic detects network share access requests indicative of the PetitPotam attack (CVE-2021-36942). It leverages Windows Event Code 5145, which logs attempts to access network share objects. This detection is significant as PetitPotam can coerce authentication from domain controllers, potentially leading to unauthorized access. If confirmed malicious, this activity could allow attackers to escalate privileges or move laterally within the network, posing a severe security risk. Ens
author: Michael Haag, Mauricio Velazco, Splunk
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    subjectusername: ANONYMOUS LOGON
    eventcode: 5145
    relativetargetname: lsarpc
  condition: selection
tags:
  - attack.t1187
references:
  - https://attack.mitre.org/techniques/T1187/
  - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=5145
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5145
custom_attributes:
  original_rule_id: 95b8061a-0a67-11ec-85ec-acde48001122
  source_format: splunk_spl