title: PingID New MFA Method After Credential Reset
id: 315a27a7-f09f-582a-8475-f868cd7eb345
status: stable
level: high
description: |
  The following analytic identifies the provisioning of a new MFA device shortly after a password reset. It detects this activity by correlating Windows Event Log events for password changes (EventID 4723, 4724) with PingID logs indicating device pairing. This behavior is significant as it may indicate a social engineering attack where a threat actor impersonates a valid user to reset credentials and add a new MFA device. If confirmed malicious, this activity could allow an attacker to gain persis
author: Steven Dick
logsource:
  product: windows
  category: authentication
detection:
  selection:
    reason: result.message
    type: outer
    eventid:
      - 4723
      - 4724
  condition: selection
tags:
  - attack.t1621
  - attack.t1556.006
  - attack.t1098.005
references:
  - https://techcommunity.microsoft.com/t5/microsoft-entra-azure-ad-blog/defend-your-users-from-mfa-fatigue-attacks/ba-p/2365677
  - https://www.bleepingcomputer.com/news/security/mfa-fatigue-hackers-new-favorite-tactic-in-high-profile-breaches/
  - https://attack.mitre.org/techniques/T1098/005/
  - https://attack.mitre.org/techniques/T1556/006/
  - https://docs.pingidentity.com/r/en-us/pingoneforenterprise/p14e_subscriptions?tocId=3xhnxjX3VzKNs3SXigWnQA
custom_attributes:
  original_rule_id: 2fcbce12-cffa-4c84-b70c-192604d201d0
  source_format: splunk_spl