title: PingID Multiple Failed MFA Requests For User
id: 24a4316a-91bf-52f4-9bd4-df77da013fc1
status: stable
level: high
description: |
  The following analytic identifies multiple failed multi-factor authentication (MFA) requests for a single user within a PingID environment. It triggers when 10 or more MFA prompts fail within 10 minutes, using JSON logs from PingID. This activity is significant as it may indicate an adversary attempting to bypass MFA by bombarding the user with repeated authentication requests. If confirmed malicious, this could lead to unauthorized access, as the user might eventually accept the fraudulent requ
author: Steven Dick
logsource:
  product: splunk
detection:
  selection:
    object: resources{}.devicemodel
    reason: result.message
    span: 10m
  condition: selection
tags:
  - attack.t1621
  - attack.t1078
  - attack.t1110
references:
  - https://therecord.media/russian-hackers-bypass-2fa-by-annoying-victims-with-repeated-push-notifications/
  - https://attack.mitre.org/techniques/T1621/
  - https://attack.mitre.org/techniques/T1110/
  - https://attack.mitre.org/techniques/T1078/004/
  - https://docs.pingidentity.com/r/en-us/pingoneforenterprise/p14e_subscriptions?tocId=3xhnxjX3VzKNs3SXigWnQA
custom_attributes:
  original_rule_id: c1bc706a-0025-4814-ad30-288f38865036
  source_format: splunk_spl