title: Ping Sleep Batch Command
id: de07fd9f-3601-5791-8082-e4687effa391
status: stable
level: medium
description: |
  The following analytic identifies the execution of ping sleep batch commands. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and parent process command-line details. This activity is significant as it indicates an attempt to delay malicious code execution, potentially evading detection or sandbox analysis. If confirmed malicious, this technique allows attackers to bypass security measures, making it harder to detect and analyze their activities, thereby 
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    parent_process:
      - '*&amp;*'
      - '*& *'
    process:
      - '*&amp;*'
      - '*& *'
  condition: selection
tags:
  - attack.t1497.003
references:
  - https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
custom_attributes:
  original_rule_id: ce058d6c-79f2-11ec-b476-acde48001122
  source_format: splunk_spl