title: Plain HTTP POST Exfiltrated Data
id: 1344879d-018e-53cb-a3d0-cdd449c1e538
status: stable
level: high
description: |
  The following analytic detects potential data exfiltration using plain HTTP POST requests. It leverages network traffic logs, specifically monitoring the `stream_http` data source for POST methods containing suspicious form data such as "wermgr.exe" or "svchost.exe". This activity is significant because it is commonly associated with malware like Trickbot, trojans, keyloggers, or APT adversaries, which use plain text HTTP POST requests to communicate with remote C2 servers. If confirmed maliciou
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
  category: network_connection
detection:
  selection:
    http_method: POST
    form_data:
      - '*wermgr.exe*'
      - '*svchost.exe*'
      - '*name=\"proclist\"*'
      - '*ipconfig*'
      - '*name=\"sysinfo\"*'
      - '*net view*'
  condition: selection
tags:
  - attack.t1048.003
references:
  - https://blog.talosintelligence.com/2020/03/trickbot-primer.html
custom_attributes:
  original_rule_id: e2b36208-a364-11eb-8909-acde48001122
  source_format: splunk_spl