title: Potentially malicious code on commandline
id: 15fba217-f9e1-566c-899f-7c32bff9ed91
status: stable
level: medium
description: |
  The following analytic detects potentially malicious command lines using a pretrained machine learning text classifier. It identifies unusual keyword combinations in command lines, such as "streamreader," "webclient," "mutex," "function," and "computehash," which are often associated with adversarial PowerShell code execution for C2 communication. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on command lines longer than 200 characters. This activity i
author: Michael Hart, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    datamodel: Endpoint.Processes
    score: predicted(unusual_cmdline_logits)
    process: orig_process
  condition: selection
tags:
  - attack.t1059.003
references:
  - https://attack.mitre.org/techniques/T1059/003/
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1059.001/T1059.001.md
custom_attributes:
  original_rule_id: 9c53c446-757e-11ec-871d-acde48001122
  source_format: splunk_spl