title: Potential password in username
id: 1d3346ea-6f49-55cb-bd6c-d41ff87aa3dd
status: stable
level: low
description: |
  The following analytic identifies instances where users may have mistakenly entered their passwords in the username field during authentication attempts. It detects this by analyzing failed authentication events with usernames longer than 7 characters and high Shannon entropy, followed by a successful authentication from the same source to the same destination. This activity is significant as it can indicate potential security risks, such as password exposure. If confirmed malicious, attackers c
author: Mikael Bjerkeland, Splunk
logsource:
  product: splunk
  category: authentication
detection:
  selection:
    search: '| tstats `security_content_summariesonly` earliest(_time) AS starttime latest(_time) AS endtime latest(sourcetype) AS sourcetype values(Authentication.src) AS src values(Authentication.dest) AS dest count FROM datamodel=Authentication WHERE nodename=Authentication.Successful_Authentication Authentication.src=\'
    datamodel:
      - Authentication
      - Authentication
    incorrect_cred: user
    maxsearches: 70
    action: RM
  condition: selection
tags:
  - attack.t1078.003
  - attack.t1552.001
references:
  - https://medium.com/@markmotig/search-for-passwords-accidentally-typed-into-the-username-field-975f1a389928
custom_attributes:
  original_rule_id: 5ced34b4-ab32-4bb0-8f22-3b8f186f0a38
  source_format: splunk_spl