title: Powershell Remote Services Add TrustedHost
id: b17898b6-c83e-5057-8c90-d984f8669984
status: stable
level: high
description: |
  The following analytic detects the execution of a PowerShell script that modifies the 'TrustedHosts' configuration via EventCode 4104. It leverages PowerShell Script Block Logging to identify commands targeting WSMan settings, specifically those altering or concatenating trusted hosts. This activity is significant as it can indicate attempts to manipulate remote connection settings, potentially allowing unauthorized remote access. If confirmed malicious, this could enable attackers to establish 
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    scriptblocktext:
      - '* -Value *'
      - '* -Concatenate *'
    eventcode: 4104
  condition: selection
tags:
  - attack.t1021.006
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.darkgate
custom_attributes:
  original_rule_id: bef21d24-297e-45e3-9b9a-c6ac45450474
  source_format: splunk_spl