title: Powershell Remove Windows Defender Directory
id: cf4e0b4d-041e-5ebb-9d1c-7f0d78989e54
status: stable
level: high
description: |
  The following analytic detects a suspicious PowerShell command attempting to delete the Windows Defender directory. It leverages PowerShell Script Block Logging to identify commands containing "rmdir" and targeting the Windows Defender path. This activity is significant as it may indicate an attempt to disable or corrupt Windows Defender, a key security component. If confirmed malicious, this action could allow an attacker to bypass endpoint protection, facilitating further malicious activities 
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    scriptblocktext:
      - '*rmdir *'
      - '*\\Microsoft\\Windows Defender*'
    eventcode: 4104
  condition: selection
tags:
  - attack.t1562.001
references:
  - https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
custom_attributes:
  original_rule_id: adf47620-79fa-11ec-b248-acde48001122
  source_format: splunk_spl