title: PowerShell Start or Stop Service
id: b7984803-2dac-5e89-9bb8-385d48c26752
status: stable
level: medium
description: |
  The following analytic identifies the use of PowerShell's Start-Service or Stop-Service cmdlets on an endpoint. It leverages PowerShell Script Block Logging to detect these commands. This activity is significant because attackers can manipulate services to disable or stop critical functions, causing system instability or disrupting business operations. If confirmed malicious, this behavior could allow attackers to disable security services, evade detection, or disrupt essential services, leading
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 4104
    scriptblocktext:
      - '*start-service*'
      - '*stop-service*'
  condition: selection
tags:
  - attack.t1059.001
references:
  - https://learn-powershell.net/2012/01/15/startingstopping-and-restarting-remote-services-with-powershell/
  - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.management/start-service?view=powershell-7.3
custom_attributes:
  original_rule_id: 04207f8a-e08d-4ee6-be26-1e0c4488b04a
  source_format: splunk_spl