title: Powershell Execute COM Object
id: ad77ee13-3c71-518f-9a51-2a283324acb3
status: stable
level: high
description: |
  The following analytic detects the execution of a COM CLSID through PowerShell. It leverages EventCode 4104 and searches for specific script block text indicating the creation of a COM object. This activity is significant as it is commonly used by adversaries and malware, such as the Conti ransomware, to execute commands, potentially for privilege escalation or bypassing User Account Control (UAC). If confirmed malicious, this technique could allow attackers to gain elevated privileges or persis
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    scriptblocktext: '*CreateInstance([type]::GetTypeFromCLSID*'
    eventcode: 4104
  condition: selection
tags:
  - attack.t1059.001
  - attack.t1546.015
references:
  - https://threadreaderapp.com/thread/1423361119926816776.html
  - https://www.splunk.com/en_us/blog/security/hunting-for-malicious-powershell-using-script-block-logging.html
custom_attributes:
  original_rule_id: 65711630-f9bf-11eb-8d72-acde48001122
  source_format: splunk_spl