title: PowerShell Script Block With URL Chain
id: 4ff2c4a1-6675-5b19-9a24-3e51a27d5b66
status: stable
level: high
description: |
  The following analytic identifies suspicious PowerShell script execution via EventCode 4104 that contains multiple URLs within a function or array. It leverages PowerShell operational logs to detect script blocks with embedded URLs, often indicative of obfuscated scripts or those attempting to download secondary payloads. This activity is significant as it may signal an attempt to execute malicious code or download additional malware. If confirmed malicious, this could lead to code execution, fu
author: Steven Dick
logsource:
  product: windows
detection:
  selection:
    scriptblocktext:
      - '*http:*'
      - '*https:*'
    eventcode: 4104
    max_match: 20
    field: ScriptBlockText
  condition: selection
tags:
  - attack.t1059.001
  - attack.t1105
references:
  - https://www.mandiant.com/resources/blog/tracking-evolution-gootloader-operations
  - https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/
  - https://attack.mitre.org/techniques/T1059/001/
custom_attributes:
  original_rule_id: 4a3f2a7d-6402-4e64-a76a-869588ec3b57
  source_format: splunk_spl