title: Prevent Automatic Repair Mode using Bcdedit
id: 08b12673-6d2f-50c3-91c2-ca47d9f6eaef
status: stable
level: high
description: |
  The following analytic detects the execution of "bcdedit.exe" with parameters to set the boot status policy to ignore all failures. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line arguments. This activity is significant because it can indicate an attempt by ransomware to prevent a compromised machine from booting into automatic repair mode, thereby hindering recovery efforts. If confirmed malicious, this action could allow attackers
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
detection:
  selection:
    process_name: bcdedit.exe
    process:
      - '*bootstatuspolicy*'
      - '*ignoreallfailures*'
  condition: selection
tags:
  - attack.t1490
references:
  - https://jsac.jpcert.or.jp/archive/2020/pdf/JSAC2020_1_tamada-yamazaki-nakatsuru_en.pdf
custom_attributes:
  original_rule_id: 7742aa92-c9d9-11eb-bbfc-acde48001122
  source_format: splunk_spl