title: Print Spooler Failed to Load a Plug-in
id: ec2fbcdf-7f8a-5b34-b79f-f59a7a7e2a8f
status: stable
level: high
description: |
  The following analytic detects driver load errors in the Windows PrintService Admin logs, specifically identifying issues related to CVE-2021-34527 (PrintNightmare). It triggers on error messages indicating the print spooler failed to load a plug-in module, such as "meterpreter.dll," with error code 0x45A. This detection method leverages specific event codes and error messages. This activity is significant as it may indicate an exploitation attempt of a known vulnerability. If confirmed maliciou
author: Mauricio Velazco, Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    errorcode: 0x45A
    eventcode:
      - 808
      - 4909
  condition: selection
tags:
  - attack.t1547.012
references:
  - https://www.truesec.com/hub/blog/fix-for-printnightmare-cve-2021-1675-exploit-to-keep-your-print-servers-running-while-a-patch-is-not-available
  - https://www.truesec.com/hub/blog/exploitable-critical-rce-vulnerability-allows-regular-users-to-fully-compromise-active-directory-printnightmare-cve-2021-1675
  - https://www.reddit.com/r/msp/comments/ob6y02/critical_vulnerability_printnightmare_exposes
custom_attributes:
  original_rule_id: 1adc9548-da7c-11eb-8f13-acde48001122
  source_format: splunk_spl