title: Process Execution via WMI
id: 0fe5f705-4979-53cc-929e-f395404c9df6
status: stable
level: high
description: |
  The following analytic detects the execution of a process by `WmiPrvSE.exe`, indicating potential use of WMI (Windows Management Instrumentation) for process creation. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and parent process relationships. This activity is significant as WMI can be used for lateral movement, remote code execution, or persistence by attackers. If confirmed malicious, this could allow an attacker to execute arbitrary c
author: Rico Valdez, Michael Haag, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    process:
      - '*\\dismhost.exe*'
  condition: selection
tags:
  - attack.t1047
custom_attributes:
  original_rule_id: 24869767-8579-485d-9a4f-d9ddfd8f0cac
  source_format: splunk_spl