title: Process Creating LNK file in Suspicious Location
id: 2462167b-880b-51e7-9537-43bdf6d54346
status: stable
level: high
description: |
  The following analytic detects a process creating a `.lnk` file in suspicious locations such as `C:\User*` or `*\Local\Temp\*`. It leverages filesystem and process activity data from the Endpoint data model to identify this behavior. This activity is significant because creating `.lnk` files in these directories is a common tactic used by spear phishing tools to establish persistence or execute malicious payloads. If confirmed malicious, this could allow an attacker to maintain persistence, exec
author: Jose Hernandez, Michael Haag, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    file_name: '*.lnk'
    file_path:
      - 'C:\\Users\\*'
      - '*\\Temp\\*'
  condition: selection
tags:
  - attack.t1566.002
references:
  - https://attack.mitre.org/techniques/T1566/001/
  - https://www.trendmicro.com/en_us/research/17/e/rising-trend-attackers-using-lnk-files-download-malware.html
  - https://twitter.com/pr0xylife/status/1590394227758104576
custom_attributes:
  original_rule_id: 5d814af1-1041-47b5-a9ac-d754e82e9a26
  source_format: splunk_spl