title: Process Writing DynamicWrapperX
id: 372a5ec8-25b9-5069-8420-c39ba48d2ffd
status: stable
level: low
description: |
  The following analytic detects a process writing the dynwrapx.dll file to disk and registering it in the registry. It leverages data from the Endpoint datamodel, specifically monitoring process and filesystem events. This activity is significant because DynamicWrapperX is an ActiveX component often used in scripts to call Windows API functions, and its presence in non-standard locations is highly suspicious. If confirmed malicious, this could allow an attacker to execute arbitrary code, escalate
author: Michael Haag, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    file_name: dynwrapx.dll
  condition: selection
tags:
  - attack.t1059
  - attack.t1559.001
references:
  - https://blog.f-secure.com/hunting-for-koadic-a-com-based-rootkit/
  - https://www.script-coding.com/dynwrapx_eng.html
  - https://bohops.com/2018/06/28/abusing-com-registry-structure-clsid-localserver32-inprocserver32/
  - https://tria.ge/210929-ap75vsddan
  - https://www.virustotal.com/gui/file/cb77b93150cb0f7fe65ce8a7e2a5781e727419451355a7736db84109fa215a89
custom_attributes:
  original_rule_id: b0a078e4-2601-11ec-9aec-acde48001122
  source_format: splunk_spl