title: Processes Tapping Keyboard Events
id: e105d35a-7df5-5f49-b1fb-314c5bbc9068
status: experimental
level: high
description: |
  The following analytic detects processes on macOS systems that are tapping keyboard events, potentially monitoring all keystrokes made by a user. It leverages data from osquery results within the Alerts data model, focusing on specific process names and command lines. This activity is significant as it is a common technique used by Remote Access Trojans (RATs) to log keystrokes, posing a serious security risk. If confirmed malicious, this could lead to unauthorized access to sensitive informatio
author: Jose Hernandez, Splunk
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    _spl_reference: true
  condition: selection
custom_attributes:
  original_rule_id: 2a371608-331d-4034-ae2c-21dda8f1d0ec
  source_format: splunk_spl