title: Recon Using WMI Class
id: 815cc060-9bd4-57d4-add1-d509c485356c
status: stable
level: medium
description: |
  The following analytic detects suspicious PowerShell activity via EventCode 4104, where WMI performs event queries to gather information on running processes or services. This detection leverages PowerShell Script Block Logging to identify specific WMI queries targeting system information classes like Win32_Bios and Win32_OperatingSystem. This activity is significant as it often indicates reconnaissance efforts by an adversary to profile the compromised machine. If confirmed malicious, the attac
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 4104
    scriptblocktext:
      - '*Win32_Bios*'
      - '*Win32_OperatingSystem*'
      - '*Win32_Processor*'
      - '*Win32_ComputerSystem*'
      - '*Win32_PnPEntity*'
      - '*Win32_ShadowCopy*'
      - '*Win32_DiskDrive*'
      - '*Win32_PhysicalMemory*'
      - '*Win32_BaseBoard*'
      - '*Win32_DisplayConfiguration*'
  condition: selection
tags:
  - attack.t1592
  - attack.t1059.001
references:
  - https://news.sophos.com/en-us/2020/05/12/maze-ransomware-1-year-counting/
  - https://help.splunk.com/en/security-offerings/splunk-user-behavior-analytics/get-data-in/5.4.1/add-other-data-to-splunk-uba/configure-powershell-logging-to-see-powershell-anomalies-in-splunk-uba.
  - https://blog.palantir.com/tampering-with-windows-event-tracing-background-offense-and-defense-4be7ac62ac63
  - https://static1.squarespace.com/static/552092d5e4b0661088167e5c/t/59c1814829f18782e24f1fe2/1505853768977/Windows+PowerShell+Logging+Cheat+Sheet+ver+Sept+2017+v2.1.pdf
  - https://www.crowdstrike.com/blog/investigating-powershell-command-and-script-logging/
custom_attributes:
  original_rule_id: 018c1972-ca07-11eb-9473-acde48001122
  source_format: splunk_spl