title: Recon AVProduct Through Pwh or WMI
id: d131ff71-c48b-5360-8abf-f1b8d9ad9a8d
status: stable
level: high
description: |
  The following analytic detects suspicious PowerShell script execution via EventCode 4104, specifically targeting checks for installed anti-virus products using WMI or PowerShell commands. This detection leverages PowerShell Script Block Logging to identify scripts containing keywords like "SELECT," "WMIC," "AntiVirusProduct," or "AntiSpywareProduct." This activity is significant as it is commonly used by malware and APT actors to map running security applications or services, potentially aiding 
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    scriptblocktext:
      - '*SELECT*'
      - '*WMIC*'
      - '*AntiVirusProduct*'
      - '*AntiSpywareProduct*'
    eventcode: 4104
  condition: selection
tags:
  - attack.t1592
references:
  - https://news.sophos.com/en-us/2020/05/12/maze-ransomware-1-year-counting/
  - https://help.splunk.com/en/security-offerings/splunk-user-behavior-analytics/get-data-in/5.4.1/add-other-data-to-splunk-uba/configure-powershell-logging-to-see-powershell-anomalies-in-splunk-uba.
  - https://blog.palantir.com/tampering-with-windows-event-tracing-background-offense-and-defense-4be7ac62ac63
  - https://static1.squarespace.com/static/552092d5e4b0661088167e5c/t/59c1814829f18782e24f1fe2/1505853768977/Windows+PowerShell+Logging+Cheat+Sheet+ver+Sept+2017+v2.1.pdf
  - https://www.crowdstrike.com/blog/investigating-powershell-command-and-script-logging/
custom_attributes:
  original_rule_id: 28077620-c9f6-11eb-8785-acde48001122
  source_format: splunk_spl