title: Reg exe Manipulating Windows Services Registry Keys
id: cd12f1aa-6a49-5512-a004-8cc010995844
status: stable
level: high
description: |
  The following analytic detects the use of reg.exe to modify registry keys associated with Windows services and their configurations. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names, parent processes, and command-line executions. This activity is significant because unauthorized changes to service registry keys can indicate an attempt to establish persistence or escalate privileges. If confirmed malicious, this could allow an attacker to control serv
author: Rico Valdez, Splunk
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1574.011
custom_attributes:
  original_rule_id: 8470d755-0c13-45b3-bd63-387a373c10cf
  source_format: splunk_spl