title: Registry Keys for Creating SHIM Databases
id: e9d40588-3af5-5e0d-92d9-af2388be1a98
status: stable
level: high
description: |
  The following analytic detects registry activity related to the creation of application compatibility shims. It leverages data from the Endpoint.Registry data model, specifically monitoring registry paths associated with AppCompatFlags. This activity is significant because attackers can use shims to bypass security controls, achieve persistence, or escalate privileges. If confirmed malicious, this could allow an attacker to maintain long-term access, execute arbitrary code, or manipulate applica
author: Patrick Bareiss, Teoderick Contreras, Splunk, Steven Dick, Bhavin Patel
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1546.011
custom_attributes:
  original_rule_id: f5f6af30-7aa7-4295-bfe9-07fe87c01bbb
  source_format: splunk_spl