title: Registry Keys Used For Privilege Escalation
id: 38f58345-60c9-5d45-9931-eddf87cfb222
status: stable
level: high
description: |
  The following analytic detects modifications to registry keys under "Image File Execution Options" that can be used for privilege escalation. It leverages data from the Endpoint.Registry data model, specifically monitoring changes to registry paths and values like GlobalFlag and Debugger. This activity is significant because attackers can use these modifications to intercept executable calls and attach malicious binaries to legitimate system binaries. If confirmed malicious, this could allow att
author: David Dorsey, Teoderick Contreras, Splunk, Steven Dick
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options*'
    registry_value_name: GlobalFlag
  condition: selection
tags:
  - attack.t1546.012
references:
  - https://blog.malwarebytes.com/101/2015/12/an-introduction-to-image-file-execution-options/
custom_attributes:
  original_rule_id: c9f4b923-f8af-4155-b697-1354f5bcbc5e
  source_format: splunk_spl