title: Regsvr32 with Known Silent Switch Cmdline
id: 33eaeaf0-7452-5e33-879c-30d44be1ae4e
status: stable
level: medium
description: |
  The following analytic detects the execution of Regsvr32.exe with the silent switch to load DLLs. This behavior is identified using Endpoint Detection and Response (EDR) telemetry, focusing on command-line executions containing the `-s` or `/s` switches. This activity is significant as it is commonly used in malware campaigns, such as IcedID, to stealthily load malicious DLLs. If confirmed malicious, this could allow an attacker to execute arbitrary code, download additional payloads, and potent
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1218.010
references:
  - https://app.any.run/tasks/56680cba-2bbc-4b34-8633-5f7878ddf858/
  - https://regexr.com/699e2
custom_attributes:
  original_rule_id: c9ef7dc4-eeaf-11eb-b2b6-acde48001122
  source_format: splunk_spl