title: Remcos client registry install entry
id: 209d0bc5-3839-53fa-9c47-762f07438df1
status: stable
level: high
description: |
  The following analytic detects the presence of a registry key associated with the Remcos RAT agent on a host. It leverages data from the Endpoint.Processes and Endpoint.Registry data models in Splunk, focusing on instances where the "license" key is found in the "Software\Remcos" path. This behavior is significant as it indicates potential compromise by the Remcos RAT, a remote access Trojan used for unauthorized access and data exfiltration. If confirmed malicious, the attacker could gain contr
author: Steven Dick, Bhavin Patel, Rod Soto, Teoderick Contreras, Splunk
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1112
references:
  - https://attack.mitre.org/software/S0332/
custom_attributes:
  original_rule_id: f2a1615a-1d63-11ec-97d2-acde48001122
  source_format: splunk_spl