title: Remcos RAT File Creation in Remcos Folder
id: 29fee3d5-4750-5e71-8028-f16a1450bfa3
status: stable
level: high
description: |
  The following analytic detects the creation of files in the Remcos folder within the AppData directory, specifically targeting keylog and clipboard log files. It leverages the Endpoint.Filesystem data model to identify .dat files created in paths containing "remcos." This activity is significant as it indicates the presence of the Remcos RAT, which performs keylogging, clipboard capturing, and audio recording. If confirmed malicious, this could lead to unauthorized data exfiltration and extensiv
author: Teoderick Contreras, Splunk, Sanjay Govind
logsource:
  product: splunk
  category: file_event
detection:
  selection:
    file_path: '*\\remcos\\*'
    file_name:
      - '*.dat'
  condition: selection
tags:
  - attack.t1113
references:
  - https://success.trendmicro.com/dcx/s/solution/1123281-remcos-malware-information?language=en_US
  - https://blog.malwarebytes.com/threat-intelligence/2021/07/remcos-rat-delivered-via-visual-basic/
custom_attributes:
  original_rule_id: 25ae862a-1ac3-11ec-94a1-acde48001122
  source_format: splunk_spl