title: Remote Desktop Process Running On System
id: 1633d176-bc54-5d97-bc2c-41d8687bb1ae
status: experimental
level: low
description: |
  The following analytic detects the execution of the remote desktop process (mstsc.exe) on systems where it is not typically run. This detection leverages data from Endpoint Detection and Response (EDR) agents, filtering out systems categorized as common RDP sources. This activity is significant because unauthorized use of mstsc.exe can indicate lateral movement or unauthorized remote access attempts. If confirmed malicious, this could allow an attacker to gain remote control of a system, potenti
author: David Dorsey, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1021.001
custom_attributes:
  original_rule_id: f5939373-8054-40ad-8c64-cec478a22a4a
  source_format: splunk_spl