title: Remote WMI Command Attempt
id: 4e43a691-95c4-5bbd-9603-3d69cf90e118
status: stable
level: high
description: |
  The following analytic detects the execution of `wmic.exe` with the `node` switch, indicating an attempt to spawn a local or remote process. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process creation events and command-line arguments. This activity is significant as it may indicate lateral movement or remote code execution attempts by an attacker. If confirmed malicious, the attacker could gain remote control over the targeted system, execute ar
author: Rico Valdez, Michael Haag, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1047
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1047/T1047.yaml
  - https://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/
  - https://thedfirreport.com/2023/05/22/icedid-macro-ends-in-nokoyawa-ransomware/
custom_attributes:
  original_rule_id: 272df6de-61f1-4784-877c-1fbc3e2d0838
  source_format: splunk_spl