title: Remote Process Instantiation via DCOM and PowerShell Script Block
id: 699219f4-acf7-58d5-9e8c-c6f4fb5f38a8
status: stable
level: high
description: |
  The following analytic detects the execution of PowerShell commands that initiate a process on a remote endpoint via the DCOM protocol. It leverages PowerShell Script Block Logging (EventCode=4104) to identify the use of ShellExecute and ExecuteShellCommand. This activity is significant as it may indicate lateral movement or remote code execution attempts by adversaries. If confirmed malicious, this behavior could allow attackers to execute arbitrary code on remote systems, potentially leading t
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    scriptblocktext:
      - '*Document.Application.ShellExecute*'
      - '*Document.ActiveView.ExecuteShellCommand*'
    eventcode: 4104
  condition: selection
tags:
  - attack.t1021.003
references:
  - https://attack.mitre.org/techniques/T1021/003/
  - https://www.cybereason.com/blog/dcom-lateral-movement-techniques
custom_attributes:
  original_rule_id: fa1c3040-4680-11ec-a618-3e22fbd008af
  source_format: splunk_spl