title: Remote Process Instantiation via WMI and PowerShell Script Block
id: 5062eca0-18cf-5981-b04b-2fd9d658c260
status: stable
level: high
description: |
  The following analytic detects the execution of the `Invoke-WmiMethod` commandlet with parameters used to start a process on a remote endpoint via WMI, leveraging PowerShell Script Block Logging (EventCode=4104). This method identifies specific script block text patterns associated with remote process instantiation. This activity is significant as it may indicate lateral movement or remote code execution attempts by adversaries. If confirmed malicious, this could allow attackers to execute arbit
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    scriptblocktext:
      - '*Invoke-WmiMethod*'
      - '*-CN*'
      - '*-ComputerName*'
      - '*-Class Win32_Process*'
      - '*-Name create*'
    eventcode: 4104
  condition: selection
tags:
  - attack.t1047
references:
  - https://attack.mitre.org/techniques/T1047/
  - https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.management/invoke-wmimethod?view=powershell-5.1
custom_attributes:
  original_rule_id: 2a048c14-4634-11ec-a618-3e22fbd008af
  source_format: splunk_spl