title: Remote Desktop Network Traffic
id: d448fde6-5438-54af-8ed3-b7b665d326e5
status: stable
level: medium
description: |
  The following analytic detects unusual Remote Desktop Protocol (RDP) traffic on TCP/3389 by filtering out known RDP sources and destinations, focusing on atypical connections within the network. This detection leverages network traffic data to identify potentially unauthorized RDP access. Monitoring this activity is crucial for a SOC as unauthorized RDP access can indicate an attacker's attempt to control networked systems, leading to data theft, ransomware deployment, or further network comprom
author: David Dorsey, Splunk
logsource:
  product: splunk
  category: network_connection
detection:
  selection:
    action: allowed
    datamodel: Network_Traffic
    dest_port: 3389
  condition: selection
tags:
  - attack.t1021.001
custom_attributes:
  original_rule_id: 272b8407-842d-4b3d-bead-a704584003d3
  source_format: splunk_spl