title: Remote Process Instantiation via WinRM and PowerShell Script Block
id: 0889f482-4264-57ff-a412-44e8337384fe
status: stable
level: high
description: |
  The following analytic detects the execution of PowerShell commands that use the `Invoke-Command` cmdlet to start a process on a remote endpoint via the WinRM protocol. It leverages PowerShell Script Block Logging (EventCode=4104) to identify such activities. This behavior is significant as it may indicate lateral movement or remote code execution attempts by adversaries. If confirmed malicious, this activity could allow attackers to execute arbitrary code on remote systems, potentially leading 
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    scriptblocktext:
      - '*Invoke-Command*'
      - '*-ComputerName*'
    eventcode: 4104
  condition: selection
tags:
  - attack.t1021.006
references:
  - https://attack.mitre.org/techniques/T1021/006/
  - https://pentestlab.blog/2018/05/15/lateral-movement-winrm/
custom_attributes:
  original_rule_id: 7d4c618e-4716-11ec-951c-3e22fbd008af
  source_format: splunk_spl