title: Rubeus Kerberos Ticket Exports Through Winlogon Access
id: 586e6052-a827-56db-82dc-33202d722dce
status: stable
level: high
description: |
  The following analytic detects a process accessing the winlogon.exe system process, indicative of the Rubeus tool attempting to export Kerberos tickets from memory. This detection leverages Sysmon EventCode 10 logs, focusing on processes obtaining a handle to winlogon.exe with specific access rights. This activity is significant as it often precedes pass-the-ticket attacks, where adversaries use stolen Kerberos tickets to move laterally within an environment. If confirmed malicious, this could a
author: Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 10
  condition: selection
tags:
  - attack.t1550.003
references:
  - https://github.com/GhostPack/Rubeus
  - https://web.archive.org/web/20210725005734/http://www.harmj0y.net/blog/redteaming/from-kekeo-to-rubeus/
  - https://attack.mitre.org/techniques/T1550/003/
custom_attributes:
  original_rule_id: 5ed8c50a-8869-11ec-876f-acde48001122
  source_format: splunk_spl