title: Runas Execution in CommandLine
id: 72b44f0c-a2d2-5db6-9f87-a7706880d319
status: stable
level: low
description: |
  The following analytic detects the execution of the runas.exe process with administrator user options. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions and process details. This activity is significant as it may indicate an attempt to gain elevated privileges, a common tactic in privilege escalation and lateral movement. If confirmed malicious, this could allow an attacker to execute commands with higher privileges, potentially leading to u
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    process_name: runas.exe
    original_file_name: runas.exe
    process:
      - '*/user:*'
      - '*admin*'
  condition: selection
tags:
  - attack.t1134.001
references:
  - https://app.any.run/tasks/ad4c3cda-41f2-4401-8dba-56cc2d245488/
custom_attributes:
  original_rule_id: 4807e716-43a4-11ec-a0e7-acde48001122
  source_format: splunk_spl