title: Rundll32 CreateRemoteThread In Browser
id: fa866d0b-d345-554b-88e7-21e1e96d52ff
status: stable
level: high
description: |
  The following analytic detects the suspicious creation of a remote thread by rundll32.exe targeting browser processes such as firefox.exe, chrome.exe, iexplore.exe, and microsoftedgecp.exe. This detection leverages Sysmon EventCode 8, focusing on SourceImage and TargetImage fields to identify the behavior. This activity is significant as it is commonly associated with malware like IcedID, which hooks browsers to steal sensitive information such as banking details. If confirmed malicious, this co
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    sourceimage: '*\\rundll32.exe'
    eventcode: 8
    targetimage:
      - '*\\firefox.exe'
      - '*\\chrome.exe'
      - '*\\iexplore.exe'
      - '*\\microsoftedgecp.exe'
  condition: selection
tags:
  - attack.t1055
references:
  - https://www.joesandbox.com/analysis/380662/0/html
custom_attributes:
  original_rule_id: f8a22586-ee2d-11eb-a193-acde48001122
  source_format: splunk_spl