title: Rundll32 with no Command Line Arguments with Network
id: a143c0cf-35aa-543a-90c0-ca5bf897c01c
status: stable
level: high
description: |
  The following analytic detects the execution of rundll32.exe without command line arguments, followed by a network connection. This behavior is identified using Endpoint Detection and Response (EDR) telemetry and network traffic data. It is significant because rundll32.exe typically requires arguments to function, and its absence is often associated with malicious activity, such as Cobalt Strike. If confirmed malicious, this activity could indicate an attempt to establish unauthorized network co
author: Steven Dick,  Michael Haag, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    process: (?i)(rundll32\.exe.{0,4}$)
    span: 1h
  filter:
    action: blocked
  condition: selection and not filter
tags:
  - attack.t1218.011
references:
  - https://attack.mitre.org/techniques/T1218/011/
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.011/T1218.011.md
  - https://lolbas-project.github.io/lolbas/Binaries/Rundll32/
  - https://bohops.com/2018/02/26/leveraging-inf-sct-fetch-execute-techniques-for-bypass-evasion-persistence/
custom_attributes:
  original_rule_id: 35307032-a12d-11eb-835f-acde48001122
  source_format: splunk_spl