title: Rundll32 Create Remote Thread To A Process
id: 6ffb4667-aa56-54a5-b6dd-b3d21532e688
status: stable
level: high
description: |
  The following analytic detects the creation of a remote thread by rundll32.exe into another process. It leverages Sysmon EventCode 8 logs, specifically monitoring SourceImage and TargetImage fields. This activity is significant as it is a common technique used by malware, such as IcedID, to execute malicious code within legitimate processes, aiding in defense evasion and data theft. If confirmed malicious, this behavior could allow an attacker to execute arbitrary code, escalate privileges, and 
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    sourceimage: '*\\rundll32.exe'
    targetimage: '*.exe'
    eventcode: 8
  condition: selection
tags:
  - attack.t1055
references:
  - https://www.joesandbox.com/analysis/380662/0/html
custom_attributes:
  original_rule_id: 2dbeee3a-f067-11eb-96c0-acde48001122
  source_format: splunk_spl