title: Ryuk Test Files Detected
id: b51f0339-b624-5437-a666-fe60233181be
status: stable
level: high
description: |
  The following analytic identifies the presence of files containing the keyword "Ryuk" in any folder on the C drive, indicative of Ryuk ransomware activity. It leverages the Endpoint Filesystem data model to detect file paths matching this pattern. This activity is significant as Ryuk ransomware is known for its destructive impact, encrypting critical files and demanding ransom. If confirmed malicious, this could lead to significant data loss, operational disruption, and financial damage due to r
author: Rod Soto, Jose Hernandez, Splunk
logsource:
  product: splunk
  category: file_event
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1486
custom_attributes:
  original_rule_id: 57d44d70-28d9-4ed1-acf5-1c80ae2bbce3
  source_format: splunk_spl