title: SAM Database File Access Attempt
id: 717f4cb6-2209-5500-a82f-ebc51dc66386
status: stable
level: low
description: |
  The following analytic detects attempts to access the SAM, SYSTEM, or SECURITY database files within the `windows\system32\config` directory using Windows Security EventCode 4663. This detection leverages Windows Security Event logs to identify unauthorized access attempts. Monitoring this activity is crucial as it indicates potential credential access attempts, possibly exploiting vulnerabilities like CVE-2021-36934. If confirmed malicious, an attacker could extract user passwords, leading to u
author: Michael Haag, Mauricio Velazco, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    objectname:
      - '*\\Windows\\System32\\config\\SAM*'
      - '*\\Windows\\System32\\config\\SYSTEM*'
      - '*\\Windows\\System32\\config\\SECURITY*'
  condition: selection
tags:
  - attack.t1003.002
references:
  - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4663
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4663
  - https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-36934
  - https://github.com/GossiTheDog/HiveNightmare
  - https://github.com/JumpsecLabs/Guidance-Advice/tree/main/SAM_Permissions
custom_attributes:
  original_rule_id: 57551656-ebdb-11eb-afdf-acde48001122
  source_format: splunk_spl