title: Samsam Test File Write
id: 71cf78bc-bb64-55f1-a388-4248a6be5200
status: stable
level: high
description: |
  The following analytic detects the creation of a file named "test.txt" within the Windows system directory, indicative of Samsam ransomware propagation. It leverages file-system activity data from the Endpoint data model, specifically monitoring file paths within the Windows System32 directory. This activity is significant as it aligns with known Samsam ransomware behavior, which uses such files for propagation and execution. If confirmed malicious, this could lead to ransomware deployment, resu
author: Rico Valdez, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1486
custom_attributes:
  original_rule_id: 493a879d-519d-428f-8f57-a06a0fdc107e
  source_format: splunk_spl