title: Schedule Task with Rundll32 Command Trigger
id: 6ea0be57-4752-5f14-aac5-0f7f248852dc
status: stable
level: high
description: |
  The following analytic detects the creation of scheduled tasks in Windows that use the rundll32 command. It leverages Windows Security EventCode 4698, which logs the creation of scheduled tasks, and filters for tasks executed via rundll32. This activity is significant as it is a common technique used by malware, such as TrickBot, to persist in an environment or deliver additional payloads. If confirmed malicious, this could lead to data theft, ransomware deployment, or other damaging outcomes. I
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    eventcode: 4698
    command:
      - '*rundll32*'
  condition: selection
tags:
  - attack.t1053
references:
  - https://labs.vipre.com/trickbot-and-its-modules/
  - https://whitehat.eu/incident-response-case-study-featuring-ryuk-and-trickbot-part-2/
custom_attributes:
  original_rule_id: 75b00fd8-a0ff-11eb-8b31-acde48001122
  source_format: splunk_spl