title: Schedule Task with HTTP Command Arguments
id: 36210588-980f-5835-82c9-946a0e749e90
status: stable
level: high
description: |
  The following analytic detects the creation of scheduled tasks on Windows systems that include HTTP command arguments, using Windows Security EventCode 4698. It identifies tasks registered via schtasks.exe or TaskService with HTTP in their command arguments. This behavior is significant as it often indicates malware activity or the use of Living off the Land binaries (lolbins) to download additional payloads. If confirmed malicious, this activity could lead to data exfiltration, malware propagat
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    eventcode: 4698
    arguments:
      - '*http*'
  condition: selection
tags:
  - attack.t1053
references:
  - https://app.any.run/tasks/92d7ef61-bfd7-4c92-bc15-322172b4ebec/
custom_attributes:
  original_rule_id: 523c2684-a101-11eb-916b-acde48001122
  source_format: splunk_spl