title: Schtasks scheduling job on remote system
id: 5c013a57-0a88-5a2e-b6d2-229eabe4771f
status: stable
level: high
description: |
  The following analytic detects the use of 'schtasks.exe' to create a scheduled task on a remote system, indicating potential lateral movement or remote code execution. It leverages process data from Endpoint Detection and Response (EDR) agents, focusing on specific command-line arguments and flags. This activity is significant as it may signify an adversary's attempt to persist or execute code remotely. If confirmed malicious, this could allow attackers to maintain access, execute arbitrary comm
author: David Dorsey, Mauricio Velazco, Splunk
logsource:
  product: splunk
detection:
  selection:
    process:
      - '*/create*'
      - '*/s *'
  condition: selection
tags:
  - attack.t1053.005
custom_attributes:
  original_rule_id: 1297fb80-f42a-4b4a-9c8a-88c066237cf6
  source_format: splunk_spl