title: Schtasks used for forcing a reboot
id: 99b81a83-039d-51ed-8e19-8c36424849c8
status: stable
level: high
description: |
  The following analytic detects the use of 'schtasks.exe' to schedule forced system reboots using the 'shutdown' and '/create' flags. It leverages endpoint process data to identify instances where these specific command-line arguments are used. This activity is significant because it may indicate an adversary attempting to disrupt operations or force a reboot to execute further malicious actions. If confirmed malicious, this could lead to system downtime, potential data loss, and provide an attac
author: Bhavin Patel, Splunk
logsource:
  product: splunk
detection:
  selection:
    process:
      - '*shutdown*'
      - '*/create *'
  condition: selection
tags:
  - attack.t1053.005
custom_attributes:
  original_rule_id: 1297fb80-f42a-4b4a-9c8a-88c066437cf6
  source_format: splunk_spl