title: Screensaver Event Trigger Execution
id: cb2da015-8630-5ee4-976d-a8921628bd85
status: stable
level: high
description: |
  The following analytic detects modifications to the SCRNSAVE.EXE registry entry, indicating potential event trigger execution via screensaver settings for persistence or privilege escalation. It leverages registry activity data from the Endpoint data model to identify changes to the specified registry path. This activity is significant as it is a known technique used by APT groups and malware to maintain persistence or escalate privileges. If confirmed malicious, this could allow an attacker to 
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    registry_path: '*\\Control Panel\\Desktop\\SCRNSAVE.EXE*'
  condition: selection
tags:
  - attack.t1546.002
references:
  - https://attack.mitre.org/techniques/T1546/002/
  - https://dmcxblue.gitbook.io/red-team-notes-2-0/red-team-techniques/privilege-escalation/untitled-3/screensaver
custom_attributes:
  original_rule_id: 58cea3ec-1f6d-11ec-8560-acde48001122
  source_format: splunk_spl