title: Sdclt UAC Bypass
id: d6bd9533-45a5-5741-9ac7-265315ea0297
status: stable
level: high
description: |
  The following analytic detects suspicious modifications to the sdclt.exe registry, a technique often used to bypass User Account Control (UAC). It leverages data from Endpoint Detection and Response (EDR) agents, focusing on specific registry paths and values associated with sdclt.exe. This activity is significant because UAC bypasses can allow attackers to execute payloads with elevated privileges without user consent. If confirmed malicious, this could lead to unauthorized code execution, priv
author: Steven Dick, Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    registry_path:
      - '*\\Windows\\CurrentVersion\\App Paths\\control.exe*'
      - '*\\exefile\\shell\\runas\\command\\*'
    registry_value_name:
      - (Default)
      - IsolatedCommand
  condition: selection
tags:
  - attack.t1548.002
references:
  - https://enigma0x3.net/2017/03/17/fileless-uac-bypass-using-sdclt-exe/
  - https://github.com/hfiref0x/UACME
  - https://www.cyborgsecurity.com/cyborg-labs/threat-hunt-deep-dives-user-account-control-bypass-via-registry-modification/
custom_attributes:
  original_rule_id: d71efbf6-da63-11eb-8c6e-acde48001122
  source_format: splunk_spl