title: Services LOLBAS Execution Process Spawn
id: f6b74146-5704-586e-9de6-2dbbc7b090c7
status: stable
level: high
description: |
  The following analytic identifies `services.exe` spawning a LOLBAS (Living Off the Land Binaries and Scripts) execution process. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process creation events where `services.exe` is the parent process. This activity is significant because adversaries often abuse the Service Control Manager to execute malicious code via native Windows binaries, facilitating lateral movement. If confirmed malicious, this behavior could all
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    process_name:
      - Regsvcs.exe
      - Ftp.exe
      - OfflineScannerShell.exe
      - Rasautou.exe
      - Schtasks.exe
      - Xwizard.exe
      - Dllhost.exe
      - Pnputil.exe
      - Atbroker.exe
      - Pcwrun.exe
      - Ttdinject.exe
      - Mshta.exe
      - Bitsadmin.exe
      - Certoc.exe
      - Ieexec.exe
      - Microsoft.Workflow.Compiler.exe
      - Runscripthelper.exe
      - Forfiles.exe
      - Msbuild.exe
      - Register-cimprovider.exe
      - Tttracer.exe
      - Ie4uinit.exe
      - Bash.exe
      - Hh.exe
      - SettingSyncHost.exe
      - Cmstp.exe
      - Mmc.exe
      - Stordiag.exe
      - Scriptrunner.exe
      - Odbcconf.exe
      - Extexport.exe
      - Msdt.exe
      - WorkFolders.exe
      - Diskshadow.exe
      - Mavinject.exe
      - Regasm.exe
      - Gpscript.exe
      - Rundll32.exe
      - Regsvr32.exe
      - Msiexec.exe
      - Wuauclt.exe
      - Presentationhost.exe
      - Wmic.exe
      - Runonce.exe
      - Syncappvpublishingserver.exe
      - Verclsid.exe
      - Infdefaultinstall.exe
      - Explorer.exe
      - Installutil.exe
      - Netsh.exe
      - Wab.exe
      - Dnscmd.exe
      - At.exe
      - Pcalua.exe
      - Msconfig.exe
  condition: selection
tags:
  - attack.t1543.003
references:
  - https://attack.mitre.org/techniques/T1543/003/
  - https://pentestlab.blog/2020/07/21/lateral-movement-services/
  - https://lolbas-project.github.io/
custom_attributes:
  original_rule_id: ba9e1954-4c04-11ec-8b74-3e22fbd008af
  source_format: splunk_spl