title: Shim Database File Creation
id: d63cceec-7667-54f3-9fbf-2d9e855e0f66
status: stable
level: high
description: |
  The following analytic detects the creation of shim database files (.sdb) in default directories using the sdbinst.exe application. It leverages filesystem activity data from the Endpoint.Filesystem data model to identify file writes to the Windows\AppPatch\Custom directory. This activity is significant because shims can intercept and alter API calls, potentially allowing attackers to bypass security controls or execute malicious code. If confirmed malicious, this could lead to unauthorized code
author: David Dorsey, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1546.011
custom_attributes:
  original_rule_id: 6e4c4588-ba2f-42fa-97e6-9f6f548eaa33
  source_format: splunk_spl