title: Short Lived Scheduled Task
id: 427d8247-b2aa-5ae9-90e5-386e34abec64
status: stable
level: high
description: |
  The following analytic detects the creation and deletion of scheduled tasks within a short time frame (less than 30 seconds) using Windows Security EventCodes 4698 and 4699. This behavior is identified by analyzing Windows Security Event Logs and leveraging the Windows TA for parsing. Such activity is significant as it may indicate lateral movement or remote code execution attempts by adversaries. If confirmed malicious, this could lead to unauthorized access, data exfiltration, or execution of 
author: Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode:
      - 4698
      - 4699
    short_lived: 'TRUE'
  condition: selection
tags:
  - attack.t1053.005
references:
  - https://attack.mitre.org/techniques/T1053/005/
  - https://docs.microsoft.com/en-us/windows/win32/taskschd/about-the-task-scheduler
custom_attributes:
  original_rule_id: 6fa31414-546e-11ec-adfa-acde48001122
  source_format: splunk_spl