title: Single Letter Process On Endpoint
id: 3d9466bf-ca1e-5d6a-bab7-5f73d68bcf48
status: stable
level: high
description: |
  The following analytic detects processes with names consisting of a single letter, which is often indicative of malware or an attacker attempting to evade detection. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant because attackers use such techniques to obscure their presence and carry out malicious activities like data theft or ransomware attacks. If confirmed malicious, this be
author: David Dorsey, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    process_name_length: 5
    endexe: 1
  condition: selection
tags:
  - attack.t1204.002
custom_attributes:
  original_rule_id: a4214f0b-e01c-41bc-8cc4-d2b71e3056b4
  source_format: splunk_spl