title: Spoolsv Suspicious Process Access
id: 75be9544-bbf0-5c38-8eb1-f3fcb4638d49
status: stable
level: high
description: |
  The following analytic detects suspicious process access by spoolsv.exe, potentially indicating exploitation of the PrintNightmare vulnerability (CVE-2021-34527). It leverages Sysmon EventCode 10 to identify when spoolsv.exe accesses critical system files or processes like rundll32.exe with elevated privileges. This activity is significant as it may signal an attempt to gain unauthorized privilege escalation on a vulnerable machine. If confirmed malicious, an attacker could achieve elevated priv
author: Mauricio Velazco, Michael Haag, Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    sourceimage: '*\\spoolsv.exe'
    calltrace: '*\\Windows\\system32\\spool\\DRIVERS\\x64\\*'
    eventcode: 10
    grantedaccess: 0x1fffff
    targetimage:
      - '*\\rundll32.exe'
      - '*\\spoolsv.exe'
  condition: selection
tags:
  - attack.t1068
references:
  - https://github.com/cube0x0/impacket/commit/73b9466c17761384ece11e1028ec6689abad6818
  - https://www.truesec.com/hub/blog/fix-for-printnightmare-cve-2021-1675-exploit-to-keep-your-print-servers-running-while-a-patch-is-not-available
  - https://www.truesec.com/hub/blog/exploitable-critical-rce-vulnerability-allows-regular-users-to-fully-compromise-active-directory-printnightmare-cve-2021-1675
  - https://www.reddit.com/r/msp/comments/ob6y02/critical_vulnerability_printnightmare_exposes
custom_attributes:
  original_rule_id: 799b606e-da81-11eb-93f8-acde48001122
  source_format: splunk_spl