title: Spoolsv Writing a DLL - Sysmon
id: 319a22a1-ea3e-54f3-b496-b50263f6fbd5
status: stable
level: high
description: |
  The following analytic detects `spoolsv.exe` writing a `.dll` file, which is unusual behavior and may indicate exploitation of vulnerabilities like CVE-2021-34527 (PrintNightmare). This detection leverages Sysmon EventID 11 to monitor file creation events in the `\spool\drivers\x64\` directory. This activity is significant because `spoolsv.exe` typically does not write DLL files, and such behavior could signify an ongoing attack. If confirmed malicious, this could allow an attacker to execute ar
author: Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    file_path: '*\\spool\\drivers\\x64\\*'
    eventid: 11
  condition: selection
tags:
  - attack.t1547.012
references:
  - https://github.com/cube0x0/impacket/commit/73b9466c17761384ece11e1028ec6689abad6818
  - https://www.truesec.com/hub/blog/fix-for-printnightmare-cve-2021-1675-exploit-to-keep-your-print-servers-running-while-a-patch-is-not-available
  - https://www.truesec.com/hub/blog/exploitable-critical-rce-vulnerability-allows-regular-users-to-fully-compromise-active-directory-printnightmare-cve-2021-1675
  - https://www.reddit.com/r/msp/comments/ob6y02/critical_vulnerability_printnightmare_exposes
custom_attributes:
  original_rule_id: 347fd388-da87-11eb-836d-acde48001122
  source_format: splunk_spl