title: Spoolsv Suspicious Loaded Modules
id: 8a94e5c8-810b-5615-a97b-3b7243ab2cab
status: stable
level: high
description: |
  The following analytic detects the suspicious loading of DLLs by spoolsv.exe, potentially indicating PrintNightmare exploitation. It leverages Sysmon EventCode 7 to identify instances where spoolsv.exe loads multiple DLLs from the Windows System32 spool drivers x64 directory. This activity is significant as it may signify an attacker exploiting the PrintNightmare vulnerability to execute arbitrary code. If confirmed malicious, this could lead to unauthorized code execution, privilege escalation,
author: Mauricio Velazco, Michael Haag, Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    image: '*\\spoolsv.exe'
    imageloaded:
      - '*\\Windows\\System32\\spool\\drivers\\x64\\*'
      - '*.dll'
    eventcode: 7
  condition: selection
tags:
  - attack.t1547.012
references:
  - https://raw.githubusercontent.com/hieuttmmo/sigma/dceb13fe3f1821b119ae495b41e24438bd97e3d0/rules/windows/image_load/sysmon_cve_2021_1675_print_nightmare.yml
custom_attributes:
  original_rule_id: a5e451f8-da81-11eb-b245-acde48001122
  source_format: splunk_spl