title: Spring4Shell Payload URL Request
id: 7c7fa22e-0b10-5e4d-aba9-5034514ea446
status: stable
level: high
description: |
  The following analytic detects attempts to exploit the Spring4Shell vulnerability (CVE-2022-22963) by identifying specific URL patterns associated with web shell payloads. It leverages web traffic data, focusing on HTTP GET requests with URLs containing indicators like "tomcatwar.jsp," "poc.jsp," and "shell.jsp." This activity is significant as it suggests an attacker is trying to deploy a web shell, which can lead to remote code execution. If confirmed malicious, this could allow the attacker t
author: Michael Haag, Splunk
logsource:
  product: splunk
detection:
  selection:
    datamodel: Web
    http_method:
      - GET
    url:
      - '*tomcatwar.jsp*'
      - '*poc.jsp*'
      - '*shell.jsp*'
  condition: selection
tags:
  - attack.t1133
  - attack.t1190
  - attack.t1505.003
references:
  - https://www.microsoft.com/security/blog/2022/04/04/springshell-rce-vulnerability-guidance-for-protecting-against-and-detecting-cve-2022-22965/
  - https://github.com/TheGejr/SpringShell
  - https://www.tenable.com/blog/spring4shell-faq-spring-framework-remote-code-execution-vulnerability
custom_attributes:
  original_rule_id: 9d44d649-7d67-4559-95c1-8022ff49420b
  source_format: splunk_spl