title: Sqlite Module In Temp Folder
id: b6c5e6f7-736c-5aa6-886b-ab59eae66a5f
status: stable
level: high
description: |
  The following analytic detects the creation of sqlite3.dll files in the %temp% folder. It leverages Sysmon EventCode 11 to identify when these files are written to the temporary directory. This activity is significant because it is associated with IcedID malware, which uses the sqlite3 module to parse browser databases and steal sensitive information such as banking details, credit card information, and credentials. If confirmed malicious, this behavior could lead to significant data theft and c
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    targetfilename:
      - '*\\sqlite32.dll'
      - '*\\sqlite64.dll'
      - '*\\temp\\*'
    eventcode: 11
  condition: selection
tags:
  - attack.t1005
references:
  - https://www.cisecurity.org/insights/white-papers/security-primer-icedid
custom_attributes:
  original_rule_id: 0f216a38-f45f-11eb-b09c-acde48001122
  source_format: splunk_spl