title: Suspicious Rundll32 no Command Line Arguments
id: c2332767-09a3-526b-a367-9df2efb27dfc
status: stable
level: high
description: |
  The following analytic detects the execution of rundll32.exe without any command line arguments. This behavior is identified using Endpoint Detection and Response (EDR) telemetry, focusing on process execution logs. It is significant because rundll32.exe typically requires command line arguments to function properly, and its absence is often associated with malicious activities, such as those performed by Cobalt Strike. If confirmed malicious, this activity could indicate an attempt to execute a
author: Michael Haag, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    process: (?i)(rundll32\.exe.{0,4}$)
  condition: selection
tags:
  - attack.t1218.011
references:
  - https://attack.mitre.org/techniques/T1218/011/
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.011/T1218.011.md
  - https://lolbas-project.github.io/lolbas/Binaries/Rundll32/
  - https://bohops.com/2018/02/26/leveraging-inf-sct-fetch-execute-techniques-for-bypass-evasion-persistence/
custom_attributes:
  original_rule_id: e451bd16-e4c5-4109-8eb1-c4c6ecf048b4
  source_format: splunk_spl