title: Suspicious WAV file in Appdata Folder
id: def90f14-89cf-5f7f-8261-d3421a3c8a4a
status: stable
level: high
description: |
  The following analytic detects the creation of .wav files in the AppData folder, a behavior associated with Remcos RAT malware, which stores audio recordings in this location for data exfiltration. The detection leverages endpoint process and filesystem data to identify .wav file creation within the AppData\Roaming directory. This activity is significant as it indicates potential unauthorized data collection and exfiltration by malware. If confirmed malicious, this could lead to sensitive inform
author: Teoderick Contreras, Splunk
logsource:
  product: splunk
  category: file_event
detection:
  selection:
    process_path: '*\\appdata\\Roaming\\*'
    file_path: '*\\appdata\\Roaming\\*'
    span:
      - 1h
      - 1h
    file_name:
      - '*.wav'
  condition: selection
tags:
  - attack.t1113
references:
  - https://success.trendmicro.com/dcx/s/solution/1123281-remcos-malware-information?language=en_US
  - https://blog.malwarebytes.com/threat-intelligence/2021/07/remcos-rat-delivered-via-visual-basic/
custom_attributes:
  original_rule_id: 5be109e6-1ac5-11ec-b421-acde48001122
  source_format: splunk_spl