title: Suspicious Process Executed From Container File
id: 669969ef-c9fd-52ad-830a-ea2f2a552e34
status: stable
level: high
description: |
  The following analytic identifies a suspicious process executed from within common container/archive file types such as ZIP, ISO, IMG, and others. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant as it is a common technique used by adversaries to execute scripts or evade defenses. If confirmed malicious, this behavior could allow attackers to execute arbitrary code, escalate privileges, or per
author: Steven Dick
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    action: allowed
    process:
      - '*.ZIP\\*'
      - '*.ISO\\*'
      - '*.IMG\\*'
      - '*.CAB\\*'
      - '*.TAR\\*'
      - '*.GZ\\*'
      - '*.RAR\\*'
      - '*.7Z\\*'
    field: process
  condition: selection
tags:
  - attack.t1204.002
  - attack.t1036.008
references:
  - https://www.mandiant.com/resources/blog/tracking-evolution-gootloader-operations
  - https://www.crowdstrike.com/blog/weaponizing-disk-image-files-analysis/
  - https://attack.mitre.org/techniques/T1204/002/
custom_attributes:
  original_rule_id: d8120352-3b62-411c-8cb6-7b47584dd5e8
  source_format: splunk_spl