title: Suspicious Copy on System32
id: a979b886-61dc-526f-b0de-b007645a8d37
status: stable
level: medium
description: |
  The following analytic detects potentially suspicious file copy operations targeting the System32 or SysWow64 directories as source, often indicative of malicious activity. It leverages data from Endpoint Detection and Response (EDR) agents,  focusing on activity initiated by command-line tools like cmd.exe or PowerShell. This behavior is significant as it may indicate an attempt to evade defenses by copying an existing binary from the system directory and renaming it. If confirmed malicious, th
author: Teoderick Contreras, Nasreddine Bencherchali, Splunk
logsource:
  product: windows
detection:
  selection:
    parent_process_name:
      - cmd.exe
      - powershell.exe
      - pwsh.exe
      - sqlps.exe
      - sqltoolsps.exe
    process_name:
      - copy.exe
      - xcopy.exe
    original_file_name:
      - copy.exe
      - xcopy.exe
    process:
      - '* \"C:\\Windows\\System32\\*'
      - '* \''C:\\Windows\\System32\\*'
      - '* C:\\Windows\\System32\\*'
      - '* \"C:\\Windows\\SysWow64\\*'
      - '* \''C:\\Windows\\SysWow64\\*'
      - '* C:\\Windows\\SysWow64\\*'
  condition: selection
tags:
  - attack.t1036.003
references:
  - https://www.hybrid-analysis.com/sample/8da5b75b6380a41eee3a399c43dfe0d99eeefaa1fd21027a07b1ecaa4cd96fdd?environmentId=120
  - https://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/
custom_attributes:
  original_rule_id: ce633e56-25b2-11ec-9e76-acde48001122
  source_format: splunk_spl