title: Suspicious Process With Discord DNS Query
id: 369e38f2-721b-5342-9c2e-fd275ae6383a
status: stable
level: medium
description: |
  The following analytic identifies a process making a DNS query to Discord, excluding legitimate Discord application paths. It leverages Sysmon logs with Event ID 22 to detect DNS queries containing "discord" in the QueryName field. This activity is significant because Discord can be abused by adversaries to host and download malicious files, as seen in the WhisperGate campaign. If confirmed malicious, this could indicate malware attempting to download additional payloads from Discord, potentiall
author: Teoderick Contreras, Mauricio Velazco, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    eventcode: 22
    queryname:
      - '*discord*'
  filter:
    image: discord.exe
  condition: selection and not filter
tags:
  - attack.t1059.005
references:
  - https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
  - https://medium.com/s2wblog/analysis-of-destructive-malware-whispergate-targeting-ukraine-9d5d158f19f3
  - https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
custom_attributes:
  original_rule_id: 4d4332ae-792c-11ec-89c1-acde48001122
  source_format: splunk_spl