title: Suspicious Reg exe Process
id: 209d7fb0-8a71-5270-959f-91bc33735db3
status: stable
level: medium
description: |
  The following analytic identifies instances of reg.exe being launched from a command prompt (cmd.exe) that was not initiated by the user, as indicated by a parent process other than explorer.exe. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and parent process names. This activity is significant because reg.exe is often used in registry manipulation, which can be indicative of malicious behavior such as persistence mechanisms or system confi
author: David Dorsey, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1112
references:
  - https://car.mitre.org/wiki/CAR-2013-03-001/
custom_attributes:
  original_rule_id: a6b3ab4e-dd77-4213-95fa-fc94701995e0
  source_format: splunk_spl