title: Suspicious PlistBuddy Usage
id: 0a786941-3379-5cbb-aac6-435136b85841
status: experimental
level: high
description: |
  The following analytic identifies the use of the native macOS utility, PlistBuddy, to create or modify property list (.plist) files. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions involving PlistBuddy. This activity is significant because PlistBuddy can be used to establish persistence by modifying LaunchAgents, as seen in the Silver Sparrow malware. If confirmed malicious, this could allow an attacker to mai
author: Michael Haag, Splunk
logsource:
  product: macos
detection:
  selection:
    process_name: PlistBuddy
  condition: selection
tags:
  - attack.t1543.001
references:
  - https://www.marcosantadev.com/manage-plist-files-plistbuddy/
custom_attributes:
  original_rule_id: c3194009-e0eb-4f84-87a9-4070f8688f00
  source_format: splunk_spl