title: Suspicious mshta child process
id: 7101124f-3756-5af6-8d6d-93636fa5cae7
status: stable
level: high
description: |
  The following analytic identifies child processes spawned from "mshta.exe". It leverages data from Endpoint Detection and Response (EDR) agents, focusing on specific child processes like "powershell.exe" and "cmd.exe". This activity is significant because "mshta.exe" is often exploited by attackers to execute malicious scripts or commands. If confirmed malicious, this behavior could allow an attacker to execute arbitrary code, escalate privileges, or maintain persistence within the environment. 
author: Michael Haag, Teoderick Contreras Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    process_name:
      - powershell.exe
      - colorcpl.exe
      - msbuild.exe
      - microsoft.workflow.compiler.exe
      - searchprotocolhost.exe
      - scrcons.exe
      - cscript.exe
      - wscript.exe
      - cmd.exe
      - bitsadmin.exe
  condition: selection
tags:
  - attack.t1218.005
references:
  - https://github.com/redcanaryco/AtomicTestHarnesses
  - https://redcanary.com/blog/introducing-atomictestharnesses/
custom_attributes:
  original_rule_id: 60023bb6-5500-11eb-ae93-0242ac130002
  source_format: splunk_spl