title: Suspicious Process DNS Query Known Abuse Web Services
id: 73d925d1-1a15-59c2-bdaf-b835991b15d1
status: stable
level: high
description: |
  The following analytic detects a suspicious process making DNS queries to known, abused text-paste web services, VoIP, instant messaging, and digital distribution platforms. It leverages Sysmon EventID 22 logs to identify queries from processes like cmd.exe, powershell.exe, and others. This activity is significant as it may indicate an attempt to download malicious files, a common initial access technique. If confirmed malicious, this could lead to unauthorized code execution, data exfiltration,
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    eventcode: 22
    queryname:
      - '*pastebin*'
      - '*discord*'
      - '*api.telegram*'
      - '*t.me*'
    process_name:
      - cmd.exe
      - '*powershell*'
      - pwsh.exe
      - wscript.exe
      - cscript.exe
    image:
      - '*\\users\\public\\*'
      - '*\\programdata\\*'
      - '*\\temp\\*'
      - '*\\Windows\\Tasks\\*'
      - '*\\appdata\\*'
      - '*\\perflogs\\*'
  condition: selection
tags:
  - attack.t1059.005
references:
  - https://urlhaus.abuse.ch/url/1798923/
  - https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
custom_attributes:
  original_rule_id: 3cf0dc36-484d-11ec-a6bc-acde48001122
  source_format: splunk_spl