title: System Processes Run From Unexpected Locations
id: a975064d-1606-522d-b8a9-a71c653f2f9b
status: stable
level: medium
description: |
  The following analytic identifies system processes running from unexpected locations outside of paths such as `C:\Windows\System32\` or `C:\Windows\SysWOW64`. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process paths, names, and hashes. This activity is significant as it may indicate a malicious process attempting to masquerade as a legitimate system process. If confirmed malicious, this behavior could allow an attacker to execute code, escalate privileges, o
author: David Dorsey, Michael Haag, Nasreddine Bencherchali, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    update: 'true'
    systemfile: 'true'
    process_path:
      - '*:\\$WINDOWS.~BT\\*'
      - '*:\\$WinREAgent\\*'
      - '*:\\Windows\\SoftwareDistribution\\*'
      - '*:\\Windows\\System32\\*'
      - '*:\\Windows\\SystemTemp\\*'
      - '*:\\Windows\\SysWOW64\\*'
      - '*:\\Windows\\uus\\*'
      - '*:\\Windows\\WinSxS\\*'
      - ''
  condition: selection
tags:
  - attack.t1036.003
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1036.003/T1036.003.yaml
  - https://attack.mitre.org/techniques/T1036/003/
custom_attributes:
  original_rule_id: a34aae96-ccf8-4aef-952c-3ea21444444d
  source_format: splunk_spl