title: TOR Traffic
id: 0c93eec9-02b5-5b0c-be73-b4357925e54b
status: stable
level: high
description: |
  The following analytic identifies allowed network traffic to The Onion Router (TOR), an anonymity network often exploited for malicious activities. It leverages data from Next Generation Firewalls, using the Network_Traffic data model to detect traffic where the application is TOR and the action is allowed. This activity is significant as TOR can be used to bypass conventional monitoring, facilitating hacking, data breaches, and illicit content dissemination. If confirmed malicious, this could l
author: David Dorsey, Bhavin Patel, Splunk
logsource:
  product: splunk
detection:
  selection:
    datamodel: Network_Traffic
    app: tor
    action:
      - allowed
      - allow
  condition: selection
tags:
  - attack.t1090.003
references:
  - https://knowledgebase.paloaltonetworks.com/KCSArticleDetail?id=kA10g000000ClRtCAK
  - https://unit42.paloaltonetworks.com/tor-traffic-enterprise-networks/#:~:text=For%20enterprises%20concerned%20about%20the,the%20most%20important%20security%20risks.
custom_attributes:
  original_rule_id: ea688274-9c06-4473-b951-e4cb7a5d7a45
  source_format: splunk_spl