title: UAC Bypass With Colorui COM Object
id: cca54e08-3cfa-5b2e-9412-4217da82cfe0
status: stable
level: high
description: |
  The following analytic detects a potential UAC bypass using the colorui.dll COM Object. It leverages Sysmon EventCode 7 to identify instances where colorui.dll is loaded by a process other than colorcpl.exe, excluding common system directories. This activity is significant because UAC bypass techniques are often used by malware, such as LockBit ransomware, to gain elevated privileges without user consent. If confirmed malicious, this could allow an attacker to execute code with higher privileges
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    imageloaded: '*\\colorui.dll'
    eventcode: 7
    image:
      - '*\\windows\\*'
      - '*\\program files*'
  filter:
    process_name: colorcpl.exe
  condition: selection and not filter
tags:
  - attack.t1218.003
references:
  - https://news.sophos.com/en-us/2020/04/24/lockbit-ransomware-borrows-tricks-to-keep-up-with-revil-and-maze/
custom_attributes:
  original_rule_id: 2bcccd20-fc2b-11eb-8d22-acde48001122
  source_format: splunk_spl