title: Unknown Process Using The Kerberos Protocol
id: e90c9ba3-caf4-5567-a3af-9c401894197b
status: stable
level: high
description: |
  The following analytic identifies a non-lsass.exe process making an outbound connection on port 88, which is typically used by the Kerberos authentication protocol. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and network traffic logs. This activity is significant because, under normal circumstances, only the lsass.exe process should interact with the Kerberos Distribution Center. If confirmed malicious, this behavior could indicate an adve
author: Mauricio Velazco, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    dest_port: 88
  condition: selection
tags:
  - attack.t1550
references:
  - https://stealthbits.com/blog/how-to-detect-overpass-the-hash-attacks/
  - https://www.thehacker.recipes/ad/movement/kerberos/ptk
custom_attributes:
  original_rule_id: c91a0852-9fbb-11ec-af44-acde48001122
  source_format: splunk_spl