title: Unloading AMSI via Reflection
id: 399b5fda-865a-5c47-a81f-e7d4ba2f4d36
status: stable
level: high
description: |
  The following analytic detects the tampering of AMSI (Antimalware Scan Interface) via PowerShell reflection. It leverages PowerShell Script Block Logging (EventCode=4104) to capture and analyze suspicious PowerShell commands, specifically those involving `system.management.automation.amsi`. This activity is significant as it indicates an attempt to bypass AMSI, a critical security feature that helps detect and block malicious scripts. If confirmed malicious, this could allow an attacker to execu
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 4104
  condition: selection
tags:
  - attack.t1059.001
  - attack.t1562
references:
  - https://help.splunk.com/en/security-offerings/splunk-user-behavior-analytics/get-data-in/5.4.1/add-other-data-to-splunk-uba/configure-powershell-logging-to-see-powershell-anomalies-in-splunk-uba.
  - https://blog.palantir.com/tampering-with-windows-event-tracing-background-offense-and-defense-4be7ac62ac63
  - https://static1.squarespace.com/static/552092d5e4b0661088167e5c/t/59c1814829f18782e24f1fe2/1505853768977/Windows+PowerShell+Logging+Cheat+Sheet+ver+Sept+2017+v2.1.pdf
  - https://www.crowdstrike.com/blog/investigating-powershell-command-and-script-logging/
custom_attributes:
  original_rule_id: a21e3484-c94d-11eb-b55b-acde48001122
  source_format: splunk_spl