title: Unusually Long Command Line - MLTK
id: 69e48e58-8580-53db-af11-800d32e1b138
status: experimental
level: medium
description: |
  The following analytic identifies unusually long command lines executed on hosts, which may indicate malicious activity. It leverages the Machine Learning Toolkit (MLTK) to detect command lines with lengths that deviate from the norm for a given user. This is significant for a SOC as unusually long command lines can be a sign of obfuscation or complex malicious scripts. If confirmed malicious, this activity could allow attackers to execute sophisticated commands, potentially leading to unauthori
author: Rico Valdez, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    _spl_reference: true
  condition: selection
custom_attributes:
  original_rule_id: 57edaefa-a73b-45e5-bbae-f39c1473f941
  source_format: splunk_spl