title: Unusually Long Content-Type Length
id: f2f811bc-ed17-5fc3-80b3-3988b0705f28
status: experimental
level: medium
description: |
  The following analytic identifies unusually long strings in the Content-Type HTTP header sent by the client to the server. It uses data from the Stream:HTTP source, specifically evaluating the length of the `cs_content_type` field. This activity is significant because excessively long Content-Type headers can indicate attempts to exploit vulnerabilities or evade detection mechanisms. If confirmed malicious, this behavior could allow attackers to execute code, manipulate data, or bypass security 
author: Bhavin Patel, Splunk
logsource:
  product: splunk
detection:
  selection:
    datamodel: Web
  condition: selection
custom_attributes:
  original_rule_id: 57a0a2bf-353f-40c1-84dc-29293f3c35b7
  source_format: splunk_spl