title: Unusually Long Command Line
id: 10412853-8e54-5c39-bf0c-78d60c9d365e
status: experimental
level: medium
description: |
  The following analytic detects unusually long command lines, which may indicate malicious activity. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on the length of command lines executed on hosts. This behavior is significant because attackers often use obfuscated or complex command lines to evade detection and execute malicious payloads. If confirmed malicious, this activity could lead to data theft, ransomware deployment, or further system compromise. Analysts sh
author: David Dorsey, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    threshold: 3
  condition: selection
custom_attributes:
  original_rule_id: c77162d3-f93c-45cc-80c8-22f6a4264e7f
  source_format: splunk_spl