title: Web Servers Executing Suspicious Processes
id: 4cd9783f-e25e-5ce1-80ec-06d1e9d48816
status: experimental
level: high
description: |
  The following analytic detects the execution of suspicious processes on systems identified as web servers. It leverages the Splunk data model "Endpoint.Processes" to search for specific process names such as "whoami", "ping", "iptables", "wget", "service", and "curl". This activity is significant because these processes are often used by attackers for reconnaissance, persistence, or data exfiltration. If confirmed malicious, this could lead to data theft, deployment of additional malware, or eve
author: David Dorsey, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    dest_category: web_server
    process:
      - '*whoami*'
      - '*ping*'
      - '*iptables*'
      - '*wget*'
      - '*service*'
      - '*curl*'
  condition: selection
tags:
  - attack.t1082
custom_attributes:
  original_rule_id: ec3b7601-689a-4463-94e0-c9f45638efb9
  source_format: splunk_spl