title: Wermgr Process Create Executable File
id: 6fae0644-e38c-54c7-9aae-50500c5d9f65
status: stable
level: high
description: |
  The following analytic detects the wermgr.exe process creating an executable file. It leverages Sysmon EventCode 11 to identify instances where wermgr.exe generates a .exe file. This behavior is unusual because wermgr.exe is typically associated with error reporting, not file creation. Such activity is significant as it may indicate TrickBot malware, which injects code into wermgr.exe to execute malicious actions like downloading additional payloads. If confirmed malicious, this could lead to fu
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    process_name: wermgr.exe
    targetfilename: '*.exe'
    eventcode: 11
  condition: selection
tags:
  - attack.t1027
references:
  - https://labs.vipre.com/trickbot-and-its-modules/
  - https://whitehat.eu/incident-response-case-study-featuring-ryuk-and-trickbot-part-2/
custom_attributes:
  original_rule_id: ab3bcce0-a105-11eb-973c-acde48001122
  source_format: splunk_spl