title: Windows Shell Process from CrushFTP
id: 3501a1e3-5190-5ed1-9d21-6b3264dfd308
status: stable
level: high
description: |
  The following analytic identifies instances where CrushFTP's service process (crushftpservice.exe) spawns shell processes like cmd.exe or powershell.exe. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process creation events. This activity is significant because CrushFTP should not normally spawn interactive shell processes during regular operations. If confirmed malicious, this behavior could indicate successful exploitation of vulnerabilities like 
author: Michael Haag, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1059.001
  - attack.t1059.003
  - attack.t1190
  - attack.t1505
references:
  - https://nvd.nist.gov/vuln/detail/CVE-2025-31161
  - https://www.crushftp.com/crush11wiki/Wiki.jsp?page=Update
  - https://www.huntress.com/blog/crushftp-cve-2025-31161-auth-bypass-and-post-exploitation
custom_attributes:
  original_rule_id: 459628e3-1b00-4e9b-9e5b-7da8961aea35
  source_format: splunk_spl