title: Windows AD Cross Domain SID History Addition
id: f4f3835f-4b41-560e-83bc-71bc12d1746d
status: stable
level: high
description: |
  The following analytic detects changes to the sIDHistory attribute of user or computer objects across different domains. It leverages Windows Security Event Codes 4738 and 4742 to identify when the sIDHistory attribute is modified. This activity is significant because the sIDHistory attribute allows users to inherit permissions from other AD accounts, which can be exploited by adversaries for inter-domain privilege escalation and persistence. If confirmed malicious, this could enable attackers t
author: Dean Luxton
logsource:
  product: windows
detection:
  selection:
    eventcode: 4742
    field:
      - SidHistory
      - TargetSid
    sidhistory:
      - '%%1793'
      - '-'
  condition: selection
tags:
  - attack.t1134.005
references:
  - https://adsecurity.org/?p=1772
  - https://learn.microsoft.com/en-us/windows/win32/adschema/a-sidhistory?redirectedfrom=MSDN
  - https://learn.microsoft.com/en-us/defender-for-identity/security-assessment-unsecure-sid-history-attribute
custom_attributes:
  original_rule_id: 41bbb371-28ba-439c-bb5c-d9930c28365d
  source_format: splunk_spl