title: Windows Steal Authentication Certificates - ESC1 Authentication
id: f1ed4706-32b7-562a-a4e1-fbafc607a8ff
status: stable
level: high
description: |
  The following analytic detects when a suspicious certificate with a Subject Alternative Name (SAN) is issued using Active Directory Certificate Services (AD CS) and then immediately used for authentication. This detection leverages Windows Security Event Logs, specifically EventCode 4887, to identify the issuance and subsequent use of the certificate. This activity is significant because improperly configured certificate templates can be exploited for privilege escalation and environment comprom
author: Steven Dick
logsource:
  product: windows
  category: authentication
detection:
  selection:
    attributes:
      - '*SAN:*upn*'
      - '*CertificateTemplate:*'
    field:
      - Attributes
      - Attributes
      - Attributes
      - Attributes
      - Requester
    max_match:
      - 10
      - 10
    eventcode:
      - 4887
    risk_score: 90
  condition: selection
tags:
  - attack.t1649
  - attack.t1550
references:
  - https://specterops.io/wp-content/uploads/sites/3/2022/06/Certified_Pre-Owned.pdf
  - https://github.com/ly4k/Certipy#esc1
  - https://pentestlaboratories.com/2021/11/08/threat-hunting-certificate-account-persistence/
custom_attributes:
  original_rule_id: f0306acf-a6ab-437a-bbc6-8628f8d5c97e
  source_format: splunk_spl