title: Windows Remote Access Software RMS Registry
id: 5899ce73-11a6-54a8-a27f-4d372e7b0216
status: stable
level: high
description: |
  The following analytic detects the creation or modification of Windows registry entries related to the Remote Manipulator System (RMS) Remote Admin tool. It leverages data from the Endpoint.Registry datamodel, focusing on registry paths containing "SYSTEM\\Remote Manipulator System." This activity is significant because RMS, while legitimate, is often abused by adversaries, such as in the Azorult malware campaigns, to gain unauthorized remote access. If confirmed malicious, this could allow atta
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*\\SYSTEM\\Remote Manipulator System*'
  condition: selection
tags:
  - attack.t1219
references:
  - https://app.any.run/tasks/a6f2ffe2-e6e2-4396-ae2e-04ea0143f2d8/
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.rms
custom_attributes:
  original_rule_id: e5b7b5a9-e471-4be8-8c5d-4083983ba329
  source_format: splunk_spl