title: Windows Create Local Administrator Account Via Net
id: e4df6375-7c78-5fbe-851b-b85e61bc2283
status: stable
level: medium
description: |
  The following analytic detects the creation of a local administrator account using the "net.exe" command. It leverages Endpoint Detection and Response (EDR) data to identify processes named "net.exe" with the "/add" parameter and keywords related to administrator accounts. This activity is significant as it may indicate an attacker attempting to gain persistent access or escalate privileges. If confirmed malicious, this could lead to unauthorized access, data theft, or further system compromise.
author: Bhavin Patel, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    process:
      - '*administrators*'
      - '*administratoren*'
      - '*administrateurs*'
      - '*administrador*'
      - '*amministratori*'
      - '*administratorer*'
      - '*Rendszergazda*'
      - '*Администратор*'
      - '*Administratör*'
  condition: selection
tags:
  - attack.t1136.001
custom_attributes:
  original_rule_id: 2c568c34-bb57-4b43-9d75-19c605b98e70
  source_format: splunk_spl