title: Windows File and Directory Enable ReadOnly Permissions
id: 20b74fda-03c2-533b-9913-f608f554652e
status: stable
level: high
description: |
  The following analytic detects instances where file or folder permissions are modified to grant read-only access. Such changes are characterized by the presence of read-related permissions (e.g., R, REA, RA, RD) and the absence of write (W) or execute (E) permissions. Monitoring these events is crucial for tracking access control changes that could be intentional for restricting access or indicative of malicious behavior. Alerts generated by this detection help ensure that legitimate security me
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    has_write_execute: 'false'
    has_read_attribute: 'true'
    field: process
    process_name:
      - icacls.exe
      - cacls.exe
      - xcacls.exe
    process:
      - '*SYSTEM*'
      - '*admin*'
      - '*S-1-1-0*'
      - '*EVERYONE*'
  condition: selection
tags:
  - attack.t1222.001
references:
  - https://www.splunk.com/en_us/blog/security/-applocker-rules-as-defense-evasion-complete-analysis.html
custom_attributes:
  original_rule_id: 1ae407b0-a042-4eb0-834a-590da055575e
  source_format: splunk_spl