title: Windows Vulnerable Driver Loaded
id: 9e8b634d-8157-52c9-97c1-87fba437c613
status: stable
level: low
description: |
  The following analytic detects the loading of known vulnerable Windows drivers, which may indicate potential persistence or privilege escalation attempts. It leverages Sysmon EventCode 6 to identify driver loading events and cross-references them with a list of vulnerable drivers. This activity is significant as attackers often exploit vulnerable drivers to gain elevated privileges or maintain persistence on a system. If confirmed malicious, this could allow attackers to execute arbitrary code w
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 6
    is_driver: 'TRUE'
  condition: selection
tags:
  - attack.t1543.003
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/driver_load/driver_load_vuln_drivers_names.yml
  - https://github.com/eclypsium/Screwed-Drivers/blob/master/DRIVERS.md
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-driver-block-rules
  - https://www.rapid7.com/blog/post/2021/12/13/driver-based-attacks-past-and-present/
  - https://github.com/jbaines-r7/dellicious
custom_attributes:
  original_rule_id: a2b1f1ef-221f-4187-b2a4-d4b08ec745f4
  source_format: splunk_spl