title: Windows Modify Registry DontShowUI
id: ab9cc70d-1fcd-5997-b575-48a06e3304e4
status: stable
level: high
description: |
  The following analytic detects modifications to the Windows Error Reporting registry key "DontShowUI" to suppress error reporting dialogs. It leverages data from the Endpoint datamodel's Registry node to identify changes where the registry value is set to 0x00000001. This activity is significant as it is commonly associated with DarkGate malware, which uses this modification to avoid detection during its installation. If confirmed malicious, this behavior could allow attackers to maintain a low 
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*\\SOFTWARE\\Microsoft\\Windows\\Windows Error Reporting\\DontShowUI'
    registry_value_data: 0x00000001
  condition: selection
tags:
  - attack.t1112
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.darkgate
custom_attributes:
  original_rule_id: 4ff9767b-fdf2-489c-83a5-c6c34412d72e
  source_format: splunk_spl