title: Windows Boot or Logon Autostart Execution In Startup Folder
id: 9e4ee3f9-ff9d-5e43-acf6-87620ee0be07
status: stable
level: medium
description: |
  The following analytic detects the creation of files in the Windows %startup% folder, a common persistence technique. It leverages the Endpoint.Filesystem data model to identify file creation events in this specific directory. This activity is significant because adversaries often use the startup folder to ensure their malicious code executes automatically upon system boot or user logon. If confirmed malicious, this could allow attackers to maintain persistence on the host, potentially leading t
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    file_path: '*\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\*'
  condition: selection
tags:
  - attack.t1547.001
references:
  - https://attack.mitre.org/techniques/T1204/002/
  - https://www.fortinet.com/blog/threat-research/chaos-ransomware-variant-sides-with-russia
custom_attributes:
  original_rule_id: 99d157cb-923f-4a00-aee9-1f385412146f
  source_format: splunk_spl