title: Windows Privileged Group Modification
id: b3c660b6-29ca-5b91-a8b7-c6fe89ef458a
status: stable
level: high
description: |
  This analytic detects modifications to privileged groups in Active Directory, including creation, deletion, and changes to various types of groups such as local, global, universal, and LDAP query groups. It specifically monitors for changes to high-privilege groups like "Administrators", "Domain Admins", "Enterprise Admins", and "ESX Admins", among others. This detection is particularly relevant in the context of potential exploitation of vulnerabilities like the VMware ESXi Active Directory Int
author: Brandon Sternfield, Optiv + ClearShark
logsource:
  product: windows
detection:
  selection:
    eventcode:
      - 4727
      - 4731
      - 4744
      - 4749
      - 4754
      - 4759
      - 4783
      - 4790
    targetusername:
      - Account Operators
      - Administrators
      - Admins DNS
      - Backup Operators
      - DnsAdmins
      - Domain Admins
      - Enterprise Admins
      - Enterprise Key Admins
      - ESX Admins
      - ESXi Admins
      - Group Policy Creator Owners
      - Hyper-V Administrators
      - Key Admins
      - Print Operators
      - Remote Desktop Users
      - Remote Management Users
      - Replicators
      - Schema Admins
      - Server Operators
  condition: selection
tags:
  - attack.t1136.001
  - attack.t1136.002
references:
  - https://nvd.nist.gov/vuln/detail/CVE-2024-37085
  - https://www.rapid7.com/blog/post/2024/07/30/vmware-esxi-cve-2024-37085-targeted-in-ransomware-campaigns/%5C
  - https://x.com/mthcht/status/1818196168515461431?s=12&t=kwffmj0KM1sZtg3MrqC0QQ
custom_attributes:
  original_rule_id: b8cbef2c-2cc3-4550-b0fc-9715b7852df9
  source_format: splunk_spl