title: Windows Modify Show Compress Color And Info Tip Registry
id: 2726e980-9d51-5c30-8c6c-317ec9e1726f
status: stable
level: high
description: |
  The following analytic detects suspicious modifications to the Windows registry keys related to file compression color and information tips. It leverages data from the Endpoint.Registry data model, specifically monitoring changes to the "ShowCompColor" and "ShowInfoTip" values under the "Microsoft\\Windows\\CurrentVersion\\Explorer\\Advanced" path. This activity is significant as it was observed in the Hermetic Wiper malware, indicating potential malicious intent to alter file attributes and use
author: Teoderick Contreras, Splunk, Steven Dick
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Advanced*'
    registry_value_name:
      - ShowCompColor
      - ShowInfoTip
  condition: selection
tags:
  - attack.t1112
references:
  - https://blog.talosintelligence.com/2022/02/threat-advisory-hermeticwiper.html
custom_attributes:
  original_rule_id: b7548c2e-9a10-11ec-99e3-acde48001122
  source_format: splunk_spl