title: Windows Service Stop Win Updates
id: a4dfe93f-f874-5ae2-b8cb-ad16f22b4064
status: stable
level: medium
description: |
  The following analytic detects the disabling of Windows Update services, such as "Update Orchestrator Service for Windows Update," "WaaSMedicSvc," and "Windows Update." It leverages Windows System Event ID 7040 logs to identify changes in service start modes to 'disabled.' This activity is significant as it can indicate an adversary's attempt to evade defenses by preventing critical updates, leaving the system vulnerable to exploits. If confirmed malicious, this could allow attackers to maintain
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 7040
    param3: disabled
    service_name:
      - Update Orchestrator Service for Windows Update
      - WaaSMedicSvc
      - Windows Update
    param1:
      - UsoSvc
      - WaaSMedicSvc
      - wuauserv
  condition: selection
tags:
  - attack.t1489
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.redline_stealer
custom_attributes:
  original_rule_id: 0dc25c24-6fcf-456f-b08b-dd55a183e4de
  source_format: splunk_spl