title: Windows DLL Module Loaded in Temp Dir
id: 542aed9c-7999-546b-a759-04d3d02b7bb3
status: stable
level: low
description: |
  The following analytic detects instances where a Dynamic Link Library (DLL) is loaded from a temporary directory on a Windows system. Loading DLLs from non-standard paths such as %TEMP% is uncommon for legitimate applications and is often associated with adversary tradecraft, including DLL search order hijacking, side-loading, or execution of malicious payloads staged in temporary folders. Adversaries frequently leverage these directories because they are writable by standard users and often ove
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    imageloaded:
      - 'C:\\Program Files*'
    eventcode: 7
  condition: selection
tags:
  - attack.t1105
references:
  - https://www.cisa.gov/news-events/cybersecurity-advisories/aa25-203a
  - https://blog.sekoia.io/interlock-ransomware-evolving-under-the-radar/
custom_attributes:
  original_rule_id: c2998141-235a-4e31-83cf-46afb5208a87
  source_format: splunk_spl