title: Windows MSC EvilTwin Directory Path Manipulation
id: 16da8222-24dc-5bf1-9ee6-aee080859054
status: stable
level: high
description: |
  The following analytic detects potential MSC EvilTwin loader exploitation, which manipulates directory paths with spaces to bypass security controls. The technique, described as CVE-2025-26633, involves crafting malicious MSC files that leverage MUIPath parameter manipulation. This detection focuses on suspicious MSC file execution patterns with unconventional command-line parameters, particularly those containing unusual spaces in Windows System32 paths or suspicious additional parameters after
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    process_name: mmc.exe
    process: (?i).*mmc\.exe.*((Windows\s+\\\\System32)|(Windows\s+System32)|(\\\\Windows\s+\\\\System32)|(Program\s+Files\s+\\\\)|(Program\s+Files\s+\(\\w+\)\s+\\\\)|(Progra~1\s+\\\\))
  condition: selection
tags:
  - attack.t1218
  - attack.t1036.005
  - attack.t1203
references:
  - https://securityintelligence.com/posts/new-threat-actor-water-gamayun-targets-telecom-finance/
  - https://www.ncsc.gov.uk/report/weekly-threat-report-12th-april-2024
custom_attributes:
  original_rule_id: 7f6b8a95-3fb7-429a-8c53-e5d4f8d92a10
  source_format: splunk_spl