title: Windows Input Capture Using Credential UI Dll
id: b0c14455-6180-5de8-85b3-3fb2b34fcc8f
status: stable
level: low
description: |
  The following analytic detects a process loading the credui.dll or wincredui.dll module. This detection leverages Sysmon EventCode 7 to identify instances where these DLLs are loaded by processes outside typical system directories. This activity is significant because adversaries often abuse these modules to create fake credential prompts or dump credentials, posing a risk of credential theft. If confirmed malicious, this activity could allow attackers to harvest user credentials, leading to una
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    imageloaded:
      - '*\\credui.dll'
      - '*\\wincredui.dll'
    originalfilename:
      - credui.dll
      - wincredui.dll
    eventcode: 7
    image:
      - '*\\windows\\explorer.exe'
      - '*\\windows\\system32\\*'
      - '*\\windows\\sysWow64\\*'
      - '*:\\program files*'
  condition: selection
tags:
  - attack.t1056.002
references:
  - https://docs.microsoft.com/en-us/windows/win32/api/wincred/nf-wincred-creduipromptforcredentialsa
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.002/T1056.002.md#atomic-test-2---powershell---prompt-user-for-password
custom_attributes:
  original_rule_id: 406c21d6-6c75-4e9f-9ca9-48049a1dd90e
  source_format: splunk_spl