title: Windows RMM Named Pipe
id: a69cc24e-953e-5bd7-a0ce-c234d28261f3
status: stable
level: medium
description: |
  The following analytic detects the creation or connection to known suspicious named pipes, which is a technique often used by offensive tools. It leverages Sysmon EventCodes 17 and 18 to identify  known default pipe names used by RMM tools. If confirmed malicious,  this could allow an attacker to abuse these to potentially gain persistence, command and control, or further system compromise.
author: Raven Tait, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 17
    process_path:
      - '*:\\Program Files \(x86\'
  condition: selection
tags:
  - attack.t1559
  - attack.t1021.002
  - attack.t1055
references:
  - https://attack.mitre.org/techniques/T1218/009/
  - https://docs.microsoft.com/en-us/windows/win32/ipc/named-pipes
custom_attributes:
  original_rule_id: c07c7138-edf5-4a16-8b24-3842599235bf
  source_format: splunk_spl