title: Windows Masquerading Explorer As Child Process
id: 165378d3-ec5d-5769-8135-aa6559b2af21
status: stable
level: high
description: |
  The following analytic identifies instances where explorer.exe is spawned by unusual parent processes such as cmd.exe, powershell.exe, or regsvr32.exe. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and parent process relationships. This activity is significant because explorer.exe is typically initiated by userinit.exe, and deviations from this norm can indicate code injection or process masquerading attempts by malware like Qakbot. If confi
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    process_name: explorer.exe
    parent_process_name:
      - cmd.exe
      - powershell.exe
      - regsvr32.exe
    process:
      - '*\\explorer.exe'
  condition: selection
tags:
  - attack.t1574.001
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.qakbot
custom_attributes:
  original_rule_id: 61490da9-52a1-4855-a0c5-28233c88c481
  source_format: splunk_spl