title: Windows Credentials from Password Stores Chrome LocalState Access
id: 6d5c7a83-17c8-5458-9f50-6b995f0bc2d4
status: stable
level: medium
description: |
  The following analytic detects non-Chrome processes accessing the Chrome "Local State" file, which contains critical settings and information. It leverages Windows Security Event logs, specifically event code 4663, to identify this behavior. This activity is significant because threat actors can exploit this file to extract the encrypted master key used for decrypting saved passwords in Chrome. If confirmed malicious, this could lead to unauthorized access to sensitive information, posing a seve
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    object_file_path: '*\\AppData\\Local\\Google\\Chrome\\User Data\\Local State'
    eventcode: 4663
    process_name:
      - '*\\chrome.exe'
      - '*:\\Windows\\explorer.exe'
  condition: selection
tags:
  - attack.t1012
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.redline_stealer
custom_attributes:
  original_rule_id: 3b1d09a8-a26f-473e-a510-6c6613573657
  source_format: splunk_spl