title: Windows Visual Basic Commandline Compiler DNSQuery
id: 093f2c94-fe61-52e5-89c6-68aae282f9ba
status: stable
level: high
description: |
  The following analytic detects instances where vbc.exe, the Visual Basic Command Line Compiler, initiates DNS queries. Normally, vbc.exe operates locally to compile Visual Basic code and does not require internet access or to perform DNS lookups. Therefore, any observed DNS activity originating from vbc.exe is highly suspicious and indicative of potential malicious activity. This behavior often suggests that a malicious payload is masquerading as the legitimate vbc.exe process to establish comma
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    process_name: vbc.exe
    eventcode: 22
  condition: selection
tags:
  - attack.t1071.004
references:
  - https://www.cisa.gov/news-events/cybersecurity-advisories/aa20-266a
custom_attributes:
  original_rule_id: 8976744a-ae7a-46a4-8128-690df85c2af4
  source_format: splunk_spl