title: Windows Office Product Dropped Cab or Inf File
id: a5a404d7-a1ea-59ad-9224-abb591534b28
status: stable
level: high
description: |
  The following analytic detects Office products writing .cab or .inf files, indicative of CVE-2021-40444 exploitation. It leverages the Endpoint.Processes and Endpoint.Filesystem data models to identify Office applications creating these file types. This activity is significant as it may signal an attempt to load malicious ActiveX controls and download remote payloads, a known attack vector. If confirmed malicious, this could lead to remote code execution, allowing attackers to gain control over 
author: Michael Haag, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    span:
      - 1h
      - 1h
    file_name:
      - '*.cab'
      - '*.inf'
  condition: selection
tags:
  - attack.t1566.001
references:
  - https://twitter.com/vxunderground/status/1436326057179860992?s=20
  - https://app.any.run/tasks/36c14029-9df8-439c-bba0-45f2643b0c70/
  - https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-40444
  - https://twitter.com/RonnyTNL/status/1436334640617373699?s=20
  - https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/trojanized-onenote-document-leads-to-formbook-malware/
custom_attributes:
  original_rule_id: dbdd251e-dd45-4ec9-a555-f5e151391746
  source_format: splunk_spl