title: Windows AD Object Owner Updated
id: caca90fd-da1c-5ce7-9599-760b51141e5d
status: stable
level: high
description: |
  AD Object Owner Updated. The owner provides Full control level privileges over the target AD Object. This event has significant impact alone and is also a precursor activity for hiding an AD object.
author: Dean Luxton
logsource:
  product: windows
detection:
  selection:
    eventcode: 5136
    field:
      - old_value
      - new_value
  condition: selection
tags:
  - attack.t1222.001
  - attack.t1484
references:
  - https://learn.microsoft.com/en-us/windows/win32/secauthz/ace-strings
  - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-adts/1522b774-6464-41a3-87a5-1e5633c3fbbb
  - https://trustedsec.com/blog/a-hitchhackers-guide-to-dacl-based-detections-part-1-a
  - https://lantern.splunk.com/Security/Product_Tips/Enterprise_Security/Enabling_an_audit_trail_from_Active_Directory
custom_attributes:
  original_rule_id: 4af01f6b-d8d4-4f96-8635-758a01557130
  source_format: splunk_spl