title: Windows Bypass UAC via Pkgmgr Tool
id: 71386bf5-f72a-5953-a0d2-7e28d2719582
status: stable
level: medium
description: |
  The following analytic detects the execution of the deprecated 'pkgmgr.exe' process with an XML input file, which is unusual and potentially suspicious. This detection leverages Endpoint Detection and Response (EDR) telemetry, focusing on process execution details and command-line arguments. The significance lies in the deprecated status of 'pkgmgr.exe' and the use of XML files, which could indicate an attempt to bypass User Account Control (UAC). If confirmed malicious, this activity could allo
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    process: '*.xml*'
    parent_process_path:
      - '*:\\windows\\system32\\*'
      - '*:\\windows\\syswow64\\*'
      - '*:\\Program Files*'
  condition: selection
tags:
  - attack.t1548.002
references:
  - https://asec.ahnlab.com/en/17692/
  - https://www.blackberry.com/us/en/solutions/endpoint-security/ransomware-protection/warzone#:~:text=Warzone%20RAT%20(AKA%20Ave%20Maria)%20is%20a%20remote%20access%20trojan,is%20as%20an%20information%20stealer.
custom_attributes:
  original_rule_id: cce58e2c-988a-4319-9390-0daa9eefa3cd
  source_format: splunk_spl