title: Windows Query Registry UnInstall Program List
id: 58c5d2f6-e50a-5a76-899d-e3e68fc1aa76
status: stable
level: medium
description: |
  The following analytic detects an access request on the uninstall registry key. It leverages Windows Security Event logs, specifically event code 4663. This activity is significant because adversaries or malware can exploit this key to gather information about installed applications, aiding in further attacks. If confirmed malicious, this behavior could allow attackers to map out installed software, potentially identifying vulnerabilities or software to exploit, leading to further system comprom
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    object_file_path: '*\\Microsoft\\Windows\\CurrentVersion\\Uninstall\\*'
    eventcode: 4663
  condition: selection
tags:
  - attack.t1012
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.redline_stealer
custom_attributes:
  original_rule_id: 535fd4fc-7151-4062-9d7e-e896bea77bf6
  source_format: splunk_spl