title: Windows Credentials from Password Stores Creation
id: cc52c969-8b98-5f13-8b47-268967482336
status: stable
level: high
description: |
  The following analytic detects the execution of the Windows OS tool cmdkey.exe, which is used to create stored usernames, passwords, or credentials. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs and command-line arguments. This activity is significant because cmdkey.exe is often abused by post-exploitation tools and malware, such as Darkgate, to gain unauthorized access. If confirmed malicious, this behavior could allow attack
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    process_name: cmdkey.exe
    original_file_name: cmdkey.exe
    process:
      - '*/user*'
      - '*/password*'
  condition: selection
tags:
  - attack.t1555
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.darkgate
custom_attributes:
  original_rule_id: c0c5a479-bf57-4ca0-af3a-4c7081e5ba05
  source_format: splunk_spl