title: Windows Mimikatz Binary Execution
id: 6b20ac92-669c-549d-bcef-fdff3a629a39
status: stable
level: high
description: |
  The following analytic identifies the execution of the native mimikatz.exe binary on Windows systems, including instances where the binary is renamed. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and original file names. This activity is significant because Mimikatz is a widely used tool for extracting authentication credentials, posing a severe security risk. If confirmed malicious, this activity could allow attackers to obtain sensitive credent
author: Michael Haag, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1003
references:
  - https://www.cisa.gov/uscert/sites/default/files/publications/aa22-320a_joint_csa_iranian_government-sponsored_apt_actors_compromise_federal%20network_deploy_crypto%20miner_credential_harvester.pdf
  - https://www.varonis.com/blog/what-is-mimikatz
  - https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF
custom_attributes:
  original_rule_id: a9e0d6d3-9676-4e26-994d-4e0406bb4467
  source_format: splunk_spl