title: Windows Compatibility Telemetry Suspicious Child Process
id: abf28807-5b41-53e8-a6eb-bec33fda1e17
status: stable
level: high
description: |
  The following analytic detects the execution of CompatTelRunner.exe with parameters indicative of a process not part of the normal "Microsoft Compatibility Appraiser" telemetry collection. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names, parent processes, and command-line arguments. This activity is significant because CompatTelRunner.exe and the "Microsoft Compatibility Appraiser" task always run as System and can be used to elevate privileges or e
author: Steven Dick
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    parent_process_name: CompatTelRunner.exe
    process:
      - '* -m:*'
  condition: selection
tags:
  - attack.t1546
  - attack.t1053.005
references:
  - https://attack.mitre.org/techniques/T1546/
  - https://scythe.io/threat-thursday/windows-telemetry-persistence
  - https://www.trustedsec.com/blog/abusing-windows-telemetry-for-persistence
custom_attributes:
  original_rule_id: 56fe46ca-ffef-46fe-8f0e-5cd4b7b4cc0c
  source_format: splunk_spl