title: Windows Local Administrator Credential Stuffing
id: 5d7e4db0-ef22-57e5-b5ce-d718f163fcd5
status: stable
level: high
description: |
  The following analytic detects attempts to authenticate using the built-in local Administrator account across more than 30 endpoints within a 5-minute window. It leverages Windows Event Logs, specifically events 4625 and 4624, to identify this behavior. This activity is significant as it may indicate an adversary attempting to validate stolen local credentials across multiple hosts, potentially leading to privilege escalation. If confirmed malicious, this could allow the attacker to gain widespr
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    eventcode:
      - 4625
      - 4624
    logon_type: 3
    targetusername: Administrator
    span: 5m
  condition: selection
tags:
  - attack.t1110.004
references:
  - https://attack.mitre.org/techniques/T1110/004/
  - https://attack.mitre.org/techniques/T1110/
  - https://www.blackhillsinfosec.com/wide-spread-local-admin-testing/
  - https://www.pentestpartners.com/security-blog/admin-password-re-use-dont-do-it/
  - https://www.praetorian.com/blog/microsofts-local-administrator-password-solution-laps/
custom_attributes:
  original_rule_id: 09555511-aca6-484a-b6ab-72cd03d73c34
  source_format: splunk_spl