title: Windows Network Connection Discovery Via Net
id: 7056afb1-1fc6-5786-924b-5d0e1a9382c6
status: stable
level: low
description: |
  The following analytic identifies the execution of `net.exe` with command-line arguments used to list or display information about computer connections. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. This activity can be significant as it indicates potential network reconnaissance by adversaries or Red Teams, aiming to gather situational awareness and Active Directory information. If confirmed malicious, this behavior c
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    process_name: net.exe
    original_file_name: net.exe
  condition: selection
tags:
  - attack.t1049
references:
  - https://attack.mitre.org/techniques/T1049/
custom_attributes:
  original_rule_id: 86a5b949-679b-4197-8d4c-9c180a818c45
  source_format: splunk_spl