title: Windows Powershell Cryptography Namespace
id: 14341b76-e465-5b95-b019-27b8ddecc369
status: stable
level: medium
description: |
  The following analytic detects suspicious PowerShell script execution involving the cryptography namespace via EventCode 4104. It leverages PowerShell Script Block Logging to identify scripts using cryptographic functions, excluding common hashes like SHA and MD5. This activity is significant as it is often associated with malware that decrypts or decodes additional malicious payloads. If confirmed malicious, this could allow an attacker to execute further code, escalate privileges, or establish
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    scriptblocktext:
      - '*SHA*'
      - '*MD5*'
      - '*DeriveBytes*'
    eventcode: 4104
  condition: selection
tags:
  - attack.t1059.001
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.asyncrat
custom_attributes:
  original_rule_id: f8b482f4-6d62-49fa-a905-dfa15698317b
  source_format: splunk_spl