title: Windows Impair Defense Change Win Defender Throttle Rate
id: 79b2202b-a266-59d0-b7c5-a3f91597c3ca
status: stable
level: high
description: |
  The following analytic detects modifications to the ThrottleDetectionEventsRate registry setting in Windows Defender. It leverages data from the Endpoint.Registry datamodel to identify changes in the registry path related to Windows Defender's event logging rate. This activity is significant because altering the ThrottleDetectionEventsRate can reduce the frequency of logged detection events, potentially masking malicious activities. If confirmed malicious, this could allow an attacker to evade d
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    registry_path: '*\\Windows Defender\\NIS\\Consumers\\IPS\\ThrottleDetectionEventsRate'
  condition: selection
tags:
  - attack.t1562.001
references:
  - https://x.com/malmoeb/status/1742604217989415386?s=20
  - https://github.com/undergroundwires/privacy.sexy
custom_attributes:
  original_rule_id: f7da5fca-9261-43de-a4d0-130dad1e4f4d
  source_format: splunk_spl