title: Windows Process Injection In Non-Service SearchIndexer
id: 2e5a082f-2881-5027-8e0a-f163c93f53e6
status: stable
level: high
description: |
  The following analytic identifies instances of the searchindexer.exe process that are not spawned by services.exe, indicating potential process injection. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and parent processes. This activity is significant because QakBot malware often uses a fake searchindexer.exe to evade detection and perform malicious actions such as data exfiltration and keystroke logging. If confirmed malicious, this a
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1055
references:
  - https://twitter.com/Max_Mal_/status/1736392741758611607
  - https://twitter.com/1ZRR4H/status/1735944522075386332
custom_attributes:
  original_rule_id: d131673f-ede1-47f2-93a1-0108d3e7fafd
  source_format: splunk_spl