title: Windows Multiple Users Failed To Authenticate From Process
id: 8f8a985d-f0db-5a5a-af8f-f59744357981
status: stable
level: high
description: |
  The following analytic detects a source process failing to authenticate with 30 unique users, indicating a potential Password Spraying attack. It leverages Windows Event 4625 with Logon Type 2, collected from domain controllers, member servers, and workstations. This activity is significant as it may represent an adversary attempting to gain initial access or elevate privileges within an Active Directory environment. If confirmed malicious, this could lead to unauthorized access, privilege escal
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    eventcode: 4625
    logon_type: 2
    span: 5m
  filter:
    processname: '-'
  condition: selection and not filter
tags:
  - attack.t1110.003
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4625
  - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4625
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/basic-audit-logon-events
custom_attributes:
  original_rule_id: 9015385a-9c84-11eb-bef2-acde48001122
  source_format: splunk_spl