title: Windows Identify Protocol Handlers
id: abf1fe20-b14b-57df-9d0c-aa3659e5b35d
status: stable
level: low
description: |
  The following analytic identifies the use of protocol handlers executed via the command line. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and command-line telemetry. This activity is significant because protocol handlers can be exploited to execute arbitrary commands or launch applications, potentially leading to unauthorized actions. If confirmed malicious, an attacker could use this technique to gain code execution, escalate privileges, or maintain 
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    ishandler: 'TRUE'
  condition: selection
tags:
  - attack.t1059
references:
  - https://gist.github.com/MHaggis/a0d3edb57d36e0916c94c0a464b2722e
  - https://www.oreilly.com/library/view/learning-java/1565927184/apas02.html
  - https://blogs.windows.com/msedgedev/2022/01/20/getting-started-url-protocol-handlers-microsoft-edge/
  - https://github.com/Mr-Un1k0d3r/PoisonHandler
  - https://www.mdsec.co.uk/2021/03/phishing-users-to-take-a-test/
custom_attributes:
  original_rule_id: bd5c311e-a6ea-48ae-a289-19a3398e3648
  source_format: splunk_spl