title: Windows Njrat Fileless Storage via Registry
id: ddec6423-b412-50d4-904f-1960501f6139
status: stable
level: high
description: |
  The following analytic detects suspicious registry modifications indicative of NjRat's fileless storage technique. It leverages the Endpoint.Registry data model to identify specific registry paths and values commonly used by NjRat for keylogging and executing DLL plugins. This activity is significant as it helps evade traditional file-based detection systems, making it crucial for SOC analysts to monitor. If confirmed malicious, this behavior could allow attackers to persist on the host, execute
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    registry_path: '*\\[kl]'
    registry_value_data:
      - '*[ENTER]*'
      - '*[TAP]*'
      - '*[Back]*'
  condition: selection
tags:
  - attack.t1027.011
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.njrat
custom_attributes:
  original_rule_id: a5fffbbd-271f-4980-94ed-4fbf17f0af1c
  source_format: splunk_spl