title: Windows AD Short Lived Domain Account ServicePrincipalName
id: 0a6eedc4-fd57-5969-93a9-41acceda3652
status: stable
level: high
description: |
  The following analytic identifies the addition and quick deletion of a Service Principal Name (SPN) to a domain account within 5 minutes. This detection leverages EventCode 5136 from the Windows Security Event Log, focusing on changes to the servicePrincipalName attribute. This activity is significant as it may indicate an attempt to perform Kerberoasting, a technique used to crack the cleartext password of a domain account offline. If confirmed malicious, this could allow an attacker to gain un
author: Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    operationtype:
      - '%%14674'
      - '%%14675'
    eventcode:
      - 5136
      - 5136
      - 5136
    attributeldapdisplayname: servicePrincipalName
    short_lived: 'TRUE'
  condition: selection
tags:
  - attack.t1098
references:
  - https://adsecurity.org/?p=3466
  - https://www.thehacker.recipes/ad/movement/dacl/targeted-kerberoasting
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5136
  - https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/t1208-kerberoasting
custom_attributes:
  original_rule_id: b681977c-d90c-4efc-81a5-c58f945fb541
  source_format: splunk_spl