title: Windows Identify PowerShell Web Access IIS Pool
id: 0c578c37-2126-52f8-a815-33783491f74b
status: stable
level: low
description: |
  This analytic detects and analyzes PowerShell Web Access (PSWA) usage in Windows environments. It tracks both connection attempts (EventID 4648) and successful logons (EventID 4624) associated with PSWA, providing a comprehensive view of access patterns. The analytic identifies PSWA's operational status, host servers, processes, and connection metrics. It highlights unique target accounts, domains accessed, and verifies logon types. This information is crucial for detecting potential misuse, suc
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    subjectusername: pswa_pool
    pswa_running: 'Yes'
    eventcode:
      - 4648
      - 4624
  condition: selection
tags:
  - attack.t1190
references:
  - https://www.cisa.gov/news-events/cybersecurity-advisories/aa24-241a
  - https://gist.github.com/MHaggis/7e67b659af9148fa593cf2402edebb41
custom_attributes:
  original_rule_id: d8419343-f0f8-4d8e-91cc-18bb531df87d
  source_format: splunk_spl