title: Windows Process Injection With Public Source Path
id: 96554cd2-cf75-53a8-a052-8621553dd5f3
status: stable
level: low
description: |
  The following analytic detects a process from a non-standard file path on Windows attempting to create a remote thread in another process. This is identified using Sysmon EventCode 8, focusing on processes not originating from typical system directories. This behavior is significant as it often indicates process injection, a technique used by adversaries to evade detection or escalate privileges. If confirmed malicious, this activity could allow an attacker to execute arbitrary code within anoth
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    targetimage: '*.exe'
    eventcode: 8
    sourceimage:
      - 'C:\\Windows\\*'
      - 'C:\\Program File*'
      - '%systemroot%\\*'
  condition: selection
tags:
  - attack.t1055.002
references:
  - https://unit42.paloaltonetworks.com/brute-ratel-c4-tool/
custom_attributes:
  original_rule_id: 492f09cf-5d60-4d87-99dd-0bc325532dda
  source_format: splunk_spl