title: Windows Multiple Invalid Users Fail To Authenticate Using Kerberos
id: e86bce63-fa99-5c3c-80f4-f54cd977e415
status: stable
level: high
description: |
  The following analytic identifies a source endpoint failing to authenticate with 30 unique invalid domain users using the Kerberos protocol. This detection leverages EventCode 4768, specifically looking for failure code 0x6, indicating the user is not found in the Kerberos database. This activity is significant as it may indicate a Password Spraying attack, where an adversary attempts to gain initial access or elevate privileges. If confirmed malicious, this could lead to unauthorized access or 
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    eventcode: 4768
    status: 0x6
    span: 5m
  condition: selection
tags:
  - attack.t1110.003
references:
  - https://attack.mitre.org/techniques/T1110/003/
custom_attributes:
  original_rule_id: 001266a6-9d5b-11eb-829b-acde48001122
  source_format: splunk_spl