title: Windows Phishing PDF File Executes URL Link
id: 7f104898-2888-5ea4-93a8-8f7d449cf44b
status: stable
level: medium
description: |
  The following analytic detects suspicious PDF viewer processes spawning browser application child processes. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and parent process names. This activity is significant as it may indicate a PDF spear-phishing attempt where a malicious URL link is executed, leading to potential payload download. If confirmed malicious, this could allow attackers to execute code, escalate privileges, or persist in the environment b
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    parent_process_name:
      - AcroRd32.exe
      - FoxitPDFReader.exe
    process_name:
      - firefox.exe
      - chrome.exe
      - iexplore.exe
  condition: selection
tags:
  - attack.t1566.001
references:
  - https://twitter.com/pr0xylife/status/1615382907446767616?s=20
custom_attributes:
  original_rule_id: 2fa9dec8-9d8e-46d3-96c1-202c06f0e6e1
  source_format: splunk_spl