title: Windows Credentials from Web Browsers Saved in TEMP Folder
id: cb520cdf-3a86-5095-8740-9e30c0bca5f0
status: stable
level: high
description: |
  The following analytic detects the creation of files containing passwords, cookies, and saved login account information by the Braodo stealer malware in temporary folders. Braodo often collects these credentials from browsers and applications, storing them in temp directories before exfiltration. This detection focuses on monitoring for the creation of files with patterns or formats commonly associated with stolen credentials. By identifying these activities, security teams can take needed actio
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    file_path: '*\\temp\\*'
    file_name:
      - login*
      - pass*
      - cookie*
      - master_key*
  condition: selection
tags:
  - attack.t1555.003
references:
  - https://x.com/suyog41/status/1825869470323056748
  - https://g0njxa.medium.com/from-vietnam-to-united-states-malware-fraud-and-dropshipping-98b7a7b2c36d
custom_attributes:
  original_rule_id: b36b23ea-763c-417b-bd4a-6a378dabad1a
  source_format: splunk_spl