title: Windows IIS Components New Module Added
id: 06dfdaf4-4d5c-5917-9cf6-2575801a6218
status: stable
level: high
description: |
  The following analytic detects the addition of new IIS modules on a Windows IIS server. It leverages the Windows Event log - Microsoft-IIS-Configuration/Operational, specifically EventCode 29, to identify this activity. This behavior is significant because IIS modules are rarely added to production servers, and unauthorized modules could indicate malicious activity. If confirmed malicious, an attacker could use these modules to execute arbitrary code, escalate privileges, or maintain persistence
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 29
  condition: selection
tags:
  - attack.t1505.004
references:
  - https://gist.github.com/MHaggis/64396dfd9fc3734e1d1901a8f2f07040
  - https://www.microsoft.com/en-us/security/blog/2022/12/12/iis-modules-the-evolution-of-web-shells-and-how-to-detect-them/
  - https://www.crowdstrike.com/wp-content/uploads/2022/05/crowdstrike-iceapple-a-novel-internet-information-services-post-exploitation-framework-1.pdf
  - https://unit42.paloaltonetworks.com/unit42-oilrig-uses-rgdoor-iis-backdoor-targets-middle-east/
  - https://www.secureworks.com/research/bronze-union
custom_attributes:
  original_rule_id: 55f22929-cfd3-4388-ba5c-4d01fac7ee7e
  source_format: splunk_spl