title: Windows Unusual Intelliform Storage Registry Access
id: 7582539e-a607-59fe-9384-e060354652b0
status: stable
level: medium
description: |
  The following analytic identifies processes accessing Intelliform Storage Registry keys used by Internet Explorer. It leverages Windows Security Event logs, specifically monitoring EventCode 4663, which tracks object access events. This activity is significant because it can indicate unauthorized access or manipulation of sensitive registry keys used for storing form data in Internet Explorer. If confirmed malicious, this could lead to data exfiltration, credential theft, or further compromise o
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    eventcode: 4663
    processname:
      - 'C:\\Program Files\\Internet Explorer\\iexplore.exe'
      - 'C:\\Windows\\System32\\dllhost.exe'
      - 'C:\\Windows\\SysWow64\\dllhost.exe'
    objectname:
      - '*Software\\microsoft\\Internet Explorer\\Intelliforms\\storage2*'
  condition: selection
tags:
  - attack.t1552.001
references:
  - https://stackoverflow.com/questions/1276700/where-does-internet-explorer-stores-its-form-data-history-that-is-uses-for-auto
custom_attributes:
  original_rule_id: 99d69078-7dae-4ffe-9f3d-063242772f5a
  source_format: splunk_spl