title: Windows Excessive Service Stop Attempt
id: cbefd557-b0e6-532d-bc15-b37d7dc19110
status: stable
level: high
description: |
  The following analytic detects multiple attempts to stop or delete services on a system using `net.exe` or `sc.exe`. It leverages Endpoint Detection and Response (EDR) telemetry, focusing on process names and command-line executions within a one-minute window. This activity is significant as it may indicate an adversary attempting to disable security or critical services to evade detection and further their objectives. If confirmed malicious, this could lead to the attacker gaining persistence, 
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    process:
      - '*stop*'
      - '*delete*'
    span: 1m
  condition: selection
tags:
  - attack.t1489
references:
  - https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
custom_attributes:
  original_rule_id: 8f3a614f-6b98-4f7d-82dd-d0df38452a8b
  source_format: splunk_spl