title: Windows InstallUtil Remote Network Connection
id: 67948a89-ac22-5b84-a578-da24b9252382
status: stable
level: medium
description: |
  The following analytic detects the Windows InstallUtil.exe binary making a remote network connection. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and network telemetry. This activity is significant because InstallUtil.exe can be exploited to download and execute malicious code, bypassing application control mechanisms. If confirmed malicious, an attacker could achieve code execution, potentially leading to further system compromise, data exfiltration,
author: Michael Haag, Splunk
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    span: 1h
  condition: selection
tags:
  - attack.t1218.004
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.004/T1218.004.md
custom_attributes:
  original_rule_id: 4fbf9270-43da-11ec-9486-acde48001122
  source_format: splunk_spl