title: Windows Disable Internet Explorer Addons
id: 96a50471-164c-518b-90a8-b57a871296f8
status: stable
level: medium
description: |
  The following analytic detects the execution of iexplore.exe (Internet Explorer) with the -extoff command-line flag, which disables all browser extensions. This flag is commonly abused by adversaries to launch a clean browser session that bypasses security controls such as antivirus browser extensions, toolbars, or group policy-enforced add-ons. Malicious documents or scripts may leverage iexplore.exe -extoff to open phishing pages, command-and-control interfaces, or download additional payloads
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    process_name: iexplore.exe
    original_file_name: IEXPLORE.EXE
    process: '*-extoff*'
  condition: selection
tags:
  - attack.t1176.001
references:
  - https://www.hybrid-analysis.com/sample/e285feeca968b3ca22017a64363eea5e69ccd519696671df523291b089597875/588175f1aac2edf92bbed32f
custom_attributes:
  original_rule_id: 65224d8b-b95d-44ec-bb44-408d830c1258
  source_format: splunk_spl