title: Windows AD Privileged Group Modification
id: ca8296f8-b1e2-5f5b-bd7a-d0c57efe2388
status: stable
level: high
description: Detect users added to privileged AD Groups.
author: Dean Luxton
logsource:
  product: windows
detection:
  selection:
    category: privileged
    eventcode:
      - 4728
  condition: selection
tags:
  - attack.t1098
references:
  - https://splunkbase.splunk.com/app/6853
custom_attributes:
  original_rule_id: 187bf937-c436-4c65-bbcb-7539ffe02da1
  source_format: splunk_spl