title: Windows Modify Registry Do Not Connect To Win Update
id: 8b652943-abb6-51f1-a0b5-7a2e1d8e0c48
status: stable
level: medium
description: |
  The following analytic detects a suspicious modification to the Windows registry that disables automatic updates. It leverages data from the Endpoint datamodel, specifically monitoring changes to the registry path "*\\SOFTWARE\\Policies\\Microsoft\\Windows\\WindowsUpdate\\DoNotConnectToWindowsUpdateInternetLocations" with a value of "0x00000001". This activity is significant as it can be used by adversaries, including malware like RedLine Stealer, to evade detection and prevent the system from r
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*\\SOFTWARE\\Policies\\Microsoft\\Windows\\WindowsUpdate\\DoNotConnectToWindowsUpdateInternetLocations'
    registry_value_data: 0x00000001
  condition: selection
tags:
  - attack.t1112
references:
  - https://learn.microsoft.com/de-de/security-updates/windowsupdateservices/18127499
  - https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.WindowsUpdate::DoNotConnectToWindowsUpdateInternetLocations
custom_attributes:
  original_rule_id: e09c598e-8dd0-4e73-b740-4b96b689199e
  source_format: splunk_spl