title: Windows Screen Capture in TEMP folder
id: 23554adb-4937-572e-9920-ac16b9dfe449
status: stable
level: high
description: |
  The following analytic detects the creation of screen capture files by the Braodo stealer malware. This stealer is known to capture screenshots of the victim's desktop as part of its data theft activities. The detection focuses on identifying unusual screen capture activity, especially when images are saved in directories often used by malware, such as temporary or hidden folders. Monitoring for these files helps to quickly identify malicious screen capture attempts, allowing security teams to r
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    file_path: '*\\temp\\*'
    file_name:
      - screenshot.png
      - screenshot.jpg
      - screenshot.bmp
  condition: selection
tags:
  - attack.t1113
references:
  - https://x.com/suyog41/status/1825869470323056748
  - https://g0njxa.medium.com/from-vietnam-to-united-states-malware-fraud-and-dropshipping-98b7a7b2c36d
custom_attributes:
  original_rule_id: 00524d1f-a032-46f5-9108-e7d9f01bfb3c
  source_format: splunk_spl