title: Windows DNS Query Request To TinyUrl
id: 912ab2db-bcd0-5a2a-8260-927afc3e112d
status: stable
level: medium
description: |
  The following analytic detects a process located in a potentially suspicious location making DNS queries to known URL shortening services, specifically tinyurl. URL shorteners are frequently used by threat actors to obfuscate malicious destinations, including phishing pages, malware distribution sites, or command-and-control (C2) endpoints.  While tinyurl.com is a legitimate service, its use in enterprise environments—particularly by non-browser processes or scripts—should be considered suspicio
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    queryname: tinyurl.com
    eventcode: 22
    image:
      - '*\\AppData\\*'
      - '*\\Perflogs\\*'
      - '*\\ProgramData\\*'
      - '*\\Temp\\*'
      - '*\\Users\\Public\\*'
      - '*\\Windows\\Tasks\\*'
  condition: selection
tags:
  - attack.t1105
references:
  - https://x.com/Unit42_Intel/status/1919418143476199869
custom_attributes:
  original_rule_id: b1ea79da-719c-437c-acaf-5c93f838f425
  source_format: splunk_spl