title: Windows Unusual Count Of Users Failed To Authenticate Using NTLM
id: f7d0073a-dd08-527e-b3a8-d5c7c3c79c61
status: stable
level: medium
description: |
  The following analytic identifies a source endpoint failing to authenticate multiple valid users using the NTLM protocol, potentially indicating a Password Spraying attack. It leverages Event 4776 from Domain Controllers, calculating the standard deviation for each host and applying the 3-sigma rule to detect anomalies. This activity is significant as it may represent an adversary attempting to gain initial access or elevate privileges. If confirmed malicious, the attacker could compromise multi
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    eventcode: 4776
    status: 0xC000006A
    span: 2m
    isoutlier: 1
  condition: selection
tags:
  - attack.t1110.003
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/audit-credential-validation
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4776
custom_attributes:
  original_rule_id: 6f6c8fd7-6a6b-4af9-a0e9-57cfc47a58b4
  source_format: splunk_spl