title: Windows Suspect Process With Authentication Traffic
id: 80b8b006-fe49-5b53-bad8-8cff308753fc
status: stable
level: medium
description: |
  The following analytic detects executables running from public or temporary locations that are communicating over Windows domain authentication ports/protocols such as LDAP (389), LDAPS (636), and Kerberos (88). It leverages network traffic data to identify processes originating from user-controlled directories. This activity is significant because legitimate applications rarely run from these locations and attempt domain authentication, making it a potential indicator of compromise. If confirme
author: Steven Dick
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    field: app
    dest_port:
      - 88
      - 389
      - 636
    app:
      - '*\\users\\*'
      - '*\\programdata\\*'
      - '*\\temp\\*'
      - '*\\Windows\\Tasks\\*'
      - '*\\appdata\\*'
      - '*\\perflogs\\*'
  condition: selection
tags:
  - attack.t1087.002
  - attack.t1204.002
references:
  - https://attack.mitre.org/techniques/T1069/002/
  - https://book.hacktricks.xyz/network-services-pentesting/pentesting-kerberos-88
custom_attributes:
  original_rule_id: 953322db-128a-4ce9-8e89-56e039e33d98
  source_format: splunk_spl