title: Windows MOVEit Transfer Writing ASPX
id: 55a29795-b8a7-5463-81c6-d9d821a31040
status: stable
level: high
description: |
  The following analytic detects the creation of new ASPX files in the MOVEit Transfer application's "wwwroot" directory. It leverages endpoint data on process and filesystem activity to identify processes responsible for creating these files. This activity is significant as it may indicate exploitation of a critical zero-day vulnerability in MOVEit Transfer, used by threat actors to install malicious ASPX files. If confirmed malicious, this could lead to exfiltration of sensitive data, including 
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    file_path:
      - '*\\MOVEitTransfer\\wwwroot\\*'
    file_name:
      - '*.ashx'
      - '*.asp*'
  condition: selection
tags:
  - attack.t1190
  - attack.t1133
references:
  - https://community.progress.com/s/article/MOVEit-Transfer-Critical-Vulnerability-31May2023
  - https://www.reddit.com/r/sysadmin/comments/13wxuej/critical_vulnerability_moveit_file_transfer/
  - https://www.bleepingcomputer.com/news/security/new-moveit-transfer-zero-day-mass-exploited-in-data-theft-attacks/
  - https://www.reddit.com/r/sysadmin/comments/13wxuej/critical_vulnerability_moveit_file_transfer/
  - https://www.mandiant.com/resources/blog/zero-day-moveit-data-theft
custom_attributes:
  original_rule_id: c0ed2aca-5666-45b3-813f-ddfac3f3eda0
  source_format: splunk_spl