title: Windows Driver Load Non-Standard Path
id: 69a9cd76-9786-547f-852e-22fc21975ddf
status: stable
level: high
description: |
  The following analytic detects the loading of new Kernel Mode Drivers from non-standard paths using Windows EventCode 7045. It identifies drivers not located in typical directories like Windows, Program Files, or SystemRoot. This activity is significant because adversaries may use these non-standard paths to load malicious or vulnerable drivers, potentially bypassing security controls. If confirmed malicious, this could allow attackers to execute code at the kernel level, escalate privileges, or
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    servicetype: kernel mode driver
    eventcode: 7045
  filter:
    imagepath: '(?i)^(\w:\\\\Program Files\\\\|\w:\\\\Program Files \(x86\)\\\\|\w:\\\\Windows\\\\System32\\\\|\w:\\\\Windows\\\\SysWOW64\\\\|\w:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\Definition Updates\\\\|\w:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\Platform\\\\|%SystemRoot%|\\\\SystemRoot\\\\|SystemRoot\\\\)'
  condition: selection and not filter
tags:
  - attack.t1014
  - attack.t1068
references:
  - https://redcanary.com/blog/tracking-driver-inventory-to-expose-rootkits/
  - https://attack.mitre.org/techniques/T1014/
  - https://www.fuzzysecurity.com/tutorials/28.html
custom_attributes:
  original_rule_id: 9216ef3d-066a-4958-8f27-c84589465e62
  source_format: splunk_spl