title: Windows PowerShell Add Module to Global Assembly Cache
id: 5c3ebfb0-e54a-57b9-bddd-b663c926d7a3
status: stable
level: high
description: |
  The following analytic detects the addition of a DLL to the Windows Global Assembly Cache (GAC) using PowerShell. It leverages PowerShell Script Block Logging to identify commands containing "system.enterpriseservices.internal.publish". This activity is significant because adding a DLL to the GAC allows it to be shared across multiple applications, potentially enabling an adversary to execute malicious code system-wide. If confirmed malicious, this could lead to widespread code execution, privil
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 4104
    scriptblocktext:
      - '*system.enterpriseservices.internal.publish*'
  condition: selection
tags:
  - attack.t1505.004
references:
  - https://www.microsoft.com/en-us/security/blog/2022/12/12/iis-modules-the-evolution-of-web-shells-and-how-to-detect-them/
  - https://www.microsoft.com/en-us/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
custom_attributes:
  original_rule_id: 3fc16961-97e5-4a5b-a079-e4ab0d9763eb
  source_format: splunk_spl