title: Windows Disable Windows Group Policy Features Through Registry
id: 989f37ef-9cb9-5890-8c34-3c954eefa749
status: stable
level: medium
description: |
  The following analytic detects suspicious registry modifications aimed at disabling Windows Group Policy features. It leverages data from the Endpoint.Registry data model, focusing on specific registry paths and values associated with disabling key Windows functionalities. This activity is significant because it is commonly used by ransomware to hinder mitigation and forensic response efforts. If confirmed malicious, this behavior could severely impair the ability of security teams to analyze an
author: Steven Dick, Teoderick Contreras, Splunk
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path:
      - '*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\*'
      - '*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\*'
    registry_value_data: 0x00000001
    registry_value_name:
      - NoDesktop
      - NoFind
      - NoControlPanel
      - NoFileMenu
      - NoSetTaskbar
      - NoTrayContextMenu
      - TaskbarLockAll
      - NoThemesTab
      - NoPropertiesMyDocuments
      - NoVisualStyleChoice
      - NoColorChoice
      - NoPropertiesMyDocuments
  condition: selection
tags:
  - attack.t1112
references:
  - https://hybrid-analysis.com/sample/ef1c427394c205580576d18ba68d5911089c7da0386f19d1ca126929d3e671ab?environmentId=120&lang=en
  - https://www.sophos.com/en-us/threat-center/threat-analyses/viruses-and-spyware/Troj~Krotten-N/detailed-analysis
  - https://www.virustotal.com/gui/file/2d7855bf6470aa323edf2949b54ce2a04d9e38770f1322c3d0420c2303178d91/details
custom_attributes:
  original_rule_id: 63a449ae-9f04-11ec-945e-acde48001122
  source_format: splunk_spl