title: Windows Archived Collected Data In TEMP Folder
id: 1880dd20-7fd1-5bb1-9d10-6a80a2c2a6c8
status: stable
level: medium
description: |
  The following analytic detects the creation of archived files in a temporary folder, which may contain collected data. This behavior is often associated with malicious activity, where attackers compress sensitive information before exfiltration. The detection focuses on monitoring specific directories, such as temp folders, for the presence of newly created archive files (e.g., .zip, .rar, .tar). By identifying this pattern, security teams can quickly respond to potential data collection and exf
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    file_name:
      - '*.zip'
      - '*.rar'
      - '*.tar'
      - '*.7z'
    file_path:
      - '*\\AppData\\Local\\Temp\\*'
      - '*\\Windows\\Temp\\*'
  condition: selection
tags:
  - attack.t1560
references:
  - https://x.com/suyog41/status/1825869470323056748
  - https://g0njxa.medium.com/from-vietnam-to-united-states-malware-fraud-and-dropshipping-98b7a7b2c36d
custom_attributes:
  original_rule_id: cb56a1ea-e0b1-46d5-913f-e024cba40cbe
  source_format: splunk_spl