title: Windows Rasautou DLL Execution
id: db5afb23-d67b-5b35-b7f2-1e312051730b
status: stable
level: high
description: |
  The following analytic detects the execution of an arbitrary DLL by the Windows Remote Auto Dialer (rasautou.exe). This behavior is identified by analyzing process creation events where rasautou.exe is executed with specific command-line arguments. This activity is significant because it leverages a Living Off The Land Binary (LOLBin) to execute potentially malicious code, bypassing traditional security controls. If confirmed malicious, this technique could allow an attacker to execute arbitrary
author: Michael Haag, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    process:
      - '* -d *'
      - '* -p *'
  condition: selection
tags:
  - attack.t1055.001
  - attack.t1218
references:
  - https://github.com/mandiant/DueDLLigence
  - https://github.com/MHaggis/notes/blob/master/utilities/Invoke-SPLDLLigence.ps1
  - https://gist.github.com/NickTyrer/c6043e4b302d5424f701f15baf136513
  - https://www.mandiant.com/resources/staying-hidden-on-the-endpoint-evading-detection-with-shellcode
custom_attributes:
  original_rule_id: 6f42b8be-8e96-11ec-ad5a-acde48001122
  source_format: splunk_spl