title: Windows File Collection Via Copy Utilities
id: 6d3d7371-1693-5800-8a16-3646a09ecbce
status: stable
level: medium
description: |
  The following analytic detects the use of Windows command-line copy utilities, such as xcopy, to systematically collect files from user directories and consolidate them into a centralized location on the system. This activity is often indicative of malicious behavior, as threat actors frequently use such commands to gather sensitive information, including documents with .doc, .docx, and .pdf extensions. The detection focuses on identifying recursive copy operations targeting user folders, such a
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    process_name:
      - copy.exe
      - xcopy.exe
    original_file_name:
      - copy.exe
      - xcopy.exe
    process:
      - '*.7z*'
      - '*.bmp*'
      - '*.db*'
      - '*.doc*'
      - '*.gif*'
      - '*.gz*'
      - '*.jpg*'
      - '*.log*'
      - '*.pdf*'
      - '*.png*'
      - '*.ppt*'
      - '*.rar*'
      - '*.rtf*'
      - '*.tar*'
      - '*.txt*'
      - '*.xls*'
      - '*.zip*'
  condition: selection
tags:
  - attack.t1119
references:
  - https://cert.gov.ua/article/6284730
custom_attributes:
  original_rule_id: dbdd556d-9da8-4c42-9980-8a3ffe25a758
  source_format: splunk_spl