title: Windows Process Injection Remote Thread
id: b1291f5a-793c-5cee-9a26-5dec1171eeef
status: stable
level: high
description: |
  The following analytic detects suspicious remote thread execution in processes such as Taskmgr.exe, calc.exe, and notepad.exe, which may indicate process injection by malware like Qakbot. This detection leverages Sysmon EventCode 8 to identify remote thread creation in specific target processes. This activity is significant as it often signifies an attempt by malware to inject malicious code into legitimate processes, potentially leading to unauthorized code execution. If confirmed malicious, th
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    eventcode: 8
    targetimage:
      - '*\\Taskmgr.exe'
      - '*\\calc.exe'
      - '*\\notepad.exe'
      - '*\\rdpclip.exe'
      - '*\\explorer.exe'
      - '*\\wermgr.exe'
      - '*\\ping.exe'
      - '*\\OneDriveSetup.exe'
      - '*\\dxdiag.exe'
      - '*\\mobsync.exe'
      - '*\\msra.exe'
      - '*\\xwizard.exe'
      - '*\\cmd.exe'
      - '*\\powershell.exe'
  condition: selection
tags:
  - attack.t1055.002
references:
  - https://twitter.com/pr0xylife/status/1585612370441031680?s=46&t=Dc3CJi4AnM-8rNoacLbScg
  - https://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/
custom_attributes:
  original_rule_id: 8a618ade-ca8f-4d04-b972-2d526ba59924
  source_format: splunk_spl