title: Windows Impair Defense Disable Realtime Signature Delivery
id: 2823d657-c640-56f9-93b8-a3463731c47a
status: stable
level: high
description: |
  The following analytic detects modifications to the Windows registry that disable the Windows Defender real-time signature delivery feature. It leverages data from the Endpoint.Registry data model, specifically monitoring changes to the registry path associated with Windows Defender signature updates. This activity is significant because disabling real-time signature delivery can prevent Windows Defender from receiving timely malware definitions, reducing its effectiveness. If confirmed maliciou
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    registry_path: '*\\Windows Defender\\Signature Updates\\RealtimeSignatureDelivery'
    registry_value_data: 0x00000000
  condition: selection
tags:
  - attack.t1562.001
references:
  - https://x.com/malmoeb/status/1742604217989415386?s=20
  - https://github.com/undergroundwires/privacy.sexy
custom_attributes:
  original_rule_id: ffd99aea-542f-448e-b737-091c1b417274
  source_format: splunk_spl