title: Windows Office Product Loaded MSHTML Module
id: 8bd17074-d124-5b18-9545-e5dde28d8677
status: stable
level: medium
description: |
  The following analytic detects the loading of the mshtml.dll module into an Office product, which is indicative of CVE-2021-40444 exploitation. It leverages Sysmon EventID 7 to monitor image loads by specific Office processes. This activity is significant because it can indicate an attempt to exploit a vulnerability in the MSHTML component via a malicious document. If confirmed malicious, this could allow an attacker to execute arbitrary code, potentially leading to system compromise, data exfil
author: Michael Haag, Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    eventid: 7
    process_name:
      - EQNEDT32.exe
      - excel.exe
      - Graph.exe
      - msaccess.exe
      - mspub.exe
      - onenote.exe
      - onenoteim.exe
      - onenotem.exe
      - outlook.exe
      - powerpnt.exe
      - visio.exe
      - winproj.exe
      - winword.exe
      - wordpad.exe
      - wordview.exe
    loaded_file_path:
      - '*\\mshtml.dll'
      - '*\\Microsoft.mshtml.dll'
      - '*\\IE.Interop.MSHTML.dll'
      - '*\\MshtmlDac.dll'
      - '*\\MshtmlDed.dll'
      - '*\\MshtmlDer.dll'
  condition: selection
tags:
  - attack.t1566.001
references:
  - https://app.any.run/tasks/36c14029-9df8-439c-bba0-45f2643b0c70/
  - https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-40444
  - https://strontic.github.io/xcyclopedia/index-dll
  - https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/trojanized-onenote-document-leads-to-formbook-malware/
custom_attributes:
  original_rule_id: 4cc015c9-687c-40d2-adcc-46350f66e10c
  source_format: splunk_spl