title: Windows Multiple Accounts Deleted
id: f14bebf4-9775-5667-898e-3db5d5b9c8ac
status: stable
level: high
description: |
  The following analytic detects the deletion of more than five unique Windows accounts within a 10-minute period, using Event Code 4726 from the Windows Security Event Log. It leverages the `wineventlog_security` dataset, segmenting data into 10-minute intervals to identify suspicious account deletions. This activity is significant as it may indicate an attacker attempting to erase traces of their actions. If confirmed malicious, this could lead to unauthorized access removal, hindering incident 
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    eventcode: 4726
    status: success
    span: 10m
  condition: selection
tags:
  - attack.t1098
  - attack.t1078
references:
  - https://attack.mitre.org/techniques/T1098/
custom_attributes:
  original_rule_id: 49c0d4d6-c55d-4d3a-b3d5-7709fafed70d
  source_format: splunk_spl