title: Windows Access Token Manipulation Winlogon Duplicate Token Handle
id: 05b9ab0a-9795-5eda-8958-255f8bfdf3b4
status: stable
level: low
description: |
  The following analytic detects a process attempting to access winlogon.exe to duplicate its handle. This is identified using Sysmon EventCode 10, focusing on processes targeting winlogon.exe with specific access rights. This activity is significant because it is a common technique used by adversaries to escalate privileges by leveraging the high privileges and security tokens associated with winlogon.exe. If confirmed malicious, this could allow an attacker to gain elevated privileges, potential
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 10
    grantedaccess: 0x1040
    targetimage:
      - '*\\system32\\winlogon.exe*'
      - '*\\SysWOW64\\winlogon.exe*'
  condition: selection
tags:
  - attack.t1134.001
references:
  - https://docs.microsoft.com/en-us/windows/win32/api/handleapi/nf-handleapi-duplicatehandle
  - https://attack.mitre.org/techniques/T1134/001/
custom_attributes:
  original_rule_id: dda126d7-1d99-4f0b-b72a-4c14031f9398
  source_format: splunk_spl