title: Windows Computer Account With SPN
id: 53547918-aa35-509d-91e1-103d234806c9
status: stable
level: high
description: |
  The following analytic detects the addition of Service Principal Names (SPNs) HOST and RestrictedKrbHost to a computer account, indicative of KrbRelayUp behavior. This detection leverages Windows Security Event Logs, specifically EventCode 4741, to identify changes in SPNs. This activity is significant as it is commonly associated with Kerberos-based attacks, which can be used to escalate privileges or perform lateral movement within a network. If confirmed malicious, this behavior could allow a
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    newuacvalue: 0x80
    eventcode: 4741
    serviceprincipalnames:
      - '*HOST/*'
      - '*RestrictedKrbHost/*'
  condition: selection
tags:
  - attack.t1558
references:
  - https://www.trustedsec.com/blog/an-attack-path-mapping-approach-to-cves-2021-42287-and-2021-42278
  - https://github.com/Dec0ne/KrbRelayUp
custom_attributes:
  original_rule_id: 9a3e57e7-33f4-470e-b25d-165baa6e8357
  source_format: splunk_spl