title: Windows Steal Authentication Certificates Certificate Issued
id: 302ab902-9ad1-51bc-8de2-8d24bd0be45f
status: stable
level: medium
description: |
  The following analytic identifies the issuance of a new certificate by Certificate Services - AD CS, detected via Event ID 4887. This event logs the requester user context, DNS hostname of the requesting machine, and the request time. Monitoring this activity is crucial as it can indicate potential misuse of authentication certificates. If confirmed malicious, an attacker could use the issued certificate to impersonate users, escalate privileges, or maintain persistence within the environment. T
author: Michael Haag, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    eventcode: 4887
  condition: selection
tags:
  - attack.t1649
references:
  - https://specterops.io/wp-content/uploads/sites/3/2022/06/Certified_Pre-Owned.pdf
custom_attributes:
  original_rule_id: 9b1a5385-0c31-4c39-9753-dc26b8ce64c2
  source_format: splunk_spl