title: Windows Process Executed From Removable Media
id: eb60074f-04f5-565a-80b1-f111a264532f
status: stable
level: medium
description: |
  This analytic is used to identify when a removable media device is attached to a machine and then a process is executed from the same drive letter assigned to the removable media device. Adversaries and Insider Threats may use removable media devices for several malicious activities, including initial access, execution, and exfiltration.
author: Steven Dick
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    registry_value_data: '*:\\*'
    registry_path:
      - HKLM\\SOFTWARE\\Microsoft\\Windows Portable Devices\\Devices\\*
      - HKLM\\System\\CurrentControlSet\\Enum\\SWD\\WPDBUSENUM\\*
    field: process_current_directory
    process_current_directory:
      - 'C:\\*'
      - '*\\sysvol\\*'
  condition: selection
tags:
  - attack.t1200
  - attack.t1025
  - attack.t1091
references:
  - https://attack.mitre.org/techniques/T1200/
  - https://www.cisa.gov/news-events/news/using-caution-usb-drives
  - https://www.bleepingcomputer.com/news/security/fbi-hackers-use-badusb-to-target-defense-firms-with-ransomware/
custom_attributes:
  original_rule_id: b483804a-4cc0-49a4-9f00-ac29ba844d08
  source_format: splunk_spl