title: Windows Impair Defense Change Win Defender Health Check Intervals
id: e1eb4884-0afe-5d82-9fb2-91124e69a6bb
status: stable
level: high
description: |
  The following analytic detects modifications to the Windows registry that change the health check interval of Windows Defender. It leverages data from the Endpoint datamodel, specifically monitoring changes to the "ServiceKeepAlive" registry path with a value of "0x00000001". This activity is significant because altering Windows Defender settings can impair its ability to perform timely health checks, potentially leaving the system vulnerable. If confirmed malicious, this could allow an attacker
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    registry_path: '*\\Windows Defender\\ServiceKeepAlive'
    registry_value_data: 0x00000001
  condition: selection
tags:
  - attack.t1562.001
references:
  - https://x.com/malmoeb/status/1742604217989415386?s=20
  - https://github.com/undergroundwires/privacy.sexy
custom_attributes:
  original_rule_id: 5211c260-820e-4366-b983-84bbfb5c263a
  source_format: splunk_spl