title: Windows Computer Account Requesting Kerberos Ticket
id: 134f19c0-2607-5d99-9a39-16b83ceef507
status: stable
level: high
description: |
  The following analytic detects a computer account requesting a Kerberos ticket, which is unusual as typically user accounts request these tickets. This detection leverages Windows Security Event Logs, specifically EventCode 4768, to identify instances where the TargetUserName ends with a dollar sign ($), indicating a computer account. This activity is significant because it may indicate the use of tools like KrbUpRelay or other Kerberos-based attacks. If confirmed malicious, this could allow att
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    targetusername: '*$'
    eventcode: 4768
  filter:
    src_ip: '::1'
  condition: selection and not filter
tags:
  - attack.t1558
references:
  - https://github.com/Dec0ne/KrbRelayUp
custom_attributes:
  original_rule_id: fb3b2bb3-75a4-4279-848a-165b42624770
  source_format: splunk_spl