title: Windows Modify Registry LongPathsEnabled
id: 68c7b391-2c4e-5769-8429-40fdcabb13f3
status: stable
level: medium
description: |
  The following analytic detects a modification to the Windows registry setting "LongPathsEnabled," which allows file paths longer than 260 characters. This detection leverages data from the Endpoint.Registry datamodel, focusing on changes to the specific registry path and value. This activity is significant because adversaries, including malware like BlackByte, exploit this setting to bypass file path limitations, potentially aiding in evasion techniques. If confirmed malicious, this modification
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*\\CurrentControlSet\\Control\\FileSystem\\LongPathsEnabled'
    registry_value_data: 0x00000001
  condition: selection
tags:
  - attack.t1112
references:
  - https://www.microsoft.com/en-us/security/blog/2023/07/06/the-five-day-job-a-blackbyte-ransomware-intrusion-case-study/
custom_attributes:
  original_rule_id: 36f9626c-4272-4808-aadd-267acce681c0
  source_format: splunk_spl