title: Windows PUA Named Pipe
id: 79330531-29a3-5e63-b483-37323d56ac71
status: stable
level: medium
description: |
  The following analytic detects the creation or connection to named pipes  used by potentially unwanted applications (PUAs) like VPNs or utilities like PsExec. It leverages Sysmon EventCodes 17 and 18. If confirmed malicious, this could allow an attacker to abuse these to potentially gain persistence, command and control, or further system compromise.
author: Raven Tait, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 17
    process_path:
      - '*:\\Program Files \(x86\'
  condition: selection
tags:
  - attack.t1559
  - attack.t1021.002
  - attack.t1055
references:
  - https://attack.mitre.org/techniques/T1218/009/
  - https://docs.microsoft.com/en-us/windows/win32/ipc/named-pipes
custom_attributes:
  original_rule_id: 95b11d20-e2c6-46a5-b526-8629f5f0860a
  source_format: splunk_spl