title: Windows Mail Protocol In Non-Common Process Path
id: 327bb895-67ec-5de9-bf6a-7aa68fff6299
status: stable
level: medium
description: |
  The following analytic detects a Windows application establishing an SMTP connection from a non-common installation path. It leverages Sysmon EventCode 3 to identify processes not typically associated with email clients (e.g., Thunderbird, Outlook) making SMTP connections. This activity is significant as adversaries, including malware like AgentTesla, use such connections for Command and Control (C2) communication to exfiltrate stolen data. If confirmed malicious, this behavior could lead to una
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    destinationportname: smtp
    eventcode: 3
    image:
      - 'C:\\Program Files \(x86\'
    destinationport:
      - 25
      - 587
  condition: selection
tags:
  - attack.t1071.003
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.agent_tesla
custom_attributes:
  original_rule_id: ac3311f5-661d-4e99-bd1f-3ec665b05441
  source_format: splunk_spl