title: Windows ISO LNK File Creation
id: c558d24f-cc6f-5d29-8494-c0343ef375ff
status: stable
level: low
description: |
  The following analytic detects the creation of .iso.lnk files in the %USER%\AppData\Local\Temp\<random folder name>\ path, indicating that an ISO file has been mounted and accessed. This detection leverages the Endpoint.Filesystem data model, specifically monitoring file creation events in the Windows Recent folder. This activity is significant as it may indicate the delivery and execution of potentially malicious payloads via ISO files. If confirmed malicious, this could lead to unauthorized co
author: Michael Haag, Teoderick Contreras, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    file_path:
      - '*\\Microsoft\\Windows\\Recent\\*'
    file_name:
      - '*.iso.lnk'
      - '*.img.lnk'
      - '*.vhd.lnk'
      - '*vhdx.lnk'
  condition: selection
tags:
  - attack.t1204.001
  - attack.t1566.001
references:
  - https://www.microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/
  - https://github.com/MHaggis/notes/blob/master/utilities/ISOBuilder.ps1
  - https://isc.sans.edu/diary/Recent+AZORult+activity/25120
  - https://tccontre.blogspot.com/2020/01/remcos-rat-evading-windows-defender-av.html
custom_attributes:
  original_rule_id: d7c2c09b-9569-4a9e-a8b6-6a39a99c1d32
  source_format: splunk_spl