title: Windows ComputerDefaults Spawning a Process
id: e7b4b034-24ff-5fba-b3fc-3a9965294b2f
status: stable
level: high
description: |
  The following analytic detects the spawning of ComputerDefaults.exe, a Windows system process used to manage default application associations. While normally legitimate, this process can be exploited by attackers to bypass User Account Control (UAC) and execute unauthorized code with elevated privileges. Detection focuses on abnormal execution patterns, unusual parent-child process relationships, or deviations from standard paths. Such behavior may indicate attempts to modify system defaults or 
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1548.002
references:
  - https://www.recordedfuture.com/research/from-castleloader-to-castlerat-tag-150-advances-operations
custom_attributes:
  original_rule_id: 697eb4c0-1008-4c3c-b5ae-7bd9b39adbd6
  source_format: splunk_spl