title: Windows Credentials from Password Stores Query
id: 49617568-e573-5cef-aec9-435964b9a852
status: stable
level: medium
description: |
  The following analytic detects the execution of the Windows OS tool cmdkey.exe, which is often abused by post-exploitation tools like winpeas, commonly used in ransomware attacks to list stored usernames, passwords, or credentials. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs. This activity is significant as it indicates potential credential harvesting, which can lead to privilege escalation and persistence. If confirmed mali
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    process_name: cmdkey.exe
    original_file_name: cmdkey.exe
    process: '*/list*'
  condition: selection
tags:
  - attack.t1555
references:
  - https://ss64.com/nt/cmdkey.html
  - https://github.com/carlospolop/PEASS-ng/tree/master/winPEAS
  - https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/
custom_attributes:
  original_rule_id: db02d6b4-5d5b-4c33-8d8f-f0577516a8c7
  source_format: splunk_spl