title: Windows Compatibility Telemetry Tampering Through Registry
id: 33a9713e-edc4-55ee-a6ef-ed1c3e89aa70
status: stable
level: high
description: |
  This detection identifies suspicious modifications to the Windows Compatibility Telemetry registry settings, specifically within the "TelemetryController" registry key and "Command" registry value. It leverages data from the Endpoint.Registry data model, focusing on registry paths and values indicative of such changes. This activity is significant because CompatTelRunner.exe and the "Microsoft Compatibility Appraiser" task always run as System and can be used to elevate privileges or establish a
author: Steven Dick
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\AppCompatFlags\\TelemetryController*'
    registry_value_name: Command
    process: registry_value_data
    registry_value_data:
      - (empty
  condition: selection
tags:
  - attack.t1546
  - attack.t1053.005
references:
  - https://attack.mitre.org/techniques/T1546/
  - https://scythe.io/threat-thursday/windows-telemetry-persistence
  - https://www.trustedsec.com/blog/abusing-windows-telemetry-for-persistence
custom_attributes:
  original_rule_id: 43834687-cc48-4878-a2fa-f76e4271791f
  source_format: splunk_spl