title: Windows AD Domain Replication ACL Addition
id: 22687b89-475d-53ef-807c-dc75a6f4c713
status: stable
level: high
description: |
  The following analytic detects the addition of permissions required for a DCSync attack, specifically DS-Replication-Get-Changes, DS-Replication-Get-Changes-All, and DS-Replication-Get-Changes-In-Filtered-Set. It leverages EventCode 5136 from the Windows Security Event Log to identify when these permissions are granted. This activity is significant because it indicates potential preparation for a DCSync attack, which can be used to replicate AD objects and exfiltrate sensitive data. If confirmed
author: Dean Luxton
logsource:
  product: windows
detection:
  selection:
    aceaccessrights: CCDCLCSWRPWPDTLOCRSDRCWDWO
    acecontrolaccessrights:
      - DS-Replication-Get-Changes
      - DS-Replication-Get-Changes-All
      - 1131f6aa-9c07-11d1-f79f-00c04fc2dcd2
      - 1131f6ad-9c07-11d1-f79f-00c04fc2dcd2
    eventcode: 5136
    objectclass: domainDNS
    field:
      - old_value
      - new_value
      - new_ace
      - aceAccessRights
      - aceFlags
    max_match:
      - 10000
      - 10000
      - 100
      - 100
    new_ace:
      - old_values
    aceobjectguid:
      - 1131f6aa-9c07-11d1-f79f-00c04fc2dcd2
      - 1131f6ad-9c07-11d1-f79f-00c04fc2dcd2
      - 89e95b76-444d-4c62-991a-0facbeda640c
  condition: selection
tags:
  - attack.t1484
references:
  - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-adts/1522b774-6464-41a3-87a5-1e5633c3fbbb
  - https://github.com/SigmaHQ/sigma/blob/29a5c62784faf986dc03952ae3e90e3df3294284/rules/windows/builtin/security/win_security_account_backdoor_dcsync_rights.yml
  - https://lantern.splunk.com/Security/Product_Tips/Enterprise_Security/Enabling_an_audit_trail_from_Active_Directory
custom_attributes:
  original_rule_id: 8c372853-f459-4995-afdc-280c114d33ab
  source_format: splunk_spl