title: Windows Process Writing File to World Writable Path
id: 9cd289e9-ae2f-5a76-8499-4ab971814dc3
status: stable
level: low
description: |
  The following analytic identifies a process writing a .txt file to a world writable path. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on file creation events within specific directories. This activity is significant as adversaries often use such techniques to deliver payloads to a system, which is uncommon for legitimate processes. If confirmed malicious, this behavior could allow attackers to execute arbitrary code, escalate privileges, or maintain 
author: Michael Haag, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    file_path:
      - '*\\Windows\\Tasks\\*'
      - '*\\Windows\\Temp\\*'
      - '*\\Windows\\tracing\\*'
      - '*\\Windows\\PLA\\Reports\\*'
      - '*\\Windows\\PLA\\Rules\\*'
      - '*\\Windows\\PLA\\Templates\\*'
      - '*\\Windows\\PLA\\Reports\\en-US\\*'
      - '*\\Windows\\PLA\\Rules\\en-US\\*'
      - '*\\Windows\\Registration\\CRMLog\\*'
      - '*\\Windows\\System32\\Tasks\\*'
      - '*\\Windows\\System32\\Com\\dmp\\*'
      - '*\\Windows\\System32\\LogFiles\\WMI\\*'
      - '*\\Windows\\System32\\Microsoft\\Crypto\\RSA\\MachineKeys\\*'
      - '*\\Windows\\System32\\spool\\PRINTERS\\*'
      - '*\\Windows\\System32\\spool\\SERVERS\\*'
      - '*\\Windows\\System32\\spool\\drivers\\color\\*'
      - '*\\Windows\\System32\\Tasks\\Microsoft\\Windows\\RemoteApp and Desktop Connections Update\\*'
      - '*\\Windows\\SysWOW64\\Tasks\\*'
      - '*\\Windows\\SysWOW64\\Com\\dmp\\*'
      - '*\\Windows\\SysWOW64\\Tasks\\Microsoft\\Windows\\PLA\\*'
      - '*\\Windows\\SysWOW64\\Tasks\\Microsoft\\Windows\\RemoteApp and Desktop Connections Update\\*'
      - '*\\Windows\\SysWOW64\\Tasks\\Microsoft\\Windows\\PLA\\System\\*'
  condition: selection
tags:
  - attack.t1218.005
references:
  - https://research.splunk.com/endpoint/efbcf8ee-bc75-47f1-8985-a5c638c4faf0/
custom_attributes:
  original_rule_id: c051b68c-60f7-4022-b3ad-773bec7a225b
  source_format: splunk_spl