title: Windows Unsecured Outlook Credentials Access In Registry
id: 00e1d14c-7b83-507f-9f8f-4710b33135b8
status: stable
level: medium
description: |
  The following analytic detects unauthorized access to Outlook credentials stored in the Windows registry. It leverages Windows Security Event logs, specifically EventCode 4663, to identify access attempts to registry paths associated with Outlook profiles. This activity is significant as it may indicate attempts to steal sensitive email credentials, which could lead to unauthorized access to email accounts. If confirmed malicious, this could allow attackers to exfiltrate sensitive information, i
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    eventcode: 4663
    object_file_path:
      - '*\\Profiles\\Outlook\\9375CFF0413111d3B88A00104B2A6676*'
      - '*\\Windows Messaging Subsystem\\Profiles\\9375CFF0413111d3B88A00104B2A6676*'
  condition: selection
tags:
  - attack.t1552
references:
  - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/choice
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.404keylogger
custom_attributes:
  original_rule_id: 36334123-077d-47a2-b70c-6c7b3cc85049
  source_format: splunk_spl