title: Windows RunMRU Command Execution
id: a0f26881-779f-53d2-9bec-8033e6daebf7
status: stable
level: medium
description: |
  The following analytic detects modifications to the Windows RunMRU registry key, which stores a history of commands executed through the Run dialog box (Windows+R). It leverages Endpoint Detection and Response (EDR) telemetry to monitor registry events targeting this key. This activity is significant as malware often uses the Run dialog to execute malicious commands while attempting to appear legitimate. If confirmed malicious, this could indicate an attacker using indirect command execution tec
author: Nasreddine Bencherchali, Michael Haag, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    registry_path: '*\\Microsoft\\Windows\\CurrentVersion\\Explorer\\RunMRU*'
    registry_value_name: MRUList
    registry_value_data: unknown
  condition: selection
tags:
  - attack.t1202
references:
  - https://medium.com/@ahmed.moh.farou2/fake-captcha-campaign-on-arabic-pirated-movie-sites-delivers-lumma-stealer-4f203f7adabf
  - https://medium.com/@shaherzakaria8/downloading-trojan-lumma-infostealer-through-capatcha-1f25255a0e71
  - https://www.forensafe.com/blogs/runmrukey.html
  - https://github.com/SigmaHQ/sigma/blob/master/rules-threat-hunting/windows/registry/registry_set/registry_set_runmru_command_execution.yml
custom_attributes:
  original_rule_id: a15aa1ab-2b79-467f-8201-65e0f32d5b1a
  source_format: splunk_spl