title: Windows AD Dangerous Group ACL Modification
id: 7eb224cf-4c1f-5bf4-a2f7-6bb276dd6cc0
status: stable
level: high
description: |
  This detection monitors the addition of the following ACLs to an Active Directory group object: "Full control", "All extended rights", "All validated writes",  "Create all child objects", "Delete all child objects", "Delete subtree", "Delete", "Modify permissions", "Modify owner", and "Write all properties".  Such modifications can indicate potential privilege escalation or malicious activity. Immediate investigation is recommended upon alert.
author: Dean Luxton
logsource:
  product: windows
detection:
  selection:
    aceaccessrights:
      - Full control
      - All extended rights
      - All validated writes
      - Create all child objects
      - Delete all child objects
      - Delete subtree
      - Delete
      - Modify permissions
      - Modify owner
      - Write all properties
      - CC
      - CR
      - DC
      - DT
      - SD
      - SW
      - WD
      - WO
      - WP
    controlaccessrights: Write member
    aceobjectguid: bf9679c0-0de6-11d0-a285-00aa003049e2
    accessrights: SW
    eventcode: 5136
    objectclass: group
    field:
      - old_value
      - new_value
      - new_ace
      - aceAccessRights
      - aceFlags
    max_match:
      - 10000
      - 10000
      - 100
      - 100
    new_ace:
      - old_values
    acetype:
      - '*denied*'
      - D
      - OD
      - XD
  condition: selection
tags:
  - attack.t1222.001
  - attack.t1484
references:
  - https://learn.microsoft.com/en-us/windows/win32/secauthz/ace-strings
  - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-adts/1522b774-6464-41a3-87a5-1e5633c3fbbb
  - https://trustedsec.com/blog/a-hitchhackers-guide-to-dacl-based-detections-part-1-a
  - https://lantern.splunk.com/Security/Product_Tips/Enterprise_Security/Enabling_an_audit_trail_from_Active_Directory
custom_attributes:
  original_rule_id: 59b0fc85-7a0d-4585-97ec-06a382801990
  source_format: splunk_spl