title: Windows Impair Defense Disable Web Evaluation
id: 1962733c-7e06-5c05-bc1e-acdf6d8154b2
status: stable
level: high
description: |
  The following analytic detects modifications to the Windows registry entry "EnableWebContentEvaluation" to disable Windows Defender web content evaluation. It leverages data from the Endpoint.Registry datamodel, specifically monitoring changes where the registry value is set to "0x00000000". This activity is significant as it indicates an attempt to impair browser security features, potentially allowing malicious web content to bypass security checks. If confirmed malicious, this could lead to u
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    registry_path: '*\\Windows\\CurrentVersion\\AppHost\\EnableWebContentEvaluation'
    registry_value_data: 0x00000000
  condition: selection
tags:
  - attack.t1562.001
references:
  - https://x.com/malmoeb/status/1742604217989415386?s=20
  - https://github.com/undergroundwires/privacy.sexy
custom_attributes:
  original_rule_id: e234970c-dcf5-4f80-b6a9-3a562544ca5b
  source_format: splunk_spl