title: Windows Modify Registry Regedit Silent Reg Import
id: 8c981691-f968-5f74-a073-c24b9b3f349a
status: stable
level: medium
description: |
  The following analytic detects the modification of the Windows registry using the regedit.exe application with the silent mode parameter. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant because the silent mode allows registry changes without user confirmation, which can be exploited by adversaries to import malicious registry settings. If confirmed malicious, this could enable attackers to pe
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    process_name: regedit.exe
    original_file_name: regedit.exe
    process:
      - '* /s *'
      - '*.reg*'
  condition: selection
tags:
  - attack.t1112
references:
  - https://app.any.run/tasks/a6f2ffe2-e6e2-4396-ae2e-04ea0143f2d8/
  - https://www.techtarget.com/searchwindowsserver/tip/Command-line-options-for-Regeditexe
custom_attributes:
  original_rule_id: 824dd598-71be-4203-bc3b-024f4cda340e
  source_format: splunk_spl