title: Windows Masquerading Msdtc Process
id: 685c5ae9-af35-5a24-921e-f991bc207759
status: stable
level: high
description: |
  The following analytic identifies the execution of msdtc.exe with specific command-line parameters (-a or -b), which are indicative of the PlugX malware. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line arguments. This activity is significant because PlugX uses these parameters to masquerade its malicious operations within legitimate processes, making it harder to detect. If confirmed malicious, this behavior could allow 
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    process_name: msdtc.exe
    process:
      - '* -a*'
      - '* -b*'
  condition: selection
tags:
  - attack.t1036
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.plugx
custom_attributes:
  original_rule_id: 238f3a07-8440-480b-b26f-462f41d9a47c
  source_format: splunk_spl