title: Windows Default Rdp File Unhidden
id: 6ac04177-0a5a-5749-a503-fe92e6473200
status: stable
level: medium
description: |
  This detection identifies the use of attrib.exe to remove hidden (-h) or system (-s) attributes from the Default.rdp file, which is automatically created in a user's Documents folder when a Remote Desktop Protocol (RDP) session is initiated using mstsc.exe. The Default.rdp file stores session configuration details such as the remote host address and screen settings. Unhiding this file is uncommon in normal user behavior and may indicate that an attacker or red team operator is attempting to acce
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    process_name: attrib.exe
    process:
      - '*-s*'
      - '*-h*'
  condition: selection
tags:
  - attack.t1021.001
references:
  - https://medium.com/@bonguides25/how-to-clear-rdp-connections-history-in-windows-cf0ffb67f344
  - https://thelocalh0st.github.io/posts/rdp/
custom_attributes:
  original_rule_id: f5c1f64b-db59-4913-991e-3dac8adff288
  source_format: splunk_spl