title: Windows Defender ASR Audit Events
id: 72572bbe-afb8-544b-af23-fb5fb168dcba
status: stable
level: medium
description: |
  This detection searches for Windows Defender ASR audit events. ASR is a feature of Windows Defender Exploit Guard that prevents actions and apps that are typically used by exploit-seeking malware to infect machines. ASR rules are applied to processes and applications. When a process or application attempts to perform an action that is blocked by an ASR rule, an event is generated. This detection searches for ASR audit events that are generated when a process or application attempts to perform an
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    value: 'NULL'
    eventcode:
      - 1122
      - 1125
      - 1126
      - 1132
      - 1134
  condition: selection
tags:
  - attack.t1059
  - attack.t1566.001
  - attack.t1566.002
references:
  - https://asrgen.streamlit.app/
custom_attributes:
  original_rule_id: 0e4d46b1-22bd-4f0e-8337-ca6f60ad4bea
  source_format: splunk_spl