title: Windows Modify Registry Qakbot Binary Data Registry
id: 6a292e32-4ec1-501c-885e-8fc299c64fcd
status: stable
level: medium
description: |
  The following analytic detects the creation of a suspicious registry entry by Qakbot malware, characterized by 8 random registry value names with encrypted binary data. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on registry modifications under the "SOFTWARE\\Microsoft\\" path by processes like explorer.exe. This activity is significant as it indicates potential Qakbot infection, which uses the registry to store malicious code or configuration data. 
author: Teoderick Contreras, Bhavin Patel, Splunk
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*\\SOFTWARE\\Microsoft\\*'
    registry_value_data: Binary Data
    registry_value_name: ^[0-9a-fA-F]{8}
    span:
      - 1m
      - 1m
    process_name:
      - explorer.exe
      - wermgr.exe
      - dxdiag.exe
      - OneDriveSetup.exe
      - mobsync.exe
      - msra.exe
      - xwizard.exe
  condition: selection
tags:
  - attack.t1112
references:
  - https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/decrypting-qakbots-encrypted-registry-keys/
custom_attributes:
  original_rule_id: 2e768497-04e0-4188-b800-70dd2be0e30d
  source_format: splunk_spl