title: Windows ConsoleHost History File Deletion
id: e480b132-d136-5a80-903e-73729db067a0
status: stable
level: medium
description: |
  The following analytic detects the deletion of the ConsoleHost_history.txt file, which stores command history for PowerShell sessions. Attackers may attempt to remove this file to cover their tracks and evade detection during post-exploitation activities. This detection focuses on file deletion commands executed via PowerShell, Command Prompt, or scripting languages that specifically target ConsoleHost_history.txt, typically located at %APPDATA%\Microsoft\Windows\PowerShell\PSReadline\ConsoleHos
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    targetfilename: '*\\Microsoft\\Windows\\PowerShell\\PSReadline\\ConsoleHost_history.txt'
    eventcode:
      - 23
      - 26
  condition: selection
tags:
  - attack.t1070.003
references:
  - https://www.cisa.gov/news-events/cybersecurity-advisories/aa25-071a
custom_attributes:
  original_rule_id: a203040e-f8fd-49bb-8424-d2fabf277322
  source_format: splunk_spl