title: Windows Abused Web Services
id: 156c882f-0178-57d7-8067-f1fc567b4293
status: stable
level: high
description: |
  The following analytic detects a suspicious process making DNS queries to known, abused web services such as text-paste sites, VoIP, secure tunneling, instant messaging, and digital distribution platforms. This detection leverages Sysmon logs with Event ID 22, focusing on specific query names. This activity is significant as it may indicate an adversary attempting to download malicious files, a common initial access technique. If confirmed malicious, this could lead to unauthorized code executio
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 22
    queryname:
      - '*pastebin*'
      - '*textbin*'
      - '*ngrok.io*'
      - '*discord*'
      - '*duckdns.org*'
      - '*pasteio.com*'
  condition: selection
tags:
  - attack.t1102
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.njrat
custom_attributes:
  original_rule_id: 01f0aef4-8591-4daa-a53d-0ed49823b681
  source_format: splunk_spl