title: Windows Unusual NTLM Authentication Destinations By Source
id: 6227165d-275f-5f7e-a6d4-0fea785d846c
status: stable
level: medium
description: |
  The following analytic detects when an unusual number NTLM authentications is attempted by the same source against multiple destinations. This activity generally results when an attacker attempts to brute force, password spray, or otherwise authenticate to a multiple domain joined Windows devices using an NTLM based process/attack. This same activity may also generate a large number of EventID 4776 events as well.
author: Steven Dick
logsource:
  product: windows
  category: authentication
detection:
  selection:
    eventcode: 8004
    user: UserName
  condition: selection
tags:
  - attack.t1110.003
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://techcommunity.microsoft.com/t5/ask-the-directory-services-team/ntlm-blocking-and-you-application-analysis-and-auditing/ba-p/397191
  - https://techcommunity.microsoft.com/t5/microsoft-defender-for-identity/enriched-ntlm-authentication-data-using-windows-event-8004/m-p/871827
  - https://www.varonis.com/blog/investigate-ntlm-brute-force
  - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nrpc/4d1235e3-2c96-4e9f-a147-3cb338a0d09f
custom_attributes:
  original_rule_id: ae9b0df5-5fb0-477f-abc9-47faf42aa91d
  source_format: splunk_spl