title: Windows Gather Victim Identity SAM Info
id: e65786f1-9973-537d-85d5-bba19c9834c3
status: stable
level: low
description: |
  The following analytic detects processes loading the samlib.dll or samcli.dll modules, which are often abused to access Security Account Manager (SAM) objects or credentials on domain controllers. This detection leverages Sysmon EventCode 7 to identify these DLLs being loaded outside typical system directories. Monitoring this activity is crucial as it may indicate attempts to gather sensitive identity information. If confirmed malicious, this behavior could allow attackers to obtain credentials
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    imageloaded:
      - '*\\samlib.dll'
      - '*\\samcli.dll'
    originalfilename:
      - samlib.dll
      - SAMCLI.DLL
    eventcode: 7
    image:
      - 'C:\\Windows\\*'
      - 'C:\\Program File*'
      - '%systemroot%\\*'
  condition: selection
tags:
  - attack.t1589.001
references:
  - https://redcanary.com/blog/active-breach-evading-defenses/
  - https://strontic.github.io/xcyclopedia/library/samlib.dll-0BDF6351009F6EBA5BA7E886F23263B1.html
custom_attributes:
  original_rule_id: a18e85d7-8b98-4399-820c-d46a1ca3516f
  source_format: splunk_spl