title: Windows AppLocker Block Events
id: 9c18e724-e1c9-5408-a955-88cbd3fe36ef
status: stable
level: medium
description: |
  The following analytic detects attempts to bypass application restrictions by identifying Windows AppLocker policy violations. It leverages Windows AppLocker event logs, specifically EventCodes 8007, 8004, 8022, 8025, 8029, and 8040, to pinpoint blocked actions. This activity is significant for a SOC as it highlights potential unauthorized application executions, which could indicate malicious intent or policy circumvention. If confirmed malicious, this activity could allow an attacker to execut
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    input: UserData_Xml
    eventcode:
      - 8007
      - 8004
      - 8022
      - 8025
      - 8029
      - 8040
  condition: selection
tags:
  - attack.t1218
references:
  - https://attack.mitre.org/techniques/T1218
  - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/applocker/using-event-viewer-with-applocker
  - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/querying-application-control-events-centrally-using-advanced-hunting
custom_attributes:
  original_rule_id: e369afe8-cd35-47a3-9c1e-d813efc1f7dd
  source_format: splunk_spl