title: Windows Admon Default Group Policy Object Modified
id: 1807431a-bf41-5ea6-9b9d-55060f72fe8b
status: stable
level: high
description: |
  The following analytic detects modifications to the default Group Policy Objects (GPOs) in an Active Directory environment. It leverages Splunk's Admon to monitor updates to the "Default Domain Policy" and "Default Domain Controllers Policy." This activity is significant because changes to these default GPOs can indicate an adversary with privileged access attempting to gain further control, establish persistence, or deploy malware across multiple hosts. If confirmed malicious, such modification
author: Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    objectcategory: CN=Group-Policy-Container,CN=Schema,CN=Configuration,DC=*
    displayname:
      - Default Domain Policy
      - Default Domain Controllers Policy
    admoneventtype: Update
  condition: selection
tags:
  - attack.t1484.001
references:
  - https://attack.mitre.org/techniques/T1484/
  - https://attack.mitre.org/techniques/T1484/001
  - https://www.trustedsec.com/blog/weaponizing-group-policy-objects-access/
  - https://adsecurity.org/?p=2716
  - https://help.splunk.com/en/splunk-cloud-platform/get-started/get-data-in/9.3.2411/get-windows-data/monitor-active-directory
custom_attributes:
  original_rule_id: 83458004-db60-4170-857d-8572f16f070b
  source_format: splunk_spl