title: Windows Developer-Signed MSIX Package Installation
id: 92d2fdfc-f544-5dd4-895b-9eb667a507bd
status: stable
level: medium
description: |
  This detection identifies the installation of developer-signed MSIX packages that lack Microsoft Store signatures. All malicious MSIX packages observed in recent threat campaigns (including those from FIN7, Zloader/Storm-0569, and FakeBat/Storm-1113) were developer-signed rather than Microsoft Store signed. Microsoft Store apps have specific publisher IDs containing '8wekyb3d8bbwe' or 'cw5n1h2txyewy', while developer-signed packages lack these identifiers. This detection focuses on EventID 855 f
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 855
    packagemoniker:
      - '*8wekyb3d8bbwe*'
      - '*cw5n1h2txyewy*'
  condition: selection
tags:
  - attack.t1553.005
  - attack.t1204.002
references:
  - https://redcanary.com/blog/threat-intelligence/msix-installers/
  - https://learn.microsoft.com/en-us/windows/win32/appxpkg/troubleshooting
  - https://www.advancedinstaller.com/msix-installation-or-launching-errors-and-fixes.html
  - https://redcanary.com/blog/threat-detection/code-signing-certificates/
custom_attributes:
  original_rule_id: 2c0427aa-982c-4e97-bc33-bddeda4fd095
  source_format: splunk_spl