title: Windows RDP Bitmap Cache File Creation
id: 12b26450-8309-5c26-b581-93c397cbbce5
status: stable
level: medium
description: |
  This detection identifies the creation of Remote Desktop Protocol (RDP) bitmap cache files on a Windows system, typically located in the user’s profile under the Terminal Server Client cache directory. These files (*.bmc, cache*.bin) are generated when a user initiates an RDP session using the built-in mstsc.exe client. Their presence can indicate interactive remote access activity and may be useful in detecting lateral movement or unauthorized RDP usage. Monitoring this behavior is especially i
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    file_path:
      - '*\\Terminal Server Client\\Cache\\*.bmc'
      - '*\\Terminal Server Client\\Cache\\cache*.bin'
  condition: selection
tags:
  - attack.t1021.001
references:
  - https://medium.com/@bonguides25/how-to-clear-rdp-connections-history-in-windows-cf0ffb67f344
  - https://thelocalh0st.github.io/posts/rdp/
custom_attributes:
  original_rule_id: 5f8671b6-07a7-425d-b3da-c39a53f2a6ae
  source_format: splunk_spl