title: Windows Impair Defense Delete Win Defender Context Menu
id: b52e2448-b988-5ca1-adbf-4c13ddd9682b
status: stable
level: low
description: |
  The following analytic detects the deletion of the Windows Defender context menu entry from the registry. It leverages data from the Endpoint datamodel, specifically monitoring registry actions where the path includes "*\\shellex\\ContextMenuHandlers\\EPP" and the action is 'deleted'. This activity is significant as it is commonly associated with Remote Access Trojan (RAT) malware attempting to disable security features. If confirmed malicious, this could allow an attacker to impair defenses, fa
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    registry_path: '*\\shellex\\ContextMenuHandlers\\EPP'
    action: deleted
  condition: selection
tags:
  - attack.t1562.001
references:
  - https://blog.malwarebytes.com/malwarebytes-news/2021/02/lazyscripter-from-empire-to-double-rat/
  - https://app.any.run/tasks/45f5d114-91ea-486c-ab01-41c4093d2861/
custom_attributes:
  original_rule_id: 395ed5fe-ad13-4366-9405-a228427bdd91
  source_format: splunk_spl