title: Windows Credentials from Password Stores Deletion
id: e2b46f11-2f89-5df3-aa4d-909fde63a6af
status: stable
level: high
description: |
  The following analytic detects the execution of the Windows OS tool cmdkey.exe with the /delete parameter. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs and command-line arguments. The activity is significant because cmdkey.exe can be used by attackers to delete stored credentials, potentially leading to privilege escalation and persistence. If confirmed malicious, this behavior could allow attackers to remove stored user cred
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    process_name: cmdkey.exe
    original_file_name: cmdkey.exe
    process: '*/delete*'
  condition: selection
tags:
  - attack.t1555
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.darkgate
custom_attributes:
  original_rule_id: 46d676aa-40c6-4fe6-b917-d23b621f0f89
  source_format: splunk_spl