title: Windows Gdrive Binary Activity
id: af571ef8-b969-594d-ac7f-32ac0a142385
status: stable
level: high
description: |
  The following analytic detects the execution of the 'gdrive' tool on a Windows host. This tool allows standard users to perform tasks associated with Google Drive via the command line. This is used by actors to stage tools as well as exfiltrate data. The detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. If confirmed malicious, this could lead to compromise of systems or sensitive data being stolen.
author: Raven Tait, Splunk
logsource:
  product: windows
detection:
  selection:
    process_name: gdrive.exe
    original_file_name: '*gdrive.exe'
    process:
      - '* download *'
      - '* upload *'
      - '* list*'
      - '* update *'
      - '* sync *'
      - '* share *'
      - '* account add*'
      - '* drives *'
      - '* files *'
  condition: selection
tags:
  - attack.t1567
references:
  - https://cloud.google.com/blog/topics/threat-intelligence/uncovering-unc3886-espionage-operations
custom_attributes:
  original_rule_id: 9e7bd7c8-1c08-496e-9ffe-fd84ceb322e7
  source_format: splunk_spl