title: Windows System Discovery Using Qwinsta
id: 29a6faa1-191a-5bcb-9bd9-8049e18627a6
status: stable
level: low
description: |
  The following analytic detects the execution of "qwinsta.exe" on a Windows operating system. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs. The "qwinsta.exe" tool is significant because it can display detailed session information on a remote desktop session host server. This behavior is noteworthy as it is commonly abused by Qakbot malware to gather system information and send it back to its Command and Control (C2) server. If
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    process_name: qwinsta.exe
    original_file_name: qwinsta.exe
  condition: selection
tags:
  - attack.t1033
references:
  - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/qwinsta
  - https://securelist.com/qakbot-technical-analysis/103931/
custom_attributes:
  original_rule_id: 2e765c1b-144a-49f0-93d0-1df4287cca04
  source_format: splunk_spl