title: Windows System Remote Discovery With Query
id: cd13f5e6-ddd6-50d9-91f8-de2844d944e1
status: stable
level: medium
description: |
  The following analytic detects the execution of `query.exe` with command-line arguments aimed at discovering data on remote devices. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant as adversaries may use `query.exe` to gain situational awareness and perform Active Directory discovery on compromised endpoints. If confirmed malicious, this behavior could allow attackers to identify various deta
author: Steven Dick
logsource:
  product: windows
detection:
  selection:
    process_name: query.exe
    original_file_name: query.exe
    process:
      - '*/server:localhost*'
      - '*/server:127.0.0.1*'
  condition: selection
tags:
  - attack.t1033
references:
  - https://attack.mitre.org/techniques/T1033/
custom_attributes:
  original_rule_id: 94859172-a521-474f-97ac-4cf4b09634a3
  source_format: splunk_spl