title: Windows IIS Server PSWA Console Access
id: 6ce49a8f-f289-5c77-ba2d-0c8feb2437c4
status: stable
level: low
description: |
  This analytic detects access attempts to the PowerShell Web Access (PSWA) console on Windows IIS servers. It monitors web traffic for requests to PSWA-related URIs, which could indicate legitimate administrative activity or potential unauthorized access attempts. By tracking source IP, HTTP status, URI path, and HTTP method, it helps identify suspicious patterns or brute-force attacks targeting PSWA. This detection is crucial for maintaining the security of remote PowerShell management interface
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    datamodel: Web
    dest:
      - /pswa/*
  condition: selection
tags:
  - attack.t1190
references:
  - https://www.cisa.gov/news-events/cybersecurity-advisories/aa24-241a
custom_attributes:
  original_rule_id: 914ab191-fa8a-48cb-83a6-0565e061f934
  source_format: splunk_spl