title: Windows Registry Certificate Added
id: 150d8c41-d840-5f41-9bf7-d185c7f01a15
status: stable
level: medium
description: |
  The following analytic detects the installation of a root CA certificate by monitoring specific registry paths for SetValue events. It leverages data from the Endpoint datamodel, focusing on registry paths containing "certificates" and registry values named "Blob." This activity is significant because unauthorized root CA certificates can compromise the integrity of encrypted communications and facilitate man-in-the-middle attacks. If confirmed malicious, this could allow an attacker to intercep
author: Michael Haag, Teodeerick Contreras, Splunk
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_value_name: Blob
    registry_path:
      - '*\\certificates\\*'
  condition: selection
tags:
  - attack.t1553.004
references:
  - https://posts.specterops.io/code-signing-certificate-cloning-attacks-and-defenses-6f98657fc6ec
  - https://github.com/redcanaryco/atomic-red-team/tree/master/atomics/T1553.004
custom_attributes:
  original_rule_id: 5ee98b2f-8b9e-457a-8bdc-dd41aaba9e87
  source_format: splunk_spl