title: Windows Unsigned DLL Side-Loading
id: 0b82066f-7935-50da-8cb8-bfccad77bfb9
status: stable
level: medium
description: |
  The following analytic detects the creation of potentially malicious unsigned DLLs in the c:\windows\system32 or c:\windows\syswow64 folders. It leverages Sysmon EventCode 7 logs to identify unsigned DLLs with unavailable signatures loaded in these critical directories. This activity is significant as it may indicate a DLL hijacking attempt, a technique used by attackers to gain unauthorized access and execute malicious code. If confirmed malicious, this could lead to privilege escalation, allow
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    originalfilename: '-'
    signaturestatus: unavailable
    eventcode: 7
    signed: 'false'
    imageloaded:
      - '*:\\windows\\system32\\*'
      - '*:\\windows\\syswow64\\*'
  condition: selection
tags:
  - attack.t1574.001
references:
  - https://asec.ahnlab.com/en/17692/
  - https://www.blackberry.com/us/en/solutions/endpoint-security/ransomware-protection/warzone#:~:text=Warzone%20RAT%20(AKA%20Ave%20Maria)%20is%20a%20remote%20access%20trojan,is%20as%20an%20information%20stealer.
custom_attributes:
  original_rule_id: 5a83ce44-8e0f-4786-a775-8249a525c879
  source_format: splunk_spl