title: Windows Advanced Installer MSIX with AI_STUBS Execution
id: 7c0286e5-439c-500e-ae23-7d85cd9ff43b
status: stable
level: high
description: |
  The following analytic identifies the execution of Advanced Installer MSIX Package Support Framework (PSF) components, specifically the AI_STUBS executables with the original filename 'popupwrapper.exe'. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process paths and original filenames. This activity is significant as adversaries have been observed packaging malicious content within MSIX files built with Advanced Installer to bypass security control
author: Michael Haag, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    original_file_name: popupwrapper.exe
    process_path:
      - '*\\AI_STUBS\\AiStubX64Elevated.exe'
      - '*\\AI_STUBS\\AiStubX86Elevated.exe'
      - '*\\AI_STUBS\\AiStubX64.exe'
      - '*\\AI_STUBS\\AiStubX86.exe'
  condition: selection
tags:
  - attack.t1218
  - attack.t1553.005
  - attack.t1204.002
references:
  - https://redcanary.com/blog/threat-intelligence/msix-installers/
  - https://redcanary.com/threat-detection-report/techniques/installer-packages/
  - https://learn.microsoft.com/en-us/windows/msix/package/package-support-framework
  - https://learn.microsoft.com/en-us/windows/msix/desktop/desktop-to-uwp-behind-the-scenes
  - https://attack.mitre.org/techniques/T1218/
custom_attributes:
  original_rule_id: 56b2e58c-5909-49a3-998e-1f4815186ec2
  source_format: splunk_spl