title: Windows Unusual Count Of Invalid Users Failed To Auth Using NTLM
id: d0466835-2112-543b-be44-0ea7916e244b
status: stable
level: medium
description: |
  The following analytic identifies a source endpoint failing to authenticate with multiple invalid users using the NTLM protocol. It leverages EventCode 4776 and calculates the standard deviation for each host, using the 3-sigma rule to detect anomalies. This behavior is significant as it may indicate a Password Spraying attack, where an adversary attempts to gain initial access or elevate privileges. If confirmed malicious, this activity could lead to unauthorized access or privilege escalation,
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    eventcode: 4776
    status: 0xc0000064
    span: 2m
    isoutlier: 1
  condition: selection
tags:
  - attack.t1110.003
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/audit-credential-validation
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4776
custom_attributes:
  original_rule_id: 15603165-147d-4a6e-9778-bd0ff39e668f
  source_format: splunk_spl