title: Windows Mshta Execution In Registry
id: fb2e5387-837c-5633-9360-43d507a8a357
status: stable
level: high
description: |
  The following analytic detects the execution of mshta.exe via registry entries to run malicious scripts. It leverages registry activity logs to identify entries containing "mshta," "javascript," "vbscript," or "WScript.Shell." This behavior is significant as it indicates potential fileless malware, such as Kovter, which uses encoded scripts in the registry to persist and execute without files. If confirmed malicious, this activity could allow attackers to maintain persistence, execute arbitrary 
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    registry_value_data:
      - '*javascript:*'
      - '*vbscript:*'
      - '*WScript.Shell*'
  condition: selection
tags:
  - attack.t1218.005
references:
  - https://redcanary.com/threat-detection-report/techniques/mshta/
  - https://learn.microsoft.com/en-us/microsoft-365/security/intelligence/fileless-threats?view=o365-worldwide
custom_attributes:
  original_rule_id: e13ceade-b673-4d34-adc4-4d9c01729753
  source_format: splunk_spl