title: Windows Modify Registry USeWuServer
id: cdcb2211-7872-5062-a607-748292d7295b
status: stable
level: low
description: |
  The following analytic detects a suspicious modification to the Windows Update configuration registry key "UseWUServer." It leverages data from the Endpoint.Registry data model to identify changes where the registry value is set to "0x00000001." This activity is significant because it is commonly used by adversaries, including malware like RedLine Stealer, to bypass detection mechanisms and potentially exploit zero-day vulnerabilities. If confirmed malicious, this modification could allow attack
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*\\SOFTWARE\\Policies\\Microsoft\\Windows\\WindowsUpdate\\AU\\UseWUServer'
    registry_value_data: 0x00000001
  condition: selection
tags:
  - attack.t1112
references:
  - https://learn.microsoft.com/de-de/security-updates/windowsupdateservices/18127499
custom_attributes:
  original_rule_id: c427bafb-0b2c-4b18-ad85-c03c6fed9e75
  source_format: splunk_spl