title: Windows Account Discovery With NetUser PreauthNotRequire
id: 778c0a1b-86ce-561b-9f97-64dc7c89b296
status: stable
level: low
description: |
  The following analytic detects the execution of the PowerView PowerShell cmdlet Get-NetUser with the -PreauthNotRequire parameter, leveraging Event ID 4104. This method identifies attempts to query Active Directory user accounts that do not require Kerberos preauthentication. Monitoring this activity is crucial as it can indicate reconnaissance efforts by an attacker to identify potentially vulnerable accounts. If confirmed malicious, this behavior could lead to further exploitation, such as una
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    scriptblocktext:
      - '*Get-NetUser*'
      - '*-PreauthNotRequire*'
    eventcode: 4104
  condition: selection
tags:
  - attack.t1087
references:
  - https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-347a
custom_attributes:
  original_rule_id: cf056b65-44b2-4d32-9172-d6b6f081a376
  source_format: splunk_spl