title: Windows MSIX Package Interaction
id: 85e914f0-896d-5221-a061-244504489876
status: stable
level: low
description: |
  This hunting query detects user interactions with MSIX packages by monitoring EventCode 171 in the Microsoft-Windows-AppXPackaging/Operational logs. These events are generated when a user clicks on or attempts to interact with an MSIX package, even if the package is not fully installed. This information can be valuable for security teams to identify what MSIX packages users are attempting to open in their environment, which may help detect malicious MSIX packages before they're fully installed. 
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 171
  condition: selection
tags:
  - attack.t1204.002
references:
  - https://www.appdeploynews.com/packaging-types/msix/troubleshooting-an-msix-package/
  - https://learn.microsoft.com/en-us/windows/win32/appxpkg/troubleshooting
  - https://www.advancedinstaller.com/msix-installation-or-launching-errors-and-fixes.html
  - https://redcanary.com/blog/msix-installers/
custom_attributes:
  original_rule_id: 1a06689d-814e-4db2-b2c7-5a174f8c2d6d
  source_format: splunk_spl