title: Windows Credentials from Password Stores Chrome Copied in TEMP Dir
id: 5fae95b3-6514-5dbf-b25f-0047ae7242de
status: stable
level: high
description: |
  The following analytic detects the copying of Chrome's Local State and Login Data files into temporary folders, a tactic often used by the Braodo stealer malware. These files contain encrypted user credentials, including saved passwords and login session details. The detection monitors for suspicious copying activity involving these specific Chrome files, particularly in temp directories where malware typically processes the stolen data. Identifying this behavior enables security teams to act qu
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    file_path: '*\\temp\\*'
    file_name:
      - Local State
      - Login Data
  condition: selection
tags:
  - attack.t1555.003
references:
  - https://x.com/suyog41/status/1825869470323056748
  - https://g0njxa.medium.com/from-vietnam-to-united-states-malware-fraud-and-dropshipping-98b7a7b2c36d
custom_attributes:
  original_rule_id: 4d14c86d-fdee-4393-94da-238d2706902f
  source_format: splunk_spl