title: Windows MOF Event Triggered Execution via WMI
id: c056fe19-4b65-558f-972e-f0f9814c4957
status: stable
level: high
description: |
  The following analytic detects the execution of MOFComp.exe loading a MOF file, often triggered by cmd.exe or powershell.exe, or from unusual paths like User Profile directories. It leverages Endpoint Detection and Response (EDR) data, focusing on process names, parent processes, and command-line executions. This activity is significant as it may indicate an attacker using WMI for persistence or lateral movement. If confirmed malicious, it could allow the attacker to execute arbitrary code, main
author: Michael Haag, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    parent_process_name:
      - cmd.exe
      - powershell.exe
    process:
      - '*\\AppData\\Local\\*'
      - '*\\Users\\Public\\*'
  condition: selection
tags:
  - attack.t1546.003
references:
  - https://attack.mitre.org/techniques/T1546/003/
  - https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
  - https://docs.microsoft.com/en-us/windows/win32/wmisdk/mofcomp
  - https://pentestlab.blog/2020/01/21/persistence-wmi-event-subscription/
  - https://www.sakshamdixit.com/wmi-events/
custom_attributes:
  original_rule_id: e59b5a73-32bf-4467-a585-452c36ae10c1
  source_format: splunk_spl