title: Windows New InProcServer32 Added
id: a6c499b2-d852-5e43-8482-87a25e43071f
status: stable
level: low
description: |
  The following analytic detects the addition of new InProcServer32 registry keys on Windows endpoints. It leverages data from the Endpoint.Registry datamodel to identify changes in registry paths associated with InProcServer32. This activity is significant because malware often uses this mechanism to achieve persistence or execute malicious code by registering a new InProcServer32 key pointing to a harmful DLL. If confirmed malicious, this could allow an attacker to persist in the environment or 
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    registry_path: '*\\InProcServer32\\*'
  condition: selection
tags:
  - attack.t1112
references:
  - https://www.netspi.com/blog/technical/red-team-operations/microsoft-outlook-remote-code-execution-cve-2024-21378/
custom_attributes:
  original_rule_id: 0fa86e31-0f73-4ec7-9ca3-dc88e117f1db
  source_format: splunk_spl