title: Windows Cisco Secure Endpoint Related Service Stopped
id: 160f8d64-ed36-53cb-9d3c-4ebdb1008883
status: stable
level: medium
description: |
  The following analytic detects the suspicious termination of known services commonly targeted by ransomware before file encryption. It leverages Windows System Event Logs (EventCode 7036) to identify when critical services such as Volume Shadow Copy, backup, and antivirus services are stopped. This activity is significant because ransomware often disables these services to avoid errors and ensure successful file encryption. If confirmed malicious, this behavior could lead to widespread data encr
author: Nasreddine Bencherchali, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 7036
    display_name:
      - Cisco AMP Orbital
      - '*Cisco Secure Endpoint*'
      - '*Cisco Security Connector Monitoring*'
      - CiscoSAM
      - CiscoAMPHeurDriver
      - CiscoAMPELAMDriver
      - CiscoAMPCEFWDriver
      - ImmunetNetworkMonitorDriver
      - ImmunetProtectDriver
      - ImmunetSelfProtectDriver
    status:
      - stopped
      - arrêté
  condition: selection
tags:
  - attack.t1490
references:
  - https://krebsonsecurity.com/2021/05/a-closer-look-at-the-darkside-ransomware-gang/
  - https://www.mcafee.com/blogs/other-blogs/mcafee-labs/mcafee-atr-analyzes-sodinokibi-aka-revil-ransomware-as-a-service-what-the-code-tells-us/
  - https://news.sophos.com/en-us/2020/04/24/lockbit-ransomware-borrows-tricks-to-keep-up-with-revil-and-maze/
  - https://blogs.vmware.com/security/2022/10/lockbit-3-0-also-known-as-lockbit-black.html
custom_attributes:
  original_rule_id: df74f45f-01c8-4fd6-bcb8-f6a9ea58307a
  source_format: splunk_spl