title: Windows AD DSRM Account Changes
id: d9fcaf9d-3e2e-5b08-ad37-82912b751a3d
status: stable
level: high
description: |
  The following analytic identifies changes to the Directory Services Restore Mode (DSRM) account behavior via registry modifications. It detects alterations in the registry path "*\\System\\CurrentControlSet\\Control\\Lsa\\DSRMAdminLogonBehavior" with specific values indicating potential misuse. This activity is significant because the DSRM account, if misconfigured, can be exploited to persist within a domain, similar to a local administrator account. If confirmed malicious, an attacker could ga
author: Dean Luxton
logsource:
  product: windows
detection:
  selection:
    registry_path: '*\\System\\CurrentControlSet\\Control\\Lsa\\DSRMAdminLogonBehavior'
    registry_value_data:
      - '*1'
      - '*2'
  condition: selection
tags:
  - attack.t1098
references:
  - https://adsecurity.org/?p=1714
custom_attributes:
  original_rule_id: 08cb291e-ea77-48e8-a95a-0799319bf056
  source_format: splunk_spl