title: Windows PowerShell Disable HTTP Logging
id: cbdb9550-2a75-50af-baed-aef509264b29
status: stable
level: high
description: |
  The following analytic detects the use of `get-WebConfigurationProperty` and `Set-ItemProperty` commands in PowerShell to disable HTTP logging on Windows systems. This detection leverages PowerShell Script Block Logging, specifically looking for script blocks that reference HTTP logging properties and attempt to set them to "false" or "dontLog". Disabling HTTP logging is significant as it can be used by adversaries to cover their tracks and delete logs, hindering forensic investigations. If conf
author: Michael Haag, Splunk
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    eventcode: 4104
    scriptblocktext:
      - '*dontLog*'
      - '*false*'
  condition: selection
tags:
  - attack.t1505.004
  - attack.t1562.002
references:
  - https://www.microsoft.com/en-us/security/blog/2022/12/12/iis-modules-the-evolution-of-web-shells-and-how-to-detect-them/
  - https://www.crowdstrike.com/wp-content/uploads/2022/05/crowdstrike-iceapple-a-novel-internet-information-services-post-exploitation-framework-1.pdf
  - https://unit42.paloaltonetworks.com/unit42-oilrig-uses-rgdoor-iis-backdoor-targets-middle-east/
  - https://www.secureworks.com/research/bronze-union
custom_attributes:
  original_rule_id: 27958de0-2857-43ca-9d4c-b255cf59dcab
  source_format: splunk_spl