title: Windows IIS Components Add New Module
id: 2c914ea9-969f-5778-bb73-a9d5e7946f0a
status: stable
level: medium
description: |
  The following analytic detects the execution of AppCmd.exe to install a new module in IIS. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant as adversaries may use it to install webshells or backdoors, leading to credit card scraping, persistence, and further post-exploitation. If confirmed malicious, this could allow attackers to maintain persistent access, execute arbitrary code, 
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    process:
      - '*install *'
      - '*module *'
    parent_process_name:
      - msiexec.exe
      - iissetup.exe
  condition: selection
tags:
  - attack.t1505.004
references:
  - https://www.microsoft.com/en-us/security/blog/2022/12/12/iis-modules-the-evolution-of-web-shells-and-how-to-detect-them/
  - https://www.crowdstrike.com/wp-content/uploads/2022/05/crowdstrike-iceapple-a-novel-internet-information-services-post-exploitation-framework-1.pdf
  - https://unit42.paloaltonetworks.com/unit42-oilrig-uses-rgdoor-iis-backdoor-targets-middle-east/
  - https://www.secureworks.com/research/bronze-union
  - https://github.com/redcanaryco/atomic-red-team/tree/master/atomics/T1505.004
custom_attributes:
  original_rule_id: 38fe731c-1f13-43d4-b878-a5bbe44807e3
  source_format: splunk_spl