title: Windows Impair Defense Overide Win Defender Phishing Filter
id: a27205e7-0744-5b5f-822c-ad466ab51a53
status: stable
level: high
description: |
  The following analytic detects modifications to the Windows registry that disable the Windows Defender phishing filter. It leverages data from the Endpoint.Registry data model, focusing on changes to specific registry values related to Microsoft Edge's phishing filter settings. This activity is significant because disabling the phishing filter can allow attackers to deceive users into visiting malicious websites without triggering browser warnings. If confirmed malicious, this could lead to user
author: Teoderick Contreras, Bhavin Patel, Splunk
logsource:
  product: windows
detection:
  selection:
    registry_path: '*\\MicrosoftEdge\\PhishingFilter*'
    registry_value_data: 0x00000000
    registry_value_name:
      - EnabledV9
      - PreventOverride
  condition: selection
tags:
  - attack.t1562.001
references:
  - https://x.com/malmoeb/status/1742604217989415386?s=20
  - https://github.com/undergroundwires/privacy.sexy
custom_attributes:
  original_rule_id: 10ca081c-57b1-4a78-ba56-14a40a7e116a
  source_format: splunk_spl