title: Windows Registry Dotnet ETW Disabled Via ENV Variable
id: 69a90764-8e5e-55b5-adec-671e659b79f0
status: stable
level: high
description: |
  The following analytic detects a registry modification that disables the ETW for the .NET Framework. It leverages data from the Endpoint.Registry data model, specifically monitoring changes to the COMPlus_ETWEnabled registry value under the "Environment" registry key path for both user (HKCU\Environment) and machine (HKLM\SYSTEM\CurrentControlSet\Control\Session Manager\Environment) scopes. This activity is significant because disabling ETW can allow attackers to evade Endpoint Detection and Res
author: Nasreddine Bencherchali, Splunk
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*\\Environment*'
    registry_value_name: COMPlus_ETWEnabled
    registry_value_data: 0x000000000
  condition: selection
tags:
  - attack.t1562.006
references:
  - https://gist.github.com/Cyb3rWard0g/a4a115fd3ab518a0e593525a379adee3
  - https://blog.xpnsec.com/hiding-your-dotnet-complus-etwenabled/
  - https://attack.mitre.org/techniques/T1562/006/
custom_attributes:
  original_rule_id: 55502381-5cce-491b-9277-7cb1d10bc0df
  source_format: splunk_spl