title: Windows Credentials from Password Stores Chrome Extension Access
id: 9bd60409-df03-5c16-9cf6-3f0b869e8cb3
status: stable
level: medium
description: |
  The following analytic detects non-Chrome processes attempting to access the Chrome extensions file. It leverages Windows Security Event logs, specifically event code 4663, to identify this behavior. This activity is significant because adversaries may exploit this file to extract sensitive information from the Chrome browser, posing a security risk. If confirmed malicious, this could lead to unauthorized access to stored credentials and other sensitive data, potentially compromising the securit
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    object_file_path: '*\\AppData\\Local\\Google\\Chrome\\User Data\\Default\\Local Extension Settings\\*'
    eventcode: 4663
    process_path:
      - '*:\\Windows\\explorer.exe'
      - '*\\chrome.exe'
  condition: selection
tags:
  - attack.t1012
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.redline_stealer
custom_attributes:
  original_rule_id: 2e65afe0-9a75-4487-bd87-ada9a9f1b9af
  source_format: splunk_spl