title: Windows DLL Side-Loading In Calc
id: 63dbc3d5-3ada-5ab9-a246-2b40839caffa
status: stable
level: high
description: |
  The following analytic detects suspicious DLL modules loaded by calc.exe that are not located in the %systemroot%\system32 or %systemroot%\sysWoW64 directories. This detection leverages Sysmon EventCode 7 to identify DLL side-loading, a technique often used by Qakbot malware to execute malicious DLLs. This activity is significant as it indicates potential malware execution through a trusted process, which can bypass security controls. If confirmed malicious, this could allow attackers to execute
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    image:
      - '*:\\windows\\system32\\*'
      - '*:\\windows\\sysWow64\\*'
    eventcode: 7
    imageloaded:
      - '*:\\windows\\system32\\*'
      - '*:\\windows\\sysWow64\\*'
      - '*:\\windows\\WinSXS\\*'
  condition: selection
tags:
  - attack.t1574.001
references:
  - https://www.bitdefender.com/blog/hotforsecurity/new-qakbot-malware-strain-replaces-windows-calculator-dll-to-infected-pcs/
custom_attributes:
  original_rule_id: af01f6db-26ac-440e-8d89-2793e303f137
  source_format: splunk_spl