title: Windows Impair Defense Delete Win Defender Profile Registry
id: ca68da74-da0e-5032-92b0-505b313b7289
status: stable
level: medium
description: |
  The following analytic detects the deletion of the Windows Defender main profile registry key. It leverages data from the Endpoint.Registry datamodel, specifically monitoring for deleted actions within the Windows Defender registry path. This activity is significant as it indicates potential tampering with security defenses, often associated with Remote Access Trojans (RATs) and other malware. If confirmed malicious, this action could allow an attacker to disable Windows Defender, reducing the s
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    registry_path: '*\\Policies\\Microsoft\\Windows Defender'
    action: deleted
  condition: selection
tags:
  - attack.t1562.001
references:
  - https://blog.malwarebytes.com/malwarebytes-news/2021/02/lazyscripter-from-empire-to-double-rat/
  - https://app.any.run/tasks/45f5d114-91ea-486c-ab01-41c4093d2861/
custom_attributes:
  original_rule_id: 65d4b105-ec52-48ec-ac46-289d0fbf7d96
  source_format: splunk_spl