title: Windows SQL Server Critical Procedures Enabled
id: 732102ff-56e8-50b6-95f2-33d013d1b753
status: stable
level: high
description: |
  This detection identifies when critical SQL Server configuration options are modified, including "Ad Hoc Distributed Queries", "external scripts enabled", "Ole Automation Procedures", "clr enabled", and "clr strict security". These features can be abused by attackers for various malicious purposes - Ad Hoc Distributed Queries enables Active Directory reconnaissance through ADSI provider, external scripts and Ole Automation allow execution of arbitrary code, and CLR features can be used to run cu
author: Michael Haag, Splunk, sidoyle from Splunk Community
logsource:
  product: windows
detection:
  selection:
    old_value:
      - 0
      - 1
    new_value:
      - 1
      - 0
    change_type:
      - enabled
      - disabled
    risk_message: SQL Server critical procedure 
    eventcode: 15457
    field: EventData_Xml
    config_name:
      - Ad Hoc Distributed Queries
      - external scripts enabled
      - Ole Automation Procedures
      - clr enabled
      - clr strict security
  condition: selection
tags:
  - attack.t1505.001
references:
  - https://learn.microsoft.com/en-us/sql/database-engine/configure-windows/ad-hoc-distributed-queries-server-configuration-option
  - https://learn.microsoft.com/en-us/sql/database-engine/configure-windows/external-scripts-enabled-server-configuration-option
  - https://learn.microsoft.com/en-us/sql/database-engine/configure-windows/ole-automation-procedures-server-configuration-option
  - https://learn.microsoft.com/en-us/sql/database-engine/configure-windows/clr-enabled-server-configuration-option
  - https://www.netspi.com/blog/technical/network-penetration-testing/enumerating-domain-accounts-via-sql-server-using-adsi/
custom_attributes:
  original_rule_id: d0434864-b043-41e3-8c08-30e53605e9cb
  source_format: splunk_spl