title: Windows Steal Authentication Certificates - ESC1 Abuse
id: 0e68245c-101e-5878-8c00-d519951aa7f3
status: stable
level: high
description: |
  The following analytic detects when a new certificate is requested or granted against Active Directory Certificate Services (AD CS) using a Subject Alternative Name (SAN). It leverages Windows Security Event Codes 4886 and 4887 to identify these actions. This activity is significant because improperly configured certificate templates can be exploited for privilege escalation and environment compromise. If confirmed malicious, an attacker could gain elevated privileges or persist within the envir
author: Steven Dick
logsource:
  product: windows
  category: authentication
detection:
  selection:
    attributes:
      - '*SAN:*upn*'
      - '*CertificateTemplate:*'
    field:
      - Attributes
      - Attributes
      - Attributes
      - Attributes
      - Requester
    max_match:
      - 10
      - 10
    eventcode:
      - 4886
      - 4887
  condition: selection
tags:
  - attack.t1649
references:
  - https://specterops.io/wp-content/uploads/sites/3/2022/06/Certified_Pre-Owned.pdf
  - https://github.com/ly4k/Certipy#esc1
  - https://pentestlaboratories.com/2021/11/08/threat-hunting-certificate-account-persistence/
custom_attributes:
  original_rule_id: cbe761fc-d945-4c8c-a71d-e26d12255d32
  source_format: splunk_spl