title: Windows Important Audit Policy Disabled
id: 1db21d66-2ff6-5400-b89d-fd3a5be0dd0b
status: stable
level: high
description: |
  The following analytic detects the disabling of important audit policies. It leverages EventCode 4719 from Windows Security Event Logs to identify changes where success or failure auditing is removed. This activity is significant as it suggests an attacker may have gained access to the domain controller and is attempting to evade detection by tampering with audit policies. If confirmed malicious, this could lead to severe consequences, including data theft, privilege escalation, and full network
author: Nasreddine Bencherchali, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 4719
    auditpolicychanges:
      - '%%8448'
      - '%%8450'
      - '%%8448'
      - '%%8450'
    changes:
      - Failure removed
      - Success removed
      - Success removed
      - Failure removed
  condition: selection
tags:
  - attack.t1562.001
references:
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4719
custom_attributes:
  original_rule_id: 1bf500e5-1226-41d9-af5d-ed1f577929f2
  source_format: splunk_spl