title: Windows InProcServer32 New Outlook Form
id: fe3c66db-655e-5b41-bdef-d1da39fcc734
status: stable
level: medium
description: |
  The following analytic detects the creation or modification of registry keys associated with new Outlook form installations, potentially indicating exploitation of CVE-2024-21378. It leverages data from the Endpoint.Registry datamodel, focusing on registry paths involving InProcServer32 keys linked to Outlook forms. This activity is significant as it may signify an attempt to achieve authenticated remote code execution via malicious form objects. If confirmed malicious, this could allow an attac
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    registry_path: '*\\InProcServer32\\*'
  condition: selection
tags:
  - attack.t1566
  - attack.t1112
references:
  - https://www.netspi.com/blog/technical/red-team-operations/microsoft-outlook-remote-code-execution-cve-2024-21378/
custom_attributes:
  original_rule_id: fedb49c4-4bd7-4d42-8fd9-f8c8538c73c4
  source_format: splunk_spl