title: Windows KrbRelayUp Service Creation
id: 2dc65e20-5a2b-5167-b0bf-0d094ebfab9d
status: stable
level: high
description: |
  The following analytic detects the creation of a service with the default name "KrbSCM" associated with the KrbRelayUp tool. It leverages Windows System Event Logs, specifically EventCode 7045, to identify this activity. This behavior is significant as KrbRelayUp is a known tool used for privilege escalation attacks. If confirmed malicious, this activity could allow an attacker to escalate privileges, potentially gaining unauthorized access to sensitive systems and data.
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 7045
    servicename:
      - KrbSCM
  condition: selection
tags:
  - attack.t1543.003
references:
  - https://github.com/Dec0ne/KrbRelayUp
custom_attributes:
  original_rule_id: e40ef542-8241-4419-9af4-6324582ea60a
  source_format: splunk_spl