title: Windows Access Token Manipulation SeDebugPrivilege
id: 4a9bfec7-cb47-5b84-98ac-2405dec5abdd
status: stable
level: medium
description: |
  The following analytic detects a process enabling the "SeDebugPrivilege" privilege token. It leverages Windows Security Event Logs with EventCode 4703, filtering out common legitimate processes. This activity is significant because SeDebugPrivilege allows a process to inspect and modify the memory of other processes, potentially leading to credential dumping or code injection. If confirmed malicious, an attacker could gain extensive control over system processes, enabling them to escalate privil
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    enabledprivilegelist: '*SeDebugPrivilege*'
    eventcode: 4703
    processname:
      - '*\\Program File*'
      - '*\\System32\\lsass.exe*'
      - '*\\SysWOW64\\lsass.exe*'
      - '*\\SysWOW64\\svchost.exe*'
      - '*\\System32\\svchost.exe*'
  condition: selection
tags:
  - attack.t1134.002
references:
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4703
  - https://devblogs.microsoft.com/oldnewthing/20080314-00/?p=23113
  - https://blog.palantir.com/windows-privilege-abuse-auditing-detection-and-defense-3078a403d74e
  - https://atomicredteam.io/privilege-escalation/T1134.001/#atomic-test-2---%60sedebugprivilege%60-token-duplication
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.asyncrat
custom_attributes:
  original_rule_id: 6ece9ed0-5f92-4315-889d-48560472b188
  source_format: splunk_spl