title: Windows Administrative Shares Accessed On Multiple Hosts
id: a77e3fba-9820-5fcb-a278-1b31426dd773
status: stable
level: high
description: |
  The following analytic detects a source computer accessing Windows administrative shares (C$, Admin$, IPC$) on 30 or more remote endpoints within a 5-minute window. It leverages Event IDs 5140 and 5145 from file share events. This behavior is significant as it may indicate an adversary enumerating network shares to locate sensitive files, a common tactic used by threat actors. If confirmed malicious, this activity could lead to unauthorized access to critical data, lateral movement, and potentia
author: Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    sharename:
      - \\\\*\\ADMIN$
      - \\\\*\\IPC$
      - \\\\*\\C$
    eventcode:
      - 5140
      - 5145
    span: 5m
  condition: selection
tags:
  - attack.t1135
references:
  - https://attack.mitre.org/techniques/T1135/
  - https://en.wikipedia.org/wiki/Administrative_share
  - https://thedfirreport.com/2023/01/23/sharefinder-how-threat-actors-discover-file-shares/
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5140
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5145
custom_attributes:
  original_rule_id: d92f2d95-05fb-48a7-910f-4d3d61ab8655
  source_format: splunk_spl