title: Windows Registry Delete Task SD
id: 44f51956-8905-5b8d-8e1a-ed134740f881
status: stable
level: medium
description: |
  The following analytic detects a process attempting to delete a scheduled task's Security Descriptor (SD) from the registry path of that task. It leverages the Endpoint.Registry data model to identify registry actions performed by the SYSTEM user, specifically targeting deletions or modifications of the SD value. This activity is significant as it may indicate an attempt to remove evidence of a scheduled task for defense evasion. If confirmed malicious, it suggests an attacker with privileged ac
author: Michael Haag, Teoderick Contreras, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    user: SYSTEM
    registry_value_name: SD
    action: Deleted
    registry_path:
      - '*\\Schedule\\TaskCache\\Tree\\*'
  condition: selection
tags:
  - attack.t1053.005
  - attack.t1562
references:
  - https://www.microsoft.com/security/blog/2022/04/12/tarrask-malware-uses-scheduled-tasks-for-defense-evasion/
  - https://gist.github.com/MHaggis/5f7fd6745915166fc6da863d685e2728
  - https://gist.github.com/MHaggis/b246e2fae6213e762a6e694cabaf0c17
custom_attributes:
  original_rule_id: ffeb7893-ff06-446f-815b-33ca73224e92
  source_format: splunk_spl