title: Windows Default Group Policy Object Modified
id: 44d73764-2e72-5db7-9ae1-1581f97653ca
status: stable
level: high
description: |
  The following analytic detects modifications to default Group Policy Objects (GPOs) using Event ID 5136. It monitors changes to the `Default Domain Controllers Policy` and `Default Domain Policy`, which are critical for enforcing security settings across domain controllers and all users/computers, respectively. This activity is significant because unauthorized changes to these GPOs can indicate an adversary with privileged access attempting to deploy persistence mechanisms or execute malware acr
author: Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    objectdn:
      - CN={31B2F340-016D-11D2-945F-00C04FB984F9},CN=POLICIES,CN=SYSTEM,DC=*
      - CN={6AC1786C-016F-11D2-945F-00C04fB984F9},CN=POLICIES,CN=SYSTEM,DC=*
    eventcode: 5136
    objectclass: groupPolicyContainer
    attributeldapdisplayname: versionNumber
  condition: selection
tags:
  - attack.t1484.001
references:
  - https://attack.mitre.org/techniques/T1484/
  - https://attack.mitre.org/techniques/T1484/001
  - https://www.trustedsec.com/blog/weaponizing-group-policy-objects-access/
  - https://adsecurity.org/?p=2716
custom_attributes:
  original_rule_id: fe6a6cc4-9e0d-4d66-bcf4-2c7f44860876
  source_format: splunk_spl