title: Windows Hijack Execution Flow Version Dll Side Load
id: d0806fd9-41f9-5757-bccd-33e175dc7033
status: stable
level: medium
description: |
  The following analytic detects a process loading a version.dll file from a directory other than %windir%\system32 or %windir%\syswow64. This detection leverages Sysmon EventCode 7 to identify instances where an unsigned or improperly located version.dll is loaded. This activity is significant as it is a common technique used in ransomware and APT malware campaigns, including Brute Ratel C4, to execute malicious code via DLL side loading. If confirmed malicious, this could allow attackers to exec
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    imageloaded:
      - '*\\windows\\system32*'
      - '*\\windows\\syswow64\\*'
    signed: 'false'
    eventcode: 7
  condition: selection
tags:
  - attack.t1574.001
references:
  - https://www.mdsec.co.uk/2022/08/part-3-how-i-met-your-beacon-brute-ratel/
custom_attributes:
  original_rule_id: 8351340b-ac0e-41ec-8b07-dd01bf32d6ea
  source_format: splunk_spl