title: Windows Kerberos Local Successful Logon
id: e649c070-651f-5ac9-8546-54020a1b8eff
status: stable
level: high
description: |
  The following analytic identifies a local successful authentication event on a Windows endpoint using the Kerberos package. It detects EventCode 4624 with LogonType 3 and source address 127.0.0.1, indicating a login to the built-in local Administrator account. This activity is significant as it may suggest a Kerberos relay attack, a method attackers use to escalate privileges. If confirmed malicious, this could allow an attacker to gain unauthorized access to sensitive systems, execute arbitrary
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 4624
    logontype: 3
    authenticationpackagename: Kerberos
    action: success
  condition: selection
tags:
  - attack.t1558
references:
  - https://github.com/Dec0ne/KrbRelayUp
custom_attributes:
  original_rule_id: 8309c3a8-4d34-48ae-ad66-631658214653
  source_format: splunk_spl