title: Windows Office Product Loading VBE7 DLL
id: e3706add-36eb-55fc-a213-135f581ff2eb
status: stable
level: medium
description: |
  The following analytic identifies office documents executing macro code. It leverages Sysmon EventCode 7 to detect when processes like WINWORD.EXE or EXCEL.EXE load specific DLLs associated with macros (e.g., VBE7.DLL). This activity is significant because macros are a common attack vector for delivering malicious payloads, such as malware. If confirmed malicious, this could lead to unauthorized code execution, data exfiltration, or further compromise of the system. Disabling macros by default i
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 7
    process_name:
      - EQNEDT32.exe
      - excel.exe
      - Graph.exe
      - msaccess.exe
      - mspub.exe
      - onenote.exe
      - onenoteim.exe
      - onenotem.exe
      - outlook.exe
      - powerpnt.exe
      - visio.exe
      - winproj.exe
      - winword.exe
    loaded_file_path:
      - '*\\VBE7INTL.DLL'
      - '*\\VBE7.DLL'
      - '*\\VBEUI.DLL'
  condition: selection
tags:
  - attack.t1566.001
references:
  - https://www.joesandbox.com/analysis/386500/0/html
  - https://www.joesandbox.com/analysis/702680/0/html
  - https://bazaar.abuse.ch/sample/02cbc1ab80695fc12ff8822b926957c3a600247b9ca412a137f69cb5716c8781/
  - https://www.fortinet.com/blog/threat-research/latest-remcos-rat-phishing
  - https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/trojanized-onenote-document-leads-to-formbook-malware/
custom_attributes:
  original_rule_id: 7cfec906-2697-43f7-898b-83634a051d9a
  source_format: splunk_spl