title: Windows Multiple Invalid Users Failed To Authenticate Using NTLM
id: 54098fdb-f4d1-5345-b7a5-ec2c02a7c8ea
status: stable
level: high
description: |
  The following analytic detects a single source endpoint failing to authenticate with 30 unique invalid users using the NTLM protocol. It leverages EventCode 4776 from Domain Controller logs, focusing on error code 0xC0000064, which indicates non-existent usernames. This behavior is significant as it may indicate a Password Spraying attack, where an adversary attempts to gain initial access or elevate privileges. If confirmed malicious, this activity could lead to unauthorized access, privilege e
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    eventcode: 4776
    status: 0xc0000064
    span: 5m
  condition: selection
tags:
  - attack.t1110.003
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/audit-credential-validation
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4776
custom_attributes:
  original_rule_id: 57ad5a64-9df7-11eb-a290-acde48001122
  source_format: splunk_spl