title: Windows Outlook Dialogs Disabled from Unusual Process
id: ee195c9f-ded2-5029-8e9e-c34190bd327b
status: stable
level: high
description: |
  The following analytic detects the modification of the Windows Registry key "PONT_STRING" under Outlook Options. This disables certain dialog popups, which could allow malicious scripts to run without notice. This detection leverages data from the Endpoint.Registry datamodel to search for this key changing from an unusual process. This activity is significant as it is commonly associated with some malware infections, indicating potential malicious intent to harvest email information.
author: Raven Tait, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    registry_path: '*\\Outlook\\Options\\General*'
    registry_value_name: PONT_STRING
    process_name: Outlook.exe
    span: 1h
  condition: selection
tags:
  - attack.t1112
  - attack.t1562
references:
  - https://lab52.io/blog/analyzing-notdoor-inside-apt28s-expanding-arsenal/
  - https://hackread.com/russian-apt28-notdoor-backdoor-microsoft-outlook/
custom_attributes:
  original_rule_id: 94e3ba29-6245-4f25-8d47-d5b6b34c40ac
  source_format: splunk_spl