title: Windows File Share Discovery With Powerview
id: d8593312-c40c-595e-b648-985aff842797
status: stable
level: high
description: |
  The following analytic detects the execution of the Invoke-ShareFinder PowerShell cmdlet from PowerView. This detection leverages PowerShell Script Block Logging to identify instances where this specific command is executed. Monitoring this activity is crucial as it indicates an attempt to enumerate network file shares, which may contain sensitive information such as backups, scripts, and credentials. If confirmed malicious, this activity could enable an attacker to escalate privileges or move l
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    eventcode: 4104
  condition: selection
tags:
  - attack.t1135
references:
  - https://github.com/PowerShellEmpire/PowerTools/blob/master/PowerView/powerview.ps1
  - https://thedfirreport.com/2023/01/23/sharefinder-how-threat-actors-discover-file-shares/
  - https://attack.mitre.org/techniques/T1135/
custom_attributes:
  original_rule_id: a44c0be1-d7ab-41e4-92fd-aa9af4fe232c
  source_format: splunk_spl