title: Windows Firewall Rule Added
id: bb75f14a-d921-55a3-9265-1145dd13a18b
status: stable
level: medium
description: |
  This detection identifies instances where a Windows Firewall rule is added by monitoring Event ID 4946 in the Windows Security Event Log. Firewall rule modifications can indicate legitimate administrative actions, but they may also signal unauthorized changes, misconfigurations, or malicious activity such as attackers allowing traffic for backdoors or persistence mechanisms. By analyzing fields like RuleName, RuleId, Computer, and ProfileChanged, security teams can determine whether the change a
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 4946
  condition: selection
tags:
  - attack.t1562.004
references:
  - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4946
custom_attributes:
  original_rule_id: efc25501-4e75-4075-8cc5-ac80f2847d80
  source_format: splunk_spl