title: Windows Remote Services Allow Rdp In Firewall
id: f41e77cb-1265-5597-a658-0b5abaf4c81e
status: stable
level: medium
description: |
  The following analytic detects modifications to the Windows firewall to enable Remote Desktop Protocol (RDP) on a targeted machine. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions involving "netsh.exe" to allow TCP port 3389. This activity is significant as it may indicate an adversary attempting to gain remote access to a compromised host, a common tactic for lateral movement. If confirmed malicious, this could allow attackers to remotely
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    process_name: netsh.exe
    original_file_name: netsh.exe
    process:
      - '*firewall*'
      - '*add*'
      - '*protocol=TCP*'
      - '*localport=3389*'
      - '*action=allow*'
  condition: selection
tags:
  - attack.t1021.001
references:
  - https://app.any.run/tasks/a6f2ffe2-e6e2-4396-ae2e-04ea0143f2d8/
custom_attributes:
  original_rule_id: 9170cb54-ea15-41e1-9dfc-9f3363ce9b02
  source_format: splunk_spl