title: Windows Command and Scripting Interpreter Path Traversal Exec
id: 15074a07-2a17-56a4-b922-8e67d0b46e95
status: stable
level: high
description: |
  The following analytic detects path traversal command-line execution, often used in malicious documents to execute code via msdt.exe for defense evasion. It leverages Endpoint Detection and Response (EDR) data, focusing on specific patterns in process paths. This activity is significant as it can indicate an attempt to bypass security controls and execute unauthorized code. If confirmed malicious, this behavior could lead to code execution, privilege escalation, or persistence within the environ
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    os: Linux
    process:
      - '*\/..\/..\/..\/*'
      - '*\\..\\..\\..\\*'
      - '*\/\/..\/\/..\/\/..\/\/*'
  condition: selection
tags:
  - attack.t1059
references:
  - https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
custom_attributes:
  original_rule_id: 58fcdeb1-728d-415d-b0d7-3ab18a275ec2
  source_format: splunk_spl