title: Windows Defender ASR Rules Stacking
id: ff941eaf-f182-51ec-915c-cefd4206100c
status: stable
level: low
description: |
  The following analytic identifies security events from Microsoft Defender, focusing on Exploit Guard and Attack Surface Reduction (ASR) features. It detects Event IDs 1121, 1126, 1131, and 1133 for blocked operations, and Event IDs 1122, 1125, 1132, and 1134 for audit logs. Event ID 1129 indicates user overrides, while Event ID 5007 signals configuration changes. This detection uses a lookup to correlate ASR rule GUIDs with descriptive names. Monitoring these events is crucial for identifying un
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    value: 'NULL'
    eventcode:
      - 1121
      - 1122
      - 1125
      - 1126
      - 1129
      - 1131
      - 1132
      - 1133
      - 1134
      - 5007
  condition: selection
tags:
  - attack.t1566.001
  - attack.t1566.002
  - attack.t1059
references:
  - https://asrgen.streamlit.app/
  - https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/attack-surface-reduction?view=o365-worldwide
custom_attributes:
  original_rule_id: 425a6657-c5e4-4cbb-909e-fc9e5d326f01
  source_format: splunk_spl