title: Windows Multiple Account Passwords Changed
id: 23dbd51d-9807-5df6-80f9-8606be3c7300
status: stable
level: high
description: |
  The following analytic detects instances where more than five unique Windows account passwords are changed within a 10-minute interval. It leverages Event Code 4724 from the Windows Security Event Log, using the wineventlog_security dataset to monitor and count distinct TargetUserName values. This behavior is significant as rapid password changes across multiple accounts are unusual and may indicate unauthorized access or internal compromise. If confirmed malicious, this activity could lead to w
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    eventcode: 4724
    status: success
    span: 10m
  condition: selection
tags:
  - attack.t1098
  - attack.t1078
references:
  - https://attack.mitre.org/techniques/T1098/
custom_attributes:
  original_rule_id: faefb681-14be-4f0d-9cac-0bc0160c7280
  source_format: splunk_spl