title: Windows Default RDP File Creation By Non MSTSC Process
id: ed05b56c-fb7c-5ad6-bfd0-eaed45631e9f
status: stable
level: medium
description: |
  This detection monitors the creation or modification of the Default.rdp file by non mstsc.exe process, typically found in the user's Documents folder. This file is automatically generated or updated by the Remote Desktop Connection client (mstsc.exe) when a user initiates an RDP session. It stores connection settings such as the last-used hostname, screen size, and other preferences. The presence or update of this file strongly suggests that an RDP session has been launched from the system. Sinc
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    span:
      - 1h
      - 1h
  condition: selection
tags:
  - attack.t1021.001
references:
  - https://medium.com/@bonguides25/how-to-clear-rdp-connections-history-in-windows-cf0ffb67f344
  - https://thelocalh0st.github.io/posts/rdp/
  - https://iam0xc4t.medium.com/rogue-rdp-via-spear-phishing-initial-access-tactic-d7be328a0b13
custom_attributes:
  original_rule_id: 692226f1-84e3-4f63-a747-d53e65699608
  source_format: splunk_spl