title: Windows Exfiltration Over C2 Via Invoke RestMethod
id: 1acc34e5-0ba3-5d1e-bbed-6823a19706f2
status: stable
level: high
description: |
  The following analytic detects potential data exfiltration using PowerShell's Invoke-RestMethod. It leverages PowerShell Script Block Logging to identify scripts that attempt to upload files via HTTP POST requests. This activity is significant as it may indicate an attacker is exfiltrating sensitive data, such as desktop screenshots or files, to an external command and control (C2) server. If confirmed malicious, this could lead to data breaches, loss of sensitive information, and further compro
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    scriptblocktext:
      - '*Invoke-RestMethod *'
      - '* -Uri *'
      - '* -Method *'
      - '* Post *'
      - '* -InFile *'
    eventcode: 4104
  condition: selection
tags:
  - attack.t1041
references:
  - https://twitter.com/_CERT_UA/status/1620781684257091584
  - https://cert.gov.ua/article/3761104
custom_attributes:
  original_rule_id: 06ade821-f6fa-40d0-80af-15bc1d45b3ba
  source_format: splunk_spl