title: Windows Group Discovery Via Net
id: d18734ee-a408-5ecf-9a20-ed8973c79b66
status: stable
level: low
description: |
  The following analytic identifies the execution of `net.exe` with command-line arguments used to query global, local and domain groups. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line arguments. This activity is significant as it indicates potential reconnaissance efforts by adversaries to enumerate local or domain groups, which is a common step in Active Directory or privileged accounts discovery. If confirmed malicious, this behav
author: Michael Haag, Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    process:
      - '*group*'
      - '*/add'
      - '*/delete'
  condition: selection
tags:
  - attack.t1069.001
  - attack.t1069.002
references:
  - https://attack.mitre.org/techniques/T1069/002/
  - https://attack.mitre.org/techniques/T1069/001/
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1069.001/T1069.001.md
  - https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF
  - https://thedfirreport.com/2023/05/22/icedid-macro-ends-in-nokoyawa-ransomware/
custom_attributes:
  original_rule_id: c5c8e0f3-147a-43da-bf04-4cfaec27dc44
  source_format: splunk_spl