title: Windows Office Product Spawned Uncommon Process
id: 000ece2d-cade-5a59-83f8-0b5a0d723a77
status: stable
level: high
description: |
  The following analytic detects a Microsoft Office product spawning uncommon processes. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process creation events where Office applications are the parent process. This activity is significant as it may indicate an attempt of a malicious macro execution or exploitation of an unknown vulnerability in an office product, in order to bypass security controls. If confirmed malicious, this behavior could allow an
author: Michael Haag, Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    process_name:
      - bitsadmin.exe
      - certutil.exe
      - cmd.exe
      - cscript.exe
      - mshta.exe
      - powershell.exe
      - pwsh.exe
      - regsvr32.exe
      - rundll32.exe
      - wmic.exe
      - wscript.exe
    original_file_name:
      - bitsadmin.exe
      - CertUtil.exe
      - Cmd.Exe
      - cscript.exe
      - MSHTA.EXE
      - PowerShell.EXE
      - pwsh.dll
      - REGSVR32.EXE
      - RUNDLL32.EXE
      - wmic.exe
      - wscript.exe
  condition: selection
tags:
  - attack.t1566.001
references:
  - https://any.run/malware-trends/trickbot
  - https://any.run/report/47561b4e949041eff0a0f4693c59c81726591779fe21183ae9185b5eb6a69847/aba3722a-b373-4dae-8273-8730fb40cdbe
  - https://app.any.run/tasks/fb894ab8-a966-4b72-920b-935f41756afd/
  - https://attack.mitre.org/techniques/T1047/
  - https://bazaar.abuse.ch/sample/02cbc1ab80695fc12ff8822b926957c3a600247b9ca412a137f69cb5716c8781/
custom_attributes:
  original_rule_id: 55d8741c-fa32-4692-8109-410304961eb8
  source_format: splunk_spl