title: Windows AD DSRM Password Reset
id: 101ffa96-5524-53ff-aa4f-07032314b434
status: stable
level: high
description: |
  The following analytic detects attempts to reset the Directory Services Restore Mode (DSRM) administrator password on a Domain Controller. It leverages event code 4794 from the Windows Security Event Log, specifically looking for events where the DSRM password reset is attempted. This activity is significant because the DSRM account can be used similarly to a local administrator account, providing potential persistence for an attacker. If confirmed malicious, this could allow an attacker to main
author: Dean Luxton
logsource:
  product: windows
  category: authentication
detection:
  selection:
    result_id: 4794
    result: set the Directory Services Restore Mode administrator password
    datamodel: Change
  condition: selection
tags:
  - attack.t1098
references:
  - https://adsecurity.org/?p=1714
custom_attributes:
  original_rule_id: d1ab841c-36a6-46cf-b50f-b2b04b31182a
  source_format: splunk_spl