title: Windows Indirect Command Execution Via forfiles
id: c139ff61-f1bc-5c95-9289-7162e436c11e
status: stable
level: high
description: |
  The following analytic detects the execution of programs initiated by forfiles.exe. This command is typically used to run commands on multiple files, often within batch scripts. The detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process creation events where forfiles.exe is the parent process. This activity is significant because forfiles.exe can be exploited to bypass command line execution protections, making it a potential vector for malicious activity
author: Eric McGinnis, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    parent_process: '*forfiles* /c *'
  condition: selection
tags:
  - attack.t1202
references:
  - https://twitter.com/KyleHanslovan/status/912659279806640128
  - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/forfiles
custom_attributes:
  original_rule_id: 1fdf31c9-ff4d-4c48-b799-0e8666e08787
  source_format: splunk_spl