title: Windows Disable or Modify Tools Via Taskkill
id: 83926444-7734-5bff-b079-3c8f41e6966a
status: stable
level: medium
description: |
  The following analytic identifies the use of taskkill.exe to forcibly terminate processes. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions that include specific taskkill parameters. This activity is significant because it can indicate attempts to disable security tools or disrupt legitimate applications, a common tactic in malware operations. If confirmed malicious, this behavior could allow attackers to evade detection, disrupt system sta
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    process_name: taskkill.exe
    process:
      - '* /im*'
      - '* /pid*'
  condition: selection
tags:
  - attack.t1562.001
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.njrat
custom_attributes:
  original_rule_id: a43ae66f-c410-4b3d-8741-9ce1ad17ddb0
  source_format: splunk_spl