title: Windows AD GPO Deleted
id: 85ec5e4d-ab57-5915-b0da-b7c5ef191af5
status: stable
level: high
description: |
  This detection identifies when an Active Directory Group Policy is deleted using the Group Policy Management Console.
author: Dean Luxton
logsource:
  product: windows
  category: file_event
detection:
  selection:
    objectcategory: CN=Group-Policy-Container*
    eventcode: 5136
    attributeldapdisplayname: gpLink
    field:
      - old_value
      - new_value
    max_match:
      - 10000
      - 10000
    type: outer
    admoneventtype: Update
    old_dn:
      - new_dn
  condition: selection
tags:
  - attack.t1562.001
  - attack.t1484.001
references:
  - https://lantern.splunk.com/Security/Product_Tips/Enterprise_Security/Enabling_an_audit_trail_from_Active_Directory
custom_attributes:
  original_rule_id: 0d41772b-35ab-4e1c-a2ba-d0b455481aee
  source_format: splunk_spl