title: Windows System LogOff Commandline
id: 25401a96-fe99-5128-b1e2-fb260e015d79
status: stable
level: medium
description: |
  The following analytic detects the execution of the Windows command line to log off a host machine. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on processes involving `shutdown.exe` with specific parameters. This activity is significant as it is often associated with Advanced Persistent Threats (APTs) and Remote Access Trojans (RATs) like dcrat, which use this technique to disrupt operations, aid in system destruction, or inhibit recovery. If confirmed malicious
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    process:
      - '* /t*'
      - '* -t*'
      - '* /f*'
      - '* -f*'
  condition: selection
tags:
  - attack.t1529
references:
  - https://attack.mitre.org/techniques/T1529/
  - https://www.mandiant.com/resources/analyzing-dark-crystal-rat-backdoor
custom_attributes:
  original_rule_id: 74a8133f-93e7-4b71-9bd3-13a66124fd57
  source_format: splunk_spl