title: Windows Diskshadow Proxy Execution
id: 22bcdc70-c11a-5316-abdc-198fdf9d9171
status: stable
level: high
description: |
  The following analytic detects the use of DiskShadow.exe in scripting mode, which can execute arbitrary unsigned code. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions with scripting mode flags. This activity is significant because DiskShadow.exe is typically used for legitimate backup operations, but its misuse can indicate an attempt to execute unauthorized code. If confirmed malicious, this could lead to unauthorized code execution, pote
author: Lou Stella, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    process:
      - '*-s*'
      - '*/s*'
  condition: selection
tags:
  - attack.t1218
references:
  - https://bohops.com/2018/03/26/diskshadow-the-return-of-vss-evasion-persistence-and-active-directory-database-extraction/
custom_attributes:
  original_rule_id: 58adae9e-8ea3-11ec-90f6-acde48001122
  source_format: splunk_spl