title: Windows System File on Disk
id: 3f2f18c0-e458-5f20-86e0-a59e6bd0ffb7
status: stable
level: low
description: |
  The following analytic detects the creation of new .sys files on disk. It leverages the Endpoint.Filesystem data model to identify and log instances where .sys files are written to the filesystem. This activity is significant because .sys files are often used as kernel mode drivers, and their unauthorized creation can indicate malicious activity such as rootkit installation. If confirmed malicious, this could allow an attacker to gain kernel-level access, leading to full system compromise, persi
author: Michael Haag, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    file_name: '*.sys*'
  condition: selection
tags:
  - attack.t1068
references:
  - https://redcanary.com/blog/tracking-driver-inventory-to-expose-rootkits/
custom_attributes:
  original_rule_id: 993ce99d-9cdd-42c7-a2cf-733d5954e5a6
  source_format: splunk_spl