title: Windows Sensitive Group Discovery With Net
id: d63c04a1-e5b1-5868-b57a-38a63af5869f
status: stable
level: medium
description: |
  The following analytic detects the execution of `net.exe` with command-line arguments used to query elevated domain or sensitive groups. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant as it indicates potential reconnaissance efforts by adversaries to identify high-privileged users within Active Directory. If confirmed malicious, this behavior could lead to further attacks aimed at compromisi
author: Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    process:
      - '*Domain Admins*'
      - '*Enterprise Admins*'
      - '*Schema Admins*'
      - '*Account Operators*'
      - '*Server Operators*'
      - '*Protected Users*'
      - '*Dns Admins*'
      - '*Domain Computers*'
  condition: selection
tags:
  - attack.t1069.002
references:
  - https://attack.mitre.org/techniques/T1069/002/
  - https://docs.microsoft.com/en-us/windows-server/identity/ad-ds/plan/security-best-practices/appendix-b--privileged-accounts-and-groups-in-active-directory
  - https://adsecurity.org/?p=3658
  - https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF
  - https://thedfirreport.com/2023/05/22/icedid-macro-ends-in-nokoyawa-ransomware/
custom_attributes:
  original_rule_id: d9eb7cda-5622-4722-bc88-7f2442f4b5af
  source_format: splunk_spl