title: Windows Known GraphicalProton Loaded Modules
id: bd468329-58c6-5936-a687-004e87d21b29
status: stable
level: medium
description: |
  The following analytic detects the loading of DLL modules associated with the GraphicalProton backdoor implant, commonly used by SVR in targeted attacks. It leverages Sysmon EventCode 7 to identify specific DLLs loaded by processes. This activity is significant as it may indicate the presence of a sophisticated backdoor, warranting immediate investigation. If confirmed malicious, the attacker could gain persistent access to the compromised host, potentially leading to further exploitation and da
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 7
    imageloaded:
      - '*\\AclNumsInvertHost.dll'
      - '*\\ModeBitmapNumericAnimate.dll'
      - '*\\UnregisterAncestorAppendAuto.dll'
      - '*\\DeregisterSeekUsers.dll'
      - '*\\ScrollbarHandleGet.dll'
      - '*\\PerformanceCaptionApi.dll'
      - '*\\WowIcmpRemoveReg.dll'
      - '*\\BlendMonitorStringBuild.dll'
      - '*\\HandleFrequencyAll.dll'
      - '*\\HardSwapColor.dll'
      - '*\\LengthInMemoryActivate.dll'
      - '*\\ParametersNamesPopup.dll'
      - '*\\ModeFolderSignMove.dll'
      - '*\\ChildPaletteConnected.dll'
      - '*\\AddressResourcesSpec.dll'
  condition: selection
tags:
  - attack.t1574.001
references:
  - https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-347a
custom_attributes:
  original_rule_id: bf471c94-0324-4b19-a113-d02749b969bc
  source_format: splunk_spl