title: Windows Service Creation Using Registry Entry
id: 38f018a0-8fb0-5b33-9ffe-14bfdb1878fb
status: stable
level: medium
description: |
  The following analytic detects the modification of registry keys that define Windows services using reg.exe. This detection leverages Splunk to search for specific keywords in the registry path, value name, and value data fields. This activity is significant because it indicates potential unauthorized changes to service configurations, a common persistence technique used by attackers. If confirmed malicious, this could allow an attacker to maintain access, escalate privileges, or move laterally 
author: Teoderick Contreras, Splunk, Steven Dick
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*\\SYSTEM\\CurrentControlSet\\Services*'
  condition: selection
tags:
  - attack.t1574.011
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/36d49de4c8b00bf36054294b4a1fcbab3917d7c5/atomics/T1574.011/T1574.011.md
custom_attributes:
  original_rule_id: 25212358-948e-11ec-ad47-acde48001122
  source_format: splunk_spl