title: Windows Executable Masquerading as Benign File Types
id: 8b192584-3b13-5abe-9419-a8ecfd577fe3
status: stable
level: medium
description: |
  The following analytic detects the presence of executable files masquerading as benign file types on Windows systems. Adversaries employ this technique to evade defenses and trick users into executing malicious code by renaming executables with extensions commonly associated with documents, images, or other non-executable formats (e.g., .pdf, .jpg, .doc, .png).
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    eventcode: 29
  condition: selection
tags:
  - attack.t1036.008
references:
  - https://www.linkedin.com/posts/mauricefielenbach_cybersecurity-incidentresponse-dfir-activity-7394805779448418304-g0gZ?utm_source=share&utm_medium=member_desktop&rcm=ACoAAAuFTjIB5weY_kcyu4qp3kHbI4v49tO0zEk
  - https://www.blackhillsinfosec.com/a-sysmon-event-id-breakdown/
  - https://thedfirreport.com/2023/10/30/netsupport-intrusion-results-in-domain-compromise/
  - https://www.esentire.com/blog/evalusion-campaign-delivers-amatera-stealer-and-netsupport-rat
custom_attributes:
  original_rule_id: 0470c8e7-dd8d-420f-8302-073e8a2b66f0
  source_format: splunk_spl