title: Windows Hunting System Account Targeting Lsass
id: 8867a105-1968-5f80-a98b-5fb3a7a384e7
status: stable
level: low
description: |
  The following analytic identifies processes attempting to access Lsass.exe, which may indicate credential dumping or applications needing credential access. It leverages Sysmon EventCode 10 to detect such activities by analyzing fields like TargetImage, GrantedAccess, and SourceImage. This behavior is significant as unauthorized access to Lsass.exe can lead to credential theft, posing a severe security risk. If confirmed malicious, attackers could gain access to sensitive credentials, potentiall
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 10
  condition: selection
tags:
  - attack.t1003.001
references:
  - https://en.wikipedia.org/wiki/Local_Security_Authority_Subsystem_Service
  - https://docs.microsoft.com/en-us/windows/win32/api/minidumpapiset/nf-minidumpapiset-minidumpwritedump
  - https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
  - https://raw.githubusercontent.com/PowerShellMafia/PowerSploit/master/Exfiltration/Invoke-Mimikatz.ps1
  - https://docs.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights?redirectedfrom=MSDN
custom_attributes:
  original_rule_id: 1c6abb08-73d1-11ec-9ca0-acde48001122
  source_format: splunk_spl