title: Windows Scheduled Task with Suspicious Name
id: caecec85-87b5-567f-8281-0f464180aadf
status: stable
level: high
description: |
  The following analytic detects the creation, modification, or enabling of scheduled tasks with known suspicious or malicious task names. It leverages Windows Security EventCode 4698, 4700, and 4702 to identify when such tasks are registered, modified, or enabled. This activity is significant as it may indicate an attempt to establish persistence or execute malicious commands on a system. If confirmed malicious, this could allow an attacker to maintain access, execute arbitrary code, or escalate 
author: Steven Dick
logsource:
  product: windows
detection:
  selection:
    dest: Computer
    eventcode:
      - 4698
      - 4700
      - 4702
  condition: selection
tags:
  - attack.t1053.005
references:
  - https://attack.mitre.org/techniques/T1053/005/
  - https://www.ic3.gov/CSA/2023/231213.pdf
  - https://news.sophos.com/en-us/2024/11/06/bengal-cat-lovers-in-australia-get-psspsspssd-in-google-driven-gootloader-campaign/
  - https://github.com/mthcht/awesome-lists/blob/main/Lists/suspicious_windows_tasks_list.csv
custom_attributes:
  original_rule_id: 9e9ab4e3-c9d0-4967-a197-6d755e8a7e6e
  source_format: splunk_spl