title: Windows InstallUtil Credential Theft
id: e857ada3-7952-5f9e-982c-9c07a9dcc3fc
status: stable
level: high
description: |
  The following analytic detects instances where the Windows InstallUtil.exe binary loads `vaultcli.dll` and `Samlib.dll`. This detection leverages Sysmon EventCode 7 to identify these specific DLL loads. This activity is significant because it can indicate an attempt to execute code that bypasses application control and captures credentials using tools like Mimikatz. If confirmed malicious, this behavior could allow an attacker to steal credentials, potentially leading to unauthorized access and 
author: Michael Haag, Mauricio Velazo, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    eventcode: 7
    loaded_file_path:
      - '*\\samlib.dll'
      - '*\\vaultcli.dll'
  condition: selection
tags:
  - attack.t1218.004
references:
  - https://gist.github.com/xorrior/bbac3919ca2aef8d924bdf3b16cce3d0
custom_attributes:
  original_rule_id: ccfeddec-43ec-11ec-b494-acde48001122
  source_format: splunk_spl