title: Windows SpeechRuntime Suspicious Child Process
id: c3e65245-81f6-57e8-9dc4-99d22071dbf6
status: stable
level: high
description: |
  SpeechRuntime is vulnerable to an attack that allows a user to run code on another user's session remotely and stealthily by exploiting a Windows COM class. When this class is invoked, it launches SpeechRuntime.exe in the context of the currently logged-on user. Because this COM class is susceptible to COM Hijacking, the attacker can alter the registry remotely to point to a malicious DLL. By dropping that DLL on the target system (e.g., via SMB) and triggering the COM object, the attacker cause
author: Raven Tait, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    parent_process_name: '*SpeechRuntime.exe*'
    process:
      - '*cmd.exe*'
      - '*powershell.exe*'
      - '*rundll32.exe*'
      - '*bitsadmin.exe*'
      - '*wmic.exe*'
      - '*cscript.exe*'
  condition: selection
tags:
  - attack.t1021.003
references:
  - https://github.com/rtecCyberSec/SpeechRuntimeMove
custom_attributes:
  original_rule_id: f7bb956f-b956-42a5-8c2c-ff9cdbbf7526
  source_format: splunk_spl