title: Windows Impair Defense Disable Win Defender Scan On Update
id: 0b69b181-ad12-5fc5-9f37-eda41e929f36
status: stable
level: high
description: |
  The following analytic detects modifications to the Windows registry that disable the Windows Defender Scan On Update feature. It leverages data from the Endpoint.Registry datamodel, specifically looking for changes to the "DisableScanOnUpdate" registry setting with a value of "0x00000001". This activity is significant because disabling automatic scans can leave systems vulnerable to malware and other threats. If confirmed malicious, this action could allow attackers to bypass Windows Defender, 
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    registry_path: '*\\Windows Defender\\Signature Updates\\DisableScanOnUpdate'
    registry_value_data: 0x00000001
  condition: selection
tags:
  - attack.t1562.001
references:
  - https://x.com/malmoeb/status/1742604217989415386?s=20
  - https://github.com/undergroundwires/privacy.sexy
custom_attributes:
  original_rule_id: 0418e72f-e710-4867-b656-0688e1523e09
  source_format: splunk_spl