title: Windows WPDBusEnum Registry Key Modification
id: 9c3486c0-3739-5066-bdb1-47d619f269b2
status: stable
level: medium
description: |
  This analytic is used to identify when a USB removable media device is attached to a Windows host. In this scenario we are querying the Endpoint Registry data model to look for modifications to the Windows Portable Device keys HKLM\SOFTWARE\Microsoft\Windows Portable Devices\Devices\ or HKLM\System\CurrentControlSet\Enum\SWD\WPDBUSENUM\ . Adversaries and Insider Threats may use removable media devices for several malicious activities, including initial access, execution, and exfiltration.
author: Steven Dick
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_value_name: FriendlyName
    registry_path:
      - HKLM\\SOFTWARE\\Microsoft\\Windows Portable Devices\\Devices\\*
      - HKLM\\System\\CurrentControlSet\\Enum\\SWD\\WPDBUSENUM\\*
  condition: selection
tags:
  - attack.t1200
  - attack.t1025
  - attack.t1091
references:
  - https://attack.mitre.org/techniques/T1200/
  - https://www.cisa.gov/news-events/news/using-caution-usb-drives
  - https://www.bleepingcomputer.com/news/security/fbi-hackers-use-badusb-to-target-defense-firms-with-ransomware/
custom_attributes:
  original_rule_id: 52b48e8b-eb6e-48b0-b8f1-73273f6b134e
  source_format: splunk_spl