title: Windows RDP Login Session Was Established
id: 347ab379-c3be-5a10-92b3-815de072f4ad
status: stable
level: medium
description: |
  The following analytic detects instances where a successful Remote Desktop Protocol (RDP) login session was established, as indicated by Windows Security Event ID 4624 with Logon Type 10. This event confirms that a user has not only provided valid credentials but has also initiated a full interactive RDP session. It is a key indicator of successful remote access to a Windows system. When correlated with Event ID 1149, which logs RDP authentication success, this analytic helps distinguish between
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    eventcode: 4624
    logon_type: 10
  condition: selection
tags:
  - attack.t1021.001
references:
  - https://medium.com/@bonguides25/how-to-clear-rdp-connections-history-in-windows-cf0ffb67f344
  - https://thelocalh0st.github.io/posts/rdp/
custom_attributes:
  original_rule_id: 00ca7f9e-88ab-4841-a6c2-83979ab1ed29
  source_format: splunk_spl