title: Windows AD Replication Request Initiated by User Account
id: 5eb17831-bfd1-5a8d-a097-d0fa7de0fdcb
status: stable
level: high
description: |
  The following analytic detects a user account initiating an Active Directory replication request, indicative of a DCSync attack. It leverages EventCode 4662 from the Windows Security Event Log, focusing on specific object types and replication permissions. This activity is significant because it can allow an attacker with sufficient privileges to request password hashes for any or all users within the domain. If confirmed malicious, this could lead to unauthorized access, privilege escalation, a
author: Dean Luxton
logsource:
  product: windows
detection:
  selection:
    accessmask: 0x100
    subjectusersid:
      - NT AUT*
      - S-1-5-18
    subjectdomainname: Window Manager
    subjectusername: '*$'
    search: search `wineventlog_security` EventCode=4624 TargetLogonId=$TargetLogonId$
    eventcode:
      - 4662
      - 4624
    objecttype:
      - '%{19195a5b-6da0-11d0-afd3-00c04fd930c9}'
      - domainDNS
    properties:
      - '*Replicating Directory Changes All*'
      - '*Manage Replication Topology*'
      - '*Remove Replica In Domain*'
      - '*{1131f6ad-9c07-11d1-f79f-00c04fc2dcd2}*'
      - '*{9923a32a-3607-11d2-b9be-0000f87a36b2}*'
      - '*{1131f6ac-9c07-11d1-f79f-00c04fc2dcd2}*'
  condition: selection
tags:
  - attack.t1003.006
references:
  - https://adsecurity.org/?p=1729
  - https://www.linkedin.com/pulse/mimikatz-dcsync-event-log-detections-john-dwyer
  - https://github.com/SigmaHQ/sigma/blob/0.22-699-g29a5c6278/rules/windows/builtin/security/win_security_dcsync.yml
custom_attributes:
  original_rule_id: 51307514-1236-49f6-8686-d46d93cc2821
  source_format: splunk_spl