title: Windows WMI Process And Service List
id: c2c8d1b2-d273-5026-9b80-b8cee8a5d9e3
status: stable
level: medium
description: |
  The following analytic identifies suspicious WMI command lines querying for running processes or services. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on specific process and command-line events. This activity is significant as adversaries often use WMI to gather system information and identify services on compromised machines. If confirmed malicious, this behavior could allow attackers to map out the system, identify critical services, and plan further attacks,
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    process:
      - '*process*'
      - '*service*'
  condition: selection
tags:
  - attack.t1047
references:
  - https://github.com/carlospolop/PEASS-ng/tree/master/winPEAS
  - https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/
custom_attributes:
  original_rule_id: ef3c5ef2-3f6d-4087-aa75-49bf746dc907
  source_format: splunk_spl