title: Windows New Default File Association Value Set
id: a56065e5-fcc6-520d-9fec-b194ac03693a
status: stable
level: low
description: |
  The following analytic detects registry changes to the default file association value. It leverages data from the Endpoint data model, specifically monitoring registry paths under "HKCR\\*\\shell\\open\\command\\*". This activity can be significant because, attackers might alter the default file associations in order to execute arbitrary scripts or payloads when a user opens a file, leading to potential code execution. If confirmed malicious, this technique can enable attackers to persist on the
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    registry_path:
      - '*HKCR\\*'
      - '*HKEY_CLASSES_ROOT\\*'
  condition: selection
tags:
  - attack.t1546.001
references:
  - https://dmcxblue.gitbook.io/red-team-notes-2-0/red-team-techniques/privilege-escalation/untitled-3/accessibility-features
custom_attributes:
  original_rule_id: 7d1f031f-f1c9-43be-8b0b-c4e3e8a8928a
  source_format: splunk_spl