title: Windows Steal Authentication Certificates CS Backup
id: da9a5634-4374-55b1-9f9d-5d5d21b1441f
status: stable
level: medium
description: |
  The following analytic identifies the backup of the Active Directory Certificate Services (AD CS) store, detected via Event ID 4876. This event is logged when a backup is performed using the CertSrv.msc UI or the CertUtil.exe -BackupDB command. Monitoring this activity is crucial as unauthorized backups can indicate an attempt to steal authentication certificates, which are critical for secure communications. If confirmed malicious, this activity could allow an attacker to impersonate users, esc
author: Michael Haag, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    eventcode: 4876
  condition: selection
tags:
  - attack.t1649
references:
  - https://specterops.io/wp-content/uploads/sites/3/2022/06/Certified_Pre-Owned.pdf
custom_attributes:
  original_rule_id: a2f4cc7f-6503-4078-b206-f83a29f408a7
  source_format: splunk_spl