title: Windows Known Abused DLL Loaded Suspiciously
id: b0d57749-28ae-53dc-889c-f0d68e6bcb48
status: stable
level: high
description: |
  The following analytic detects when DLLs with known abuse history are loaded from an unusual location. This activity may represent an attacker performing a DLL search order or sideload hijacking technique. These techniques are used to gain persistence as well as elevate privileges on the target system. This detection relies on Sysmon EID7 and is compatible with all Officla Sysmon TA versions.
author: Steven Dick
logsource:
  product: windows
detection:
  selection:
    eventcode: 7
    islibrary: 'TRUE'
    excluded: 'false'
    imageloaded:
      - '*\\Program Files*'
      - '*\\system32\\*'
      - '*\\syswow64\\*'
      - '*\\winsxs\\*'
      - '*\\wbem\\*'
    user:
      - '-'
  condition: selection
tags:
  - attack.t1574.001
references:
  - https://attack.mitre.org/techniques/T1574/002/
  - https://hijacklibs.net/api/
  - https://wietze.github.io/blog/hijacking-dlls-in-windows
  - https://github.com/olafhartong/sysmon-modular/pull/195/files
custom_attributes:
  original_rule_id: dd6d1f16-adc0-4e87-9c34-06189516b803
  source_format: splunk_spl