title: Windows Multiple Disabled Users Failed To Authenticate Wth Kerberos
id: 77c58ea0-4f88-58dd-a89c-654cd9a9cf8f
status: stable
level: high
description: |
  The following analytic detects a single source endpoint failing to authenticate with 30 unique disabled domain users using the Kerberos protocol within 5 minutes. It leverages Windows Security Event 4768, focusing on failure code `0x12`, indicating revoked credentials. This activity is significant as it may indicate a Password Spraying attack targeting disabled accounts, a tactic used by adversaries to gain initial access or elevate privileges. If confirmed malicious, this could lead to unauthor
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    eventcode: 4768
    status: 0x12
    span: 5m
  condition: selection
tags:
  - attack.t1110.003
references:
  - https://attack.mitre.org/techniques/T1110/003/
custom_attributes:
  original_rule_id: 98f22d82-9d62-11eb-9fcf-acde48001122
  source_format: splunk_spl