title: Windows Event Triggered Image File Execution Options Injection
id: 55f9f518-ddfa-536a-9b8f-abc78bc50bfe
status: stable
level: low
description: |
  The following analytic identifies the creation or modification of Image File Execution Options (IFEO) registry keys, detected via EventCode 3000 in the Application channel. This detection leverages Windows Event Logs to monitor for process names added to IFEO under specific registry paths. This activity is significant as it can indicate attempts to set traps for process monitoring or debugging, often used by attackers for persistence or evasion. If confirmed malicious, this could allow an attack
author: Michael Haag, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    eventcode: 3000
  condition: selection
tags:
  - attack.t1546.012
references:
  - https://blog.thinkst.com/2022/09/sensitive-command-token-so-much-offense.html
  - https://docs.microsoft.com/en-us/windows-hardware/drivers/debugger/registry-entries-for-silent-process-exit
custom_attributes:
  original_rule_id: f7abfab9-12ea-44e8-8745-475f9ca6e0a4
  source_format: splunk_spl