title: Windows PowerShell Script Block With Malicious String
id: e285cb98-59f6-51bf-bb8e-d24c21bb2dc0
status: stable
level: high
description: |
  The following analytic detects the execution of multiple offensive toolkits and commands by leveraging PowerShell Script Block Logging (EventCode=4104). This method captures and logs the full command sent to PowerShell, allowing for the identification of suspicious activities including several well-known tools used for credential theft, lateral movement, and persistence. If confirmed malicious, this could lead to unauthorized access, privilege escalation, and potential compromise of sensitive in
author: Steven Dick
logsource:
  product: windows
detection:
  selection:
    eventcode: 4104
  condition: selection
tags:
  - attack.t1059.001
references:
  - https://attack.mitre.org/techniques/T1059/001/
  - https://github.com/PowerShellMafia/PowerSploit
  - https://github.com/PowerShellEmpire/
  - https://github.com/S3cur3Th1sSh1t/PowerSharpPack
custom_attributes:
  original_rule_id: 0f09cedd-10f1-4b9f-bdea-7a8b06ea575d
  source_format: splunk_spl