title: Windows Scheduled Task with Highest Privileges
id: 4315add9-0559-572a-b9c1-14e4f7c03d56
status: stable
level: high
description: |
  The following analytic detects the creation of a new scheduled task with the highest execution privileges via Schtasks.exe. It leverages Endpoint Detection and Response (EDR) logs to monitor for specific command-line parameters ('/rl' and 'highest') in schtasks.exe executions. This activity is significant as it is commonly used in AsyncRAT attacks for persistence and privilege escalation. If confirmed malicious, this could allow an attacker to maintain persistent access and execute tasks with el
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    process_name: schtasks.exe
    process:
      - '*/rl *'
      - '* highest *'
  condition: selection
tags:
  - attack.t1053.005
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.asyncrat
custom_attributes:
  original_rule_id: 2f15e1a4-0fc2-49dd-919e-cbbe60699218
  source_format: splunk_spl