title: Windows High File Deletion Frequency
id: b2bf371c-f2d0-539d-9f70-2b69b8a16b7a
status: stable
level: medium
description: |
  The following analytic identifies a high frequency of file deletions by monitoring Sysmon EventCodes 23 and 26 for specific file extensions. This detection leverages Sysmon logs to track deleted target filenames, process names, and process IDs. Such activity is significant as it often indicates ransomware behavior, where files are encrypted and the originals are deleted. If confirmed malicious, this activity could lead to extensive data loss and operational disruption, as ransomware can render c
author: Teoderick Contreras, Splunk, Steven Dick
logsource:
  product: windows
  category: file_event
detection:
  selection:
    eventcode:
      - 23
      - 26
    targetfilename:
      - '*\\INetCache\\Content.Outlook\\*'
  condition: selection
tags:
  - attack.t1485
references:
  - https://www.mandiant.com/resources/fin11-email-campaigns-precursor-for-ransomware-data-theft
  - https://blog.virustotal.com/2020/11/keep-your-friends-close-keep-ransomware.html
  - https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
custom_attributes:
  original_rule_id: 45b125c4-866f-11eb-a95a-acde48001122
  source_format: splunk_spl