title: Windows Odbcconf Load Response File
id: 9c61fe61-d925-52c1-9133-ac869fbf7f16
status: stable
level: high
description: |
  The following analytic detects the execution of odbcconf.exe with a response file, which may contain commands to load a DLL (REGSVR) or other instructions. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line arguments. This activity is significant as it may indicate an attempt to execute arbitrary code or load malicious DLLs, potentially leading to unauthorized actions. If confirmed malicious, this could allow an attacker to
author: Michael Haag, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    process:
      - '*-f *'
      - '*/f *'
  condition: selection
tags:
  - attack.t1218.008
references:
  - https://strontic.github.io/xcyclopedia/library/odbcconf.exe-07FBA12552331355C103999806627314.html
  - https://twitter.com/redcanary/status/1541838407894171650?s=20&t=kp3WBPtfnyA3xW7D7wx0uw
custom_attributes:
  original_rule_id: 1acafff9-1347-4b40-abae-f35aa4ba85c1
  source_format: splunk_spl