title: Windows Unsigned DLL Side-Loading In Same Process Path
id: 997ee799-0786-5f47-8e6b-9a3c11ea3a96
status: stable
level: high
description: |
  This detection identifies unsigned DLLs loaded through DLL side-loading with same file path with the process loaded the DLL, a technique observed in DarkGate malware. This detection monitors DLL loading, verifies signatures, and flags unsigned DLLs. Suspicious file paths and known executable associations are checked. Detecting such suspicious DLLs is crucial in preventing privilege escalation attacks and other potential security breaches. Regular security assessments, thorough monitoring, and im
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    eventcode: 7
    signed: 'false'
    field:
      - Image
      - ImageLoaded
    imagefolderpath: ImageLoadedFolderPath
    image:
      - '*:\\windows\\system32\\*'
      - '*:\\windows\\syswow64\\*'
      - 'c:\\Program Files*'
    imageloaded:
      - '*:\\windows\\system32\\*'
      - '*:\\windows\\syswow64\\*'
      - 'c:\\Program Files*'
  condition: selection
tags:
  - attack.t1574.001
references:
  - https://www.splunk.com/en_us/blog/security/enter-the-gates-an-analysis-of-the-darkgate-autoit-loader.html
  - https://www.trendmicro.com/en_us/research/23/b/investigating-the-plugx-trojan-disguised-as-a-legitimate-windows.html
custom_attributes:
  original_rule_id: 3cf85c02-f9d6-4186-bf3c-e70ee99fbc7f
  source_format: splunk_spl