title: Windows ESX Admins Group Creation via Net
id: 5bff5619-2096-5d65-bb9e-58b76f73ad20
status: stable
level: high
description: |
  This analytic detects attempts to create an "ESX Admins" group using the Windows net.exe or net1.exe commands. This activity may indicate an attempt to exploit the VMware ESXi Active Directory Integration Authentication Bypass vulnerability (CVE-2024-37085). Attackers can use this method to gain unauthorized access to ESXi hosts by recreating the "ESX Admins" group after its deletion from Active Directory.
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    process:
      - '*group*'
      - '*ESX Admins*'
      - '*/add*'
  condition: selection
tags:
  - attack.t1136.002
  - attack.t1136.001
references:
  - https://support.broadcom.com/web/ecx/support-content-notification/-/external/content/SecurityAdvisories/0/24505
  - https://www.microsoft.com/en-us/security/blog/2024/07/29/ransomware-operators-exploit-esxi-hypervisor-vulnerability-for-mass-encryption/
  - https://www.securityweek.com/microsoft-says-ransomware-gangs-exploiting-just-patched-vmware-esxi-flaw/
custom_attributes:
  original_rule_id: 3d7df60b-3332-4667-8090-afe03e08dce0
  source_format: splunk_spl