title: Windows SQL Server Extended Procedure DLL Loading Hunt
id: 169bdf43-8a26-5d0d-84b2-30dd4574cda9
status: stable
level: low
description: |
  This analytic detects when SQL Server loads DLLs to execute extended stored procedures. This is particularly important for security monitoring as it indicates the first-time use or version changes of potentially dangerous procedures like xp_cmdshell, sp_OACreate, and others. While this is a legitimate operation, adversaries may abuse these procedures for execution, discovery, or privilege escalation.
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 8128
    field: EventData_Xml
  condition: selection
tags:
  - attack.t1505.001
  - attack.t1059.009
references:
  - https://learn.microsoft.com/en-us/sql/relational-databases/system-stored-procedures/general-extended-stored-procedures-transact-sql
  - https://learn.microsoft.com/en-us/previous-versions/sql/sql-server-2008-r2/ms175543(v=sql.105)
  - https://learn.microsoft.com/en-us/sql/relational-databases/extended-stored-procedures-programming/using-extended-stored-procedures
custom_attributes:
  original_rule_id: 182ba99f-2dde-4cdb-8e5c-e3b1e251cb10
  source_format: splunk_spl