title: Windows Service Create RemComSvc
id: ddfe0f34-f175-56eb-839d-f4ae46c00122
status: stable
level: medium
description: |
  The following analytic detects the creation of the RemComSvc service on a Windows endpoint, typically indicating lateral movement using RemCom.exe. It leverages Windows EventCode 7045 from the System event log, specifically looking for the "RemCom Service" name. This activity is significant as it often signifies unauthorized lateral movement within the network, which is a common tactic used by attackers to spread malware or gain further access. If confirmed malicious, this could lead to unauthor
author: Michael Haag, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    servicename: RemCom Service
    eventcode: 7045
  condition: selection
tags:
  - attack.t1543.003
references:
  - https://www.crowdstrike.com/blog/bears-midst-intrusion-democratic-national-committee/
  - https://github.com/kavika13/RemCom
custom_attributes:
  original_rule_id: 0be4b5d6-c449-4084-b945-2392b519c33b
  source_format: splunk_spl