title: Windows Svchost.exe Parent Process Anomaly
id: f8411dc8-40a4-5851-800d-8f5a6891fb72
status: stable
level: medium
description: |
  The following analytic detects an anomaly where an svchost.exe process is spawned by a parent process other than the standard services.exe. In a typical Windows environment, svchost.exe is a system process that hosts Windows service DLLs, and is expected to be a child of services.exe. A process deviation from this hierarchy may indicate suspicious behavior, such as malicious code attempting to masquerade as a legitimate system process or evade detection. It is essential to investigate the parent
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    process_name: svchost.exe
  filter:
    parent_process_name: services.exe
    parent_process_path: 'C:\\Program Files\\Windows Defender\\MsMpEng.exe'
  condition: selection and not filter
tags:
  - attack.t1036.009
references:
  - https://attack.mitre.org/techniques/T1036/009/
  - https://www.trendmicro.com/en_nl/research/24/k/earth-estries.html
custom_attributes:
  original_rule_id: 1d38e5e9-2ff8-4c47-872c-bf1657cefab5
  source_format: splunk_spl