title: Windows Alternate DataStream - Base64 Content
id: 2aef2703-82f0-50e0-9248-08d84262e006
status: stable
level: high
description: |
  The following analytic detects the creation of Alternate Data Streams (ADS) with Base64 content on Windows systems. It leverages Sysmon EventID 15, which captures file creation events, including the content of named streams. ADS can conceal malicious payloads, making them significant for SOC monitoring. This detection identifies hidden streams that may contain executables, scripts, or configuration data, often used by malware to evade detection. If confirmed malicious, this activity could allow 
author: Steven Dick, Teoderick Contreras, Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    targetfilename: '(?<!\/)\b\w+(\.\w+)?:\w+(\.\w+)?$'
    contents:
      - '-'
      - [ZoneTransfer]*
    eventcode: 15
    process: Image
    file_path: TargetFilename
  condition: selection
tags:
  - attack.t1564.004
references:
  - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
  - https://car.mitre.org/analytics/CAR-2020-08-001/
  - https://blogs.juniper.net/en-us/threat-research/bitpaymer-ransomware-hides-behind-windows-alternate-data-streams
  - https://blog.netwrix.com/2022/12/16/alternate_data_stream/
  - https://github.com/trustedsec/SysmonCommunityGuide/blob/master/chapters/file-stream-creation-hash.md
custom_attributes:
  original_rule_id: 683f48de-982f-4a7e-9aac-9cec550da498
  source_format: splunk_spl