title: Windows Admon Group Policy Object Created
id: a2af1460-a475-524d-b6e4-c136fafb1b68
status: stable
level: high
description: |
  The following analytic detects the creation of a new Group Policy Object (GPO) using Splunk's Admon data. It identifies events where a new GPO is created, excluding default "New Group Policy Object" entries. Monitoring GPO creation is crucial as adversaries can exploit GPOs to escalate privileges or deploy malware across an Active Directory network. If confirmed malicious, this activity could allow attackers to control system configurations, deploy ransomware, or propagate malware, significantly
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    objectcategory: CN=Group-Policy-Container,CN=Schema,CN=Configuration,DC=*
    admoneventtype: Update
    versionnumber: 0
  filter:
    displayname: New Group Policy Object
  condition: selection and not filter
tags:
  - attack.t1484.001
references:
  - https://attack.mitre.org/techniques/T1484/
  - https://attack.mitre.org/techniques/T1484/001
  - https://www.trustedsec.com/blog/weaponizing-group-policy-objects-access/
  - https://adsecurity.org/?p=2716
  - https://help.splunk.com/en/splunk-cloud-platform/get-started/get-data-in/9.3.2411/get-windows-data/monitor-active-directory
custom_attributes:
  original_rule_id: 69201633-30d9-48ef-b1b6-e680805f0582
  source_format: splunk_spl