title: Windows AD Domain Controller Audit Policy Disabled
id: 2c1ea922-be78-595d-9c3f-f4a2eefb83e2
status: stable
level: high
description: |
  The following analytic detects the disabling of audit policies on a domain controller. It leverages EventCode 4719 from Windows Security Event Logs to identify changes where success or failure auditing is removed. This activity is significant as it suggests an attacker may have gained access to the domain controller and is attempting to evade detection by tampering with audit policies. If confirmed malicious, this could lead to severe consequences, including data theft, privilege escalation, and
author: Dean Luxton
logsource:
  product: windows
detection:
  selection:
    dest_category: domain_controller
    eventcode: 4719
    auditpolicychanges:
      - '%%8448'
      - '%%8450'
      - '%%8448'
      - '%%8450'
    changes:
      - Failure removed
      - Success removed
      - Success removed
      - Failure removed
  condition: selection
tags:
  - attack.t1562.001
references:
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4719
custom_attributes:
  original_rule_id: fc3ccef1-60a4-4239-bd66-b279511b4d14
  source_format: splunk_spl