title: Windows Suspicious React or Next.js Child Process
id: 9255bcbc-5398-5cce-8578-60c772610706
status: stable
level: high
description: |
  This analytic detects Windows processes such as cmd.exe, PowerShell, and common Windows LOLBINs being spawned by React or Next.js application servers. In the context of CVE-2025-55182 / React2Shell / CVE-2025-66478 for Next.js, successful exploitation can lead to arbitrary JavaScript execution on the server, which in turn is used to invoke Node's child_process APIs (for example child_process.execSync) to run OS-level commands. This detection focuses on suspicious child processes where a Next/Rea
author: Nasreddine Bencherchali, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    parent_process_name: node.exe
    process_name:
      - bash.exe
      - bitsadmin.exe
      - calc.exe
      - certutil.exe
      - cscript.exe
      - curl.exe
      - ftp.exe
      - ipconfig.exe
      - mshta.exe
      - netstat.exe
      - OpenConsole.exe
      - powershell.exe
      - pwsh.exe
      - regsvr32.exe
      - rundll32.exe
      - sh.exe
      - tftp.exe
      - wget.exe
      - wmic.exe
      - wscript.exe
      - wsl.exe
      - wt.exe
    process:
      - '* -CAROOT*'
      - '* -install *'
    parent_process:
      - '*--experimental-https*'
      - '*--experimental-next-config-strip-types*'
      - '*\\node_modules\\next*'
      - '*next dev*'
      - '*next start*'
      - '*next\" start*'
      - '*node_modules\\.bin\\\\..\\next*'
      - '*react-scripts start*'
      - '*start-server.js*'
      - ''
  condition: selection
tags:
  - attack.t1190
  - attack.t1059.003
  - attack.t1059.001
references:
  - https://react.dev/blog/2025/12/03/critical-security-vulnerability-in-react-server-components
  - https://nextjs.org/blog/CVE-2025-66478
  - https://nvd.nist.gov/vuln/detail/CVE-2025-55182
  - https://gist.github.com/maple3142/48bc9393f45e068cf8c90ab865c0f5f3
  - https://www.wiz.io/blog/critical-vulnerability-in-react-cve-2025-55182
custom_attributes:
  original_rule_id: baa80bc8-7c9c-4395-b458-b69feb92830a
  source_format: splunk_spl