title: Windows Impair Defenses Disable Auto Logger Session
id: 995567fc-cbb5-5116-8546-3206df065145
status: stable
level: medium
description: |
  The following analytic detects the disabling of an AutoLogger session or one of its providers, by identifying changes to the Registry values "Start" and "Enabled" part of the "\WMI\Autologger\" key path. It leverages data from the Endpoint.Registry datamodel to monitor specific registry paths and values. This activity is significant as attackers and adversaries can leverage this in order to evade defense and blind EDRs and log ingest tooling. If confirmed malicious, this action could allow an at
author: Nasreddine Bencherchali, Splunk
logsource:
  product: windows
detection:
  selection:
    registry_path: '*\\WMI\\Autologger\\*'
    registry_value_name:
      - Start
      - Enabled
    registry_value_data: 0x00000000
  condition: selection
tags:
  - attack.t1562.001
references:
  - https://blog.malwarebytes.com/malwarebytes-news/2021/02/lazyscripter-from-empire-to-double-rat/
  - https://app.any.run/tasks/45f5d114-91ea-486c-ab01-41c4093d2861/
  - https://isc.sans.edu/diary/rss/28628
  - https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
  - https://learn.microsoft.com/en-us/windows/win32/etw/configuring-and-starting-an-autologger-session
custom_attributes:
  original_rule_id: dc6a5613-d024-47e7-9997-ab6477a483d3
  source_format: splunk_spl