title: Windows AD add Self to Group
id: 9ed330de-c69d-5222-9da7-5dd4e4f1d989
status: stable
level: high
description: |
  This analytic detects instances where a user adds themselves to an Active Directory (AD) group. This activity is a common indicator of privilege escalation, where a user attempts to gain unauthorized access to higher privileges or sensitive resources. By monitoring AD logs, this detection identifies such suspicious behavior, which could be part of a larger attack strategy aimed at compromising critical systems and data.
author: Dean Luxton
logsource:
  product: windows
detection:
  selection:
    user: src_user
    eventcode:
      - 4728
  condition: selection
tags:
  - attack.t1098
custom_attributes:
  original_rule_id: 065f2701-b7ea-42f5-9ec4-fbc2261165f9
  source_format: splunk_spl