title: Windows Special Privileged Logon On Multiple Hosts
id: 83d53c52-9a30-59c3-a6e5-786ee597dec0
status: stable
level: high
description: |
  The following analytic detects a user authenticating with special privileges on 30 or more remote endpoints within a 5-minute window. It leverages Event ID 4672 from Windows Security logs to identify this behavior. This activity is significant as it may indicate lateral movement or remote code execution by an adversary. If confirmed malicious, the attacker could gain extensive control over the network, potentially leading to privilege escalation, data exfiltration, or further compromise of the e
author: Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 4672
    span: 5m
    caller_user_name:
      - DWM-1
      - DWM-2
      - DWM-3
      - LOCAL SERVICE
      - NETWORK SERVICE
      - SYSTEM
      - '*$'
  condition: selection
tags:
  - attack.t1087
  - attack.t1021.002
  - attack.t1135
references:
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4672
  - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/dn319113(v=ws.11)
  - https://thedfirreport.com/2023/01/23/sharefinder-how-threat-actors-discover-file-shares/
  - https://attack.mitre.org/tactics/TA0008/
custom_attributes:
  original_rule_id: 4c461f5a-c2cc-4e86-b132-c262fc9edca7
  source_format: splunk_spl