title: Windows Rapid Authentication On Multiple Hosts
id: cab9e150-a1f3-53a8-beb8-de9020d4de67
status: stable
level: high
description: |
  The following analytic detects a source computer authenticating to 30 or more remote endpoints within a 5-minute timespan using Event ID 4624. This behavior is identified by analyzing Windows Event Logs for LogonType 3 events and counting unique target computers. Such activity is significant as it may indicate lateral movement or network share enumeration by an adversary. If confirmed malicious, this could lead to unauthorized access to multiple systems, potentially compromising sensitive data a
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    eventcode: 4624
    logontype: 3
    span: 5m
  filter:
    targetusername: '*$'
  condition: selection and not filter
tags:
  - attack.t1003.002
references:
  - https://attack.mitre.org/techniques/T1135/
  - https://thedfirreport.com/2023/01/23/sharefinder-how-threat-actors-discover-file-shares/
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4624
custom_attributes:
  original_rule_id: 62606c77-d53d-4182-9371-b02cdbbbcef7
  source_format: splunk_spl