title: Windows Spearphishing Attachment Connect To None MS Office Domain
id: 8b503ca6-3deb-536a-8251-d4f0161a77fc
status: stable
level: low
description: |
  The following analytic identifies suspicious Office documents that connect to non-Microsoft Office domains. It leverages Sysmon EventCode 22 to detect processes like winword.exe or excel.exe making DNS queries to domains outside of *.office.com or *.office.net. This activity is significant as it may indicate a spearphishing attempt using malicious documents to download or connect to harmful content. If confirmed malicious, this could lead to unauthorized data access, malware infection, or furthe
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 22
    image:
      - '*\\winword.exe'
      - '*\\excel.exe'
      - '*\\powerpnt.exe'
      - '*\\mspub.exe'
      - '*\\visio.exe'
      - '*\\wordpad.exe'
      - '*\\wordview.exe'
      - '*\\onenote.exe'
      - '*\\onenotem.exe'
      - '*\\onenoteviewer.exe'
      - '*\\onenoteim.exe'
      - '*\\msaccess.exe'
    queryname:
      - '*.office.com'
      - '*.office.net'
  condition: selection
tags:
  - attack.t1566.001
references:
  - https://www.netskope.com/blog/asyncrat-using-fully-undetected-downloader
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.asyncrat
custom_attributes:
  original_rule_id: 1cb40e15-cffa-45cc-abbd-e35884a49766
  source_format: splunk_spl