title: Windows Defender ASR Block Events
id: 90c0c6a3-b010-56de-94e0-d49a919eceef
status: stable
level: medium
description: |
  This detection searches for Windows Defender ASR block events. ASR is a feature of Windows Defender Exploit Guard that prevents actions and apps that are typically used by exploit-seeking malware to infect machines. ASR rules are applied to processes and applications. When a process or application attempts to perform an action that is blocked by an ASR rule, an event is generated. This detection searches for ASR block events that are generated when a process or application attempts to perform an
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    value: 'NULL'
    eventcode:
      - 1121
      - 1126
      - 1129
      - 1131
      - 1133
  condition: selection
tags:
  - attack.t1059
  - attack.t1566.001
  - attack.t1566.002
references:
  - https://asrgen.streamlit.app/
custom_attributes:
  original_rule_id: 026f5f4e-e99f-4155-9e63-911ba587300b
  source_format: splunk_spl