title: Windows DNS Gather Network Info
id: 2042ebc8-5a8d-5ac7-9940-b160bc4adf9c
status: stable
level: medium
description: |
  The following analytic detects the use of the dnscmd.exe command to enumerate DNS records. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process command-line executions. This activity is significant as it may indicate an adversary gathering network information, a common precursor to more targeted attacks. If confirmed malicious, this behavior could enable attackers to map the network, identify critical assets, and plan subsequent actions, potentially leading to
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    process_name: dnscmd.exe
    process: '* /enumrecords *'
  condition: selection
tags:
  - attack.t1590.002
references:
  - https://cert.gov.ua/article/3718487
  - https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF
custom_attributes:
  original_rule_id: 347e0892-e8f3-4512-afda-dc0e3fa996f3
  source_format: splunk_spl