title: Windows Suspicious C2 Named Pipe
id: 753b13a4-63ae-5519-bb22-00447437b922
status: stable
level: high
description: |
  The following analytic detects the creation or connection to known suspicious C2 named pipes. It leverages Sysmon EventCodes 17 and 18 to identify known default pipe names used by C2 tools. If confirmed malicious, this could allow an attacker to abuse these to potentially gain persistence, command and control, or further system compromise.
author: Raven Tait, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 17
    process_path:
      - '*:\\Program Files \(x86\'
  condition: selection
tags:
  - attack.t1559
  - attack.t1021.002
  - attack.t1055
references:
  - https://attack.mitre.org/techniques/T1218/009/
  - https://docs.microsoft.com/en-us/windows/win32/ipc/named-pipes
custom_attributes:
  original_rule_id: 90599d85-dc2a-4d4c-8c59-9485c3665828
  source_format: splunk_spl