title: Windows Alternate DataStream - Process Execution
id: 87493e55-806d-5ae3-b429-ad6aa8938e5a
status: stable
level: high
description: |
  The following analytic detects when a process attempts to execute a file from within an NTFS file system alternate data stream. This detection leverages process execution data from sources like Windows process monitoring or Sysmon Event ID 1, focusing on specific processes known for such behavior. This activity is significant because alternate data streams can be used by threat actors to hide malicious code, making it difficult to detect. If confirmed malicious, this could allow an attacker to e
author: Steven Dick
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    process: '(\b)\w+(\.\w+)?:\w+(\.\w{2,4})(?!\.)(\b|\s|&)'
    process_name:
      - appvlp.exe
      - bitsadmin.exe
      - control.exe
      - cscript.exe
      - forfiles.exe
      - ftp.exe
      - mavinject.exe
      - mshta.exe
      - powershell.exe
      - powershell_ise.exe
      - pwsh.exe
      - regini.exe
      - regscr32.exe
      - rundll32.exe
      - sc.exe
      - wmic.exe
      - wscript.exe
  filter:
    parent_process_name: unknown
  condition: selection and not filter
tags:
  - attack.t1564.004
references:
  - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
  - https://car.mitre.org/analytics/CAR-2020-08-001/
  - https://blogs.juniper.net/en-us/threat-research/bitpaymer-ransomware-hides-behind-windows-alternate-data-streams
  - https://blog.netwrix.com/2022/12/16/alternate_data_stream/
custom_attributes:
  original_rule_id: 30c32c5c-41fe-45db-84fe-275e4320da3f
  source_format: splunk_spl