title: Windows BitLockerToGo Process Execution
id: 5770096c-6cf6-5bb3-955b-ff415ac1176d
status: stable
level: low
description: |
  The following analytic detects BitLockerToGo.exe execution, which has been observed being abused by Lumma stealer malware. The malware leverages this legitimate Windows utility to manipulate registry keys, search for cryptocurrency wallets and credentials, and exfiltrate sensitive data. This activity is significant because BitLockerToGo.exe provides functionality for viewing, copying, and writing files as well as modifying registry branches - capabilities that the Lumma stealer exploits. However
author: Michael Haag, Nasreddine Bencherchali, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1218
references:
  - https://securelist.com/fake-captcha-delivers-lumma-amadey/114312/
custom_attributes:
  original_rule_id: 68cbc9e9-2882-46f2-b636-3b5080589d58
  source_format: splunk_spl