title: Windows AD Rogue Domain Controller Network Activity
id: f25479a7-6352-517e-8a11-1d10b72adeee
status: experimental
level: high
description: |
  The following analytic identifies unauthorized replication RPC calls from non-domain controller devices. It leverages Zeek wire data to detect specific RPC operations like DrsReplicaAdd and DRSGetNCChanges, filtering out legitimate domain controllers. This activity is significant as it may indicate an attempt to introduce a rogue domain controller, which can compromise the integrity of the Active Directory environment. If confirmed malicious, this could allow attackers to manipulate directory da
author: Dean Luxton
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    dest_category: Domain Controller
    src_category: Domain Controller
    value: Unknown
  condition: selection
tags:
  - attack.t1207
references:
  - https://adsecurity.org/?p=1729
custom_attributes:
  original_rule_id: c4aeeeef-da7f-4338-b3ba-553cbcbe2138
  source_format: splunk_spl