title: Windows Unusual Count Of Users Fail To Auth Wth ExplicitCredentials
id: 176dc4b7-8553-53f6-bc0e-1b82930c353b
status: stable
level: medium
description: |
  The following analytic identifies a source user failing to authenticate with multiple users using explicit credentials on a host. It leverages Windows Event Code 4648 and calculates the standard deviation for each host, using the 3-sigma rule to detect anomalies. This behavior is significant as it may indicate a Password Spraying attack, where an adversary attempts to gain initial access or elevate privileges. If confirmed malicious, this activity could lead to unauthorized access, privilege esc
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    eventcode: 4648
    span: 5m
    isoutlier: 1
  condition: selection
tags:
  - attack.t1110.003
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4648
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/basic-audit-logon-events
custom_attributes:
  original_rule_id: 14f414cf-3080-4b9b-aaf6-55a4ce947b93
  source_format: splunk_spl