title: Windows File Transfer Protocol In Non-Common Process Path
id: c19cb7e8-5422-5299-a0c5-aa0fc019544d
status: stable
level: medium
description: |
  The following analytic detects FTP connections initiated by processes located in non-standard installation paths on Windows systems. It leverages Sysmon EventCode 3 to identify network connections where the process image path does not match common directories like "Program Files" or "Windows\System32". This activity is significant as FTP is often used by adversaries and malware, such as AgentTesla, for Command and Control (C2) communications to exfiltrate stolen data. If confirmed malicious, thi
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    destinationportname: ftp
    eventcode: 3
    destinationport: 21
    image:
      - 'C:\\Program Files \(x86\'
  condition: selection
tags:
  - attack.t1071.003
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.agent_tesla
custom_attributes:
  original_rule_id: 0f43758f-1fe9-470a-a9e4-780acc4d5407
  source_format: splunk_spl