title: Windows PowerShell Process With Malicious String
id: 4604d42d-c15f-5380-be39-5b04cf209581
status: stable
level: high
description: |
  The following analytic detects the execution of multiple offensive toolkits and commands through the process execution datamodel. This method captures commands given directly to powershell.exe, allowing for the identification of suspicious activities including several well-known tools used for credential theft, lateral movement, and persistence. If confirmed malicious, this could lead to unauthorized access, privilege escalation, and potential compromise of sensitive information within the envir
author: Steven Dick
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1059.001
references:
  - https://attack.mitre.org/techniques/T1059/001/
  - https://github.com/PowerShellMafia/PowerSploit
  - https://github.com/PowerShellEmpire/
  - https://github.com/S3cur3Th1sSh1t/PowerSharpPack
custom_attributes:
  original_rule_id: 5df35d50-e1a3-4a52-a337-92e69d9b1b8a
  source_format: splunk_spl