title: Windows Credential Dumping LSASS Memory Createdump
id: 0374e2c1-0f72-52e9-91b3-6a5ea6d2da52
status: stable
level: high
description: |
  The following analytic detects the use of CreateDump.exe to perform a process dump. This binary is not native to Windows and is often introduced by third-party applications, including PowerShell 7. The detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names, GUIDs, and complete command-line executions. This activity is significant as it may indicate an attempt to dump LSASS memory, which can be used to extract credentials. If confirmed malicious, thi
author: Michael Haag, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    original_file_name: FX_VER_INTERNALNAME_STR
    process:
      - '*-u *'
      - '*-f *'
  condition: selection
tags:
  - attack.t1003.001
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.001/T1003.001.md#atomic-test-11---dump-lsass-with-createdumpexe-from-net-v5
custom_attributes:
  original_rule_id: b3b7ce35-fce5-4c73-85f4-700aeada81a9
  source_format: splunk_spl