title: Windows Create Local Account
id: 29202048-9abd-56c8-adfe-ce51b0257c4f
status: stable
level: medium
description: |
  The following analytic detects the creation of a new local user account on a Windows system. It leverages Windows Security Audit logs, specifically event ID 4720, to identify this activity. Monitoring the creation of local accounts is crucial for a SOC as it can indicate unauthorized access or lateral movement within the network. If confirmed malicious, this activity could allow an attacker to establish persistence, escalate privileges, or gain unauthorized access to sensitive systems and data.
author: Michael Haag, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    datamodel: Change
    result_id: 4720
  condition: selection
tags:
  - attack.t1136.001
references:
  - https://thedfirreport.com/2022/03/21/apt35-automates-initial-access-using-proxyshell/
custom_attributes:
  original_rule_id: 3fb2e8e3-7bc0-4567-9722-c5ab9f8595eb
  source_format: splunk_spl