title: Windows SSH Proxy Command
id: 646c6af1-ce48-5606-805c-a69c25b57d83
status: stable
level: medium
description: |
  This detection identifies potential abuse of SSH "ProxyCommand" or "LocalCommand" by monitoring for suspicious process execution patterns. Specifically, it looks for instances where ssh.exe (as a parent process) containing "ProxyCommand" or "LocalCommand" in its arguments spawns potentially malicious child processes like mshta, powershell, wscript, or cscript, or processes containing "http" in their command line. This technique can be used by attackers to execute arbitrary commands through SSH p
author: Michael Haag, AJ King, Nasreddine Bencherchali, Splunk, Jesse Hunter, Splunk Community Contributor
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    parent_process_name: ssh.exe
    parent_process:
      - '*ProxyCommand=*'
      - '* PermitLocalCommand=yes*'
      - '* LocalCommand=*'
    process:
      - '*cscript*'
      - '*http*'
      - '*mshta*'
      - '*powershell*'
      - '*pwsh*'
      - '*wmic*'
      - '*wscript*'
  condition: selection
tags:
  - attack.t1572
  - attack.t1059.001
  - attack.t1105
references:
  - https://www.virustotal.com/gui/file/c33f82868dbbfc3ab03918f430b1a348499f5baf047b136ff0a4fc3e8addaa9b/detection
  - https://attack.mitre.org/techniques/T1572/
  - https://lolbas-project.github.io/lolbas/Binaries/Ssh/
  - https://man.openbsd.org/ssh_config#ProxyCommand
  - https://man.openbsd.org/ssh_config#LocalCommand
custom_attributes:
  original_rule_id: ac520039-21f1-4567-b528-5b7133dba76f
  source_format: splunk_spl