title: Windows Outlook WebView Registry Modification
id: aab7380c-ceb3-5d74-ab49-e6ee36249f82
status: stable
level: medium
description: |
  The following analytic identifies modifications to specific Outlook registry values related to WebView and Today features. It detects when a URL is set in these registry locations, which could indicate attempts to manipulate Outlook's web-based components. The analytic focuses on changes to the "URL" value within Outlook's WebView and Today registry paths. This activity is significant as it may represent an attacker's effort to redirect Outlook's web content or inject malicious URLs. If successf
author: Michael Haag, Splunk
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path:
      - '*\\Software\\Microsoft\\Office\\*\\Outlook\\WebView\\*'
      - '*\\Software\\Microsoft\\Office\\*\\Outlook\\Today'
    registry_value_name: URL
  condition: selection
tags:
  - attack.t1112
references:
  - https://gist.github.com/MHaggis/c6318acde2e2f691b550e3a491f49ff1
  - https://github.com/trustedsec/specula/wiki
custom_attributes:
  original_rule_id: 6e1ad5d4-d9af-496a-96ec-f31c11cd09f2
  source_format: splunk_spl