title: Windows SubInAcl Execution
id: b80d0d6e-7536-50fb-8793-6c7e71ae0625
status: stable
level: medium
description: |
  The following analytic detects the execution of the SubInAcl utility. SubInAcl is a legacy Windows Resource Kit tool from the Windows 2003 era, used to manipulate security descriptors of securable objects. It leverages data from Endpoint Detection and Response (EDR) agents, specifically searching for any process execution involving "SubInAcl.exe" binary. This activity can be significant because the utility should be rarely found on modern Windows machines, which mean any execution could potentia
author: Nasreddine Bencherchali, Michael Haag, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    _spl_reference: true
  condition: selection
tags:
  - attack.t1222.001
references:
  - https://www.pwc.com/gx/en/issues/cybersecurity/cyber-threat-intelligence/cyber-year-in-retrospect/yir-cyber-threats-report-download.pdf
  - https://attack.mitre.org/techniques/T1222/001/
custom_attributes:
  original_rule_id: 12491419-1a6f-4af4-afc3-4e2052f0610e
  source_format: splunk_spl