title: Windows Get Local Admin with FindLocalAdminAccess
id: ac1d62f9-0bf1-5258-998c-2e0a98acaed8
status: stable
level: high
description: |
  The following analytic detects the execution of the `Find-LocalAdminAccess` cmdlet using PowerShell Script Block Logging (EventCode=4104). This cmdlet is part of PowerView, a toolkit for Windows domain enumeration. Identifying the use of `Find-LocalAdminAccess` is crucial as adversaries may use it to find machines where the current user has local administrator access, facilitating lateral movement or privilege escalation. If confirmed malicious, this activity could allow attackers to target and 
author: Gowthamaraj Rajendran, Mauricio Velazco, Splunk
logsource:
  product: windows
detection:
  selection:
    scriptblocktext: '*Find-LocalAdminAccess*'
    eventcode: 4104
  condition: selection
tags:
  - attack.t1087.002
references:
  - https://powersploit.readthedocs.io/en/latest/Recon/Find-LocalAdminAccess/
  - https://attack.mitre.org/techniques/T1087/002/
  - https://book.hacktricks.xyz/windows-hardening/basic-powershell-for-pentesters/powerview
custom_attributes:
  original_rule_id: d2988160-3ce9-4310-b59d-905334920cdd
  source_format: splunk_spl