title: Windows Possible Credential Dumping
id: 64fb2cfc-d93f-56b5-8efb-df1ccdd62c9b
status: stable
level: high
description: |
  The following analytic detects potential credential dumping by identifying specific GrantedAccess permission requests and CallTrace DLLs targeting the LSASS process. It leverages Sysmon EventCode 10 logs, focusing on access requests to lsass.exe and call traces involving debug and native API DLLs like dbgcore.dll, dbghelp.dll, and ntdll.dll. This activity is significant as credential dumping can lead to unauthorized access to sensitive credentials. If confirmed malicious, attackers could gain el
author: Michael Haag, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    eventcode: 10
    granted_access:
      - 0x01000
      - 0x1010
      - 0x1038
      - 0x40
      - 0x1400
      - 0x1fffff
      - 0x1410
      - 0x143a
      - 0x1438
      - 0x1000
    calltrace:
      - '*dbgcore.dll*'
      - '*dbghelp.dll*'
      - '*ntdll.dll*'
      - '*kernelbase.dll*'
      - '*kernel32.dll*'
    sourceuser:
      - NT AUTHORITY\\SYSTEM
      - NT AUTHORITY\\NETWORK SERVICE
  condition: selection
tags:
  - attack.t1003.001
references:
  - https://en.wikipedia.org/wiki/Local_Security_Authority_Subsystem_Service
  - https://docs.microsoft.com/en-us/windows/win32/api/minidumpapiset/nf-minidumpapiset-minidumpwritedump
  - https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
  - https://raw.githubusercontent.com/PowerShellMafia/PowerSploit/master/Exfiltration/Invoke-Mimikatz.ps1
  - https://docs.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights?redirectedfrom=MSDN
custom_attributes:
  original_rule_id: e4723b92-7266-11ec-af45-acde48001122
  source_format: splunk_spl