title: Windows Credential Access From Browser Password Store
id: 3e060f88-8b68-5990-949a-9aa34e107460
status: stable
level: medium
description: |
  The following analytic identifies a possible non-common browser process accessing its browser user data profile. This tactic/technique has been observed in various Trojan Stealers, such as SnakeKeylogger, which attempt to gather sensitive browser information and credentials as part of their exfiltration strategy. Detecting this anomaly can serve as a valuable pivot for identifying processes that access lists of browser user data profiles unexpectedly. This detection uses a lookup file `browser_a
author: Teoderick Contreras, Bhavin Patel Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    isallowed: 'false'
    eventcode: 4663
    field: process_name
    ismalicious: 1
  condition: selection
tags:
  - attack.t1012
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.404keylogger
  - https://www.checkpoint.com/cyber-hub/threat-prevention/what-is-malware/snake-keylogger-malware/
custom_attributes:
  original_rule_id: 72013a8e-5cea-408a-9d51-5585386b4d69
  source_format: splunk_spl