title: Windows Mark Of The Web Bypass
id: 0c7acc24-73eb-54ab-9da0-a2f22c0be787
status: stable
level: high
description: |
  The following analytic identifies a suspicious process that deletes the Mark-of-the-Web (MOTW) data stream. It leverages Sysmon EventCode 23 to detect when a file's Zone.Identifier stream is removed. This activity is significant because it is a common technique used by malware, such as Ave Maria RAT, to bypass security restrictions on files downloaded from the internet. If confirmed malicious, this behavior could allow an attacker to execute potentially harmful files without triggering security 
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    targetfilename: '*:Zone.Identifier'
    eventcode: 23
  condition: selection
tags:
  - attack.t1553.005
references:
  - https://attack.mitre.org/techniques/T1553/005/
  - https://github.com/nmantani/PS-MOTW#remove-motwps1
custom_attributes:
  original_rule_id: 8ca13343-7405-4916-a2d1-ae34ce0c28ae
  source_format: splunk_spl