title: Windows Credentials Access via VaultCli Module
id: 484417e9-3af8-5faf-9aa3-226437a54605
status: stable
level: medium
description: |
  The following analytic detects potentially abnormal interactions with VaultCLI.dll, particularly those initiated by processes located in publicly writable Windows folder paths. The VaultCLI.dll module allows processes to extract credentials from the Windows Credential Vault. It was seen being abused by information stealers such as Meduza. The analytic monitors suspicious API calls, unauthorized credential access patterns, and anomalous process behaviors indicative of malicious activity. By lever
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    imageloaded: '*\\vaultcli.dll'
    eventcode: 7
    process_path:
      - '*\\windows\\fonts\\*'
      - '*\\windows\\temp\\*'
      - '*\\users\\public\\*'
      - '*\\windows\\debug\\*'
      - '*\\Users\\Administrator\\Music\\*'
      - '*\\Windows\\servicing\\*'
      - '*\\Users\\Default\\*'
      - '*Recycle.bin*'
      - '*\\Windows\\Media\\*'
      - \\Windows\\repair\\*
      - '*\\appdata\\local\\temp\\*'
      - '*\\PerfLogs\\*'
      - '*:\\temp\\*'
  condition: selection
tags:
  - attack.t1555.004
references:
  - https://hijacklibs.net/entries/microsoft/built-in/vaultcli.html
  - https://www.fortinet.com/blog/threat-research/exploiting-cve-2024-21412-stealer-campaign-unleashed
  - https://cert.gov.ua/article/6276652
  - https://cert.gov.ua/article/6281018
  - https://g0njxa.medium.com/approaching-stealers-devs-a-brief-interview-with-meduza-f1bbd2efb84f
custom_attributes:
  original_rule_id: c0d89118-3f89-4cd7-8140-1f39e7210681
  source_format: splunk_spl