title: Windows LSA Secrets NoLMhash Registry
id: d40950ad-3662-5ccb-8e94-84111682e8be
status: stable
level: high
description: |
  The following analytic detects modifications to the Windows registry related to the Local Security Authority (LSA) NoLMHash setting. It identifies when the registry value is set to 0, indicating that the system will store passwords in the weaker Lan Manager (LM) hash format. This detection leverages registry activity logs from endpoint data sources like Sysmon or EDR tools. Monitoring this activity is crucial as it can indicate attempts to weaken password storage security. If confirmed malicious
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    registry_path: '*\\System\\CurrentControlSet\\Control\\Lsa\\NoLMHash'
  condition: selection
tags:
  - attack.t1003.004
references:
  - https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-347a
custom_attributes:
  original_rule_id: 48cc1605-538c-4223-8382-e36bee5b540d
  source_format: splunk_spl