title: Windows Remote Access Software BRC4 Loaded Dll
id: 06ecd712-4023-50e6-9679-44c39a22500a
status: stable
level: medium
description: |
  The following analytic identifies the loading of four specific Windows DLLs (credui.dll, dbghelp.dll, samcli.dll, winhttp.dll) by a non-standard process. This detection leverages Sysmon EventCode 7 to monitor DLL load events and flags when all four DLLs are loaded within a short time frame. This activity is significant as it may indicate the presence of Brute Ratel C4, a sophisticated remote access tool used for credential dumping and other malicious activities. If confirmed malicious, this beha
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 7
    span: 30s
  condition: selection
tags:
  - attack.t1219
  - attack.t1003
references:
  - https://unit42.paloaltonetworks.com/brute-ratel-c4-tool/
  - https://www.mdsec.co.uk/2022/08/part-3-how-i-met-your-beacon-brute-ratel/
  - https://strontic.github.io/xcyclopedia/library/logoncli.dll-138871DBE68D0696D3D7FA91BC2873B1.html
  - https://strontic.github.io/xcyclopedia/library/credui.dll-A5BD797BBC2DD55231B9DE99837E5461.html
  - https://docs.microsoft.com/en-us/windows/win32/secauthn/credential-manager
custom_attributes:
  original_rule_id: 73cf5dcb-cf36-4167-8bbe-384fe5384d05
  source_format: splunk_spl