title: Windows Spearphishing Attachment Onenote Spawn Mshta
id: 403c6a85-161d-5216-b0b3-fffce4a9ae65
status: stable
level: high
description: |
  The following analytic detects OneNote spawning `mshta.exe`, a behavior often associated with spearphishing attacks. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process creation events where OneNote is the parent process. This activity is significant as it is commonly used by malware families like TA551, AsyncRat, Redline, and DCRAT to execute malicious scripts. If confirmed malicious, this could allow attackers to execute arbitrary code, potentially leading 
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    parent_process_name:
      - onenote.exe
      - onenotem.exe
  condition: selection
tags:
  - attack.t1566.001
references:
  - https://www.bleepingcomputer.com/news/security/hackers-now-use-microsoft-onenote-attachments-to-spread-malware/
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.asyncrat
custom_attributes:
  original_rule_id: 35aeb0e7-7de5-444a-ac45-24d6788796ec
  source_format: splunk_spl