title: Windows Unusual Count Of Users Failed To Authenticate From Process
id: cc82e5b2-a6d4-5d84-bc0a-6de9d12a201b
status: stable
level: medium
description: |
  The following analytic identifies a source process failing to authenticate multiple users, potentially indicating a Password Spraying attack. It leverages Windows Event 4625, which logs failed logon attempts, and uses statistical analysis to detect anomalies. This activity is significant as it may represent an adversary attempting to gain initial access or elevate privileges within an Active Directory environment. If confirmed malicious, the attacker could compromise multiple accounts, leading t
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    eventcode: 4625
    logon_type: 2
    span: 2m
    isoutlier: 1
  filter:
    processname: '-'
  condition: selection and not filter
tags:
  - attack.t1110.003
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4625
  - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4625
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/basic-audit-logon-events
custom_attributes:
  original_rule_id: 25bdb6cb-2e49-4d34-a93c-d6c567c122fe
  source_format: splunk_spl