title: Windows List ENV Variables Via SET Command From Uncommon Parent
id: 12156340-0d08-5b94-91ff-d8b434e4d2ee
status: stable
level: medium
description: |
  The following analytic identifies a suspicious process command line fetching environment variables using the cmd.exe "set" command, with a non-shell parent process. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions and parent process names. This activity could be significant as it is commonly associated with malware like Qakbot, which uses this technique to gather system information. If confirmed malicious, this behavior could indicate that 
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    process_name: cmd.exe
    process:
      - '*/c set'
      - '*/c \"set'
    parent_process_name:
      - cmd.exe
      - explorer.exe
      - powershell*" "pwsh.exe
  condition: selection
tags:
  - attack.t1055
references:
  - https://twitter.com/pr0xylife/status/1585612370441031680?s=46&t=Dc3CJi4AnM-8rNoacLbScg
custom_attributes:
  original_rule_id: aec157f4-8783-4584-aca6-754c4dc7fba9
  source_format: splunk_spl