title: Windows Raw Access To Master Boot Record Drive
id: 6f5bcd0d-5163-5c25-bc3e-8e07fa7fb3d4
status: stable
level: high
description: |
  The following analytic detects suspicious raw access reads to the drive containing the Master Boot Record (MBR). It leverages Sysmon EventCode 9 to identify processes attempting to read or write to the MBR sector, excluding legitimate system processes. This activity is significant because adversaries often target the MBR to wipe, encrypt, or overwrite it as part of their impact payload. If confirmed malicious, this could lead to system instability, data loss, or a complete system compromise, sev
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 9
    image:
      - '*\\Windows\\System32\\*'
      - '*\\Windows\\SysWOW64\\*'
  condition: selection
tags:
  - attack.t1561.002
references:
  - https://www.splunk.com/en_us/blog/security/threat-advisory-strt-ta02-destructive-software.html
  - https://www.crowdstrike.com/blog/technical-analysis-of-whispergate-malware/
  - https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
custom_attributes:
  original_rule_id: 7b83f666-900c-11ec-a2d9-acde48001122
  source_format: splunk_spl