title: Windows Rdp AutomaticDestinations Deletion
id: a8303e66-24d4-5fe5-a641-85330fa040b0
status: stable
level: medium
description: |
  This detection identifies the deletion of files within the AutomaticDestinations folder, located under a user’s AppData\Roaming\Microsoft\Windows\Recent directory. These files are part of the Windows Jump List feature, which records recently accessed files and folders tied to specific applications. Each .automaticDestinations-ms file corresponds to a program (e.g., Explorer, Word, Notepad) and can be valuable for forensic analysis of user activity. Adversaries may target this folder to erase evi
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 23
    targetfilename:
      - '*\\Recent\\AutomaticDestinations*'
  condition: selection
tags:
  - attack.t1070.004
references:
  - https://medium.com/@bonguides25/how-to-clear-rdp-connections-history-in-windows-cf0ffb67f344
  - https://thelocalh0st.github.io/posts/rdp/
custom_attributes:
  original_rule_id: e40a40a1-9fea-4554-abdf-b164422f0627
  source_format: splunk_spl