title: Windows Credentials from Password Stores Chrome Login Data Access
id: 381af259-0258-5e6b-b032-6137613862bb
status: stable
level: medium
description: |
  The following analytic identifies non-Chrome processes accessing the Chrome user data file "login data." This file is an SQLite database containing sensitive information, including saved passwords. The detection leverages Windows Security Event logs, specifically event code 4663, to monitor access attempts. This activity is significant as it may indicate attempts by threat actors to extract and decrypt stored passwords, posing a risk to user credentials. If confirmed malicious, attackers could g
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: authentication
detection:
  selection:
    object_file_path: '*\\AppData\\Local\\Google\\Chrome\\User Data\\Default\\Login Data'
    eventcode: 4663
    process_path:
      - '*:\\Windows\\explorer.exe'
      - '*:\\Windows\\System32\\dllhost.exe'
      - '*\\chrome.exe'
  condition: selection
tags:
  - attack.t1012
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.redline_stealer
custom_attributes:
  original_rule_id: 0d32ba37-80fc-4429-809c-0ba15801aeaf
  source_format: splunk_spl