title: Windows RDPClient Connection Sequence Events
id: d5b1455a-c1e6-58cf-82a1-8703f20d61ff
status: stable
level: medium
description: |
  This analytic monitors Windows RDP client connection sequence events (EventCode 1024) from the Microsoft-Windows-TerminalServices-RDPClient/Operational log. These events track when RDP ClientActiveX initiates connection attempts to remote servers. The connection sequence is a critical phase of RDP where the client and server exchange settings and establish common parameters for the session. Monitoring these events can help identify unusual RDP connection patterns, potential lateral movement atte
author: Michael Haag, Splunk
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    eventcode: 1024
  condition: selection
tags:
  - attack.t1133
references:
  - https://gist.github.com/MHaggis/acd5dcbf1d4fb705b77f0a48e772eefc
  - https://www.microsoft.com/en-us/security/blog/2024/10/29/midnight-blizzard-conducts-large-scale-spear-phishing-campaign-using-rdp-files/
custom_attributes:
  original_rule_id: 67340df1-3f1d-4470-93c8-9ac7249d11b0
  source_format: splunk_spl