title: Windows DotNet Binary in Non Standard Path
id: 2d1bde95-0673-5c7c-9b0b-f5ec0c1542e9
status: stable
level: high
description: |
  The following analytic detects the execution of native .NET binaries from non-standard directories within the Windows operating system. It leverages Endpoint Detection and Response (EDR) telemetry, comparing process names and original file names against a predefined lookup "is_net_windows_file". This activity is significant because adversaries may move .NET binaries to unconventional paths to evade detection and execute malicious code. If confirmed malicious, this behavior could allow attackers 
author: Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    update:
      - 'true'
      - 'true'
    netfile: 'true'
    process_path:
      - '*:\\Windows\\ADWS\\*'
      - '*:\\Windows\\Microsoft.NET\\*'
      - '*:\\Windows\\NetworkController\\*'
      - '*:\\Windows\\System32\\*'
      - '*:\\Windows\\SystemApps\\*'
      - '*:\\Windows\\SysWOW64\\*'
      - '*:\\Windows\\WinSxS\\*'
  condition: selection
tags:
  - attack.t1036.003
  - attack.t1218.004
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1036.003/T1036.003.yaml
  - https://attack.mitre.org/techniques/T1036/003/
  - https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.004/T1218.004.md
custom_attributes:
  original_rule_id: fddf3b56-7933-11ec-98a6-acde48001122
  source_format: splunk_spl