title: Windows Disable Notification Center
id: 93a50eef-1ef8-5e0a-a5b0-1fa3fb07cba9
status: stable
level: medium
description: |
  The following analytic detects the modification of the Windows registry to disable the Notification Center on a host machine. It leverages data from the Endpoint.Registry data model, specifically looking for changes to the "DisableNotificationCenter" registry value set to "0x00000001." This activity is significant because disabling the Notification Center can be a tactic used by RAT malware to hide its presence and subsequent actions. If confirmed malicious, this could allow an attacker to opera
author: Teoderick Contreras, Splunk, Steven Dick
logsource:
  product: windows
detection:
  selection:
    registry_value_name: DisableNotificationCenter
    registry_value_data: 0x00000001
  condition: selection
tags:
  - attack.t1112
references:
  - https://tccontre.blogspot.com/2020/01/remcos-rat-evading-windows-defender-av.html
custom_attributes:
  original_rule_id: 1cd983c8-8fd6-11ec-a09d-acde48001122
  source_format: splunk_spl