title: Windows Defender ASR Registry Modification
id: 3f2350ae-1baf-525b-a48b-3653ca15771a
status: stable
level: low
description: |
  The following analytic detects modifications to Windows Defender Attack Surface Reduction (ASR) registry settings. It leverages Windows Defender Operational logs, specifically EventCode 5007, to identify changes in ASR rules. This activity is significant because ASR rules are designed to block actions commonly used by malware to exploit systems. Unauthorized modifications to these settings could indicate an attempt to weaken system defenses. If confirmed malicious, this could allow an attacker t
author: Michael Haag, Splunk
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    field:
      - New_Value
      - Old_Value
      - New_Value
    eventcode:
      - 5007
  condition: selection
tags:
  - attack.t1112
references:
  - https://asrgen.streamlit.app/
custom_attributes:
  original_rule_id: 6a1b6cbe-6612-44c3-92b9-1a1bd77412eb
  source_format: splunk_spl