title: Windows Handle Duplication in Known UAC-Bypass Binaries
id: f8b2f1c2-972e-5ce7-93c0-f86a380bf15b
status: stable
level: medium
description: |
  The following analytic detects suspicious handle duplication activity targeting known Windows utilities such as ComputerDefaults.exe, Eventvwr.exe, and others. This technique is commonly used to escalate privileges or bypass UAC by inheriting or injecting elevated tokens or handles. The detection focuses on non-standard use of DuplicateHandle or token duplication where process, thread, or token handles are copied into the context of trusted, signed utilities. Such behavior may indicate attempts 
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 10
    process_dup_handle: 64
    dup_handle_set: bit_and
    targetimage:
      - '*\\ComputerDefaults.exe'
      - '*\\eventvwr.exe*'
      - '*\\fodhelper.exe'
      - '*\\slui.exe'
      - '*\\sdclt.exe'
      - '*\\mmc.exe'
      - '*\\colorcpl.exe'
      - '*\\wsreset.exe'
      - '*\\esentutl.exe'
      - '*\PkgMgr.exe'
    sourceimage:
      - '*C:\\Windows\\system32\\*'
      - '*C:\\Windows\\syswow64\\*'
      - '*C:\\Program Files\\*'
      - '*C:\\Program Files (x86'
  condition: selection
tags:
  - attack.t1134.001
references:
  - https://www.recordedfuture.com/research/from-castleloader-to-castlerat-tag-150-advances-operations
custom_attributes:
  original_rule_id: d7369bf5-1315-4138-b927-2dd8bb8c1da7
  source_format: splunk_spl