title: Windows Process Injection into Notepad
id: c5294ba8-aa57-5c5d-be6f-f2527aa94756
status: stable
level: medium
description: |
  The following analytic detects process injection into Notepad.exe using Sysmon EventCode 10. It identifies suspicious GrantedAccess requests (0x40 and 0x1fffff) to Notepad.exe, excluding common system paths like System32, Syswow64, and Program Files. This behavior is often associated with the SliverC2 framework by BishopFox. Monitoring this activity is crucial as it may indicate an initial payload attempting to execute malicious code within Notepad.exe. If confirmed malicious, this could allow a
author: Michael Haag, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    eventcode: 10
    targetimage:
      - '*\\notepad.exe'
    sourceimage:
      - '*\\system32\\*'
      - '*\\syswow64\\*'
      - '*\\Program Files\\*'
    grantedaccess:
      - 0x40
      - 0x1fffff
  condition: selection
tags:
  - attack.t1055.002
references:
  - https://dominicbreuker.com/post/learning_sliver_c2_08_implant_basics/
  - https://www.cybereason.com/blog/sliver-c2-leveraged-by-many-threat-actors
custom_attributes:
  original_rule_id: b8340d0f-ba48-4391-bea7-9e793c5aae36
  source_format: splunk_spl