title: Windows Short Lived DNS Record
id: e14678ac-b549-5b51-b91c-6214ae6ea056
status: stable
level: high
description: |
  The following analytic identifies the creation and quick deletion of a DNS object within 300 seconds in an Active Directory environment, indicative of a potential attack abusing DNS. This detection leverages Windows Security Event Codes 5136 and 5137, analyzing the duration between these events. This activity is significant as temporary DNS entries allows attackers to cause unexpecting network trafficking, leading to potential compromise.
author: Raven Tait, Splunk
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    objectclass:
      - dnsNode
      - dnsNode
    attributeldapdisplayname: dNSTombstoned
    attributevalue: 'TRUE'
    eventcode:
      - 5137
      - 5136
    time_diff: lastTime
  condition: selection
tags:
  - attack.t1071.004
  - attack.t1557.001
  - attack.t1187
references:
  - https://web.archive.org/web/20250617122747/https://www.synacktiv.com/publications/ntlm-reflection-is-dead-long-live-ntlm-reflection-an-in-depth-analysis-of-cve-2025
  - https://www.synacktiv.com/publications/relaying-kerberos-over-smb-using-krbrelayx
  - https://www.guidepointsecurity.com/blog/the-birth-and-death-of-loopyticket/
custom_attributes:
  original_rule_id: d585e253-1859-4170-977d-09376c731f74
  source_format: splunk_spl