title: WinEvent Scheduled Task Created to Spawn Shell
id: 69f1ba0b-1d79-55f0-8059-b17f43cdc946
status: stable
level: high
description: |
  The following analytic detects the creation of scheduled tasks designed to execute commands using native Windows shells like PowerShell, Cmd, Wscript, or Cscript. It leverages Windows Security EventCode 4698 to identify when such tasks are registered. This activity is significant as it may indicate an attempt to establish persistence or execute malicious commands on a system. If confirmed malicious, this could allow an attacker to maintain access, execute arbitrary code, or escalate privileges, 
author: Michael Haag, Splunk
logsource:
  product: windows
  category: file_event
detection:
  selection:
    eventcode: 4698
    taskcontent:
      - '*powershell.exe*'
      - '*wscript.exe*'
      - '*cscript.exe*'
      - '*cmd.exe*'
      - '*sh.exe*'
      - '*ksh.exe*'
      - '*zsh.exe*'
      - '*bash.exe*'
      - '*scrcons.exe*'
      - '*pwsh.exe*'
  condition: selection
tags:
  - attack.t1053.005
references:
  - https://research.checkpoint.com/2021/irans-apt34-returns-with-an-updated-arsenal/
  - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4698
  - https://redcanary.com/threat-detection-report/techniques/scheduled-task-job/
  - https://docs.microsoft.com/en-us/windows/win32/taskschd/time-trigger-example--scripting-?redirectedfrom=MSDN
custom_attributes:
  original_rule_id: 203ef0ea-9bd8-11eb-8201-acde48001122
  source_format: splunk_spl