title: WMI Permanent Event Subscription - Sysmon
id: 13a197f5-36c7-5d28-b976-9b754eccf94c
status: stable
level: high
description: |
  The following analytic identifies the creation of WMI permanent event subscriptions, which can be used to establish persistence or perform privilege escalation. It leverages Sysmon data, specifically EventCodes 19, 20, and 21, to detect the creation of WMI EventFilters, EventConsumers, and FilterToConsumerBindings. This activity is significant as it may indicate an attacker setting up mechanisms to execute code with elevated SYSTEM privileges when specific events occur. If confirmed malicious, t
author: Rico Valdez, Michael Haag, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 21
  condition: selection
tags:
  - attack.t1546.003
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1546.003/T1546.003.md
  - https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/
  - https://github.com/trustedsec/SysmonCommunityGuide/blob/master/chapters/WMI-events.md
  - https://in.security/2019/04/03/an-intro-into-abusing-and-identifying-wmi-event-subscriptions-for-persistence/
custom_attributes:
  original_rule_id: ad05aae6-3b2a-4f73-af97-57bd26cee3b9
  source_format: splunk_spl