title: WMI Permanent Event Subscription
id: 0e7135f5-ef36-524e-9b90-aff713732639
status: experimental
level: high
description: |
  The following analytic detects the creation of permanent event subscriptions using Windows Management Instrumentation (WMI). It leverages Sysmon EventID 5 data to identify instances where the event consumers are not the expected "NTEventLogEventConsumer." This activity is significant because it suggests an attacker is attempting to achieve persistence by running malicious scripts or binaries in response to specific system events. If confirmed malicious, this could lead to severe impacts such as 
author: Rico Valdez, Splunk
logsource:
  product: windows
detection:
  selection:
    eventcode: 5861
    field: Message
  filter:
    consumer: NTEventLogEventConsumer=\
  condition: selection and not filter
tags:
  - attack.t1047
custom_attributes:
  original_rule_id: 71bfdb13-f200-4c6c-b2c9-a2e07adf437d
  source_format: splunk_spl