title: Wmiprvse LOLBAS Execution Process Spawn
id: 627be310-6eb9-5c94-9c94-24d02b561f08
status: stable
level: high
description: |
  The following analytic detects `wmiprvse.exe` spawning a LOLBAS execution process. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process creation events where `wmiprvse.exe` is the parent process and the child process is a known LOLBAS binary. This activity is significant as it may indicate lateral movement or remote code execution by an adversary abusing Windows Management Instrumentation (WMI). If confirmed malicious, this behavior could allow attackers to ex
author: Mauricio Velazco, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    process_name:
      - Regsvcs.exe
      - Ftp.exe
      - OfflineScannerShell.exe
      - Rasautou.exe
      - Schtasks.exe
      - Xwizard.exe
      - Dllhost.exe
      - Pnputil.exe
      - Atbroker.exe
      - Pcwrun.exe
      - Ttdinject.exe
      - Mshta.exe
      - Bitsadmin.exe
      - Certoc.exe
      - Ieexec.exe
      - Microsoft.Workflow.Compiler.exe
      - Runscripthelper.exe
      - Forfiles.exe
      - Msbuild.exe
      - Register-cimprovider.exe
      - Tttracer.exe
      - Ie4uinit.exe
      - Bash.exe
      - Hh.exe
      - SettingSyncHost.exe
      - Cmstp.exe
      - Mmc.exe
      - Stordiag.exe
      - Scriptrunner.exe
      - Odbcconf.exe
      - Extexport.exe
      - Msdt.exe
      - WorkFolders.exe
      - Diskshadow.exe
      - Mavinject.exe
      - Regasm.exe
      - Gpscript.exe
      - Rundll32.exe
      - Regsvr32.exe
      - Msiexec.exe
      - Wuauclt.exe
      - Presentationhost.exe
      - Wmic.exe
      - Runonce.exe
      - Syncappvpublishingserver.exe
      - Verclsid.exe
      - Infdefaultinstall.exe
      - Explorer.exe
      - Installutil.exe
      - Netsh.exe
      - Wab.exe
      - Dnscmd.exe
      - At.exe
      - Pcalua.exe
      - Msconfig.exe
  condition: selection
tags:
  - attack.t1047
references:
  - https://attack.mitre.org/techniques/T1047/
  - https://www.ired.team/offensive-security/lateral-movement/t1047-wmi-for-lateral-movement
  - https://lolbas-project.github.io/
custom_attributes:
  original_rule_id: b7e11721-08b1-4d8b-9628-813bb2380514
  source_format: splunk_spl