title: WS FTP Remote Code Execution
id: ee3dd3ae-25c5-5f5c-8fe9-0e87caf0130a
status: stable
level: high
description: |
  The following analytic detects potential Remote Code Execution (RCE) attempts exploiting CVE-2023-40044 in WS_FTP software. It identifies HTTP POST requests to the "/AHT/AhtApiService.asmx/AuthUser" URL with a status code of 200. This detection leverages the Web datamodel to monitor specific URL patterns and HTTP status codes. This activity is significant as it may indicate an exploitation attempt, potentially allowing an attacker to execute arbitrary code on the server. If confirmed malicious, 
author: Michael Haag, Splunk
logsource:
  product: splunk
  category: process_creation
detection:
  selection:
    datamodel: Web
    status: 200
    http_method: POST
    url:
      - /AHT/AhtApiService.asmx/AuthUser
  condition: selection
tags:
  - attack.t1190
references:
  - https://github.com/projectdiscovery/nuclei-templates/pull/8296/files
  - https://www.assetnote.io/resources/research/rce-in-progress-ws-ftp-ad-hoc-via-iis-http-modules-cve-2023-40044
  - https://github.com/rapid7/metasploit-framework/pull/18414
custom_attributes:
  original_rule_id: b84e8f39-4e7b-4d4f-9e7c-fcd29a227845
  source_format: splunk_spl