title: Wscript Or Cscript Suspicious Child Process
id: 49f81368-1f07-58f4-a288-88c9bd923ace
status: stable
level: high
description: |
  This analytic identifies a suspicious spawned process by WScript or CScript process. This technique was a common technique used by adversaries and malware to execute different LOLBIN, other scripts like PowerShell or spawn a suspended process to inject its code as a defense evasion. This TTP may detect some normal script that uses several application tools that are in the list of the child process it detects but a good pivot and indicator that a script may execute suspicious code.
author: Teoderick Contreras, Splunk
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    parent_process_name:
      - cscript.exe
      - wscript.exe
    process_name:
      - regsvr32.exe
      - rundll32.exe
      - winhlp32.exe
      - certutil.exe
      - msbuild.exe
      - cmd.exe
      - powershell*
      - pwsh.exe
      - wmic.exe
      - mshta.exe
  condition: selection
tags:
  - attack.t1055
  - attack.t1134.004
  - attack.t1543
references:
  - https://www.hybrid-analysis.com/sample/8da5b75b6380a41eee3a399c43dfe0d99eeefaa1fd21027a07b1ecaa4cd96fdd?environmentId=120
  - https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
custom_attributes:
  original_rule_id: 1f35e1da-267b-11ec-90a9-acde48001122
  source_format: splunk_spl