title: XMRIG Driver Loaded
id: c657f6df-00f7-5480-b3b8-bdb6e36a227d
status: stable
level: high
description: |
  The following analytic detects the installation of the XMRIG coinminer driver on a system. It identifies the loading of the `WinRing0x64.sys` driver, commonly associated with XMRIG, by analyzing Sysmon EventCode 6 logs for specific signatures and image loads. This activity is significant because XMRIG is an open-source CPU miner frequently exploited by adversaries to mine cryptocurrency illicitly. If confirmed malicious, this activity could lead to unauthorized resource consumption, degraded sys
author: Teoderick Contreras, Splunk
logsource:
  product: windows
detection:
  selection:
    signature: Noriyuki MIYAZAKI
    imageloaded: '*\\WinRing0x64.sys'
    eventcode: 6
  condition: selection
tags:
  - attack.t1543.003
references:
  - https://www.trendmicro.com/vinfo/hk/threat-encyclopedia/malware/trojan.ps1.powtran.a/
custom_attributes:
  original_rule_id: 90080fa6-a8df-11eb-91e4-acde48001122
  source_format: splunk_spl