title: Zoom High Video Latency
id: aa56bd43-aa53-5d03-ae6a-71dfe12d9c11
status: experimental
level: medium
description: |
  Detects particularly high latency from Zoom logs. Latency observed from threat actors performing Remote Employment Fraud (REF) is typically well above what’s normal for the majority of employees.
author: Marissa Bower, Raven Tait
logsource:
  product: splunk
detection:
  selection:
    email: '*'
    field:
      - avg_latency
      - latency
  condition: selection
tags:
  - attack.t1078
custom_attributes:
  original_rule_id: 6ad6b548-adfa-452c-aa77-9ff94877e832
  source_format: splunk_spl