title: Zoom Rare Video Devices
id: 0b89bf65-3a43-5b3f-be83-547158ee4618
status: experimental
level: low
description: |
  Detects rare video devices from Zoom logs. Actors performing Remote Employment Fraud (REF) typically use unusual device information compared to a majority of employees. Detecting this activity requires careful analysis, regular review, and a thorough understanding of the audio and video devices commonly used within your environment.
author: Marissa Bower, Raven Tait
logsource:
  product: splunk
detection:
  selection:
    camera:
      - '*FaceTime*'
      - '*MacBook*'
    speaker: '*AirPods*'
    microphone: '*MacBook Pro Microphone*'
    limit: 50
  condition: selection
tags:
  - attack.t1123
custom_attributes:
  original_rule_id: 9b2b819d-c76b-4dc6-bd3d-148edb8de83e
  source_format: splunk_spl