title: Zscaler Legal Liability Threat Blocked
id: 0d53fb36-2813-5bbc-bc9a-2b1bed009e9c
status: stable
level: medium
description: |
  The following analytic identifies significant legal liability threats blocked by the Zscaler web proxy. It uses web proxy logs to track destinations, device owners, users, URL categories, and actions associated with legal liability. By leveraging statistics on unique fields, it ensures a precise focus on these threats. This activity is significant for SOC as it helps enforce legal compliance and risk management. If confirmed malicious, it could indicate attempts to access legally sensitive or re
author: Rod Soto, Gowthamaraj Rajendran, Splunk
logsource:
  product: splunk
detection:
  selection:
    urlclass: Legal Liability
  condition: selection
tags:
  - attack.t1566
references:
  - https://help.zscaler.com/zia/nss-feed-output-format-web-logs
custom_attributes:
  original_rule_id: bbf55ebf-c416-4f62-94d9-4064f2a28014
  source_format: splunk_spl