title: Zscaler Virus Download threat blocked
id: cc50506c-c142-50a7-ad61-de3bc1bc5364
status: stable
level: medium
description: |
  The following analytic identifies attempts to download viruses that were blocked by Zscaler within a network. It leverages web proxy logs to detect blocked actions indicative of virus download attempts. Key data points such as device owner, user, URL category, destination URL, and IP are analyzed. This activity is significant as it helps in early detection and remediation of potential virus threats, enhancing network security. If confirmed malicious, this activity could indicate an attempt to co
author: Gowthamaraj Rajendran, Rod Soto, Splunk
logsource:
  product: splunk
detection:
  selection:
    action: blocked
    threatclass: Virus
  filter:
    threatname: 'None'
  condition: selection and not filter
tags:
  - attack.t1566
references:
  - https://help.zscaler.com/zia/nss-feed-output-format-web-logs
custom_attributes:
  original_rule_id: aa19e627-d448-4a31-85cd-82068dec5691
  source_format: splunk_spl