title: Zscaler Scam Destinations Threat Blocked
id: 973c781d-5d32-5d6f-a29f-764f573f2e75
status: stable
level: medium
description: |
  The following analytic identifies blocked scam-related activities detected by Zscaler within a network. It leverages web proxy logs to examine actions flagged as scam threats, focusing on data points such as device owner, user, URL category, destination URL, and IP. This detection is significant for SOC as it helps in the early identification and mitigation of scam activities, ensuring network safety. If confirmed malicious, this activity could indicate attempts to deceive users, potentially lea
author: Gowthamaraj Rajendran, Rod Soto, Splunk
logsource:
  product: splunk
detection:
  selection:
    action: blocked
  condition: selection
tags:
  - attack.t1566
references:
  - https://help.zscaler.com/zia/nss-feed-output-format-web-logs
custom_attributes:
  original_rule_id: a0c21379-f4ba-4bac-a958-897e260f964a
  source_format: splunk_spl