title: Zscaler Phishing Activity Threat Blocked
id: 5a7650d6-4485-5055-a294-00694d2c5cd6
status: stable
level: medium
description: |
  The following analytic identifies potential phishing attempts blocked by Zscaler within a network. It leverages web proxy logs to detect actions tagged as HTML.Phish. The detection method involves analyzing critical data points such as user, threat name, URL, and hostname. This activity is significant for a SOC as it serves as an early warning system for phishing threats, enabling prompt investigation and mitigation. If confirmed malicious, this activity could indicate an attempt to deceive user
author: Gowthamaraj Rajendran, Rod Soto, Splunk
logsource:
  product: splunk
detection:
  selection:
    threatname: HTML.Phish*
    action: blocked
  condition: selection
tags:
  - attack.t1566
references:
  - https://help.zscaler.com/zia/nss-feed-output-format-web-logs
custom_attributes:
  original_rule_id: 68d3e2c1-e97f-4310-b080-dea180b48aa9
  source_format: splunk_spl