title: Zscaler Adware Activities Threat Blocked
id: 241d475c-5175-5f40-b905-38eeb4f8083f
status: stable
level: medium
description: |
  The following analytic identifies potential adware activity blocked by Zscaler. It leverages web proxy logs to detect blocked actions associated with adware threats. Key data points such as device owner, user, URL category, destination URL, and IP are analyzed. This activity is significant as adware can degrade system performance, lead to unwanted advertisements, and potentially expose users to further malicious content. If confirmed malicious, it could indicate an attempt to compromise user sys
author: Gowthamaraj Rajendran, Splunk
logsource:
  product: splunk
detection:
  selection:
    action: blocked
  condition: selection
tags:
  - attack.t1566
references:
  - https://help.zscaler.com/zia/nss-feed-output-format-web-logs
custom_attributes:
  original_rule_id: 3407b250-345a-4d71-80db-c91e555a3ece
  source_format: splunk_spl