title: Cisco Umbrella - Request to blocklisted file type
id: de58ee9e-b229-4252-8537-41a4c2f4045e
status: stable
level: medium
description: |
  'Detects request to potentially harmful file types (.ps1, .bat, .vbs, etc.).'

author: Microsoft
logsource:
  product: azure
  service: sentinel
detection:
  _kql_query: |
    let file_ext_blocklist = dynamic(['.ps1', '.vbs', '.bat', '.scr']);
let lbtime = 10m;
Cisco_Umbrella
| where TimeGenerated > ago(lbtime)
| where EventType == 'proxylogs'
| where DvcAction =~ 'Allowed'
| extend file_ext = extract(@'.*(\.\w+)$', 1, UrlOriginal)
| extend Filename = extract(@'.*\/*\/(.*\.\w+)$', 1, UrlOriginal)
| where file_ext in (file_ext_blocklist)
| project TimeGenerated, SrcIpAddr, Identities, Filename

  condition: _kql_query
tags:
  - attack.initial_access

