title: Cisco Umbrella - URI contains IP address
id: ee1818ec-5f65-4991-b711-bcf2ab7e36c3
status: stable
level: medium
description: |
  'Malware can use IP address to communicate with C2.'

author: Microsoft
logsource:
  product: azure
  service: sentinel
detection:
  _kql_query: |
    let lbtime = 10m;
Cisco_Umbrella
| where TimeGenerated > ago(lbtime)
| where EventType == 'proxylogs'
| where DvcAction =~ 'Allowed'
| where UrlOriginal matches regex @'\Ahttp:\/\/\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}.*'
| project TimeGenerated, SrcIpAddr, Identities

  condition: _kql_query
tags:


