title: CreepyDrive request URL sequence
id: eda260eb-f4a1-4379-ad98-452604da9b3e
status: stable
level: high
description: |
  'CreepyDrive uses OneDrive for command and control, however, it makes regular requests to predicatable paths.
This detecton will alert when over 20 sequences are observed in a single day.'

author: Thomas McElroy
logsource:
  product: azure
  service: sentinel
detection:
  _kql_query: |
    let eventsThreshold = 20;
CommonSecurityLog
| where isnotempty(RequestURL)
| project TimeGenerated, RequestURL, RequestMethod, SourceIP, SourceHostName
| evaluate sequence_detect(TimeGenerated, 5s, 8s, login=(RequestURL has "login.microsoftonline.com/consumers/oauth2/v2.0/token"), graph=(RequestURL has "graph.microsoft.com/v1.0/me/drive/"), SourceIP, SourceHostName)
| summarize Events=count() by SourceIP, SourceHostName
| where Events >= eventsThreshold

  condition: _kql_query
tags:
  - attack.exfiltration
  - attack.t1567.002
  - attack.t1102.002
