title: Excessive NXDOMAIN DNS Queries (ASIM DNS Schema)
id: c3b11fb2-9201-4844-b7b9-6b7bf6d9b851
status: stable
level: medium
description: |
  'This creates an incident in the event a client generates excessive amounts of DNS queries for non-existent domains. 
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

author: Yaron
logsource:
  product: azure
  service: sentinel
detection:
  _kql_query: |
    let threshold = 200;
_Im_Dns(responsecodename='NXDOMAIN')
| where isnotempty(DnsResponseCodeName)
//| where DnsResponseCodeName =~ "NXDOMAIN"
| summarize count() by SrcIpAddr, bin(TimeGenerated,15m)
| where count_ > threshold
| join kind=inner (_Im_Dns(responsecodename='NXDOMAIN')
    ) on SrcIpAddr

  condition: _kql_query
tags:

  - attack.t1568
  - attack.t1008
