title: PE file dropped in Color Profile Folder
id: f68a5046-b7eb-4f69-9519-1e99708bb9e0
status: stable
level: medium
description: |
  'This query looks for writes of PE files to C:\Windows\System32\spool\drivers\color\.
  This is a common directory used by malware, as well as some legitimate programs, and writes of PE files to the folder should be monitored.
  Ref: https://www.microsoft.com/security/blog/2022/07/27/untangling-knotweed-european-private-sector-offensive-actor-using-0-day-exploits/'

author: Pete Bryan
logsource:
  product: azure
  service: sentinel
detection:
  _kql_query: |
    DeviceFileEvents
  | where ActionType =~ "FileCreated"
  | where FolderPath has "C:\\Windows\\System32\\spool\\drivers\\color\\" 
  | where FileName endswith ".exe" or FileName endswith ".dll"

  condition: _kql_query
tags:
  - attack.execution
  - attack.t1203
