title: Potential Password Spray Attack (Uses Authentication Normalization)
id: 6a2e2ff4-5568-475e-bef2-b95f12b9367b
status: stable
level: medium
description: |
  'This query searches for failed attempts to log in from more than 15 various users within a 5 minute timeframe from the same source. This is a potential indication of a password spray attack
 To use this analytics rule, make sure you have deployed the [ASIM normalization parsers](https://aka.ms/ASimAuthentication)'

author: Ofer Shezaf
logsource:
  product: azure
  service: sentinel
detection:
  _kql_query: |
    let FailureThreshold = 15;
imAuthentication
| where EventType== 'Logon' and  EventResult== 'Failure'
// reason: creds 
| where EventResultDetails in ('No such user or password', 'Incorrect password')
| summarize UserCount=dcount(TargetUserId), Vendors=make_set(EventVendor), Products=make_set(EventVendor)
  , Users = make_set(TargetUserId,100) 
    by SrcDvcIpAddr, SrcGeoCountry, bin(TimeGenerated, 5m)
| where UserCount > FailureThreshold

  condition: _kql_query
tags:
  - attack.credential_access
  - attack.t1110
