title: Suspicious Sign In by Entra ID Connect Sync Account
id: 2cd8b3d5-c9e0-4be3-80f7-0469d511c3f6
status: stable
level: medium
description: |
  'This query looks for sign ins by the Microsoft Entra ID Connect Sync account to Azure where properties about the logon are anomalous.
This query uses Microsoft Sentinel's UEBA features to detect these suspicious properties.
A threat actor may attempt to steal the Sync account credentials and use them to access Azure resources. This alert should be 
reviewed to ensure that the log in came was from a legitimate source.'

author: Microsoft Security Community
logsource:
  product: azure
  service: sentinel
detection:
  _kql_query: |
    BehaviorAnalytics
// User modification is expected from this account so focus on logons
| where ActivityType =~ "LogOn"
| where UserName startswith "Sync_" and UsersInsights.AccountDisplayName =~ "On-Premises Directory Synchronization Service Account"
// Filter out this expected activity
| where ActivityInsights.App !~ "Microsoft Azure Active Directory Connect"
| where InvestigationPriority > 0
| extend Name = split(UserPrincipalName, "@")[0], UPNSuffix = split(UserPrincipalName, "@")[1]

  condition: _kql_query
tags:
  - attack.initial_access
  - attack.t1078.004
