title: Trust Monitor Event
id: 8dcf7238-a7d0-4cfd-8d0c-b230e3cd9182
status: stable
level: medium
description: |
  'This query identifies when a new trust monitor event is detected.'

author: SecurityJedi
logsource:
  product: azure
  service: sentinel
detection:
  _kql_query: |
    let timeframe = ago(5m);
DuoSecurityTrustMonitor_CL
| where TimeGenerated >= timeframe
| extend AccountName = tostring(split(surfaced_auth_user_name_s, "@")[0]), AccountUPNSuffix = tostring(split(surfaced_auth_user_name_s, "@")[1])

  condition: _kql_query
tags:
  - attack.credential_access
  - attack.t1528
  - attack.t1555
