title: Wazuh - Large Number of Web errors from an IP
id: 2790795b-7dba-483e-853f-44aa0bc9c985
status: stable
level: low
description: |
  'Identifies instances where Wazuh logged over 400 '403' Web Errors from one IP Address. To onboard Wazuh data into Sentinel please view: https://documentation.wazuh.com/current/cloud-security/azure/index.html'

author: Jordan Ross
logsource:
  product: azure
  service: sentinel
detection:
  _kql_query: |
    CommonSecurityLog
| where DeviceProduct =~ "Wazuh"
| where Activity has "Web server 400 error code."
| where Message has "403"
| extend HostName=substring(split(DeviceCustomString1,")")[0],1)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), NumberOfErrors = dcount(SourceIP) by HostName, SourceIP
| where NumberOfErrors > 400
| sort by NumberOfErrors desc
| extend timestamp = StartTime

  condition: _kql_query
tags:
  - attack.credential_access
  - attack.t1110
