title: Abnormally High Number Of Cloud Instances Destroyed
id: ef629fc9-1583-4590-b62a-f2247fbf7bbf
status: experimental
level: medium
description: |
  The following analytic identifies an abnormally high number of cloud instances being destroyed within a 4-hour period. It leverages cloud infrastructure logs and applies a probability density model to detect outliers. This activity is significant for a SOC because a sudden spike in destroyed instances could indicate malicious activity, such as an insider threat or a compromised account attempting to disrupt services. If confirmed malicious, this could lead to significant operational disruptions, data loss, and potential financial impact due to the destruction of critical cloud resources.
author: David Dorsey, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: threat
detection:
  _splunk_search: |
    | tstats count as instances_destroyed values(All_Changes.object_id) as object_id FROM datamodel=Change
  WHERE All_Changes.action=deleted
    AND
    All_Changes.status=success
    AND
    All_Changes.object_category=instance
  BY All_Changes.user _time span=1h
| `drop_dm_object_name("All_Changes")`
| eval HourOfDay=strftime(_time, "%H")
| eval HourOfDay=floor(HourOfDay/4)*4
| eval DayOfWeek=strftime(_time, "%w")
| eval isWeekend=if(DayOfWeek >= 1 AND DayOfWeek <= 5, 0, 1)
| join HourOfDay isWeekend [summary cloud_excessive_instances_destroyed_v1]
| where cardinality >=16
| apply cloud_excessive_instances_destroyed_v1 threshold=0.005
| rename "IsOutlier(instances_destroyed)" as isOutlier
| where isOutlier=1
| eval expected_upper_threshold = mvindex(split(mvindex(BoundaryRanges, -1), ":"), 0)
| eval distance_from_threshold = instances_destroyed - expected_upper_threshold
| table _time, user, instances_destroyed, expected_upper_threshold, distance_from_threshold, object_id
| `abnormally_high_number_of_cloud_instances_destroyed_filter`
  condition: _splunk_search
references:

tags:
  - attack.t1078.004
