title: Abnormally High Number Of Cloud Infrastructure API Calls
id: 0840ddf1-8c89-46ff-b730-c8d6722478c0
status: stable
level: medium
description: |
  The following analytic detects a spike in the number of API calls made to your cloud infrastructure by a user. It leverages cloud infrastructure logs and compares the current API call volume against a baseline probability density function to identify anomalies. This activity is significant because an unusual increase in API calls can indicate potential misuse or compromise of cloud resources. If confirmed malicious, this could lead to unauthorized access, data exfiltration, or disruption of cloud services, posing a significant risk to the organization's cloud environment.
author: David Dorsey, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    | tstats count as api_calls values(All_Changes.command) as command FROM datamodel=Change
  WHERE All_Changes.user!=unknown All_Changes.status=success
  BY All_Changes.user _time span=1h
| `drop_dm_object_name("All_Changes")`
| eval HourOfDay=strftime(_time, "%H")
| eval HourOfDay=floor(HourOfDay/4)*4
| eval DayOfWeek=strftime(_time, "%w")
| eval isWeekend=if(DayOfWeek >= 1 AND DayOfWeek <= 5, 0, 1)
| join user HourOfDay isWeekend [ summary cloud_excessive_api_calls_v1]
| where cardinality >=16
| apply cloud_excessive_api_calls_v1 threshold=0.005
| rename "IsOutlier(api_calls)" as isOutlier
| where isOutlier=1
| eval expected_upper_threshold = mvindex(split(mvindex(BoundaryRanges, -1), ":"), 0)
| where api_calls > expected_upper_threshold
| eval distance_from_threshold = api_calls - expected_upper_threshold
| table _time, user, command, api_calls, expected_upper_threshold, distance_from_threshold
| `abnormally_high_number_of_cloud_infrastructure_api_calls_filter`
  condition: _splunk_search
references:

tags:
  - attack.t1078.004
