title: AWS Console Login Failed During MFA Challenge
id: 55349868-5583-466f-98ab-d3beb321961e
status: stable
level: high
description: |
  The following analytic identifies failed authentication attempts to the AWS Console during the Multi-Factor Authentication (MFA) challenge. It leverages AWS CloudTrail logs, specifically the `additionalEventData` field, to detect when MFA was used but the login attempt still failed. This activity is significant as it may indicate an adversary attempting to access an account with compromised credentials but being thwarted by MFA. If confirmed malicious, this could suggest an ongoing attempt to breach the account, potentially leading to unauthorized access and further attacks if MFA is bypassed.
author: Bhavin Patel, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: threat
detection:
  _splunk_search: |
    `cloudtrail` eventName= ConsoleLogin errorMessage="Failed authentication" additionalEventData.MFAUsed = "Yes"
  | rename user_name as user
  | stats count min(_time) as firstTime max(_time) as lastTime
    BY signature dest user
       user_agent src vendor_account
       vendor_region vendor_product additionalEventData.MFAUsed
       errorMessage
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `aws_console_login_failed_during_mfa_challenge_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1621/
  - https://aws.amazon.com/what-is/mfa/
tags:
  - attack.t1586.003
  - attack.t1621
