title: AWS Excessive Security Scanning
id: 1fdd164a-def8-4762-83a9-9ffe24e74d5a
status: stable
level: high
description: |
  The following analytic identifies excessive security scanning activities in AWS by detecting a high number of Describe, List, or Get API calls from a single user. It leverages AWS CloudTrail logs to count distinct event names and flags users with more than 50 such events. This behavior is significant as it may indicate reconnaissance activities by an attacker attempting to map out your AWS environment. If confirmed malicious, this could lead to unauthorized access, data exfiltration, or further exploitation of your cloud infrastructure.
author: Patrick Bareiss, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    `cloudtrail` eventName=Describe* OR eventName=List* OR eventName=Get*
  | fillnull
  | rename user_name as user
  | stats dc(signature) as dc_events min(_time) as firstTime max(_time) as lastTime values(signature) as signature values(dest) as dest values(user_agent) as user_agent values(src) as src values(vendor_account) as vendor_account values(vendor_region) as vendor_region
    BY user
  | where dc_events > 50
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `aws_excessive_security_scanning_filter`
  condition: _splunk_search
references:
  - https://github.com/aquasecurity/cloudsploit
tags:
  - attack.t1526
