title: AWS CreateAccessKey
id: 2a9b80d3-6340-4345-11ad-212bf3d0d111
status: stable
level: low
description: |
  The following analytic identifies the creation of AWS IAM access keys by a user for another user, which can indicate privilege escalation. It leverages AWS CloudTrail logs to detect instances where the user creating the access key is different from the user for whom the key is created. This activity is significant because unauthorized access key creation can allow attackers to establish persistence or exfiltrate data via AWS APIs. If confirmed malicious, this could lead to unauthorized access to AWS services, data exfiltration, and long-term persistence in the environment.
author: Bhavin Patel, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    `cloudtrail` eventName = CreateAccessKey userAgent !=console.amazonaws.com errorCode = success
  | eval match=if(match(userIdentity.userName,requestParameters.userName),1,0)
  | search match=0
  | rename user_name as user
  | stats count min(_time) as firstTime max(_time) as lastTime
    BY signature dest user
       user_agent src vendor_account
       vendor_region vendor_product
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `aws_createaccesskey_filter`
  condition: _splunk_search
references:
  - https://bishopfox.com/blog/privilege-escalation-in-aws
  - https://rhinosecuritylabs.com/aws/aws-privilege-escalation-methods-mitigation-part-2/
tags:
  - attack.t1136.003
