title: AWS High Number Of Failed Authentications From Ip
id: f75b7f1a-b8eb-4975-a214-ff3e0a944757
status: stable
level: medium
description: |
  The following analytic detects an IP address with 20 or more failed authentication attempts to the AWS Web Console within a 5-minute window. This detection leverages CloudTrail logs, aggregating failed login events by IP address and time span. This activity is significant as it may indicate a brute force attack aimed at gaining unauthorized access or escalating privileges within an AWS environment. If confirmed malicious, this could lead to unauthorized access, data breaches, or further exploitation of AWS resources.
author: Bhavin Patel, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: threat
detection:
  _splunk_search: |
    `cloudtrail` eventName=ConsoleLogin action=failure
  | bucket span=10m _time
  | rename user_name as user
  | stats dc(_raw) AS failed_attempts values(user) as user values(user_agent) as user_agent
    BY _time, src, signature,
       dest, vendor_account vendor_region,
       vendor_product
  | where failed_attempts > 20
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `aws_high_number_of_failed_authentications_from_ip_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://www.whiteoaksecurity.com/blog/goawsconsolespray-password-spraying-tool/
  - https://softwaresecuritydotblog.wordpress.com/2019/09/28/how-to-protect-against-credential-stuffing-on-aws/
tags:
  - attack.t1110.003
  - attack.t1110.004
