title: AWS ECR Container Scanning Findings Low Informational Unknown
id: cbc95e44-7c22-443f-88fd-0424478f5589
status: stable
level: medium
description: |
  The following analytic identifies low, informational, or unknown severity findings from AWS Elastic Container Registry (ECR) image scans. It leverages AWS CloudTrail logs, specifically the DescribeImageScanFindings event, to detect these findings. This activity is significant for a SOC as it helps in early identification of potential vulnerabilities or misconfigurations in container images, which could be exploited if left unaddressed. If confirmed malicious, these findings could lead to unauthorized access, data breaches, or further exploitation within the containerized environment.
author: Patrick Bareiss, Eric McGinnis Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    `cloudtrail` eventSource=ecr.amazonaws.com eventName=DescribeImageScanFindings
  | spath path=responseElements.imageScanFindings.findings{} output=findings
  | mvexpand findings
  | spath input=findings
  | search severity IN ("LOW", "INFORMATIONAL", "UNKNOWN")
  | rename name as finding_name, description as finding_description, requestParameters.imageId.imageDigest as imageDigest, requestParameters.repositoryName as repository
  | rename user_name as user
  | stats count min(_time) as firstTime max(_time) as lastTime
    BY signature dest user
       user_agent src vendor_account
       vendor_region vendor_product finding_name
       finding_description imageDigest repository
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `aws_ecr_container_scanning_findings_low_informational_unknown_filter`
  condition: _splunk_search
references:
  - https://docs.aws.amazon.com/AmazonECR/latest/userguide/image-scanning.html
tags:
  - attack.t1204.003
