title: AWS Unusual Number of Failed Authentications From Ip
id: 0b5c9c2b-e2cb-4831-b4f1-af125ceb1386
status: stable
level: medium
description: |
  The following analytic identifies a single source IP failing to authenticate into the AWS Console with multiple valid users. It uses CloudTrail logs and calculates the standard deviation for source IP, leveraging the 3-sigma rule to detect unusual numbers of failed authentication attempts. This behavior is significant as it may indicate a Password Spraying attack, where an adversary attempts to gain initial access or elevate privileges. If confirmed malicious, this activity could lead to unauthorized access, data breaches, or further exploitation within the AWS environment.
author: Bhavin Patel, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: threat
detection:
  _splunk_search: |
    `cloudtrail` eventName=ConsoleLogin action=failure
  | rename eventName as action, eventSource as dest, userName as user, userAgent as user_agent, sourceIPAddress as src, userIdentity.accountId as vendor_account, awsRegion as vendor_region
  | bucket span=10m _time
  | stats  dc(_raw) AS distinct_attempts values(user_name) as tried_accounts values(action) as action values(dest) as dest values(vendor_account) as vendor_account values(vendor_region) as vendor_region values(vendor_product) as vendor_product values(user_agent) as user_agent
    BY _time, src
  | eventstats avg(distinct_attempts) as avg_attempts , stdev(distinct_attempts) as ip_std
    BY _time
  | eval upperBound=(avg_attempts+ip_std*3)
  | eval  isOutlier=if(distinct_attempts > 10 and distinct_attempts >= upperBound, 1, 0)
  | where isOutlier = 1
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `aws_unusual_number_of_failed_authentications_from_ip_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://www.whiteoaksecurity.com/blog/goawsconsolespray-password-spraying-tool/
  - https://softwaresecuritydotblog.wordpress.com/2019/09/28/how-to-protect-against-credential-stuffing-on-aws/
tags:
  - attack.t1110.003
  - attack.t1110.004
  - attack.t1586.003
