title: AWS Successful Console Authentication From Multiple IPs
id: 395e50e1-2b87-4fa3-8632-0dfbdcbcd2cb
status: stable
level: medium
description: |
  The following analytic detects an AWS account successfully authenticating from multiple unique IP addresses within a 5-minute window. It leverages AWS CloudTrail logs, specifically monitoring `ConsoleLogin` events and counting distinct source IPs. This behavior is significant as it may indicate compromised credentials, potentially from a phishing attack, being used concurrently by an adversary and a legitimate user. If confirmed malicious, this activity could allow unauthorized access to corporate resources, leading to data breaches or further exploitation within the AWS environment.
author: Bhavin Patel, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: threat
detection:
  _splunk_search: |
    `cloudtrail` eventName = ConsoleLogin
  | bin span=5m _time
  | rename user_name as user
  | stats  dc(src) as distinct_ip_count values(src) as src values(user_agent) as user_agent values(dest) as dest
    BY _time, user, signature,
       vendor_account, vendor_region, vendor_product
  | where distinct_ip_count>1
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `aws_successful_console_authentication_from_multiple_ips_filter`
  condition: _splunk_search
references:
  - https://rhinosecuritylabs.com/aws/mfa-phishing-on-aws/
tags:
  - attack.t1586
  - attack.t1535
