title: AWS CreateLoginProfile
id: 2a9b80d3-6340-4345-11ad-212bf444d111
status: stable
level: high
description: |
  The following analytic identifies the creation of a login profile for one AWS user by another, followed by a console login from the same source IP. It uses AWS CloudTrail logs to correlate the `CreateLoginProfile` and `ConsoleLogin` events based on the source IP and user identity. This activity is significant as it may indicate privilege escalation, where an attacker creates a new login profile to gain unauthorized access. If confirmed malicious, this could allow the attacker to escalate privileges and maintain persistent access to the AWS environment.
author: Bhavin Patel, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    `cloudtrail` eventName = CreateLoginProfile
  | rename requestParameters.userName as new_login_profile
  | table src_ip eventName new_login_profile userIdentity.userName
  | join new_login_profile src_ip [
  | search `cloudtrail` eventName = ConsoleLogin
  | rename userIdentity.userName  as new_login_profile
  | stats count values(eventName) min(_time) as firstTime max(_time) as lastTime
    BY eventSource aws_account_id errorCode
       user_agent eventID awsRegion
       userIdentity.principalId user_arn new_login_profile
       src_ip dest vendor_account
       vendor_region vendor_product
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`]
  | rename user_arn as user
  | `aws_createloginprofile_filter`
  condition: _splunk_search
references:
  - https://bishopfox.com/blog/privilege-escalation-in-aws
  - https://rhinosecuritylabs.com/aws/aws-privilege-escalation-methods-mitigation-part-2/
tags:
  - attack.t1136.003
