title: AWS Exfiltration via Anomalous GetObject API Activity
id: e4384bbf-5835-4831-8d85-694de6ad2cc6
status: stable
level: medium
description: |
  The following analytic identifies anomalous GetObject API activity in AWS, indicating potential data exfiltration attempts. It leverages AWS CloudTrail logs and uses the `anomalydetection` command to detect unusual patterns in the frequency of GetObject API calls by analyzing fields such as "count," "user_type," and "user_arn" within a 10-minute window. This activity is significant as it may indicate unauthorized data access or exfiltration from S3 buckets. If confirmed malicious, attackers could exfiltrate sensitive data, leading to data breaches and compliance violations.
author: Bhavin Patel, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: threat
detection:
  _splunk_search: |
    `cloudtrail` eventName=GetObject
  | bin _time span=10m
  | rename user_name as user
  | stats count values(requestParameters.bucketName) as bucketName
    BY signature dest user
       user_agent src vendor_account
       vendor_region vendor_product
  | anomalydetection "count" "user" action=annotate
  | search probable_cause=*
  | `aws_exfiltration_via_anomalous_getobject_api_activity_filter`
  condition: _splunk_search
references:
  - https://labs.nettitude.com/blog/how-to-exfiltrate-aws-ec2-data/
  - https://help.splunk.com/en/splunk-enterprise/search/spl-search-reference/9.4/search-commands/anomalydetection
  - https://www.vectra.ai/blogpost/abusing-the-replicator-silently-exfiltrating-data-with-the-aws-s3-replication-service
tags:
  - attack.t1119
