title: Azure AD Successful Single-Factor Authentication
id: a560e7f6-1711-4353-885b-40be53101fcd
status: stable
level: high
description: |
  The following analytic identifies a successful single-factor authentication event against Azure Active Directory. It leverages Azure SignInLogs data, specifically focusing on events where single-factor authentication succeeded. This activity is significant as it may indicate a misconfiguration, policy violation, or potential account takeover attempt. If confirmed malicious, an attacker could gain unauthorized access to the account, potentially leading to data breaches, privilege escalation, or further exploitation within the environment.
author: Mauricio Velazco, Gowthamaraj Rajendran, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: identity
detection:
  _splunk_search: |
    `azure_monitor_aad` category=SignInLogs properties.authenticationRequirement=singleFactorAuthentication properties.authenticationDetails{}.succeeded=true
  | rename properties.* as *
  | rename userAgent as user_agent
  | fillnull
  | stats count min(_time) as firstTime max(_time) as lastTime
    BY dest user src
       vendor_account vendor_product user_agent
       signature
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `azure_ad_successful_single_factor_authentication_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1078/004/
  - https://docs.microsoft.com/en-us/azure/active-directory/authentication/concept-mfa-howitworks*
  - https://www.forbes.com/sites/daveywinder/2020/07/08/new-dark-web-audit-reveals-15-billion-stolen-logins-from-100000-breaches-passwords-hackers-cybercrime/?sh=69927b2a180f
tags:
  - attack.t1078.004
  - attack.t1586.003
