title: Azure AD Unusual Number of Failed Authentications From Ip
id: 3d8d3a36-93b8-42d7-8d91-c5f24cec223d
status: stable
level: medium
description: |
  The following analytic identifies a single source IP failing to authenticate with multiple valid users, potentially indicating a Password Spraying attack against an Azure Active Directory tenant. It uses Azure SignInLogs data and calculates the standard deviation for source IPs, applying the 3-sigma rule to detect unusual numbers of failed authentication attempts. This activity is significant as it may signal an adversary attempting to gain initial access or elevate privileges. If confirmed malicious, this could lead to unauthorized access, privilege escalation, and potential compromise of sensitive information.
author: Mauricio Velazco, Gowthamaraj Rajendran, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: access
detection:
  _splunk_search: |
    `azure_monitor_aad` category=SignInLogs properties.status.errorCode=50126 properties.authenticationDetails{}.succeeded=false
  | rename properties.* as *
  | bucket span=5m _time
  | stats dc(userPrincipalName) AS unique_accounts values(userPrincipalName) as userPrincipalName values(dest) as dest  values(user) as user
    BY _time, src, vendor_account,
       vendor_product
  | eventstats avg(unique_accounts) as ip_avg, stdev(unique_accounts) as ip_std
    BY src
  | eval upperBound=(ip_avg+ip_std*3)
  | eval isOutlier=if(unique_accounts > 10 and unique_accounts >= upperBound, 1,0)
  | where isOutlier = 1
  | `azure_ad_unusual_number_of_failed_authentications_from_ip_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://docs.microsoft.com/en-us/security/compass/incident-response-playbook-password-spray
  - https://www.cisa.gov/uscert/ncas/alerts/aa21-008a
  - https://docs.microsoft.com/azure/active-directory/reports-monitoring/reference-sign-ins-error-codes
tags:
  - attack.t1110.003
  - attack.t1110.004
  - attack.t1586.003
