title: Azure AD Device Code Authentication
id: d68d8732-6f7e-4ee5-a6eb-737f2b990b91
status: stable
level: high
description: |
  The following analytic identifies Azure Device Code Phishing attacks, which can lead to Azure Account Take-Over (ATO). It leverages Azure AD SignInLogs to detect suspicious authentication requests using the device code authentication protocol. This activity is significant as it indicates potential bypassing of Multi-Factor Authentication (MFA) and Conditional Access Policies (CAPs) through phishing emails. If confirmed malicious, attackers could gain unauthorized access to Azure AD, Exchange mailboxes, and Outlook Web Application (OWA), leading to potential data breaches and unauthorized data access.
author: Mauricio Velazco, Gowthamaraj Rajendran,  Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: identity
detection:
  _splunk_search: |
    `azure_monitor_aad` category=SignInLogs "properties.authenticationProtocol"=deviceCode
  | rename properties.* as *
  | rename userAgent as user_agent
  | fillnull
  | stats count min(_time) as firstTime max(_time) as lastTime
    BY dest user src
       vendor_account vendor_product user_agent
       category
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `azure_ad_device_code_authentication_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1528
  - https://github.com/rvrsh3ll/TokenTactics
  - https://embracethered.com/blog/posts/2022/device-code-phishing/
  - https://0xboku.com/2021/07/12/ArtOfDeviceCodePhish.html
  - https://learn.microsoft.com/en-us/azure/active-directory/develop/v2-oauth2-device-code
tags:
  - attack.t1528
  - attack.t1566.002
