title: Azure AD Multiple Service Principals Created by User
id: 32880707-f512-414e-bd7f-204c0c85b758
status: stable
level: medium
description: |
  The following analytic identifies instances where a single user creates more than three unique OAuth applications within a 10-minute timeframe in Azure AD. It detects this activity by monitoring the 'Add service principal' operation and aggregating data in 10-minute intervals. This behavior is significant as it may indicate an adversary rapidly creating multiple service principals to stage an attack or expand their foothold within the network. If confirmed malicious, this activity could allow attackers to establish persistence, escalate privileges, or access sensitive information within the Azure environment.
author: Mauricio Velazco, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: identity
detection:
  _splunk_search: |
    `azure_monitor_aad` operationName="Add service principal" properties.initiatedBy.user.id=*
  | rename properties.* as *
  | bucket span=10m _time
  | rename targetResources{}.displayName as displayName
  | rename userAgent as user_agent
  | fillnull
  | stats count min(_time) as firstTime max(_time) as lastTime dc(displayName) as unique_apps values(displayName) as displayName values(dest) as dest values(src) as src values(user) as user values(user_agent) as user_agent
    BY src_user vendor_account vendor_product
       signature
  | where unique_apps > 3
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `azure_ad_multiple_service_principals_created_by_user_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1136/003/
  - https://www.microsoft.com/en-us/security/blog/2024/01/25/midnight-blizzard-guidance-for-responders-on-nation-state-attack/
tags:
  - attack.t1136.003
