title: Azure AD Successful Authentication From Different Ips
id: be6d868d-33b6-4aaa-912e-724fb555b11a
status: stable
level: high
description: |
  The following analytic detects an Azure AD account successfully authenticating from multiple unique IP addresses within a 30-minute window. It leverages Azure AD SignInLogs to identify instances where the same user logs in from different IPs in a short time frame. This behavior is significant as it may indicate compromised credentials being used by an adversary, potentially following a phishing attack. If confirmed malicious, this activity could allow unauthorized access to corporate resources, leading to data breaches or further exploitation within the network.
author: Mauricio Velazco, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: identity
detection:
  _splunk_search: |
    `azure_monitor_aad` properties.authenticationDetails{}.succeeded=true category=SignInLogs
  | rename properties.* as *
  | bucket span=30m _time
  | fillnull
  | stats count min(_time) as firstTime max(_time) as lastTime dc(src) AS unique_ips values(dest) as dest values(src) as src
    BY user vendor_account vendor_product
       signature
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | where unique_ips > 1
  | `azure_ad_successful_authentication_from_different_ips_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1110
  - https://attack.mitre.org/techniques/T1110.001
  - https://attack.mitre.org/techniques/T1110.003
tags:
  - attack.t1110.001
  - attack.t1110.003
