title: Azure AD Multi-Factor Authentication Disabled
id: 482dd42a-acfa-486b-a0bb-d6fcda27318e
status: stable
level: high
description: |
  The following analytic detects attempts to disable multi-factor authentication (MFA) for an Azure AD user. It leverages Azure Active Directory AuditLogs to identify the "Disable Strong Authentication" operation. This activity is significant because disabling MFA can allow adversaries to maintain persistence using compromised accounts without raising suspicion. If confirmed malicious, this action could enable attackers to bypass an essential security control, potentially leading to unauthorized access and prolonged undetected presence in the environment.
author: Mauricio Velazco, Gowthamaraj Rajendran, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: identity
detection:
  _splunk_search: |
    `azure_monitor_aad` category=AuditLogs operationName="Disable Strong Authentication"
  | rename properties.* as *
  | rename targetResources{}.type as type
  | rename initiatedBy.user.userPrincipalName as initiatedBy
  | rename userAgent as user_agent
  | fillnull
  | stats count min(_time) as firstTime max(_time) as lastTime
    BY dest user src
       vendor_account vendor_product user_agent
       initiatedBy signature
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `azure_ad_multi_factor_authentication_disabled_filter`
  condition: _splunk_search
references:
  - https://docs.microsoft.com/en-us/azure/active-directory/authentication/concept-mfa-howitworks
  - https://docs.microsoft.com/en-us/azure/active-directory/authentication/howto-mfa-userstates
  - https://attack.mitre.org/tactics/TA0005/
  - https://attack.mitre.org/techniques/T1556/
tags:
  - attack.t1556.006
  - attack.t1586.003
