title: Azure AD Service Principal Owner Added
id: 7ddf2084-6cf3-4a44-be83-474f7b73c701
status: stable
level: high
description: |
  The following analytic detects the addition of a new owner to a Service Principal within an Azure AD tenant. It leverages Azure Active Directory events from the AuditLog log category to identify this activity. This behavior is significant because Service Principals do not support multi-factor authentication or conditional access policies, making them a target for adversaries seeking persistence or privilege escalation. If confirmed malicious, this activity could allow attackers to maintain access to the Azure AD environment with single-factor authentication, potentially leading to unauthorized access and control over critical resources.
author: Mauricio Velazco, Gowthamaraj Rajendran, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: audit
detection:
  _splunk_search: |
    `azure_monitor_aad` operationName="Add owner to application"
  | rename properties.* as *
  | rename initiatedBy.user.userPrincipalName as initiatedBy
  | rename targetResources{}.userPrincipalName as newOwner
  | rename targetResources{}.modifiedProperties{}.newValue as displayName
  | eval displayName = mvindex(displayName,1)
  | where initiatedBy!=newOwner
  | fillnull
  | stats count min(_time) as firstTime max(_time) as lastTime
    BY dest user src
       vendor_account vendor_product initiatedBy
       result newOwner displayName
       signature
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `azure_ad_service_principal_owner_added_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1098/
tags:
  - attack.t1098
