title: Azure AD Privileged Role Assigned
id: a28f0bc3-3400-4a6e-a2da-89b9e95f0d2a
status: stable
level: high
description: |
  The following analytic detects the assignment of privileged Azure Active Directory roles to a user. It leverages Azure AD audit logs, specifically monitoring the "Add member to role" operation. This activity is significant as adversaries may assign privileged roles to compromised accounts to maintain persistence within the Azure AD environment. If confirmed malicious, this could allow attackers to escalate privileges, access sensitive information, and maintain long-term control over the Azure AD infrastructure.
author: Mauricio Velazco, Gowthamaraj Rajendran, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: audit
detection:
  _splunk_search: |
    `azure_monitor_aad` "operationName"="Add member to role"
  | rename properties.* as *
  | rename initiatedBy.user.userPrincipalName as initiatedBy
  | rename targetResources{}.modifiedProperties{}.newValue as roles
  | eval role=mvindex(roles,1)
  | fillnull
  | stats count min(_time) as firstTime max(_time) as lastTime
    BY dest user src
       vendor_account vendor_product initiatedBy
       result role signature
  | lookup privileged_azure_ad_roles azureadrole AS role OUTPUT isprvilegedadrole description
  | search isprvilegedadrole = True
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `azure_ad_privileged_role_assigned_filter`
  condition: _splunk_search
references:
  - https://docs.microsoft.com/en-us/azure/active-directory/roles/concept-understand-roles
  - https://docs.microsoft.com/en-us/azure/active-directory/roles/permissions-reference
  - https://adsecurity.org/?p=4277
  - https://www.mandiant.com/resources/detecting-microsoft-365-azure-active-directory-backdoors
  - https://docs.microsoft.com/en-us/azure/active-directory/roles/security-planning
  - https://attack.mitre.org/techniques/T1098/003/
tags:
  - attack.t1098.003
