title: Cisco IOS XE WebUI Programmatic Configuration
id: f9686576-a23d-4c4d-bfad-a45499dc448a
status: stable
level: medium
description: |
  This analytic detects Cisco IOS-XE configuration changes performed by the WebUI WSMA process.

author: Nasreddine Bencherchali
date: 
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `cisco_ios`
facility="SYS"
mnemonic="CONFIG_P"
message_text="*Configured programmatically by process SEP_webui_wsma_http*"
| rex field=_raw "process\s(?<process>\S+)\sfrom.*as\s(?<user>\S+)\son\s(?<vty>\S+)"
| eval dest=coalesce(host, dvc, dest, "unknown")
| stats count min(_time) as firstTime
              max(_time) as lastTime
              values(process) as process
              values(vty) as vty
  by dest user
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| `cisco_ios_xe_webui_programmatic_configuration_filter`
  condition: _splunk_search
references:
  - https://www.cisa.gov/news-events/cybersecurity-advisories/aa25-239a
  - https://blog.talosintelligence.com/salt-typhoon-analysis/
tags:

