title: Cisco Secure Firewall - Blacklisted SSL Certificate Fingerprint
id: c43f7b49-2dab-4e76-892e-7f971c2f20f1
status: stable
level: high
description: |
  The following analytic detects the use of known suspicious SSL certificates in any observed event where the SSL_CertFingerprint field is present. It leverages Cisco Secure Firewall logs and compares the SSL certificate SHA1 fingerprint against a blacklist of certificates associated with malware distribution, command and control (C2) infrastructure, or phishing campaigns. This activity is significant as adversaries often reuse or self-sign certificates across malicious infrastructure, allowing defenders to track and detect encrypted sessions even when domains or IPs change. If confirmed malicious, this may indicate beaconing, malware download, or data exfiltration over TLS/SSL.

author: Nasreddine Bencherchali, Splunk
date: 2026-01-21
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    `cisco_secure_firewall` EventType=* SSL_CertFingerprint=*
| lookup sslbl_ssl_certificate_blacklist SHA1 as SSL_CertFingerprint OUTPUT Listingdate, Listingreason
| where isnotnull(Listingreason)
| stats min(_time) as firstTime max(_time) as lastTime
        values(dest) as dest
        values(dest_port) as dest_port
        values(rule) as rule
        values(url) as url
        values(Listingreason) as Reasons
        values(Listingdate) as "SSL Cert Listing Dates"
        count by SSL_CertFingerprint src transport action
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| `cisco_secure_firewall___blacklisted_ssl_certificate_fingerprint_filter`

  condition: _splunk_search
references:
  - https://www.cisco.com/c/en/us/td/docs/security/firepower/741/api/FQE/secure_firewall_estreamer_fqe_guide_740.pdf
tags:
  - attack.t1587.002
  - attack.t1588.004
  - attack.t1071.001
  - attack.t1573.002
