title: Detect Traffic Mirroring
id: 42b3b753-5925-49c5-9742-36fa40a73990
status: experimental
level: high
description: |
  The following analytic detects the initiation of traffic mirroring sessions on Cisco network devices. It leverages logs with specific mnemonics and facilities related to traffic mirroring, such as "ETH_SPAN_SESSION_UP" and "PKTCAP_START." This activity is significant because adversaries may use traffic mirroring to exfiltrate data by duplicating and forwarding network traffic to an external destination. If confirmed malicious, this could allow attackers to capture sensitive information, monitor network communications, and potentially compromise the integrity and confidentiality of the network.
author: Mikael Bjerkeland, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    `cisco_networks` (facility="MIRROR" mnemonic="ETH_SPAN_SESSION_UP") OR (facility="SPAN" mnemonic="SESSION_UP") OR (facility="SPAN" mnemonic="PKTCAP_START") OR (mnemonic="CFGLOG_LOGGEDCMD" command="monitor session*")
  | stats min(_time) AS firstTime max(_time) AS lastTime count
    BY host facility mnemonic
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `detect_traffic_mirroring_filter`
  condition: _splunk_search
references:

tags:
  - attack.t1020.001
  - attack.t1200
  - attack.t1498
