title: Detect Unauthorized Assets by MAC address
id: dcfd6b40-42f9-469d-a433-2e53f7489ff4
status: experimental
level: high
description: |
  The following analytic identifies unauthorized devices attempting to connect to the organization's network by inspecting DHCP request packets. It detects this activity by comparing the MAC addresses in DHCP requests against a list of known authorized devices stored in the assets_by_str.csv file. This activity is significant for a SOC because unauthorized devices can pose security risks, including potential data breaches or network disruptions. If confirmed malicious, this activity could allow an attacker to gain unauthorized network access, potentially leading to further exploitation or data exfiltration.
author: Bhavin Patel, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    | tstats `security_content_summariesonly` count FROM datamodel=Network_Sessions
  WHERE nodename=All_Sessions.DHCP All_Sessions.tag=dhcp
  BY All_Sessions.dest_ip All_Sessions.dest_mac
| dedup All_Sessions.dest_mac
| `drop_dm_object_name("Network_Sessions")`
| `drop_dm_object_name("All_Sessions")`
| search NOT [
| inputlookup asset_lookup_by_str
| rename mac as dest_mac
| fields + dest_mac]
| `detect_unauthorized_assets_by_mac_address_filter`
  condition: _splunk_search
references:

tags:

