title: Detect S3 access from a new IP
id: e6f1bb1b-f441-492b-9126-902acda217da
status: experimental
level: medium
description: |
  The following analytic identifies access to an S3 bucket from a new or previously unseen remote IP address. It leverages S3 bucket-access logs, specifically focusing on successful access events (http_status=200). This activity is significant because access from unfamiliar IP addresses could indicate unauthorized access or potential data exfiltration attempts. If confirmed malicious, this activity could lead to unauthorized data access, data theft, or further exploitation of the compromised S3 bucket, posing a significant risk to sensitive information stored within the bucket.
author: Bhavin Patel, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    `aws_s3_accesslogs` http_status=200  [search `aws_s3_accesslogs` http_status=200
  | stats earliest(_time) as firstTime latest(_time) as lastTime
    BY bucket_name remote_ip
  | inputlookup append=t previously_seen_S3_access_from_remote_ip
  | stats min(firstTime) as firstTime, max(lastTime) as lastTime
    BY bucket_name remote_ip
  | outputlookup previously_seen_S3_access_from_remote_ip
  | eval newIP=if(firstTime >= relative_time(now(), "-70m@m"), 1, 0)
  | where newIP=1
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | table bucket_name remote_ip]
  | iplocation remote_ip
  | rename remote_ip as src_ip
  | table _time bucket_name src_ip City Country operation request_uri
  | `detect_s3_access_from_a_new_ip_filter`
  condition: _splunk_search
references:

tags:
  - attack.t1530
