title: Detect suspicious DNS TXT records using pretrained model in DSDL
id: 92f65c3a-968c-11ed-a1eb-0242ac120002
status: experimental
level: medium
description: |
  The following analytic identifies suspicious DNS TXT records using a pre-trained deep learning model. It leverages DNS response data from the Network Resolution data model, categorizing TXT records into known types via regular expressions. Records that do not match known patterns are flagged as suspicious. This activity is significant as DNS TXT records can be used for data exfiltration or command-and-control communication. If confirmed malicious, attackers could use these records to covertly transfer data or receive instructions, posing a severe threat to network security.
author: Abhinav Mishra, Kumar Sharad and Namratha Sreekanta, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Network_Resolution
  WHERE DNS.message_type=response
    AND
    DNS.record_type=TXT
  BY DNS.src DNS.dest DNS.answer
     DNS.record_type
| `drop_dm_object_name("DNS")`
| rename answer as text
| fields firstTime, lastTime, message_type,record_type,src,dest, text
| apply detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl
| rename predicted_is_unknown as is_suspicious_score
| where is_suspicious_score > 0.5
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| table src,dest,text,record_type, firstTime, lastTime,is_suspicious_score
| `detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1071/004/
  - https://unit42.paloaltonetworks.com/dns-tunneling-how-dns-can-be-abused-by-malicious-actors/
  - https://en.wikipedia.org/wiki/TXT_record
tags:
  - attack.t1568.002
