title: Detect Spike in AWS Security Hub Alerts for EC2 Instance
id: 2a9b80d3-6340-4345-b5ad-290bf5d0d222
status: stable
level: medium
description: |
  The following analytic identifies a spike in the number of AWS Security Hub alerts for an EC2 instance within a 4-hour interval. It leverages AWS Security Hub findings data, calculating the average and standard deviation of alerts to detect anomalies. This activity is significant for a SOC as a sudden increase in alerts may indicate potential security incidents or misconfigurations requiring immediate attention. If confirmed malicious, this could signify an ongoing attack, leading to unauthorized access, data exfiltration, or disruption of services on the affected EC2 instance.
author: Bhavin Patel, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `aws_securityhub_finding` "Resources{}.Type"=AWSEC2Instance
  | bucket span=4h _time
  | stats count AS alerts values(Title) as Title values(Types{}) as Types values(vendor_account) as vendor_account values(vendor_region) as vendor_region values(severity) as severity
    BY _time dest
  | eventstats avg(alerts) as total_alerts_avg, stdev(alerts) as total_alerts_stdev
  | eval threshold_value = 3
  | eval isOutlier=if(alerts > total_alerts_avg+(total_alerts_stdev * threshold_value), 1, 0)
  | search isOutlier=1
  | table _time dest alerts Title Types vendor_account vendor_region severity isOutlier total_alerts_avg
  | `detect_spike_in_aws_security_hub_alerts_for_ec2_instance_filter`
  condition: _splunk_search
references:

tags:

