title: Detect Remote Access Software Usage FileInfo
id: ccad96d7-a48c-4f13-8b9c-9f6a31cba454
status: stable
level: medium
description: |
  The following analytic detects the execution of processes with file or code signing attributes from known remote access software within the environment. It leverages Sysmon EventCode 1 data and cross-references a lookup table of remote access utilities such as AnyDesk, GoToMyPC, LogMeIn, and TeamViewer. This activity is significant as adversaries often use these tools to maintain unauthorized remote access. If confirmed malicious, this could allow attackers to persist in the environment, potentially leading to data exfiltration or further compromise of the network.
author: Steven Dick
date: 2026-03-10
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `sysmon` EventCode=1
  | stats count min(_time) as firstTime max(_time) as lastTime, values(Company) as Company values(Product) as Product
    BY action dest original_file_name
       parent_process parent_process_exec parent_process_guid
       parent_process_id parent_process_name parent_process_path
       process process_exec process_guid
       process_hash process_id process_integrity_level
       process_name process_path user
       user_id vendor_product
  | lookup remote_access_software remote_utility_fileinfo AS Product OUTPUT isutility, description as signature, comment_reference as desc, category
  | search isutility = True
  | `remote_access_software_usage_exceptions`
  | `detect_remote_access_software_usage_fileinfo_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1219/
  - https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
  - https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/
tags:
  - attack.t1219
