title: Detect DGA domains using pretrained model in DSDL
id: 92e24f32-9b9a-4060-bba2-2a0eb31f3493
status: experimental
level: medium
description: |
  The following analytic identifies Domain Generation Algorithm (DGA) generated domains using a pre-trained deep learning model. It leverages the Network Resolution data model to analyze domain names and detect unusual character sequences indicative of DGA activity. This behavior is significant as adversaries often use DGAs to generate numerous domain names for command-and-control servers, making it harder to block malicious traffic. If confirmed malicious, this activity could enable attackers to maintain persistent communication with compromised systems, evade detection, and execute further malicious actions.
author: Abhinav Mishra, Kumar Sharad and Namratha Sreekanta, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    | tstats `security_content_summariesonly` values(DNS.answer) as IPs min(_time) as firstTime  max(_time) as lastTime FROM datamodel=Network_Resolution
  BY DNS.src, DNS.query
| `drop_dm_object_name(DNS)`
| rename query AS domain
| fields IPs, src, domain, firstTime, lastTime
| apply pretrained_dga_model_dsdl
| rename pred_dga_proba AS dga_score
| where dga_score>0.5
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| table src, domain, IPs, firstTime, lastTime, dga_score
| `detect_dga_domains_using_pretrained_model_in_dsdl_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1568/002/
  - https://unit42.paloaltonetworks.com/threat-brief-understanding-domain-generation-algorithms-dga/
  - https://en.wikipedia.org/wiki/Domain_generation_algorithm
tags:
  - attack.t1568.002
