title: Detect ARP Poisoning
id: b44bebd6-bd39-467b-9321-73971bcd1aac
status: experimental
level: high
description: |
  The following analytic detects ARP Poisoning attacks by monitoring for Dynamic ARP Inspection (DAI) errors on Cisco network devices. It leverages logs from Cisco devices, specifically looking for events where the ARP inspection feature has disabled an interface due to suspicious activity. This activity is significant because ARP Poisoning can allow attackers to intercept, modify, or disrupt network traffic, leading to potential data breaches or denial of service. If confirmed malicious, this could enable attackers to perform man-in-the-middle attacks, compromising the integrity and confidentiality of network communications.
author: Mikael Bjerkeland, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    `cisco_networks` facility="PM" mnemonic="ERR_DISABLE" disable_cause="arp-inspection"
  | eval src_interface=src_int_prefix_long+src_int_suffix
  | stats min(_time) AS firstTime max(_time) AS lastTime count
    BY host src_interface
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `detect_arp_poisoning_filter`
  condition: _splunk_search
references:

tags:
  - attack.t1200
  - attack.t1498
  - attack.t1557.002
