title: Detect SNICat SNI Exfiltration
id: 82d06410-134c-11eb-adc1-0242ac120002
status: experimental
level: high
description: |
  The following analytic identifies the use of SNICat tool commands within the TLS SNI field, indicating potential data exfiltration attempts. It leverages Zeek SSL data to detect specific SNICat commands such as LIST, LS, SIZE, LD, CB, EX, ALIVE, EXIT, WHERE, and finito in the server_name field. This activity is significant as SNICat is a known tool for covert data exfiltration using TLS. If confirmed malicious, this could allow attackers to exfiltrate sensitive data undetected, posing a severe threat to data confidentiality and integrity.
author: Shannon Davis, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    `zeek_ssl`
  | rex field=server_name "(?<snicat>(LIST
  | LS
  | SIZE
  | LD
  | CB
  | CD
  | EX
  | ALIVE
  | EXIT
  | WHERE
  | finito)-[A-Za-z0-9]{16}\.)"
  | stats count
    BY src_ip dest_ip server_name
       snicat
  | where count>0
  | table src_ip dest_ip server_name snicat
  | `detect_snicat_sni_exfiltration_filter`
  condition: _splunk_search
references:
  - https://www.mnemonic.io/resources/blog/introducing-snicat/
  - https://github.com/mnemonic-no/SNIcat
  - https://attack.mitre.org/techniques/T1041/
tags:
  - attack.t1041
