title: DNS Query Length Outliers - MLTK
id: 85fbcfe8-9718-4911-adf6-7000d077a3a9
status: experimental
level: medium
description: |
  The following analytic identifies DNS requests with unusually large query lengths for the record type being requested. It leverages the Network_Resolution data model and applies a machine learning model to detect outliers in DNS query lengths. This activity is significant because unusually large DNS queries can indicate data exfiltration or command-and-control communication attempts. If confirmed malicious, this activity could allow attackers to exfiltrate sensitive data or maintain persistent communication channels with compromised systems.
author: Rico Valdez, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    | tstats `security_content_summariesonly` count min(_time) as start_time max(_time) as end_time values(DNS.src) as src values(DNS.dest) as dest FROM datamodel=Network_Resolution
  BY DNS.query DNS.record_type
| search DNS.record_type=*
| `drop_dm_object_name(DNS)`
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| eval query_length = len(query)
| apply dns_query_pdfmodel threshold=0.01
| rename "IsOutlier(query_length)" as isOutlier
| search isOutlier > 0
| sort -query_length
| table start_time end_time query record_type count src dest query_length
| `dns_query_length_outliers___mltk_filter`
  condition: _splunk_search
references:

tags:
  - attack.t1071.004
