title: ESXi Syslog Config Change
id: e530beb9-9b8c-4c9b-9776-0a05521ff32d
status: stable
level: high
description: |
  This detection identifies changes to the syslog configuration on an ESXi host using esxcli, which may indicate an attempt to disrupt log collection and evade detection.
author: Raven Tait, Splunk
date: 2025-05-13
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `esxi_syslog` Message="*syslog config set*" AND Message="*esxcli*" | rex field=_raw "\].*\[\s*(?P<user>[^\]]+)\]:\s(?P<command>.+)" | rex field=_raw "Z (?<dest>[\w\.]+)\s" | stats min(_time) as firstTime max(_time) as lastTime count by dest user command | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `esxi_syslog_config_change_filter`
  condition: _splunk_search
references:

tags:
  - attack.t1562.003
