title: ESXi SSH Enabled
id: b8003567-c5b6-445b-8966-ecdacc81c24d
status: stable
level: high
description: |
  This detection identifies SSH being enabled on ESXi hosts, which can be an early indicator of malicious activity. Threat actors often use SSH to gain persistent remote access after compromising credentials or exploiting vulnerabilities.
author: Raven Tait, Splunk
date: 2025-10-14
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `esxi_syslog` Message="*SSH access has been enabled" | rex field=_raw "Z (?<dest>[\w\.]+)\s" | stats min(_time) as firstTime max(_time) as lastTime count by dest Message | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `esxi_ssh_enabled_filter`
  condition: _splunk_search
references:

tags:
  - attack.t1021.004
