title: ESXi Download Errors
id: 515cccd0-c4d8-4427-92d9-8a8f8b5a71dc
status: stable
level: medium
description: |
  This detection identifies failed file download attempts on ESXi hosts by looking for specific error messages in the system logs. These failures may indicate unauthorized or malicious attempts to install or update components—such as VIBs or scripts
author: Raven Tait, Splunk
date: 2025-05-12
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `esxi_syslog` Message IN ("*Download failed*", "*Failed to download file*", "*File download error*", "*Could not download*") | rex field=_raw "Z (?<dest>[\w\.]*)\s" | stats min(_time) as firstTime max(_time) as lastTime count by dest Message | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `esxi_download_errors_filter` 
  condition: _splunk_search
references:

tags:
  - attack.t1601.001
  - attack.t1562.001
