title: First Time Seen Running Windows Service
id: 823136f2-d755-4b6d-ae04-372b486a5808
status: experimental
level: medium
description: |
  The following analytic detects the first occurrence of a Windows service running in your environment. It leverages Windows system event logs, specifically EventCode 7036, to identify services entering the "running" state. This activity is significant because the appearance of a new or previously unseen service could indicate the installation of unauthorized or malicious software. If confirmed malicious, this activity could allow an attacker to execute arbitrary code, maintain persistence, or escalate privileges within the environment. Monitoring for new services helps in early detection of potential threats.
author: David Dorsey, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `wineventlog_system` EventCode=7036
  | rex field=Message "The (?<service>[-\(\)\s\w]+) service entered the (?<state>\w+) state"
  | where state="running"
  | lookup previously_seen_running_windows_services service as service OUTPUT firstTimeSeen
  | where isnull(firstTimeSeen) OR firstTimeSeen > relative_time(now(), `previously_seen_windows_services_window`)
  | table _time dest service
  | `first_time_seen_running_windows_service_filter`
  condition: _splunk_search
references:

tags:
  - attack.t1569.002
