title: GCP Unusual Number of Failed Authentications From Ip
id: bd8097ed-958a-4873-87d9-44f2b4d85705
status: stable
level: medium
description: |
  The following analytic identifies a single source IP failing to authenticate into Google Workspace with multiple valid users, potentially indicating a Password Spraying attack. It uses Google Workspace login failure events and calculates the standard deviation for source IPs, applying the 3-sigma rule to detect unusual failed authentication attempts. This activity is significant as it may signal an adversary attempting to gain initial access or elevate privileges. If confirmed malicious, this could lead to unauthorized access, data breaches, or further exploitation within the environment.
author: Bhavin Patel, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: threat
detection:
  _splunk_search: |
    `gws_reports_login` event.type = login event.name = login_failure
  | bucket span=5m _time
  | stats  dc(user_name) AS unique_accounts values(user_name) as tried_accounts values(authentication_method) AS authentication_method
    BY _time, src
  | eventstats  avg(unique_accounts) as ip_avg , stdev(unique_accounts) as ip_std
    BY _time
  | eval  upperBound=(ip_avg+ip_std*3)
  | eval  isOutlier=if(unique_accounts > 10 and unique_accounts >= upperBound, 1, 0)
  | where isOutlier =1
  | `gcp_unusual_number_of_failed_authentications_from_ip_filter`
  condition: _splunk_search
references:
  - https://cloud.google.com/blog/products/identity-security/how-google-cloud-can-help-stop-credential-stuffing-attacks
  - https://www.slideshare.net/dafthack/ok-google-how-do-i-red-team-gsuite
  - https://attack.mitre.org/techniques/T1110/003/
  - https://www.blackhillsinfosec.com/wp-content/uploads/2020/05/Breaching-the-Cloud-Perimeter-Slides.pdf
tags:
  - attack.t1110.003
  - attack.t1110.004
  - attack.t1586.003
