title: GCP Detect gcploit framework
id: a1c5a85e-a162-410c-a5d9-99ff639e5a52
status: experimental
level: high
description: |
  The following analytic identifies the use of the GCPloit exploitation framework within Google Cloud Platform (GCP). It detects specific GCP Pub/Sub messages with a function timeout of 539 seconds, which is indicative of GCPloit activity. This detection is significant as GCPloit can be used to escalate privileges and facilitate lateral movement from compromised high-privilege accounts. If confirmed malicious, this activity could allow attackers to gain unauthorized access, escalate their privileges, and move laterally within the GCP environment, potentially compromising sensitive data and critical resources.
author: Rod Soto, Splunk
date: 2026-03-12
logsource:
  product: splunk
  category: threat
detection:
  _splunk_search: |
    `google_gcp_pubsub_message` data.protoPayload.request.function.timeout=539s
  | table src src_user data.resource.labels.project_id data.protoPayload.request.function.serviceAccountEmail data.protoPayload.authorizationInfo{}.permission data.protoPayload.request.location http_user_agent
  | `gcp_detect_gcploit_framework_filter`
  condition: _splunk_search
references:
  - https://github.com/dxa4481/gcploit
  - https://www.youtube.com/watch?v=Ml09R38jpok
tags:
  - attack.t1078
