title: GSuite Email Suspicious Attachment
id: 6d663014-fe92-11eb-ab07-acde48001122
status: stable
level: medium
description: |
  The following analytic detects suspicious attachment file extensions in GSuite emails, potentially indicating a spear-phishing attack. It leverages GSuite Gmail logs to identify emails with attachments having file extensions commonly associated with malware, such as .exe, .bat, and .js. This activity is significant as these file types are often used to deliver malicious payloads, posing a risk of compromising targeted machines. If confirmed malicious, this could lead to unauthorized code execution, data breaches, or further network infiltration.
author: Teoderick Contreras, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `gsuite_gmail` "attachment{}.file_extension_type" IN ("pl", "py", "rb", "sh", "bat", "exe", "dll", "cpl", "com", "js", "vbs", "ps1", "reg","swf", "cmd", "go")
  | eval phase="plan"
  | eval severity="medium"
  | stats count min(_time) as firstTime max(_time) as lastTime values(attachment{}.file_extension_type) as email_attachments, values(attachment{}.sha256) as attachment_sha256, values(payload_size) as payload_size
    BY destination{}.service num_message_attachments subject
       destination{}.address source.address phase
       severity
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `gsuite_email_suspicious_attachment_filter`
  condition: _splunk_search
references:
  - https://www.redhat.com/en/topics/devops/what-is-devsecops
tags:
  - attack.t1566.001
