title: Kerberos User Enumeration
id: d82d4af4-a0bd-11ec-9445-3e22fbd008af
status: stable
level: medium
description: |
  The following analytic detects an unusual number of Kerberos Ticket Granting Ticket (TGT) requests for non-existing users from a single source endpoint. It leverages Event ID 4768 and identifies anomalies using the 3-sigma statistical rule. This behavior is significant as it may indicate an adversary performing a user enumeration attack against Active Directory. If confirmed malicious, the attacker could validate a list of usernames, potentially leading to further attacks such as brute force or credential stuffing, compromising the security of the environment.
author: Mauricio Velazco, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `wineventlog_security` EventCode=4768 Status=0x6 TargetUserName!="*$"
  | bucket span=2m _time
  | stats dc(TargetUserName) AS unique_accounts values(TargetUserName) as tried_accounts values(dest) as dest
    BY _time, src_ip
  | eventstats avg(unique_accounts) as comp_avg , stdev(unique_accounts) as comp_std
    BY src_ip
  | eval upperBound=(comp_avg+comp_std*3)
  | eval isOutlier=if(unique_accounts > 10 and unique_accounts >= upperBound, 1, 0)
  | search isOutlier=1
  | `kerberos_user_enumeration_filter`
  condition: _splunk_search
references:
  - https://github.com/ropnop/kerbrute
  - https://attack.mitre.org/techniques/T1589/002/
  - https://redsiege.com/tools-techniques/2020/04/user-enumeration-part-3-windows/
tags:
  - attack.t1589.002
