title: Kubernetes Falco Shell Spawned
id: d2feef92-d54a-4a19-8306-b47c6ceba5b2
status: stable
level: medium
description: |
  The following analytic detects instances where a shell is spawned within a Kubernetes container. Leveraging Falco, a cloud-native runtime security tool, this analytic monitors system calls within the Kubernetes environment and flags when a shell is spawned. This activity is significant for a SOC as it may indicate unauthorized access, allowing an attacker to execute arbitrary commands, manipulate container processes, or escalate privileges. If confirmed malicious, this could lead to data breaches, service disruptions, or unauthorized access to sensitive information, severely impacting the Kubernetes infrastructure's integrity and security.
author: Patrick Bareiss, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    `kube_container_falco` "A shell was spawned in a container"
|  fillnull
| stats count by container_image container_image_tag container_name parent proc_exepath process user
| `kubernetes_falco_shell_spawned_filter`
  condition: _splunk_search
references:
  - https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
tags:
  - attack.t1204
