title: Kubernetes Access Scanning
id: 2f4abe6d-5991-464d-8216-f90f42999764
status: stable
level: medium
description: |
  The following analytic detects potential scanning activities within a Kubernetes environment. It identifies unauthorized access attempts, probing of public APIs, or attempts to exploit known vulnerabilities by monitoring Kubernetes audit logs for repeated failed access attempts or unusual API requests. This activity is significant for a SOC as it may indicate an attacker's preliminary reconnaissance to gather information about the system. If confirmed malicious, this activity could lead to unauthorized access to sensitive systems or data, posing a severe security risk.
author: Patrick Bareiss, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    `kube_audit` "user.groups{}"="system:unauthenticated" "responseStatus.code"=403
  | iplocation sourceIPs{}
  | stats count values(userAgent) as userAgent values(user.username) as user.username values(user.groups{}) as user.groups{} values(verb) as verb values(requestURI) as requestURI values(responseStatus.code) as responseStatus.code values(responseStatus.message) as responseStatus.message values(responseStatus.reason) as responseStatus.reason values(responseStatus.status) as responseStatus.status
    BY sourceIPs{} Country City
  | where count > 5
  | rename sourceIPs{} as src_ip, user.username as user
  | `kubernetes_access_scanning_filter`
  condition: _splunk_search
references:
  - https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
tags:
  - attack.t1046
