title: Large Volume of DNS ANY Queries
id: 8fa891f7-a533-4b3c-af85-5aa2e7c1f1eb
status: experimental
level: medium
description: |
  The following analytic identifies a large volume of DNS ANY queries, which may indicate a DNS amplification attack. It leverages the Network_Resolution data model to count DNS queries of type "ANY" directed to specific destinations. This activity is significant because DNS amplification attacks can overwhelm network resources, leading to Denial of Service (DoS) conditions. If confirmed malicious, this activity could disrupt services, degrade network performance, and potentially be part of a larger Distributed Denial of Service (DDoS) attack, impacting the availability of critical infrastructure.
author: Bhavin Patel, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    | tstats `security_content_summariesonly` count FROM datamodel=Network_Resolution
  WHERE nodename=DNS "DNS.message_type"="QUERY" "DNS.record_type"="ANY"
  BY "DNS.dest"
| `drop_dm_object_name("DNS")`
| where count>200
| `large_volume_of_dns_any_queries_filter`
  condition: _splunk_search
references:

tags:
  - attack.t1498.002
