title: Linux Auditd Kernel Module Enumeration
id: d1b088de-c47a-4572-9339-bdcc26493b32
status: stable
level: medium
description: |
  The following analytic identifies the use of the 'kmod' process to list kernel modules on a Linux system. This detection leverages data from Linux Auditd, focusing on process names and command-line executions. While listing kernel modules is not inherently malicious, it can be a precursor to loading unauthorized modules using 'insmod'. If confirmed malicious, this activity could allow an attacker to load kernel modules, potentially leading to privilege escalation, persistence, or other malicious actions within the system.
author: Teoderick Contreras, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `linux_auditd` type=SYSCALL comm=lsmod
  | rename host as dest
  | stats count min(_time) as firstTime max(_time) as lastTime
    BY comm exe syscall
       uid ppid pid
       success dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `linux_auditd_kernel_module_enumeration_filter`
  condition: _splunk_search
references:
  - https://man7.org/linux/man-pages/man8/kmod.8.html
tags:
  - attack.t1082
  - attack.t1014
