title: MacOS LOLbin
id: 58d270fb-5b39-418e-a855-4b8ac046805e
status: stable
level: high
description: |
  The following analytic detects multiple executions of Living off the Land (LOLbin) binaries on macOS within a short period. It leverages osquery to monitor process events and identifies commands such as "find", "crontab", "screencapture", "openssl", "curl", "wget", "killall", and "funzip". This activity is significant as LOLbins are often used by attackers to perform malicious actions while evading detection. If confirmed malicious, this behavior could allow attackers to execute arbitrary code, escalate privileges, or persist within the environment, posing a significant security risk.
author: Patrick Bareiss, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `osquery_macro` name=es_process_events columns.cmdline IN ("find*", "crontab*", "screencapture*", "openssl*", "curl*", "wget*", "killall*", "funzip*")
  | rename columns.* as *
  | stats  min(_time) as firstTime max(_time) as lastTime values(cmdline) as cmdline, values(pid) as pid, values(parent) as parent, values(path) as path, values(signing_id) as signing_id,  dc(path) as dc_path
    BY username host
  | rename username as user, cmdline as process, path as process_path, host as dest
  | where dc_path > 3
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `macos_lolbin_filter`
  condition: _splunk_search
references:
  - https://osquery.readthedocs.io/en/stable/deployment/process-auditing/
tags:
  - attack.t1059.004
