title: NLTest Domain Trust Discovery
id: c3e05466-5f22-11eb-ae93-0242ac130002
status: stable
level: high
description: |
  The following analytic identifies the execution of `nltest.exe` with command-line arguments `/domain_trusts` or `/all_trusts` to query Domain Trust information. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs and command-line arguments. This activity is significant as it indicates potential reconnaissance efforts by adversaries to understand domain trust relationships, which can inform their lateral movement strategies. If confirmed malicious, this activity could enable attackers to map out trusted domains, facilitating further compromise and pivoting within the network.
author: Michael Haag, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
  WHERE (
        Processes.process_name=nltest.exe
        OR
        Processes.original_file_name=nltestrk.exe
    )
    (Processes.process=*/domain_trusts* OR Processes.process=*/all_trusts*)
  BY Processes.action Processes.dest Processes.original_file_name
     Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
     Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
     Processes.process Processes.process_exec Processes.process_guid
     Processes.process_hash Processes.process_id Processes.process_integrity_level
     Processes.process_name Processes.process_path Processes.user
     Processes.user_id Processes.vendor_product
| `drop_dm_object_name(Processes)`
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| `nltest_domain_trust_discovery_filter`
  condition: _splunk_search
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1482/T1482.md
  - https://malware.news/t/lets-learn-trickbot-implements-network-collector-module-leveraging-cmd-wmi-ldap/19104
  - https://attack.mitre.org/techniques/T1482/
  - https://owasp.org/www-pdf-archive/Red_Team_Operating_in_a_Modern_Environment.pdf
  - https://ss64.com/nt/nltest.html
  - https://redcanary.com/threat-detection-report/techniques/domain-trust-discovery/
  - https://thedfirreport.com/2020/10/08/ryuks-return/
tags:
  - attack.t1482
