title: O365 Disable MFA
id: c783dd98-c703-4252-9e8a-f19d9f5c949e
status: stable
level: high
description: |
  The following analytic identifies instances where Multi-Factor Authentication (MFA) is disabled for a user within the Office 365 environment. It leverages O365 audit logs, specifically focusing on events related to MFA settings. Disabling MFA removes a critical security layer, making accounts more vulnerable to unauthorized access. If confirmed malicious, this activity could indicate an attacker attempting to maintain persistence or an insider threat, significantly increasing the risk of unauthorized access. Immediate investigation is required to validate the reason for disabling MFA, potentially re-enable it, and assess any other suspicious activities related to the affected account.
author: Rod Soto, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: threat
detection:
  _splunk_search: |
    `o365_management_activity` Operation="Disable Strong Authentication."
  | rename UserId as user object as src_user
  | fillnull
  | stats count min(_time) as firstTime max(_time) as lastTime
    BY signature dest user
       src vendor_account vendor_product
       src_user
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `o365_disable_mfa_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1556/
tags:
  - attack.t1556
