title: O365 Service Principal New Client Credentials
id: a1b229e9-d962-4222-8c62-905a8a010453
status: stable
level: high
description: |
  The following analytic detects the addition of new credentials for Service Principals within an Office 365 tenant. It uses O365 audit logs, focusing on events related to credential modifications or additions in the AzureActiveDirectory workload. This activity is significant because Service Principals represent application identities, and their credentials allow applications to authenticate and access resources. If an attacker successfully adds or modifies these credentials, they can impersonate the application, leading to unauthorized data access, data exfiltration, or malicious operations under the application's identity.
author: Mauricio Velazco, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: identity
detection:
  _splunk_search: |
    `o365_management_activity` Workload=AzureActiveDirectory Operation="Update application*Certificates and secrets management "
  | fillnull
  | stats earliest(_time) as firstTime latest(_time) as lastTime
    BY user ModifiedProperties{}.NewValue object
       ObjectId dest signature
       src vendor_account vendor_product
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `o365_service_principal_new_client_credentials_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1098/001/
  - https://www.mandiant.com/resources/blog/remediation-and-hardening-strategies-for-microsoft-365-to-defend-against-unc2452
  - https://microsoft.github.io/Azure-Threat-Research-Matrix/Persistence/AZT501/AZT501-2/
  - https://github.com/swisskyrepo/PayloadsAllTheThings/blob/master/Methodology%20and%20Resources/Cloud%20-%20Azure%20Pentest.md#add-credentials-to-all-enterprise-applications
tags:
  - attack.t1098.001
