title: O365 OAuth App Mailbox Access via EWS
id: e600cf1a-0bef-4426-b42e-00176d610a4d
status: stable
level: high
description: |
  The following analytic detects when emails are accessed in Office 365 Exchange via Exchange Web Services (EWS) using OAuth-authenticated applications. It leverages the ClientInfoString field to identify EWS interactions and aggregates metrics such as access counts, timing, and client IP addresses, categorized by user, ClientAppId, OperationCount, and AppId. Monitoring OAuth applications accessing emails through EWS is crucial for identifying potential abuse or unauthorized data access. If confirmed malicious, this activity could lead to unauthorized email access, data exfiltration, or further compromise of sensitive information.
author: Mauricio Velazco, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: threat
detection:
  _splunk_search: |
    `o365_management_activity` Workload=Exchange Operation=MailItemsAccessed AppId=* ClientAppId=*
  | regex ClientInfoString="^Client=WebServices;ExchangeWebServices"
  | fillnull
  | stats count earliest(_time) as firstTime latest(_time) as lastTime values(ClientIPAddress) as src
    BY user ClientAppId OperationCount
       AppId vendor_account vendor_product
       dest signature ClientInfoString
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `o365_oauth_app_mailbox_access_via_ews_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1114/002/
  - https://www.microsoft.com/en-us/security/blog/2024/01/25/midnight-blizzard-guidance-for-responders-on-nation-state-attack/
  - https://learn.microsoft.com/en-us/exchange/client-developer/exchange-web-services/ews-applications-and-the-exchange-architecture
tags:
  - attack.t1114.002
