title: O365 Concurrent Sessions From Different Ips
id: 58e034de-1f87-4812-9dc3-a4f68c7db930
status: stable
level: high
description: |
  The following analytic identifies user sessions in Office 365 accessed from multiple IP addresses, indicating potential adversary-in-the-middle (AiTM) phishing attacks. It detects this activity by analyzing Azure Active Directory logs for 'UserLoggedIn' operations and flags sessions with more than one associated IP address. This behavior is significant as it suggests unauthorized concurrent access, which is uncommon in normal usage. If confirmed malicious, the impact could include data theft, account takeover, and the launching of internal phishing campaigns, posing severe risks to organizational security.
author: Mauricio Velazco, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: threat
detection:
  _splunk_search: |
    `o365_management_activity` Workload=AzureActiveDirectory Operation=UserLoggedIn
  | fillnull
  | stats count min(_time) as firstTime max(_time) as lastTime values(src) as src
    BY signature dest user
       vendor_account vendor_product SessionId
  | where mvcount(src) > 1
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `o365_concurrent_sessions_from_different_ips_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1185/
  - https://breakdev.org/evilginx-2-next-generation-of-phishing-2fa-tokens/
  - https://github.com/kgretzky/evilginx2
tags:
  - attack.t1185
