title: O365 Multiple AppIDs and UserAgents Authentication Spike
id: 66adc486-224d-45c1-8e4d-9e7eeaba988f
status: stable
level: medium
description: |
  The following analytic identifies unusual authentication activity in an O365 environment, where a single user account experiences more than 8 authentication attempts using 3 or more unique application IDs and over 5 unique user agents within a short timeframe. It leverages O365 audit logs, focusing on authentication events and applying statistical thresholds. This behavior is significant as it may indicate an adversary probing for multi-factor authentication weaknesses. If confirmed malicious, it suggests a compromised account, potentially leading to unauthorized access, privilege escalation, and data exfiltration. Early detection is crucial to prevent further exploitation.
author: Mauricio Velazco, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: identity
detection:
  _splunk_search: |
    `o365_management_activity` Workload=AzureActiveDirectory (Operation=UserLoggedIn OR Operation=UserLoginFailed)
  | bucket span=5m _time
  | stats dc(_raw) as failed_attempts dc(ApplicationId) as unique_app_ids dc(UserAgent) as unique_user_agents values(ApplicationId) values(OS) values(signature) as signature
    BY _time user src
       vendor_account vendor_product dest
  | where failed_attempts > 5 and unique_user_agents > 5 and unique_app_ids > 2
  | `o365_multiple_appids_and_useragents_authentication_spike_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1078/
  - https://www.blackhillsinfosec.com/exploiting-mfa-inconsistencies-on-microsoft-services/
  - https://github.com/dafthack/MFASweep
  - https://www.youtube.com/watch?v=SK1zgqaAZ2E
tags:
  - attack.t1078
