title: O365 ApplicationImpersonation Role Assigned
id: 49cdce75-f814-4d56-a7a4-c64ec3a481f2
status: stable
level: high
description: |
  The following analytic detects the assignment of the ApplicationImpersonation role in Office 365 to a user or application. It uses the Office 365 Management Activity API to monitor Azure Active Directory audit logs for role assignment events. This activity is significant because the ApplicationImpersonation role allows impersonation of any user, enabling access to and modification of their mailbox. If confirmed malicious, an attacker could gain unauthorized access to sensitive information, manipulate mailbox data, and perform actions as a legitimate user, posing a severe security risk to the organization.
author: Mauricio Velazco, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: threat
detection:
  _splunk_search: |
    `o365_management_activity` Workload=Exchange Operation="New-ManagementRoleAssignment" Role=ApplicationImpersonation
  | rename User as target_user
  | fillnull
  | stats count min(_time) as firstTime max(_time) as lastTime
    BY signature dest user
       src vendor_account vendor_product
       target_user
  | `security_content_ctime(lastTime)`
  | `o365_applicationimpersonation_role_assigned_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1098/002/
  - https://www.mandiant.com/resources/blog/remediation-and-hardening-strategies-for-microsoft-365-to-defend-against-unc2452
  - https://www.mandiant.com/media/17656
tags:
  - attack.t1098.002
