title: O365 Security And Compliance Alert Triggered
id: 5b367cdd-8dfc-49ac-a9b7-6406cf27f33e
status: stable
level: high
description: |
  The following analytic identifies alerts triggered by the Office 365 Security and Compliance Center, indicating potential threats or policy violations. It leverages data from the `o365_management_activity` dataset, focusing on events where the workload is SecurityComplianceCenter and the operation is AlertTriggered. This activity is significant as it highlights security and compliance issues within the O365 environment, which are crucial for maintaining organizational security. If confirmed malicious, these alerts could indicate attempts to breach security policies, leading to unauthorized access, data exfiltration, or other malicious activities.
author: Mauricio Velazco, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: identity
detection:
  _splunk_search: |
    `o365_management_activity` Workload=SecurityComplianceCenter Category=ThreatManagement Operation=AlertTriggered
  | spath input=Data path=f3u output=user
  | spath input=Data path=op output=operation
  | spath input=_raw path=wl
  | spath input=Data path=rid output=rule_id
  | spath input=Data path=ad output=alert_description
  | spath input=Data path=lon output=operation_name
  | spath input=Data path=an output=alert_name
  | spath input=Data path=sev output=severity
  | fillnull
  | stats count earliest(_time) as firstTime latest(_time) as lastTime
    BY user, Name, rule_id,
       alert_description, alert_name, severity,
       dest, src, vendor_account,
       vendor_product, signature
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `o365_security_and_compliance_alert_triggered_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1078/004/
  - https://learn.microsoft.com/en-us/purview/alert-policies?view=o365-worldwide
  - https://learn.microsoft.com/en-us/purview/alert-policies
tags:
  - attack.t1078.004
