title: O365 Excessive Authentication Failures Alert
id: d441364c-349c-453b-b55f-12eccab67cf9
status: stable
level: medium
description: |
  The following analytic identifies an excessive number of authentication failures, including failed attempts against MFA prompt codes. It uses data from the `o365_management_activity` dataset, focusing on events where the authentication status is marked as failure. This behavior is significant as it may indicate a brute force attack or an attempt to compromise user accounts. If confirmed malicious, this activity could lead to unauthorized access, data breaches, or further exploitation within the environment.
author: Rod Soto, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: threat
detection:
  _splunk_search: |
    `o365_management_activity` Workload=AzureActiveDirectory UserAuthenticationMethod=* status=failure
  | stats count earliest(_time) AS firstTime latest(_time) AS lastTime values(UserAuthenticationMethod) AS UserAuthenticationMethod values(UserAgent) AS user_agent values(status) AS status values(src_ip) AS src values(signature) as signature
    BY user vendor_account vendor_product
       dest
  | where count > 10
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `o365_excessive_authentication_failures_alert_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1110/
tags:
  - attack.t1110
