title: O365 Threat Intelligence Suspicious File Detected
id: 00958c7b-35db-4e7a-ad13-31550a7a7c64
status: stable
level: high
description: |
  The following analytic identifies when a malicious file is detected within the Microsoft Office 365 ecosystem through the Advanced Threat Protection engine. Attackers may stage and execute malicious files from within the Microsoft Office 365 ecosystem. Any detections from built-in Office 365 capabilities should be monitored and responded to appropriately. Certain premium Office 365 capabilities such as Safe Attachment and Safe Links further enhance these detection and response functions.
author: Steven Dick
date: 2026-02-25
logsource:
  product: splunk
  category: threat
detection:
  _splunk_search: |
    `o365_management_activity` Workload=ThreatIntelligence Operation=AtpDetection
  | eval dest="NA"
  | eval src="NA"
  | stats values(DetectionMethod) as category values(FileData.FileName) as file_name values(FileData.FilePath) as file_path values(FileData.FileSize) as file_size values(FileData.MalwareFamily) as signature count, min(_time) as firstTime, max(_time) as lastTime
    BY Id, UserId, dest,
       src, vendor_account, vendor_product
  | rename Id as signature_id, UserId as user
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `o365_threat_intelligence_suspicious_file_detected_filter`
  condition: _splunk_search
references:
  - https://learn.microsoft.com/en-us/microsoft-365/security/office-365-security/threat-explorer-real-time-detections-about?view=o365-worldwide
  - https://learn.microsoft.com/en-us/microsoft-365/security/office-365-security/anti-malware-protection-for-spo-odfb-teams-about?view=o365-worldwide
tags:
  - attack.t1204.002
