title: Okta Successful Single Factor Authentication
id: 98f6ad4f-4325-4096-9d69-45dc8e638e82
status: stable
level: medium
description: |
  The following analytic identifies successful single-factor authentication events against the Okta Dashboard for accounts without Multi-Factor Authentication (MFA) enabled. It detects this activity by analyzing Okta logs for successful authentication events where "Okta Verify" is not used. This behavior is significant as it may indicate a misconfiguration, policy violation, or potential account takeover. If confirmed malicious, an attacker could gain unauthorized access to the account, potentially leading to data breaches or further exploitation within the environment.
author: Bhavin Patel, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: identity
detection:
  _splunk_search: |
    `okta`  action=success src_user_type = User eventType = user.authentication.verify OR eventType = user.authentication.auth_via_mfa
  | stats dc(eventType) values(eventType) as eventType values(target{}.displayName) as targets values(debugContext.debugData.url) min(_time) as firstTime max(_time) as lastTime values(authentication_method)
    BY src_ip user action
       dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | search targets !="Okta Verify"
  | `okta_successful_single_factor_authentication_filter`
  condition: _splunk_search
references:
  - https://sec.okta.com/everythingisyes
  - https://attack.mitre.org/techniques/T1078/004/
tags:
  - attack.t1078.004
  - attack.t1586.003
  - attack.t1621
