title: Remote Desktop Network Traffic
id: 272b8407-842d-4b3d-bead-a704584003d3
status: stable
level: medium
description: |
  The following analytic detects unusual Remote Desktop Protocol (RDP) traffic on TCP/3389 by filtering out known RDP sources and destinations, focusing on atypical connections within the network. This detection leverages network traffic data to identify potentially unauthorized RDP access. Monitoring this activity is crucial for a SOC as unauthorized RDP access can indicate an attacker's attempt to control networked systems, leading to data theft, ransomware deployment, or further network compromise. If confirmed malicious, this activity could result in significant data breaches or complete system and network control loss.
author: David Dorsey, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Network_Traffic
  WHERE All_Traffic.dest_port=3389
    AND
    All_Traffic.dest_category!=common_rdp_destination
    AND
    All_Traffic.src_category!=common_rdp_source
    AND
    All_Traffic.action="allowed"
  BY All_Traffic.src All_Traffic.dest All_Traffic.dest_port
     All_Traffic.dest_ip All_Traffic.dvc All_Traffic.src_ip
     All_Traffic.src_port All_Traffic.vendor_product
| `drop_dm_object_name("All_Traffic")`
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| `remote_desktop_network_traffic_filter`
  condition: _splunk_search
references:

tags:
  - attack.t1021.001
