title: SMB Traffic Spike - MLTK
id: d25773ba-9ad8-48d1-858e-07ad0bbeb828
status: experimental
level: medium
description: |
  The following analytic identifies spikes in the number of Server Message Block (SMB) connections using the Machine Learning Toolkit (MLTK). It leverages the Network_Traffic data model to monitor SMB traffic on ports 139 and 445, applying a machine learning model to detect anomalies. This activity is significant because sudden increases in SMB traffic can indicate lateral movement or data exfiltration attempts by attackers. If confirmed malicious, this behavior could lead to unauthorized access, data theft, or further compromise of the network.
author: Rico Valdez, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    | tstats `security_content_summariesonly` count values(All_Traffic.dest_ip) as dest values(All_Traffic.dest_port) as port FROM datamodel=Network_Traffic
  WHERE All_Traffic.dest_port=139
    OR
    All_Traffic.dest_port=445
    OR
    All_Traffic.app=smb
  BY _time span=1h, All_Traffic.src
| eval HourOfDay=strftime(_time, "%H")
| eval DayOfWeek=strftime(_time, "%A")
| `drop_dm_object_name(All_Traffic)`
| apply smb_pdfmodel threshold=0.001
| rename "IsOutlier(count)" as isOutlier
| search isOutlier > 0
| sort -count
| table _time src dest port count
| `smb_traffic_spike___mltk_filter`
  condition: _splunk_search
references:

tags:
  - attack.t1021.002
