title: Supernova Webshell
id: 2ec08a09-9ff1-4dac-b59f-1efd57972ec1
status: experimental
level: high
description: |
  The following analytic detects the presence of the Supernova webshell, used in the SUNBURST attack, by identifying specific patterns in web URLs. The detection leverages Splunk to search for URLs containing "*logoimagehandler.ashx*codes*", "*logoimagehandler.ashx*clazz*", "*logoimagehandler.ashx*method*", and "*logoimagehandler.ashx*args*". This activity is significant as it indicates potential unauthorized access and arbitrary code execution on a compromised system. If confirmed malicious, this could lead to data theft, ransomware deployment, or other severe outcomes. Immediate steps include reviewing the web URLs, inspecting on-disk artifacts, and analyzing concurrent processes and network connections.
author: John Stoner, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    | tstats `security_content_summariesonly` count FROM datamodel=Web.Web
  WHERE web.url=*logoimagehandler.ashx*codes*
    OR
    Web.url=*logoimagehandler.ashx*clazz*
    OR
    Web.url=*logoimagehandler.ashx*method*
    OR
    Web.url=*logoimagehandler.ashx*args*
  BY Web.src Web.dest Web.url
     Web.vendor_product Web.user Web.http_user_agent
     _time span=1s
| `supernova_webshell_filter`
  condition: _splunk_search
references:
  - https://www.splunk.com/en_us/blog/security/detecting-supernova-malware-solarwinds-continued.html
  - https://www.guidepointsecurity.com/blog/supernova-solarwinds-net-webshell-analysis/
tags:
  - attack.t1505.003
  - attack.t1133
