title: Unusual Number of Computer Service Tickets Requested
id: ac3b81c0-52f4-11ec-ac44-acde48001122
status: experimental
level: low
description: |
  The following analytic identifies an unusual number of computer service ticket requests from a single source, leveraging Event ID 4769, "A Kerberos service ticket was requested." It uses statistical analysis, including standard deviation and the 3-sigma rule, to detect anomalies in service ticket requests. This activity is significant as it may indicate malicious behavior such as lateral movement, malware staging, or reconnaissance. If confirmed malicious, an attacker could gain unauthorized access to multiple endpoints, facilitating further compromise and potential data exfiltration.
author: Mauricio Velazco, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `wineventlog_security` EventCode=4769 Service_Name="*$" Account_Name!="*$*"
  | bucket span=2m _time
  | stats dc(Service_Name) AS unique_targets values(Service_Name) as host_targets
    BY _time, Client_Address, Account_Name
  | eventstats avg(unique_targets) as comp_avg , stdev(unique_targets) as comp_std
    BY Client_Address, Account_Name
  | eval upperBound=(comp_avg+comp_std*3)
  | eval isOutlier=if(unique_targets >10 and unique_targets >= upperBound, 1, 0)
  | `unusual_number_of_computer_service_tickets_requested_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1078/
tags:
  - attack.t1078
