title: Unusual Number of Remote Endpoint Authentication Events
id: acb5dc74-5324-11ec-a36d-acde48001122
status: experimental
level: low
description: |
  The following analytic identifies an unusual number of remote authentication attempts from a single source by leveraging Windows Event ID 4624, which logs successful account logons. It uses statistical analysis, specifically the 3-sigma rule, to detect deviations from normal behavior. This activity is significant for a SOC as it may indicate lateral movement, malware staging, or reconnaissance. If confirmed malicious, this behavior could allow an attacker to move laterally within the network, escalate privileges, or gather information for further attacks.
author: Mauricio Velazco, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `wineventlog_security` EventCode=4624 Logon_Type=3 Account_Name!="*$"
  | eval Source_Account = mvindex(Account_Name, 1)
  | bucket span=2m _time
  | stats dc(ComputerName) AS unique_targets values(ComputerName) as target_hosts
    BY _time, Source_Network_Address, Source_Account
  | eventstats avg(unique_targets) as comp_avg , stdev(unique_targets) as comp_std
    BY Source_Network_Address, Source_Account
  | eval upperBound=(comp_avg+comp_std*3)
  | eval isOutlier=if(unique_targets >10 and unique_targets >= upperBound, 1, 0)
  | `unusual_number_of_remote_endpoint_authentication_events_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1078/
tags:
  - attack.t1078
