title: Windows AppX Deployment Unsigned Package Installation
id: 9b5e7c14-f8d2-4a3b-b1a7-e5c9f2a8d123
status: stable
level: high
description: |
  The following analytic detects attempts to install unsigned MSIX/AppX packages using the -AllowUnsigned parameter. This detection leverages Windows event logs from the AppXDeployment-Server, specifically focusing on EventID 603 which indicates the start of a deployment operation with specific deployment flags. The flag value 8388608 corresponds to the -AllowUnsigned option in PowerShell's Add-AppxPackage cmdlet. This activity is significant as adversaries have been observed leveraging unsigned MSIX packages to deliver malware, bypassing signature verification that would normally protect users from malicious packages. If confirmed malicious, this could allow attackers to execute arbitrary code, establish persistence, or deliver malware while evading traditional detection mechanisms.
author: Michael Haag, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `wineventlog_appxdeploymentserver` EventCode=603 Flags="8388608"
  | stats count min(_time) as firstTime max(_time) as lastTime values(Path) as file_name values(CallingProcess) as CallingProcess
    BY dvc EventCode Flags
       user_id
  | rename dvc as dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_appx_deployment_unsigned_package_installation_filter`
  condition: _splunk_search
references:
  - https://learn.microsoft.com/en-us/powershell/module/appx/add-appxpackage
  - https://learn.microsoft.com/en-us/windows/msix/package/unsigned-package
  - https://redcanary.com/blog/threat-intelligence/msix-installers/
  - https://attack.mitre.org/techniques/T1553/005/
tags:
  - attack.t1553.005
  - attack.t1204.002
