title: Windows OneDrive Share Mounted via Net
id: af1fe9eb-911c-4679-a475-a1193b12e4d1
status: stable
level: medium
description: |
  The following analytic detects the use of net.exe or net1.exe to mount a OneDrive share as a network drive.
This behavior may indicate an attempt to stage, access, or exfiltrate data through a cloud-hosted WebDAV path rather than a traditional file share.
If confirmed malicious, an attacker could use the mounted share to move data outside the environment over trusted cloud infrastructure.
author: Raven Tait, Splunk
date: 2026-04-13
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    | tstats `security_content_summariesonly`
  count min(_time) as firstTime
        max(_time) as lastTime

from datamodel=Endpoint.Processes where

`process_net`
Processes.process="*use*"
Processes.process="*https://d.docs.live.net*"

by Processes.process Processes.vendor_product Processes.user_id Processes.process_hash
   Processes.parent_process_name Processes.parent_process_exec Processes.action
   Processes.dest Processes.process_current_directory Processes.process_path
   Processes.process_integrity_level Processes.original_file_name Processes.parent_process
   Processes.parent_process_path Processes.parent_process_guid Processes.parent_process_id
   Processes.process_guid Processes.process_id Processes.user Processes.process_name

| `drop_dm_object_name(Processes)`
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| `windows_onedrive_share_mounted_via_net_filter`
  condition: _splunk_search
references:

tags:
  - attack.t1567.002
