title: Windows AD add Self to Group
id: 065f2701-b7ea-42f5-9ec4-fbc2261165f9
status: stable
level: high
description: |
  This analytic detects instances where a user adds themselves to an Active Directory (AD) group. This activity is a common indicator of privilege escalation, where a user attempts to gain unauthorized access to higher privileges or sensitive resources. By monitoring AD logs, this detection identifies such suspicious behavior, which could be part of a larger attack strategy aimed at compromising critical systems and data.
author: Dean Luxton
date: 2026-03-10
logsource:
  product: splunk
  category: audit
detection:
  _splunk_search: |
    `wineventlog_security` EventCode IN (4728)
  | where user=src_user
  | stats min(_time) as _time dc(user) as usercount, values(user) as user values(user_category) as user_category values(src_user_category) as src_user_category values(dvc) as dvc
    BY signature, Group_Name, src_user,
       dest
  | `windows_ad_add_self_to_group_filter`
  condition: _splunk_search
references:

tags:
  - attack.t1098
