title: Windows Unusual NTLM Authentication Destinations By Source
id: ae9b0df5-5fb0-477f-abc9-47faf42aa91d
status: stable
level: medium
description: |
  The following analytic detects when an unusual number NTLM authentications is attempted by the same source against multiple destinations. This activity generally results when an attacker attempts to brute force, password spray, or otherwise authenticate to a multiple domain joined Windows devices using an NTLM based process/attack. This same activity may also generate a large number of EventID 4776 events as well.
author: Steven Dick
date: 2026-01-14
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `ntlm_audit`
EventCode = 8004
SChannelName=* WorkstationName=*
```CIM alignment, remove leading \\ from some auth attempts ```
| eval src = replace(WorkstationName,"\\\\","")
| eval dest = SChannelName, user = UserName

``` Remove NTLM auths to self, improves accuracy for certain applications ```
| where SChannelName!=src

| stats count min(_time) as firstTime
              max(_time) as lastTime
              dc(eval(upper(dest))) as unique_count by src
| eventstats avg(unique_count) as unique_avg
             stdev(unique_count) as unique_std

``` adjust formula for sensitivity```
| eval upperBound_unique=(1+unique_avg+unique_std*3)

| eval isOutlier=CASE(unique_count > upperBound_unique, 1, true(), 0)
| where isOutlier==1
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| `windows_unusual_ntlm_authentication_destinations_by_source_filter`

  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://techcommunity.microsoft.com/t5/ask-the-directory-services-team/ntlm-blocking-and-you-application-analysis-and-auditing/ba-p/397191
  - https://techcommunity.microsoft.com/t5/microsoft-defender-for-identity/enriched-ntlm-authentication-data-using-windows-event-8004/m-p/871827
  - https://www.varonis.com/blog/investigate-ntlm-brute-force
  - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nrpc/4d1235e3-2c96-4e9f-a147-3cb338a0d09f
tags:
  - attack.t1110.003
