title: Windows Vulnerable Driver Installed
id: 1dda7586-57be-4a1b-8de1-a9ad802b9a7f
status: stable
level: high
description: |
  The following analytic detects the loading of known vulnerable Windows drivers, which may indicate potential persistence or privilege escalation attempts. It leverages Windows System service install EventCode 7045 to identify driver loading events and cross-references them with a list of vulnerable drivers. This activity is significant as attackers often exploit vulnerable drivers to gain elevated privileges or maintain persistence on a system. If confirmed malicious, this could allow attackers to execute arbitrary code with high privileges, leading to further system compromise and potential data exfiltration. This detection is a Windows Event Log adaptation of the Sysmon driver loaded detection written by Michael Haag.
author: Dean Luxton
date: 2026-02-25
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `wineventlog_system` EventCode=7045 ServiceType="kernel mode driver"
  | table _time dest EventCode ImagePath ServiceName ServiceType
  | lookup loldrivers driver_name AS ImagePath OUTPUT is_driver driver_description
  | search is_driver = TRUE
  | `windows_vulnerable_driver_installed_filter`
  condition: _splunk_search
references:
  - https://loldrivers.io/
  - https://github.com/SpikySabra/Kernel-Cactus
  - https://github.com/wavestone-cdt/EDRSandblast
  - https://research.splunk.com/endpoint/a2b1f1ef-221f-4187-b2a4-d4b08ec745f4/
  - https://www.splunk.com/en_us/blog/security/these-are-the-drivers-you-are-looking-for-detect-and-prevent-malicious-drivers.html
tags:
  - attack.t1543.003
