title: Windows CrowdStrike Agent Registry Key Removal
id: 094e8c62-c071-4b3d-af43-d3c74c4b249f
status: stable
level: medium
description: |
  Detects delete events on the CrowdStrike registry keys.
These keys are removed as part of the agent uninstallation process.
This activity should only occur during planned events and any instances outside that should be evaluated for malicious activity such as CVE-2022-44721.
author: Raven Tait, Splunk
date: 
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `sysmon`
EventID="12"
TargetObject="*\\SYSTEM\\CrowdStrike"
action="deleted"
| fillnull
| stats count min(_time) as firstTime
              max(_time) as lastTime
  by Computer EventID TargetObject action dest process_guid process_id registry_hive
     registry_path registry_key_name status user vendor_product

| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| `windows_crowdstrike_agent_registry_key_removal_filter`
  condition: _splunk_search
references:
  - https://github.com/purplededa/CVE-2022-44721-CsFalconUninstaller
tags:

