title: Windows Unusual Count Of Users Remotely Failed To Auth From Host
id: cf06a0ee-ffa9-4ed3-be77-0670ed9bab52
status: stable
level: medium
description: |
  The following analytic identifies a source host failing to authenticate against a remote host with multiple users, potentially indicating a Password Spraying attack. It leverages Windows Event 4625 (failed logon attempts) and Logon Type 3 (remote authentication) to detect this behavior. This activity is significant as it may represent an adversary attempting to gain initial access or elevate privileges within an Active Directory environment. If confirmed malicious, this could lead to unauthorized access, privilege escalation, and further compromise of the network.
author: Mauricio Velazco, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `wineventlog_security`  EventCode=4625 Logon_Type=3 IpAddress!="-"
  | bucket span=2m _time
  | stats dc(TargetUserName) AS unique_accounts values(TargetUserName) as tried_accounts values(dest) as dest values(src) as src values(user) as user
    BY _time, IpAddress, Computer,
       action, app, authentication_method,
       signature, signature_id
  | eventstats avg(unique_accounts) as comp_avg , stdev(unique_accounts) as comp_std
    BY IpAddress, Computer
  | eval upperBound=(comp_avg+comp_std*3)
  | eval isOutlier=if(unique_accounts > 10 and unique_accounts >= upperBound, 1, 0)
  | search isOutlier=1
  | `windows_unusual_count_of_users_remotely_failed_to_auth_from_host_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4625
  - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4625
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/basic-audit-logon-events
tags:
  - attack.t1110.003
