title: Windows Chrome Enable Extension Loading via Command-Line
id: da355155-1d23-48f9-bf95-e534ae273ab0
status: stable
level: medium
description: |
  The following analytic detects instances where Google Chrome is started with the --disable-features=DisableLoadExtensionCommandLineSwitch flag, effectively enabling the loading of extensions via the command line.
This may indicate attempts to bypass enterprise extension policies, load unauthorized or malicious extensions, or manipulate browser behavior.
Monitoring this activity helps identify potential security policy violations, malware persistence techniques, or other suspicious Chrome modifications.

author: Teoderick Contreras, Splunk
date: 2026-01-12
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    | tstats `security_content_summariesonly` min(_time) as firstTime max(_time) as lastTime
from datamodel=Endpoint.Processes where
  Processes.process_name = "Chrome.exe"
  Processes.process= "*--disable-features*"
  Processes.process= "*DisableLoadExtensionCommandLineSwitch*"
by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
   Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
   Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
   Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
   Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
| `drop_dm_object_name(Processes)`
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| `windows_chrome_enable_extension_loading_via_command_line_filter`

  condition: _splunk_search
references:
  - https://www.gdatasoftware.com/blog/2025/11/38298-learning-about-browser-hijacking
tags:
  - attack.t1185
