title: Windows AppLocker Execution from Uncommon Locations
id: d57ce957-151a-4aec-ada5-5fb1eb555b6b
status: stable
level: low
description: |
  The following analytic identifies the execution of applications or scripts from uncommon or suspicious file paths, potentially indicating malware or unauthorized activity. It leverages Windows AppLocker event logs and uses statistical analysis to detect anomalies. By calculating the average and standard deviation of execution counts per file path, it flags paths with execution counts significantly higher than expected. This behavior is significant as it can uncover malicious activities or policy violations. If confirmed malicious, this activity could allow attackers to execute unauthorized code, leading to potential system compromise or data breaches.
author: Michael Haag, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `applocker`
  | spath input=UserData_Xml
  | rename RuleAndFileData.* as *, Computer as dest, TargetUser AS user
  | stats count min(_time) as firstTime max(_time) as lastTime
    BY dest, PolicyName, RuleId,
       user, TargetProcessId, FilePath,
       FullFilePath
  | eventstats avg(count) as avg, stdev(count) as stdev
  | eval upperBound=(avg+stdev*2), anomaly=if(count > upperBound, "Yes", "No")
  | where anomaly="Yes"
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_applocker_execution_from_uncommon_locations_filter`
  condition: _splunk_search
references:
  - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/querying-application-control-events-centrally-using-advanced-hunting
  - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/applocker/using-event-viewer-with-applocker
tags:
  - attack.t1218
