title: Windows AD Short Lived Server Object
id: 193769d3-1e33-43a9-970e-ad4a88256cdb
status: stable
level: high
description: |
  The following analytic identifies the creation and quick deletion of a Domain Controller (DC) object within 30 seconds in an Active Directory environment, indicative of a potential DCShadow attack. This detection leverages Windows Security Event Codes 5137 and 5141, analyzing the duration between these events. This activity is significant as DCShadow allows attackers with privileged access to register a rogue DC, enabling unauthorized changes to AD objects, including credentials. If confirmed malicious, this could lead to unauthorized AD modifications, compromising the integrity and security of the entire domain.
author: Mauricio Velazco, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `wineventlog_security` EventCode=5137 OR EventCode=5141 ObjectDN="*CN=Servers,CN=Default-First-Site-Name,CN=Sites,CN=Configuration*"
  | transaction ObjectDN startswith=(EventCode=5137) endswith=(EventCode=5141)
  | eval short_lived=case((duration<30),"TRUE")
  | search short_lived = TRUE
  | stats values(ObjectDN) values(signature) values(EventCode)
    BY _time, Computer, SubjectUserName,
       dest
  | `windows_ad_short_lived_server_object_filter`
  condition: _splunk_search
references:
  - https://www.dcshadow.com/
  - https://attack.mitre.org/techniques/T1207/
  - https://stealthbits.com/blog/detecting-dcshadow-with-event-logs/
  - https://pentestlab.blog/2018/04/16/dcshadow/
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5137
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5141
tags:
  - attack.t1207
