title: Windows Suspicious QEMU Execution
id: c4c0a2d4-0675-4fde-97b7-115145ba257c
status: stable
level: high
description: |
  Detects execution of the QEMU binary and an image file with the -nographic flag.
This causes it to run in the background without any display.
This has been observed as a persistence and initial access technique by some threat actors to install a rogue linux virtual machine
author: Raven Tait, Splunk
date: 
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `sysmon`
EventID=1
CommandLine="*-nographic*"
CommandLine="*.img*"
(
    Description="*QEMU machine*"
    OR
    Product="QEMU"
    OR
    Company="*qemu*"
)
| fillnull
| stats count min(_time) as firstTime
              max(_time) as lastTime
  by Computer EventID CommandLine Description Product Company action dest
     original_file_name parent_process parent_process_exec parent_process_guid
     parent_process_id parent_process_name parent_process_path process_hash
     process_integrity_level user user_id vendor_product

| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| `windows_suspicious_qemu_execution_filter`
  condition: _splunk_search
references:
  - https://www.securonix.com/blog/crontrap-emulated-linux-environments-as-the-latest-tactic-in-malware-staging/
  - https://www.bleepingcomputer.com/news/security/windows-infected-with-backdoored-linux-vms-in-new-phishing-attacks/
tags:

