title: Windows Special Privileged Logon On Multiple Hosts
id: 4c461f5a-c2cc-4e86-b132-c262fc9edca7
status: stable
level: high
description: |
  The following analytic detects a user authenticating with special privileges on 30 or more remote endpoints within a 5-minute window. It leverages Event ID 4672 from Windows Security logs to identify this behavior. This activity is significant as it may indicate lateral movement or remote code execution by an adversary. If confirmed malicious, the attacker could gain extensive control over the network, potentially leading to privilege escalation, data exfiltration, or further compromise of the environment. Security teams should adjust detection thresholds based on their specific environment.
author: Mauricio Velazco, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `wineventlog_security` EventCode=4672 AND NOT(Caller_User_Name IN ("DWM-1","DWM-2","DWM-3","LOCAL SERVICE","NETWORK SERVICE","SYSTEM","*$"))
  | bucket span=5m _time
  | stats dc(Computer) AS unique_targets values(Computer) as dest values(PrivilegeList) as privileges
    BY _time, Caller_User_Name
  | rename Caller_User_Name as user
  | where unique_targets > 30
  | `windows_special_privileged_logon_on_multiple_hosts_filter`
  condition: _splunk_search
references:
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4672
  - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/dn319113(v=ws.11)
  - https://thedfirreport.com/2023/01/23/sharefinder-how-threat-actors-discover-file-shares/
  - https://attack.mitre.org/tactics/TA0008/
tags:
  - attack.t1087
  - attack.t1021.002
  - attack.t1135
