title: Windows Export Certificate
id: d8ddfa9b-b724-4df9-9dbe-f34cc0936714
status: stable
level: medium
description: |
  The following analytic detects the export of a certificate from the Windows Certificate Store. It leverages the Certificates Lifecycle log channel, specifically event ID 1007, to identify this activity. Monitoring certificate exports is crucial as certificates can be used for authentication to VPNs or private resources. If malicious actors export certificates, they could potentially gain unauthorized access to sensitive systems or data, leading to significant security breaches.
author: Michael Haag, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `certificateservices_lifecycle` EventCode=1007
  | xmlkv UserData_Xml
  | stats count min(_time) as firstTime max(_time) as lastTime
    BY Computer, SubjectName, UserData_Xml
  | rename Computer as dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_export_certificate_filter`
  condition: _splunk_search
references:
  - https://atomicredteam.io/defense-evasion/T1553.004/#atomic-test-4---install-root-ca-on-windows
tags:
  - attack.t1552.004
  - attack.t1649
