title: Windows Large Number of Computer Service Tickets Requested
id: 386ad394-c9a7-4b4f-b66f-586252de20f0
status: stable
level: medium
description: |
  The following analytic detects a high volume of Kerberos service ticket requests, specifically more than 30, from a single source within a 5-minute window. It leverages Event ID 4769, which logs when a Kerberos service ticket is requested, focusing on requests with computer names as the Service Name. This behavior is significant as it may indicate malicious activities such as lateral movement, malware staging, or reconnaissance. If confirmed malicious, an attacker could gain unauthorized access to multiple endpoints, potentially compromising the entire network.
author: Mauricio Velazco, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `wineventlog_security` EventCode=4769 ServiceName="*$" TargetUserName!="*$"
  | bucket span=5m _time
  | stats dc(ServiceName) AS unique_targets values(ServiceName) as host_targets values(dest) as dest
    BY _time, IpAddress, TargetUserName
  | where unique_targets > 30
  | `windows_large_number_of_computer_service_tickets_requested_filter`
  condition: _splunk_search
references:
  - https://thedfirreport.com/2023/01/23/sharefinder-how-threat-actors-discover-file-shares/
  - https://attack.mitre.org/techniques/T1135/
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4769
tags:
  - attack.t1135
  - attack.t1078
