title: Windows Rapid Authentication On Multiple Hosts
id: 62606c77-d53d-4182-9371-b02cdbbbcef7
status: stable
level: high
description: |
  The following analytic detects a source computer authenticating to 30 or more remote endpoints within a 5-minute timespan using Event ID 4624. This behavior is identified by analyzing Windows Event Logs for LogonType 3 events and counting unique target computers. Such activity is significant as it may indicate lateral movement or network share enumeration by an adversary. If confirmed malicious, this could lead to unauthorized access to multiple systems, potentially compromising sensitive data and escalating privileges within the network.
author: Mauricio Velazco, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `wineventlog_security` EventCode=4624 LogonType=3 TargetUserName!="ANONYMOUS LOGON" TargetUserName!="*$"
  | bucket span=5m _time
  | stats dc(Computer) AS unique_targets values(Computer) as host_targets values(dest) as dest values(src) as src values(user) as user
    BY _time, IpAddress, TargetUserName,
       action, app, authentication_method,
       signature, signature_id
  | where unique_targets > 30
  | `windows_rapid_authentication_on_multiple_hosts_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1135/
  - https://thedfirreport.com/2023/01/23/sharefinder-how-threat-actors-discover-file-shares/
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4624
tags:
  - attack.t1003.002
