title: Windows Local Administrator Credential Stuffing
id: 09555511-aca6-484a-b6ab-72cd03d73c34
status: stable
level: high
description: |
  The following analytic detects attempts to authenticate using the built-in local Administrator account across more than 30 endpoints within a 5-minute window. It leverages Windows Event Logs, specifically events 4625 and 4624, to identify this behavior. This activity is significant as it may indicate an adversary attempting to validate stolen local credentials across multiple hosts, potentially leading to privilege escalation. If confirmed malicious, this could allow the attacker to gain widespread access and control over numerous systems within the network, posing a severe security risk.
author: Mauricio Velazco, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `wineventlog_security` EventCode=4625 OR EventCode=4624 Logon_Type=3 TargetUserName=Administrator
  | bucket span=5m _time
  | stats dc(Computer) AS unique_targets values(Computer) as host_targets values(dest) as dest values(src) as src values(user) as user
    BY _time, IpAddress, TargetUserName,
       EventCode, action, app,
       authentication_method, signature, signature_id
  | where unique_targets > 30
  | `windows_local_administrator_credential_stuffing_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1110/004/
  - https://attack.mitre.org/techniques/T1110/
  - https://www.blackhillsinfosec.com/wide-spread-local-admin-testing/
  - https://www.pentestpartners.com/security-blog/admin-password-re-use-dont-do-it/
  - https://www.praetorian.com/blog/microsofts-local-administrator-password-solution-laps/
  - https://wiki.porchetta.industries/smb-protocol/password-spraying
tags:
  - attack.t1110.004
