title: Windows Important Audit Policy Disabled
id: 1bf500e5-1226-41d9-af5d-ed1f577929f2
status: stable
level: high
description: |
  The following analytic detects the disabling of important audit policies. It leverages EventCode 4719 from Windows Security Event Logs to identify changes where success or failure auditing is removed. This activity is significant as it suggests an attacker may have gained access to the domain controller and is attempting to evade detection by tampering with audit policies. If confirmed malicious, this could lead to severe consequences, including data theft, privilege escalation, and full network compromise. Immediate investigation is required to determine the source and intent of the change.
author: Nasreddine Bencherchali, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `wineventlog_security` EventCode=4719 (AuditPolicyChanges IN ("%%8448","%%8450","%%8448, %%8450") OR Changes IN ("Failure removed","Success removed","Success removed, Failure removed")) `important_audit_policy_subcategory_guids`
  | replace "%%8448" with "Success removed", "%%8450" with "Failure removed", "%%8448, %%8450" with "Success removed, Failure removed" in AuditPolicyChanges
  | eval AuditPolicyChanges=coalesce(AuditPolicyChanges,Changes), SubcategoryGuid=coalesce(SubcategoryGuid,Subcategory_GUID)
  | rename ClientProcessId as process_id
  | stats min(_time) as _time values(host) as dest
    BY AuditPolicyChanges SubcategoryGuid, process_id
  | lookup advanced_audit_policy_guids GUID as SubcategoryGuid OUTPUT Category SubCategory
  | `windows_important_audit_policy_disabled_filter`
  condition: _splunk_search
references:
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4719
tags:
  - attack.t1562.001
