title: Windows Multiple Accounts Disabled
id: 5d93894e-befa-4429-abde-7fc541020b7b
status: stable
level: high
description: |
  The following analytic identifies instances where more than five unique Windows accounts are disabled within a 10-minute window, as indicated by Event Code 4725 in the Windows Security Event Log. It leverages the wineventlog_security dataset, grouping data into 10-minute segments and tracking the count and distinct count of TargetUserName. This behavior is significant as it may indicate internal policy breaches or an external attacker's attempt to disrupt operations. If confirmed malicious, this activity could lead to widespread account lockouts, hindering user access and potentially disrupting business operations.
author: Mauricio Velazco, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `wineventlog_security` EventCode=4725 status=success
  | bucket span=10m _time
  | stats count dc(user) as unique_users values(user) as user values(dest) as dest
    BY EventCode signature _time
       src_user SubjectDomainName TargetDomainName
       Logon_ID
  | where unique_users > 5
  | `windows_multiple_accounts_disabled_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1098/
tags:
  - attack.t1098
  - attack.t1078
