title: Windows AppLocker Rare Application Launch Detection
id: 9556f7b7-285f-4f18-8eeb-963d989f9d27
status: stable
level: low
description: |
  The following analytic detects the launch of rarely used applications within the environment, which may indicate the use of potentially malicious software or tools by attackers. It leverages Windows AppLocker event logs, aggregating application launch counts over time and flagging those that significantly deviate from the norm. This behavior is significant as it helps identify unusual application activity that could signal a security threat. If confirmed malicious, this activity could allow attackers to execute unauthorized code, potentially leading to further compromise of the system.
author: Michael Haag, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `applocker`
  | spath input=UserData_Xml
  | rename RuleAndFileData.* as *, Computer as dest, TargetUser AS user
  | stats dc(_time) as days, count
    BY FullFilePath dest user
  | eventstats avg(count) as avg, stdev(count) as stdev
  | eval upperBound=(avg+stdev*3), lowerBound=(avg-stdev*3)
  | where count > upperBound OR count < lowerBound
  | `windows_applocker_rare_application_launch_detection_filter`
  condition: _splunk_search
references:
  - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/applocker/using-event-viewer-with-applocker
  - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/querying-application-control-events-centrally-using-advanced-hunting
tags:
  - attack.t1218
