title: Windows AD Rogue Domain Controller Network Activity
id: c4aeeeef-da7f-4338-b3ba-553cbcbe2138
status: experimental
level: high
description: |
  The following analytic identifies unauthorized replication RPC calls from non-domain controller devices. It leverages Zeek wire data to detect specific RPC operations like DrsReplicaAdd and DRSGetNCChanges, filtering out legitimate domain controllers. This activity is significant as it may indicate an attempt to introduce a rogue domain controller, which can compromise the integrity of the Active Directory environment. If confirmed malicious, this could allow attackers to manipulate directory data, escalate privileges, and persist within the network, posing a severe security risk.
author: Dean Luxton
date: 2026-02-25
logsource:
  product: splunk
  category: network
detection:
  _splunk_search: |
    `zeek_rpc` DrsReplicaAdd OR DRSGetNCChanges
  | where NOT (dest_category="Domain Controller") OR NOT (src_category="Domain Controller")
  | fillnull value="Unknown" src_category, dest_category
  | table _time endpoint operation src src_category dest dest_category
  | `windows_ad_rogue_domain_controller_network_activity_filter`
  condition: _splunk_search
references:
  - https://adsecurity.org/?p=1729
tags:
  - attack.t1207
