title: Windows Default Cobalt Strike PowerShell Beacon
id: 25b6329b-d6b7-4ccd-9ac2-6ca1dfd2b0c1
status: stable
level: high
description: |
  Detects default function and variable names known to be used by the Cobalt Strike PowerShell beacon.
This beacon is used to gain command and control on a victim.
author: Raven Tait, Splunk
date: 
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `powershell`
EventID="4104"
ScriptBlockText IN (
    "*func_get_proc_address*",
    "*$var_unsafe_native_methods*",
    "*$var_gpa.Invoke*",
    "*func_get_delegate_type*",
    "*$var_type_builder*"
)
| fillnull
| stats count min(_time) as firstTime
              max(_time) as lastTime

by Computer EventID ScriptBlockText dest signature signature_id
   user_id vendor_product Guid Opcode Name
   Path ProcessID ScriptBlockId

| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| `windows_default_cobalt_strike_powershell_beacon_filter`
  condition: _splunk_search
references:

tags:

