title: Windows Mark Of The Web Bypass
id: 8ca13343-7405-4916-a2d1-ae34ce0c28ae
status: stable
level: high
description: |
  The following analytic identifies a suspicious process that deletes the Mark-of-the-Web (MOTW) data stream. It leverages Sysmon EventCode 23 to detect when a file's Zone.Identifier stream is removed. This activity is significant because it is a common technique used by malware, such as Ave Maria RAT, to bypass security restrictions on files downloaded from the internet. If confirmed malicious, this behavior could allow an attacker to execute potentially harmful files without triggering security warnings, leading to further compromise of the system.
author: Teoderick Contreras, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `sysmon` EventCode=23 TargetFilename = "*:Zone.Identifier"
  | stats count min(_time) as firstTime, max(_time) as lastTime
    BY action dest dvc
       file_path file_hash file_name
       file_modify_time process_exec process_guid
       process_id process_name process_path
       signature signature_id user
       user_id vendor_product
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_mark_of_the_web_bypass_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1553/005/
  - https://github.com/nmantani/PS-MOTW#remove-motwps1
tags:
  - attack.t1553.005
