title: Windows Unusual Count Of Users Fail To Auth Wth ExplicitCredentials
id: 14f414cf-3080-4b9b-aaf6-55a4ce947b93
status: stable
level: medium
description: |
  The following analytic identifies a source user failing to authenticate with multiple users using explicit credentials on a host. It leverages Windows Event Code 4648 and calculates the standard deviation for each host, using the 3-sigma rule to detect anomalies. This behavior is significant as it may indicate a Password Spraying attack, where an adversary attempts to gain initial access or elevate privileges. If confirmed malicious, this activity could lead to unauthorized access, privilege escalation, or further compromise of the Active Directory environment.
author: Mauricio Velazco, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `wineventlog_security` EventCode=4648 Caller_User_Name!=*$ Target_User_Name!=*$
  | bucket span=5m _time
  | stats dc(Target_User_Name) AS unique_accounts values(Target_User_Name) as user values(dest) as dest values(src_ip) as src_ip
    BY _time, Computer, Caller_User_Name
  | eventstats avg(unique_accounts) as comp_avg , stdev(unique_accounts) as comp_std
    BY Computer
  | eval upperBound=(comp_avg+comp_std*3)
  | eval isOutlier=if(unique_accounts > 10 and unique_accounts >= upperBound, 1, 0)
  | search isOutlier=1
  | `windows_unusual_count_of_users_fail_to_auth_wth_explicitcredentials_filter`
  condition: _splunk_search
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4648
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/basic-audit-logon-events
tags:
  - attack.t1110.003
