title: WinEvent Scheduled Task Created Within Public Path
id: 5d9c6eee-988c-11eb-8253-acde48001122
status: stable
level: high
description: |
  The following analytic detects the creation of scheduled tasks within user-writable paths using Windows Security EventCode 4698. It identifies tasks registered via schtasks.exe or TaskService that execute commands from directories like Public, ProgramData, Temp, and AppData. This behavior is significant as it may indicate an attempt to establish persistence or execute unauthorized commands. If confirmed malicious, an attacker could maintain long-term access, escalate privileges, or execute arbitrary code, posing a severe threat to system integrity and security.
author: Michael Haag, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: endpoint
detection:
  _splunk_search: |
    `wineventlog_security`
EventCode=4698
TaskContent IN (
  "*\\users\\public\\*", "*\\programdata\\*", "*\\temp\\*",
  "*\\Windows\\Tasks\\*", "*\\appdata\\*", "*\\perflogs\\*"
  )
| stats count min(_time) as firstTime max(_time) as lastTime
  by Computer, TaskName, TaskContent, user
|  rename Computer as dest
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| `winevent_scheduled_task_created_within_public_path_filter`

  condition: _splunk_search
references:
  - https://research.checkpoint.com/2021/irans-apt34-returns-with-an-updated-arsenal/
  - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4698
  - https://redcanary.com/threat-detection-report/techniques/scheduled-task-job/
  - https://docs.microsoft.com/en-us/windows/win32/taskschd/time-trigger-example--scripting-?redirectedfrom=MSDN
  - https://app.any.run/tasks/e26f1b2e-befa-483b-91d2-e18636e2faf3/
tags:
  - attack.t1053.005
