title: Zoom Rare Audio Devices
id: 9fdbf709-4c46-4819-9fb6-98b2d72059ed
status: experimental
level: low
description: |
  Detects rare audio devices from Zoom logs. Actors performing Remote Employment Fraud (REF) typically use unusual device information compared to a majority of employees. Detecting this activity requires careful analysis, regular review, and a thorough understanding of the audio and video devices commonly used within your environment.
author: Marissa Bower, Raven Tait
date: 2026-02-25
logsource:
  product: splunk
  category: identity
detection:
  _splunk_search: |
    `zoom_index` speaker=* NOT (camera=*iPhone* OR camera="*FaceTime*" OR speaker="*AirPods*" OR camera="*MacBook*" OR microphone="*MacBook Pro Microphone*")
  | rare speaker limit=50
  | `zoom_rare_audio_devices_filter`
  condition: _splunk_search
references:

tags:
  - attack.t1123
