title: Zscaler Legal Liability Threat Blocked
id: bbf55ebf-c416-4f62-94d9-4064f2a28014
status: stable
level: medium
description: |
  The following analytic identifies significant legal liability threats blocked by the Zscaler web proxy. It uses web proxy logs to track destinations, device owners, users, URL categories, and actions associated with legal liability. By leveraging statistics on unique fields, it ensures a precise focus on these threats. This activity is significant for SOC as it helps enforce legal compliance and risk management. If confirmed malicious, it could indicate attempts to access legally sensitive or restricted content, potentially leading to legal repercussions and compliance violations.
author: Rod Soto, Gowthamaraj Rajendran, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: threat
detection:
  _splunk_search: |
    `zscaler_proxy` urlclass="Legal Liability"
  | stats count min(_time) as firstTime max(_time) as lastTime
    BY action deviceowner user
       urlcategory url src
       dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | dedup urlcategory
  | `zscaler_legal_liability_threat_blocked_filter`
  condition: _splunk_search
references:
  - https://help.zscaler.com/zia/nss-feed-output-format-web-logs
tags:
  - attack.t1566
