title: Zscaler CryptoMiner Downloaded Threat Blocked
id: ed76ce37-bab9-4ec0-bf3e-9c6a6cf43365
status: stable
level: medium
description: |
  The following analytic identifies attempts to download cryptomining software that are blocked by Zscaler. It leverages web proxy logs to detect blocked actions associated with cryptominer threats, analyzing key data points such as device owner, user, URL category, destination URL, and IP. This activity is significant for a SOC as it helps in early identification and mitigation of cryptomining activities, which can compromise network integrity and resource availability. If confirmed malicious, this activity could lead to unauthorized use of network resources for cryptomining, potentially degrading system performance and increasing operational costs.
author: Gowthamaraj Rajendran, Rod Soto, Splunk
date: 2026-02-25
logsource:
  product: splunk
  category: threat
detection:
  _splunk_search: |
    `zscaler_proxy` action=blocked threatname=*miner*
  | stats count min(_time) as firstTime max(_time) as lastTime
    BY action deviceowner user
       urlcategory url src
       dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `zscaler_cryptominer_downloaded_threat_blocked_filter`
  condition: _splunk_search
references:
  - https://help.zscaler.com/zia/nss-feed-output-format-web-logs
tags:
  - attack.t1566
