title: Zscaler Privacy Risk Destinations Threat Blocked
id: 5456bdef-d765-4565-8e1f-61ca027bc50d
status: stable
level: medium
description: |
  The following analytic identifies blocked destinations within a network that are deemed privacy risks by Zscaler. It leverages web proxy logs, focusing on entries marked as "Privacy Risk." Key data points such as device owner, user, URL category, destination URL, and IP are analyzed. This activity is significant for a SOC as it helps monitor and manage privacy risks, ensuring a secure network environment. If confirmed malicious, this activity could indicate attempts to access or exfiltrate sensitive information, posing a significant threat to data privacy and security.
author: Gowthamaraj Rajendran, Rod Soto, Splunk
date: 2026-03-10
logsource:
  product: splunk
  category: threat
detection:
  _splunk_search: |
    `zscaler_proxy` action=blocked urlclass="Privacy Risk"
  | stats count min(_time) as firstTime max(_time) as lastTime
    BY action deviceowner user
       urlcategory url src
       dest
  | dedup urlcategory
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `zscaler_privacy_risk_destinations_threat_blocked_filter`
  condition: _splunk_search
references:
  - https://help.zscaler.com/zia/nss-feed-output-format-web-logs
tags:
  - attack.t1566
