title: '$(sca.policy): $(sca.check.title)'
id: 9b04b566-7fc9-5e88-b6d9-5794df3e5267
status: stable
level: low
description: '$(sca.policy): $(sca.check.title)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    sca.check.result: ^passed
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-19006
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-19008
  wazuh_level: 3