title: '$(sca.policy): $(sca.check.title): Status changed from failed to ''not applicable'''
id: ffc40654-2d69-503b-92dc-ef196e715f2a
status: stable
level: low
description: '$(sca.policy): $(sca.check.title): Status changed from failed to ''not applicable'''
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    sca.check.previous_result: ^failed
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-19009
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-19013
  wazuh_level: 5