title: '$(sca.policy): $(sca.check.title)'
id: 689cf6c6-5d16-5863-a951-ec2d25a5c89c
status: stable
level: medium
description: '$(sca.policy): $(sca.check.title)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    sca.check.result: ^failed
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-19006
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-19007
  wazuh_level: 7