title: '$(sca.policy): $(sca.check.title)'
id: 2e05bf47-75a3-5aa7-96bf-13cdd3d266ac
status: stable
level: low
description: '$(sca.policy): $(sca.check.title)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    sca.check.status: ^Not applicable
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-19006
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-19009
  wazuh_level: 3