title: '$(sca.policy): $(sca.check.title): Status changed from ''not applicable'' to failed'
id: 8ad04d11-ea78-5b7a-8a56-56626afc4290
status: stable
level: medium
description: '$(sca.policy): $(sca.check.title): Status changed from ''not applicable'' to failed'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    sca.check.previous_result: ^Not applicable
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-19007
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-19014
  wazuh_level: 9