title: '$(sca.policy): $(sca.check.title): Status changed from ''not applicable'' to passed'
id: df7cbca5-3557-543a-941f-1df52f1b14f5
status: stable
level: low
description: '$(sca.policy): $(sca.check.title): Status changed from ''not applicable'' to passed'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    sca.check.previous_result: ^Not applicable
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-19008
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-19015
  wazuh_level: 3