title: '$(sca.policy): $(sca.check.title): Status changed from passed to failed'
id: dc0ec82a-30e4-5b74-9647-46b1cb6fb6c5
status: stable
level: medium
description: '$(sca.policy): $(sca.check.title): Status changed from passed to failed'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    sca.check.previous_result: ^passed
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-19007
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-19011
  wazuh_level: 9