title: '$(sca.policy): $(sca.check.title): Status changed from passed to ''not applicable'''
id: f762eeb2-bbb1-5d38-b87d-7b71241e3183
status: stable
level: low
description: '$(sca.policy): $(sca.check.title): Status changed from passed to ''not applicable'''
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    sca.check.previous_result: ^passed
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-19009
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-19012
  wazuh_level: 5