title: '$(sca.policy): $(sca.check.title): Status changed from failed to passed'
id: e89d3c1b-0cb8-555a-bf5d-d5795379e687
status: stable
level: low
description: '$(sca.policy): $(sca.check.title): Status changed from failed to passed'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    sca.check.previous_result: ^failed
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-19008
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-19010
  wazuh_level: 3