title: A scan of your computer failed because there are no threat definitions
id: 17a3bbad-4757-5eeb-92d5-9dd21c04e76a
status: stable
level: low
description: A scan of your computer failed because there are no threat definitions
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    win.system.eventID: ^4137$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-60600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-90533
  wazuh_level: 4