title: A Windows log file was cleared
id: ced1b3d0-cbbd-585b-973b-fc207263f700
status: stable
level: low
description: A Windows log file was cleared
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-18101
tags:
  - attack.t1070
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-83201
  wazuh_level: 5