title: Active protection could not be enabled because there are no threat definitions
id: cf2d8f9e-684d-5497-862d-ed39af2debbd
status: stable
level: low
description: Active protection could not be enabled because there are no threat definitions
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    win.system.eventID: ^4111$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-60600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-90513
  wazuh_level: 4