title: Active protection disabled
id: 7a4ec92b-8131-5f63-829c-6625df9ad235
status: stable
level: medium
description: Active protection disabled
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    win.system.eventID: ^4106$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-60600
tags:
  - attack.t1089
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-90509
  wazuh_level: 7