title: Agent event queue is flooded. Check the agent configuration.
id: a7ca0811-c160-539d-86d2-b05878dbe936
status: stable
level: high
description: Agent event queue is flooded. Check the agent configuration.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    level: flooded
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-201
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-204
  wazuh_level: 12