title: Agent event queue is $(level) full.
id: 7fa94c0e-2dc7-53be-93f0-92b0100cf0a4
status: stable
level: medium
description: Agent event queue is $(level) full.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    level: '%'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-201
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-202
  wazuh_level: 7