title: Agent event queue is back to normal load.
id: 56c76b7f-8ece-5b48-bb7a-784fc0460688
status: stable
level: low
description: Agent event queue is back to normal load.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    level: normal
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-201
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-205
  wazuh_level: 3