title: Agent event queue is full. Events may be lost.
id: 593d5822-30d4-5a12-a92f-037922043a73
status: stable
level: medium
description: Agent event queue is full. Events may be lost.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    level: full
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-201
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-203
  wazuh_level: 9