title: 'Algorithm not supported with source IP $(gcp.jsonPayload.sourceIP) from $(gcp.resource.labels.location), severity $(gcp.severity)'
id: 091b3275-9503-5896-a6ea-e368d54f7fe7
status: stable
level: medium
description: 'Algorithm not supported with source IP $(gcp.jsonPayload.sourceIP) from $(gcp.resource.labels.location), severity $(gcp.severity)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    gcp.jsonPayload.responseCode: ^BADALG$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-65002,65003
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-65036
  wazuh_level: 7