title: 'Allow: The firewall allowed a URL.'
id: 24b6cd8a-4771-5f7b-b814-0add05f93453
status: stable
level: low
description: 'Allow: The firewall allowed a URL.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    fw_action: Allow
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64220
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64239
  wazuh_level: 3