title: An item has been deleted from quarantine
id: b508fc30-07ee-5c73-bf07-d7f980c9c946
status: stable
level: medium
description: An item has been deleted from quarantine
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    win.system.eventID: ^4141$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-60600
tags:
  - attack.t1107
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-90537
  wazuh_level: 6