title: An IPsec Extended Mode negotiation failed
id: e9a88606-273b-53ef-800e-5a63ad6ad4c6
status: stable
level: medium
description: An IPsec Extended Mode negotiation failed
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-18104
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-18654
  wazuh_level: 8