title: 'Apache: Client sent malformed Host header. Possible Code Red attack.'
id: 3fbe22ca-30df-5588-a1c9-a2473dc9b7b1
status: stable
level: medium
description: 'Apache: Client sent malformed Host header. Possible Code Red attack.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-30301
tags:
  - attack.t1102
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-30307
  wazuh_level: 6