title: 'Apache: Invalid URI (bad client request).'
id: bb86e700-0a54-50dc-bc6a-e6546fd3e8b7
status: stable
level: low
description: 'Apache: Invalid URI (bad client request).'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-30301
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-30315
  wazuh_level: 5