title: Apparmor messages grouped.
id: 34917f00-895c-5a37-bd04-c1902979187d
status: stable
level: low
description: Apparmor messages grouped.
author: Wazuh, Inc.
logsource:
  category: linux
  service: kernel
  product: wazuh
detection:
  selection:
    message|contains: apparmor=
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-52000
  wazuh_level: 3