title: ASA critical message.
id: 9416ae76-d15d-5386-a86b-409f3f6a0bfd
status: stable
level: low
description: ASA critical message.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: '%ASA-2-'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64002
  wazuh_level: 5