title: ASA error message.
id: 8656d61e-2c60-5463-a97d-2bfe1977d680
status: stable
level: low
description: ASA error message.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: '%ASA-3-'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64003
  wazuh_level: 4