title: 'ASA: Firewall command executed (for accounting only).'
id: bd75c1f5-0317-5318-adfb-f4895264050a
status: stable
level: low
description: 'ASA: Firewall command executed (for accounting only).'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64005
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64025
  wazuh_level: 3