title: 'ASA: Successful login.'
id: 33655af8-099f-5154-80cc-c6d4f3730a8b
status: stable
level: low
description: 'ASA: Successful login.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64005
tags:
  - attack.t1078
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64009
  wazuh_level: 3