title: 'ASA: AAA (VPN) authentication successful.'
id: 2461c739-acf1-5a0f-ac27-05f7d80f1ed6
status: stable
level: low
description: 'ASA: AAA (VPN) authentication successful.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64005
tags:
  - attack.t1078
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64019
  wazuh_level: 3