title: 'ASA: Attack in progress detected.'
id: b984b460-7e39-5128-b35a-982459fc605a
status: stable
level: medium
description: 'ASA: Attack in progress detected.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64001
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64014
  wazuh_level: 8