title: 'ASA: Attack in progress detected.'
id: 964ac24c-f94c-57ab-b78e-ccab6cf01a76
status: stable
level: medium
description: 'ASA: Attack in progress detected.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64004
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64016
  wazuh_level: 8