title: 'ASA: Firewall configuration changed.'
id: cf9cf5d3-72c6-50ff-bdb0-b41b570e28cf
status: stable
level: medium
description: 'ASA: Firewall configuration changed.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64005
tags:
  - attack.t1089
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64024
  wazuh_level: 8