title: Attempting to load library.
id: 49abc36d-51b2-56c5-8b7d-e95698717052
status: stable
level: low
description: Attempting to load library.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: Attempting to load library
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-85000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-85002
  wazuh_level: 3