title: 'Auditd: user ID changed'
id: 85188ef9-78c1-56ad-85cf-2920a69111a3
status: stable
level: low
description: 'Auditd: user ID changed'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.type: CHUSER_ID
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80742
  wazuh_level: 5