title: 'Auditd: login attempt from a forbidden location.'
id: 015fa8b8-7638-55ac-ac97-8dd8eb79bba9
status: stable
level: low
description: 'Auditd: login attempt from a forbidden location.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.type: ANOM_LOGIN_LOCATION
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80724
  wazuh_level: 5