title: 'Auditd: End'
id: 013ecf6b-36f4-541c-9262-3bef059987d2
status: stable
level: high
description: 'Auditd: End'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.type: DAEMON_END
    audit.res: success
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80703
  wazuh_level: 10