title: 'Auditd: account login attempt ended abnormally.'
id: f3c3aac6-31e7-59f9-8d0e-381ed5b99acd
status: stable
level: low
description: 'Auditd: account login attempt ended abnormally.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.type: ANOM_LOGIN_ACCT
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80722
  wazuh_level: 5