title: 'Auditd: Abort'
id: d0f9b3e5-62b4-57da-8534-57d9db5eab73
status: stable
level: high
description: 'Auditd: Abort'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.type: DAEMON_ABORT
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80704
  wazuh_level: 10