title: 'Audit: Watch - Write access: $(audit.directory.name)'
id: 7eebd816-8a0a-5007-b51b-2e854cdb242f
status: stable
level: low
description: 'Audit: Watch - Write access: $(audit.directory.name)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.directory.name: \.+
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80780
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80782
  wazuh_level: 3