title: 'Auditd: group ID changed'
id: 2a145f8a-d3d8-5985-a623-db9832aa42fc
status: stable
level: low
description: 'Auditd: group ID changed'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.type: CHGRP_ID
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80741
  wazuh_level: 5