title: 'Auditd: file or a directory access ended abnormally'
id: f88140f2-74c9-55f8-9a46-3606d4024be6
status: stable
level: medium
description: 'Auditd: file or a directory access ended abnormally'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.type: ANOM_ACCESS_FS
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
tags:
  - attack.t1203
  - attack.t1492
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80714
  wazuh_level: 8