title: 'Auditd: failure of the Abstract Machine Test Utility (AMTU) detected'
id: 922771bf-adc8-5f45-b0ee-48fcb7402cc1
status: stable
level: medium
description: 'Auditd: failure of the Abstract Machine Test Utility (AMTU) detected'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.type: ANOM_AMTU_FAIL
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80715
  wazuh_level: 8