title: 'Auditd: login attempt reached the maximum amount of concurrent sessions.'
id: 3d82aa5d-6151-59ff-8a42-64cbaa5b2ad5
status: stable
level: low
description: 'Auditd: login attempt reached the maximum amount of concurrent sessions.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.type: ANOM_LOGIN_SESSIONS
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80725
  wazuh_level: 4