title: 'Audit: Watch - Change attribute: $(audit.directory.name)'
id: a524d997-832d-55e2-93ca-bd09a3ddc5b8
status: stable
level: low
description: 'Audit: Watch - Change attribute: $(audit.directory.name)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.directory.name: \.+
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80786
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80788
  wazuh_level: 3