title: 'Audit: Watch - Change attribute: $(audit.file.name)'
id: fc3dce3b-817c-5c45-899a-8229535c42ef
status: stable
level: low
description: 'Audit: Watch - Change attribute: $(audit.file.name)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.file.name: \.+
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80786
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80787
  wazuh_level: 3