title: 'Auditd: user-space account modification ended abnormally.'
id: b2492d59-cc59-5fad-acca-bac97faf1ec8
status: stable
level: low
description: 'Auditd: user-space account modification ended abnormally.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.type: ANOM_MOD_ACCT
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80720
  wazuh_level: 3