title: 'Auditd: file is made executable'
id: 14cbaa48-5970-5748-afbf-3005057edcbe
status: stable
level: medium
description: 'Auditd: file is made executable'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.type: ANOM_MK_EXEC
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80713
  wazuh_level: 7