title: 'Auditd: login attempt is made at a time when it is prevented by.'
id: 93da6fcb-cf00-5af6-8109-55f5031b1d1e
status: stable
level: low
description: 'Auditd: login attempt is made at a time when it is prevented by.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.type: ANOM_LOGIN_TIME
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80726
  wazuh_level: 5