title: 'Auditd: maximum amount of Discretionary Access Control (DAC) or Mandatory Access Control (MAC) failures reached'
id: ba63505c-3959-5793-816e-f3ead0d031e6
status: stable
level: medium
description: 'Auditd: maximum amount of Discretionary Access Control (DAC) or Mandatory Access Control (MAC) failures reached'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.type:
      - ANOM_MAX_DAC
      - ANOM_MAX_MAC
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80716
  wazuh_level: 8