title: 'Audit: Watch - Write access: $(audit.file.name)'
id: d5d47b16-84a4-57ce-a981-46fbbc2054d3
status: stable
level: low
description: 'Audit: Watch - Write access: $(audit.file.name)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.file.name: \.+
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80780
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80781
  wazuh_level: 3