title: 'Auditd: Start / Resume'
id: 9f1fe6ea-c581-5d21-ab9e-acaad678f56c
status: stable
level: informational
description: 'Auditd: Start / Resume'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.type:
      - DAEMON_RESUME
      - DAEMON_START
    audit.res: success
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80701
  wazuh_level: 1