title: 'Auditd: user-space account addition ended abnormally.'
id: bc8fb882-0878-5f5c-8f2d-f0dcf98c0a61
status: stable
level: low
description: 'Auditd: user-space account addition ended abnormally.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.type: ANOM_ADD_ACCT
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
tags:
  - attack.t1136
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80718
  wazuh_level: 3