title: 'Audit: Watch - Execute access: $(audit.file.name)'
id: f6812ee5-4d71-5140-b129-00d7338a05af
status: stable
level: low
description: 'Audit: Watch - Execute access: $(audit.file.name)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80789
  wazuh_level: 3