title: 'Auditd: process ended abnormally'
id: b0d72dc0-47e4-59fd-87fc-34cb88e25e35
status: stable
level: high
description: 'Auditd: process ended abnormally'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.type: ANOM_ABEND
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80711
  wazuh_level: 10