title: 'Auditd: SELinux mode (enforcing, permissive, off) is changed'
id: a5bc6edb-2c56-538f-bd6d-c0d3b49e3274
status: stable
level: high
description: 'Auditd: SELinux mode (enforcing, permissive, off) is changed'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.type: MAC_STATUS
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80731
  wazuh_level: 10