title: 'Auditd: execution of a file ended abnormally'
id: 2fc2ccfa-3d6b-58a8-b14a-07cbecec2de5
status: stable
level: high
description: 'Auditd: execution of a file ended abnormally'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.type: ANOM_EXEC
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
tags:
  - attack.t1204
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80712
  wazuh_level: 10