title: 'Auditd: SELinux permission check'
id: 0d90d936-33d0-5b06-929c-f7c88fffa8d4
status: stable
level: low
description: 'Auditd: SELinux permission check'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit.type: AVC
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80700
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80730
  wazuh_level: 3