title: 'Authorize: Client Authentication logon.'
id: a54aa0c8-8363-5813-90bb-3c76421ecfe7
status: stable
level: low
description: 'Authorize: Client Authentication logon.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    fw_action: Authorize
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64220
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64233
  wazuh_level: 3