title: AWS ALB alert.
id: fdd8c151-db64-5053-a4a2-97927db21dc8
status: stable
level: low
description: AWS ALB alert.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    aws.source: alb
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80200
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80325
  wazuh_level: 3