title: AWS NLB alert.
id: 4d0beddb-4ab2-5089-9fc9-c63cc96fb90c
status: stable
level: low
description: AWS NLB alert.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    aws.source: nlb
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80200
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80335
  wazuh_level: 3