title: 'AWS Cloudtrail: $(aws.eventSource) - $(aws.eventName) - User Login failed.'
id: dfeee63c-8d3a-53ac-b845-fd52405d19b8
status: stable
level: low
description: 'AWS Cloudtrail: $(aws.eventSource) - $(aws.eventName) - User Login failed.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    aws.responseElements.ConsoleLogin: Failure
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80253
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80254
  wazuh_level: 5