title: 'AWS Macie $(aws.severity): $(aws.name) - $(aws.summary.description)'
id: 858f8b12-0aad-5217-a058-f00ea0c56ec2
status: stable
level: low
description: 'AWS Macie $(aws.severity): $(aws.name) - $(aws.summary.description)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    aws.severity: LOW
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80350
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80352
  wazuh_level: 4