title: 'AWS Cloudtrail: $(aws.eventSource) - $(aws.eventName). Error: $(aws.errorCode).'
id: 6bd32c07-0dcd-57e8-819a-12e72009fed7
status: stable
level: low
description: 'AWS Cloudtrail: $(aws.eventSource) - $(aws.eventName). Error: $(aws.errorCode).'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    aws.errorCode: AccessDenied
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80203
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80250
  wazuh_level: 5