title: 'AWS Macie $(aws.severity): $(aws.name) - $(aws.summary.description)'
id: 6dc205c1-8d83-59d2-9026-e356ff8722b3
status: stable
level: high
description: 'AWS Macie $(aws.severity): $(aws.name) - $(aws.summary.description)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    aws.severity: CRITICAL
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80350
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80355
  wazuh_level: 12