title: 'AWS Cloudtrail: $(aws.eventSource) - $(aws.eventName) - Possible breaking attempt (high number of login attempts).'
id: 769366b3-5b8e-5415-94e3-edde506032a8
status: stable
level: high
description: 'AWS Cloudtrail: $(aws.eventSource) - $(aws.eventName) - Possible breaking attempt (high number of login attempts).'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  - type: aggregation
    window:
      maxspan: 360s
    condition:
      field: event_count
      operator: '>='
      value: 6
  - type: sequence
    parent_rule: wazuh-80254
    window:
      maxspan: 360s
    enforce_order: true
tags:
  - attack.t1110
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80255
  wazuh_level: 10