title: 'AWS Macie $(aws.severity): $(aws.name) - $(aws.summary.description)'
id: 842d5a34-f28b-5d3e-a411-a2b18d4b4617
status: stable
level: low
description: 'AWS Macie $(aws.severity): $(aws.name) - $(aws.summary.description)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    aws.severity: INFO
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80350
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80351
  wazuh_level: 3