title: 'AWS GuardDuty: $(aws.service.action.actionType) - $(aws.title)'
id: 08276b64-1c9b-506b-ad0a-b86e70e7acf5
status: stable
level: high
description: 'AWS GuardDuty: $(aws.service.action.actionType) - $(aws.title)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    aws.severity:
      - 7
      - 8
      - 9
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80300
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80303
  wazuh_level: 10