title: 'AWS Macie $(aws.severity): $(aws.name) - $(aws.summary.description)'
id: 85f257b1-6f85-581f-8aaf-81ff7a27ff71
status: stable
level: medium
description: 'AWS Macie $(aws.severity): $(aws.name) - $(aws.summary.description)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    aws.severity: HIGH
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80350
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80354
  wazuh_level: 8