title: 'AWS VPC Flow: [$(aws.action)] - Interface: $(aws.interface_id) - Protocol: $(aws.protocol)'
id: ab8656bc-9414-5ba0-ac83-827672cad45d
status: stable
level: low
description: 'AWS VPC Flow: [$(aws.action)] - Interface: $(aws.interface_id) - Protocol: $(aws.protocol)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    aws.action: ACCEPT
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80400
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80401
  wazuh_level: 3