title: 'AWS Cloudtrail: $(aws.eventSource) - $(aws.eventName) - User Login Success.'
id: 1c10a274-62e6-5e42-9a55-0847dadb211f
status: stable
level: low
description: 'AWS Cloudtrail: $(aws.eventSource) - $(aws.eventName) - User Login Success.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    aws.eventName: ConsoleLogin
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80202
tags:
  - attack.t1078
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80253
  wazuh_level: 3