title: 'AWS Inspector - Network assessment [$(aws.createdAt)]: $(aws.title) [$(aws.severity)]'
id: 9389aa49-33ce-579a-84b8-ed8b7521bf06
status: stable
level: low
description: 'AWS Inspector - Network assessment [$(aws.createdAt)]: $(aws.title) [$(aws.severity)]'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    aws.severity: Low
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80495
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80498
  wazuh_level: 4