title: AWS CLB alert.
id: 883b473e-c671-574f-b243-0a601936e9aa
status: stable
level: low
description: AWS CLB alert.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    aws.source: clb
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80200
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80330
  wazuh_level: 3