title: 'AWS Inspector - Network assessment [$(aws.createdAt)]: $(aws.title) [$(aws.severity)]'
id: d2ff0d46-5923-5816-9a09-382ec3744ad2
status: stable
level: low
description: 'AWS Inspector - Network assessment [$(aws.createdAt)]: $(aws.title) [$(aws.severity)]'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    aws.severity: Informational
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80495
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80499
  wazuh_level: 3