title: 'AWS Macie $(aws.severity): $(aws.name) - $(aws.summary.description)'
id: 42981e56-d269-58c9-8dba-b6463701de04
status: stable
level: medium
description: 'AWS Macie $(aws.severity): $(aws.name) - $(aws.summary.description)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    aws.severity: MEDIUM
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80350
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80353
  wazuh_level: 6