title: 'AWS Inspector - Network assessment [$(aws.createdAt)]: $(aws.title) [$(aws.severity)]'
id: cc85d4d6-2c07-5aa2-904f-be6b3072743c
status: stable
level: medium
description: 'AWS Inspector - Network assessment [$(aws.createdAt)]: $(aws.title) [$(aws.severity)]'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    aws.severity: Medium
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80495
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80497
  wazuh_level: 7