title: 'Azure: Storage'
id: e610758c-0aad-52c5-b8e4-c9e888ad6997
status: stable
level: low
description: 'Azure: Storage'
author: Wazuh, Inc.
logsource:
  service: json
  product: wazuh
detection:
  selection:
    azure_tag: azure-storage
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87803
  wazuh_level: 3