title: 'Azure: AD $(activity)'
id: 1a5b2187-edad-531d-9333-426693086613
status: stable
level: low
description: 'Azure: AD $(activity)'
author: Wazuh, Inc.
logsource:
  service: json
  product: wazuh
detection:
  selection:
    azure_tag: azure-ad-graph
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87802
  wazuh_level: 3