title: 'Azure: Storage: $(OperationName)'
id: d19b01d0-e8d7-5005-acf9-a05411cbf02a
status: stable
level: low
description: 'Azure: Storage: $(OperationName)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    operationName: \.+
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87803
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87813
  wazuh_level: 3