title: 'Azure: Log analytics'
id: 0f1b3183-b110-5d54-859f-ecae81bbc13e
status: stable
level: low
description: 'Azure: Log analytics'
author: Wazuh, Inc.
logsource:
  service: json
  product: wazuh
detection:
  selection:
    azure_tag: azure-log-analytics
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87801
  wazuh_level: 3