title: 'Azure: Log analytics: $(OperationName)'
id: 5fd8d3dc-8bc0-5333-bdd2-5f90061d9cc8
status: stable
level: low
description: 'Azure: Log analytics: $(OperationName)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    OperationName: \.+
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87810
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87811
  wazuh_level: 3