title: 'Azure: Log analytics activity'
id: e4417462-96ca-5b64-8363-681e7384c939
status: stable
level: low
description: 'Azure: Log analytics activity'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    Type: AzureActivity
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87801
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87810
  wazuh_level: 3