title: 'Azure: Storage'
id: e0cf8910-ee9f-5e47-bb2a-1c49ec9e3842
status: stable
level: low
description: 'Azure: Storage'
author: Wazuh, Inc.
logsource:
  service: azure-storage
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87804
  wazuh_level: 3