title: Bad web site blocking enabled
id: eb7ec93a-1cf1-5d8b-b142-1c44830f97d8
status: stable
level: low
description: Bad web site blocking enabled
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    win.system.eventID: ^4171$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-60600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-90559
  wazuh_level: 3