title: 'Block: Connection blocked by Interspect.'
id: 8fbac424-5d42-502b-909f-44cc1026cab6
status: stable
level: medium
description: 'Block: Connection blocked by Interspect.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    fw_action: Block
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64220
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64234
  wazuh_level: 7