title: 'Bypass: The connection passed transparently through InterSpect.'
id: 3f153fc3-0cb2-5b0a-970a-b144d62deac0
status: stable
level: low
description: 'Bypass: The connection passed transparently through InterSpect.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    fw_action: Bypass
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64220
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64228
  wazuh_level: 3