title: 'CIS-CAT Report overview: Score less than 50% ($(cis-data.score) %)'
id: 6ec5187a-0489-5a57-a068-df227c5f9ef8
status: stable
level: medium
description: 'CIS-CAT Report overview: Score less than 50% ($(cis-data.score) %)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    cis-data.score|re: '^4\d|^3\d'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87403
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87425
  wazuh_level: 7