title: 'CIS-CAT: $(cis-data.rule_title) (informational)'
id: aff309a3-b0bb-59f0-9bf0-fe620156e87f
status: stable
level: informational
description: 'CIS-CAT: $(cis-data.rule_title) (informational)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    type: ^scan_result$
    cis-data.result: ^informational$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87403
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87417
  wazuh_level: 1