title: 'CIS-CAT: $(cis.rule_title) (failed)'
id: 31795079-2d2a-5f52-a6c2-3c0124f9476b
status: stable
level: medium
description: 'CIS-CAT: $(cis.rule_title) (failed)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    type: ^scan_result$
    cis.result: ^fail$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87401, 87402
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87418
  wazuh_level: 7