title: 'CIS-CAT: assessment information for scan $(scan_id)'
id: b7c24073-eda8-5139-949d-08e940a2b589
status: stable
level: low
description: 'CIS-CAT: assessment information for scan $(scan_id)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    type: ^scan_info$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87403
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87405
  wazuh_level: 3