title: 'CIS-CAT: $(cis.rule_title) (unknown)'
id: 4df4ad1f-8fcb-54dd-acde-c06a49d9f6b5
status: stable
level: low
description: 'CIS-CAT: $(cis.rule_title) (unknown)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    type: ^scan_result$
    cis.result: ^unknown$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87401, 87402
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87414
  wazuh_level: 3