title: 'CIS-CAT: assessment information for scan $(scan_id)'
id: a6824fdc-03dc-5c85-a181-c77f9ec170eb
status: stable
level: low
description: 'CIS-CAT: assessment information for scan $(scan_id)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    type: ^scan_info$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87401, 87402
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87404
  wazuh_level: 3