title: 'CIS-CAT Report overview: Score less than 30% ($(cis.score))'
id: fb8e82c9-9b25-59fb-b1de-c7acb7158bd2
status: stable
level: medium
description: 'CIS-CAT Report overview: Score less than 30% ($(cis.score))'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    cis.score|re: '^2\d|^1\d|^\d$'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87401, 87402
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87426
  wazuh_level: 9