title: 'CIS-CAT: $(cis.rule_title) (informational)'
id: 97e44590-9eb0-5184-a2b1-33b28948ed86
status: stable
level: informational
description: 'CIS-CAT: $(cis.rule_title) (informational)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    type: ^scan_result$
    cis.result: ^informational$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87401, 87402
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87416
  wazuh_level: 1