title: 'Cisco IOS: Successful login to the router.'
id: 8eee6f04-b931-51f8-b944-53b8c06a0097
status: stable
level: low
description: 'Cisco IOS: Successful login to the router.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-4715
tags:
  - attack.t1078
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-4722
  wazuh_level: 3