title: Clamd restarted
id: a63e3817-21e0-5ea6-87a6-b4cdff99b0b5
status: stable
level: low
description: Clamd restarted
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: clamd daemon
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-52500
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-52505
  wazuh_level: 3