title: Completed scheduled quick scan
id: 382619ba-77d0-55c4-b1a4-5d6ac297cdb8
status: stable
level: low
description: Completed scheduled quick scan
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    win.system.eventID: ^4131$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-60600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-90527
  wazuh_level: 3