title: Completed scheduled deep scan
id: 18f7e4e3-1081-5049-86dc-5c211377bb3f
status: stable
level: low
description: Completed scheduled deep scan
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    win.system.eventID: ^4129$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-60600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-90525
  wazuh_level: 3