title: 'Deauthorize: Client Authentication logoff.'
id: bfbe9da2-18b1-5dfe-bd08-02bcfdddeace
status: stable
level: low
description: 'Deauthorize: Client Authentication logoff.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    fw_action: Deauthorize
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64220
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64232
  wazuh_level: 3