title: 'Decrypt: Connection Decrypted'
id: 36a6743a-e07f-5e4e-b658-0e5099ee19b6
status: stable
level: informational
description: 'Decrypt: Connection Decrypted'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    fw_action: Decrypt
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64220
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64225
  wazuh_level: 2