title: Definitions update cancelled
id: 81d9d787-37cb-54ef-987a-fd55c6f67f30
status: stable
level: low
description: Definitions update cancelled
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    win.system.eventID: ^4122$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-60600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-90520
  wazuh_level: 4