title: Delete of an from quarantine failed
id: b2ab15a9-c6bc-5762-9e6c-77ba9117c686
status: stable
level: low
description: Delete of an from quarantine failed
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    win.system.eventID: ^4162$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-60600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-90551
  wazuh_level: 4