title: 'Detect: Connection was detected by Interspect.'
id: 6d8678f9-ae28-5319-85cc-91f795403285
status: stable
level: low
description: 'Detect: Connection was detected by Interspect.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    fw_action: Detect
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64220
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64235
  wazuh_level: 3