title: DNS update denied.
id: f1c59680-0696-5e02-82ca-8abc8ecbd677
status: stable
level: low
description: DNS update denied.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains:
      - denied update from
      - unapproved update from
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-12100
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-12103
  wazuh_level: 4