title: 'Docker: Filesystem of container $(docker.Actor.Attributes.name) exported'
id: cedc724c-fdea-5dca-8a49-d0f5d31f2be3
status: stable
level: low
description: 'Docker: Filesystem of container $(docker.Actor.Attributes.name) exported'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.status: ^export$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87900
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87923
  wazuh_level: 5