title: 'Docker: Node updated'
id: a5a072ad-d212-5021-a35a-863044a638d1
status: stable
level: low
description: 'Docker: Node updated'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.Action: ^update$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87948
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87950
  wazuh_level: 3