title: 'Docker: Image created from imported data'
id: ef6b6d60-9a1f-5b4f-ab0b-a7b50873ba45
status: stable
level: low
description: 'Docker: Image created from imported data'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.status: ^import$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87900
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87920
  wazuh_level: 3