title: 'Docker: Node created'
id: df326cd3-3a29-5681-87b7-4fca72e1137f
status: stable
level: low
description: 'Docker: Node created'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.Action: ^create$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87948
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87949
  wazuh_level: 3