title: 'Docker: Plugin $(docker.Actor.Attributes.name) pulled'
id: b2b04bb4-7b07-57f4-b81d-f4b49441a927
status: stable
level: low
description: 'Docker: Plugin $(docker.Actor.Attributes.name) pulled'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.Action: ^pull$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87942
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87943
  wazuh_level: 3