title: 'Docker: Secret ''$(docker.Actor.Attributes.name)'' removed'
id: 93c22804-94ed-590c-bbe3-f2a92b6287a8
status: stable
level: low
description: 'Docker: Secret ''$(docker.Actor.Attributes.name)'' removed'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.Action: ^remove$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87939
tags:
  - attack.t1107
  - attack.t1485
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87941
  wazuh_level: 3