title: 'Docker: Network $(docker.Actor.Attributes.name) disconnected'
id: 75f14454-c1a2-560b-89f1-a9772723a3b0
status: stable
level: low
description: 'Docker: Network $(docker.Actor.Attributes.name) disconnected'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.Action: ^disconnect$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87927
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87929
  wazuh_level: 4