title: 'Docker: Started shell session in container $(docker.Actor.Attributes.name)'
id: af7c9690-2232-5011-9cd2-0fed5eaf2cf3
status: stable
level: low
description: 'Docker: Started shell session in container $(docker.Actor.Attributes.name)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.status|re: '^exec_start: bash $|^exec_start: /bin/bash $|^exec_start: sh $|^exec_start: dash $|^exec_start: /bin/dash $'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87907
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87908
  wazuh_level: 5