title: 'Docker: Container $(docker.Actor.Attributes.name) received the action: $(docker.status)'
id: bedcc627-1bfe-5b1b-a008-3df8dd2d0a42
status: stable
level: medium
description: 'Docker: Container $(docker.Actor.Attributes.name) received the action: $(docker.status)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.status|re: '^kill$|^die$'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87900
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87924
  wazuh_level: 7