title: 'Docker: Image loaded'
id: 0060cc0c-bcae-5a0d-82f4-ebef85216ffe
status: stable
level: low
description: 'Docker: Image loaded'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.status: ^load$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87900
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87933
  wazuh_level: 3