title: 'Docker: Error message'
id: fdad3789-e44c-598a-9183-f150c6eeda29
status: stable
level: low
description: 'Docker: Error message'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.level: error
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-86000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-86003
  wazuh_level: 3