title: 'Docker: Network $(docker.Actor.Attributes.name) connected'
id: be6bfcc8-1c06-5552-9622-74255469f729
status: stable
level: low
description: 'Docker: Network $(docker.Actor.Attributes.name) connected'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.Action: ^connect$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87927
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87928
  wazuh_level: 3