title: 'Docker: Container $(docker.Actor.Attributes.name) restarted'
id: 8cf4c2c4-446f-50b3-9787-75a7a206f8c5
status: stable
level: low
description: 'Docker: Container $(docker.Actor.Attributes.name) restarted'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.status: ^restart$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87900
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87909
  wazuh_level: 3