title: 'Docker: Image saved'
id: c1472b56-4a36-5f20-98f1-97d7280c1363
status: stable
level: low
description: 'Docker: Image saved'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.status: ^save$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87900
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87934
  wazuh_level: 3