title: 'Docker: Running processes of container $(docker.Actor.Attributes.name) displayed'
id: 9674e004-e487-55f4-9761-27608d487351
status: stable
level: low
description: 'Docker: Running processes of container $(docker.Actor.Attributes.name) displayed'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.status: ^top$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87900
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87926
  wazuh_level: 3