title: 'Docker: Warning message'
id: 9bb57e01-7237-5537-9766-9683f3aadf37
status: stable
level: informational
description: 'Docker: Warning message'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.level: warning
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-86000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-86002
  wazuh_level: 1