title: 'Docker: Information message'
id: 04845943-0d69-5a2a-9911-9633466345ed
status: stable
level: informational
description: 'Docker: Information message'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.level: info
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-86000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-86001
  wazuh_level: 1