title: 'Docker: Secret ''$(docker.Actor.Attributes.name)'' created'
id: 1b2f5afd-2354-53db-a578-ae041aa1a8be
status: stable
level: low
description: 'Docker: Secret ''$(docker.Actor.Attributes.name)'' created'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.Action: ^create$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87939
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87940
  wazuh_level: 3