title: 'Docker: Fatal message'
id: f1a96c27-6071-5aeb-ba05-bc37841f714f
status: stable
level: low
description: 'Docker: Fatal message'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.level: fatal
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-86000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-86004
  wazuh_level: 3