title: 'Docker: Image $(docker.Actor.Attributes.name) untagged'
id: fde51fe0-f7dc-5862-9dad-da22f568dfe3
status: stable
level: low
description: 'Docker: Image $(docker.Actor.Attributes.name) untagged'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    docker.status: ^untag$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87900
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87919
  wazuh_level: 3