title: Dovecot Authentication Success.
id: 35597ddb-a498-577f-a4d6-0b285f5060de
status: stable
level: low
description: Dovecot Authentication Success.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: 'login: Login:'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-9700
tags:
  - attack.t1078
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-9701
  wazuh_level: 3