title: 'Drop: Prohibit a packet from passing. Send no response.'
id: a715da63-bc07-586b-9ecd-272b2e296c86
status: stable
level: low
description: 'Drop: Prohibit a packet from passing. Send no response.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    fw_action: Drop
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64220
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64222
  wazuh_level: 4