title: 'During Quick Mode negotiation, IPsec received an invalid negotiation packet'
id: eee39365-5530-5049-8add-17d1263c694b
status: stable
level: medium
description: 'During Quick Mode negotiation, IPsec received an invalid negotiation packet'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-18104
tags:
  - attack.t1095
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-18660
  wazuh_level: 7