title: Email protection is enabled but the drivers are not loaded
id: f1f71d44-ed54-5be4-9357-69e4c983e7cb
status: stable
level: low
description: Email protection is enabled but the drivers are not loaded
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    win.system.eventID: ^4147$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-60600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-90542
  wazuh_level: 4