title: 'Encrypt: Connection Encrypted'
id: f330c524-6563-5d01-aa8c-ba559cd25436
status: stable
level: informational
description: 'Encrypt: Connection Encrypted'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    fw_action: Encrypt
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64220
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64224
  wazuh_level: 2