title: File added to the system.
id: 8ee0134a-d724-521e-9153-b33c6f984248
status: stable
level: low
description: File added to the system.
author: Wazuh, Inc.
logsource:
  service: syscheck_new_entry
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-554
  wazuh_level: 5