title: File deleted.
id: 33a4ac09-771e-5cfe-8004-afbf7fbe77f6
status: stable
level: medium
description: File deleted.
author: Wazuh, Inc.
logsource:
  service: syscheck_deleted
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection
tags:
  - attack.t1107
  - attack.t1485
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-553
  wazuh_level: 7