title: Firewall stops all traffic
id: 5accbc11-0fff-5fd6-9c33-6ec7dd190b7a
status: stable
level: low
description: Firewall stops all traffic
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    win.system.eventID: ^4176$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-60600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-90564
  wazuh_level: 5