title: 'Fortigate: Multiple Firewall drop events from same source.'
id: 037fbacd-4547-582d-adc3-618e8e801f79
status: stable
level: medium
description: 'Fortigate: Multiple Firewall drop events from same source.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  - type: aggregation
    window:
      maxspan: 45s
    by:
      - source.ip
    condition:
      field: event_count
      operator: '>='
      value: 18
    ignore_window: 240s
  - type: sequence
    parent_rule: wazuh-81604
    window:
      maxspan: 45s
    enforce_order: true
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-81605
  wazuh_level: 7