title: 'Fortigate: Multiple default tunneling setting events from same source.'
id: fc89e3c3-b3a2-529f-9501-9cf593ed74c5
status: stable
level: medium
description: 'Fortigate: Multiple default tunneling setting events from same source.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  - type: aggregation
    window:
      maxspan: 45s
    by:
      - source.ip
    condition:
      field: event_count
      operator: '>='
      value: 18
    ignore_window: 240s
  - type: sequence
    parent_rule: wazuh-81610
    window:
      maxspan: 45s
    enforce_order: true
tags:
  - attack.t1071
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-81611
  wazuh_level: 7