title: 'Fortigate: User logout successful'
id: b561176e-f7f6-5822-8bc2-210210942982
status: stable
level: low
description: 'Fortigate: User logout successful'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-81603
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-81616
  wazuh_level: 4