title: 'Fortigate: Multiple URL blocked from same source.'
id: 120d9949-390f-541e-9198-214184bdf441
status: stable
level: low
description: 'Fortigate: Multiple URL blocked from same source.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  - type: aggregation
    window:
      maxspan: 45s
    by:
      - source.ip
    condition:
      field: event_count
      operator: '>='
      value: 18
    ignore_window: 240s
  - type: sequence
    parent_rule: wazuh-81620
    window:
      maxspan: 45s
    enforce_order: true
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-81621
  wazuh_level: 3