title: 'Fortigate: Multiple Firewall SSL VPN failed login events from same source.'
id: a93f76aa-b647-589e-9621-d93e5fe22481
status: stable
level: medium
description: 'Fortigate: Multiple Firewall SSL VPN failed login events from same source.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  - type: aggregation
    window:
      maxspan: 45s
    by:
      - source.ip
    condition:
      field: event_count
      operator: '>='
      value: 18
    ignore_window: 240s
  - type: sequence
    parent_rule: wazuh-81614
    window:
      maxspan: 45s
    enforce_order: true
tags:
  - attack.t1110
  - attack.t1133
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-81615
  wazuh_level: 7