title: 'Fortigate: User successfully logged into firewall interface.'
id: 98caace6-244c-5b07-bee9-cdb33ebbe948
status: stable
level: low
description: 'Fortigate: User successfully logged into firewall interface.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: ui
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-81603
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-81626
  wazuh_level: 3