title: 'Fortigate: Multiple Firewall login events from same source.'
id: 83258d84-f28b-5fd8-94cc-f70b8bcfcb10
status: stable
level: low
description: 'Fortigate: Multiple Firewall login events from same source.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  - type: aggregation
    window:
      maxspan: 45s
    by:
      - source.ip
    condition:
      field: event_count
      operator: '>='
      value: 18
    ignore_window: 240s
  - type: sequence
    parent_rule: wazuh-81626
    window:
      maxspan: 45s
    enforce_order: true
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-81627
  wazuh_level: 4