title: 'GCP critical event on project $(gcp.resource.labels.project_id), monitored resource type: $(gcp.resource.type)'
id: 5be50db0-2746-5a05-b8d3-4966d6ed3aa0
status: stable
level: medium
description: 'GCP critical event on project $(gcp.resource.labels.project_id), monitored resource type: $(gcp.resource.type)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    gcp.severity: ^CRITICAL$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-65000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-65044
  wazuh_level: 9