title: 'GCP information event on project $(gcp.resource.labels.project_id), monitored resource type: $(gcp.resource.type)'
id: 31f4a953-4caf-5401-b60a-5b13f424518c
status: stable
level: informational
description: 'GCP information event on project $(gcp.resource.labels.project_id), monitored resource type: $(gcp.resource.type)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    gcp.severity: ^INFO$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-65000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-65040
  wazuh_level: 2