title: 'GCP emergency event on project $(gcp.resource.labels.project_id), monitored resource type: $(gcp.resource.type)'
id: 2d65e395-a381-5ed3-8a94-07083768479b
status: stable
level: high
description: 'GCP emergency event on project $(gcp.resource.labels.project_id), monitored resource type: $(gcp.resource.type)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    gcp.severity: ^EMERGENCY$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-65000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-65046
  wazuh_level: 12