title: High amount of POST requests in a small period of time (likely bot).
id: 12f38220-877c-5ef1-962f-7b759b4353ec
status: stable
level: high
description: High amount of POST requests in a small period of time (likely bot).
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  - type: aggregation
    window:
      maxspan: 20s
    by:
      - source.ip
    condition:
      field: event_count
      operator: '>='
      value: 8
  - type: sequence
    parent_rule: wazuh-31530
    window:
      maxspan: 20s
    enforce_order: true
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-31533
  wazuh_level: 10