title: Host Blocked by $(script) Active Response
id: 9b3a7b49-5307-5058-a8fc-cc34e6a734e5
status: stable
level: low
description: Host Blocked by $(script) Active Response
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    script: route-null
    type: add
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-605
  wazuh_level: 3