title: Host Unblocked by firewall-drop.sh Active Response
id: e700c7db-2b89-5591-a925-1b167a28ec9d
status: stable
level: low
description: Host Unblocked by firewall-drop.sh Active Response
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    script: firewall-drop.sh
    type: delete
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-602
  wazuh_level: 3