title: Host information added.
id: 8ed579f7-3963-5522-a8a8-cb3d61de34aa
status: stable
level: medium
description: Host information added.
author: Wazuh, Inc.
logsource:
  service: hostinfo_new
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-581
  wazuh_level: 8