title: Host information changed.
id: 9e352788-df1d-5717-a634-6abd09bfe858
status: stable
level: medium
description: Host information changed.
author: Wazuh, Inc.
logsource:
  service: hostinfo_modified
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-580
  wazuh_level: 8