title: Host Blocked by firewall-drop.sh Active Response
id: a1359ec8-178f-50cb-8d61-195a6ab60e3e
status: stable
level: low
description: Host Blocked by firewall-drop.sh Active Response
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    script: firewall-drop.sh
    type: add
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-601
  wazuh_level: 3