title: Host Blocked by host-deny.sh Active Response
id: 1fd5f37f-bc70-5350-89a4-b8c581986529
status: stable
level: low
description: Host Blocked by host-deny.sh Active Response
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    script: host-deny.sh
    type: add
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-603
  wazuh_level: 3