title: Host Unblocked by host-deny.sh Active Response
id: 2fa29f7a-b6f0-5fa3-a9d2-8129a27e02b3
status: stable
level: low
description: Host Unblocked by host-deny.sh Active Response
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    script: host-deny.sh
    type: delete
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-604
  wazuh_level: 3