title: Integrity checksum changed.
id: 8647f4b5-bb3d-5279-9f2a-3feb360d6918
status: stable
level: medium
description: Integrity checksum changed.
author: Wazuh, Inc.
logsource:
  service: syscheck_integrity_changed
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection
tags:
  - attack.t1492
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-550
  wazuh_level: 7