title: IPsec Services failed to process some IPsec filters on a plug-and-play event for network interfaces
id: a59fee9f-2882-5407-9ec0-e0d4f1909d6f
status: stable
level: medium
description: IPsec Services failed to process some IPsec filters on a plug-and-play event for network interfaces
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-18105
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-18666
  wazuh_level: 8