title: IPsec dropped an inbound clear text packet that should have been secured
id: 637c252a-a34c-5df3-9291-897f5973da1e
status: stable
level: medium
description: IPsec dropped an inbound clear text packet that should have been secured
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-18104
tags:
  - attack.t1107
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-18657
  wazuh_level: 8