title: IPsec Services encountered a potentially serious failure
id: 03c7ed75-5456-5263-8e71-1f0f92277288
status: stable
level: medium
description: IPsec Services encountered a potentially serious failure
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-18105
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-18668
  wazuh_level: 8