title: IPsec Services failed to initialize RPC server. IPsec Services could not be started
id: a0497f2f-026b-5522-9ed5-4fa6b942313d
status: stable
level: medium
description: IPsec Services failed to initialize RPC server. IPsec Services could not be started
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-18105
tags:
  - attack.t1489
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-18664
  wazuh_level: 8