title: 'Jenkins: Warning message'
id: a62b9860-9b80-5204-854c-9988ea52ad56
status: stable
level: informational
description: 'Jenkins: Warning message'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    jenkins.severity: WARNING
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-86250
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-86252
  wazuh_level: 1