title: 'Jenkins: Information message'
id: a6bcce6b-753a-5584-b8a3-f132113c98b8
status: stable
level: informational
description: 'Jenkins: Information message'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    jenkins.severity: INFO
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-86250
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-86251
  wazuh_level: 1