title: 'Jenkins: Severe message'
id: 65f96a05-75f4-5c26-a20d-0ea61be84e66
status: stable
level: low
description: 'Jenkins: Severe message'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    jenkins.severity: SEVERE
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-86250
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-86253
  wazuh_level: 3