title: Kaspersky Endpoint Security - Task $(TaskName) changed to state $(TaskState)
id: c60c438b-39e6-5394-b841-c40ebdd4cf87
status: stable
level: low
description: Kaspersky Endpoint Security - Task $(TaskName) changed to state $(TaskState)
author: Wazuh, Inc.
logsource:
  service: kes_parent
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-17000
  wazuh_level: 3