title: 'Login: A user logged into the system.'
id: e8a6c0d2-0b17-51b8-8038-e27c919ffd4e
status: stable
level: low
description: 'Login: A user logged into the system.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    fw_action: Login
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64220
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64230
  wazuh_level: 3