title: MariaDB warning message
id: 87d46b34-3526-5aef-8e54-bb45e0741070
status: stable
level: low
description: MariaDB warning message
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    mariadb.type: '[Warning]'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-88100
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-88102
  wazuh_level: 3