title: MariaDB error message
id: cebfa7f0-08cf-5668-a227-69deec14efee
status: stable
level: low
description: MariaDB error message
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    mariadb.type: '[ERROR]'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-88100
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-88101
  wazuh_level: 5