title: Maximum authentication attempts exceeded.
id: 34ad1d30-9b80-54fe-9377-86e1e07b041e
status: stable
level: medium
description: Maximum authentication attempts exceeded.
author: Wazuh, Inc.
logsource:
  category: authentication
  service: sshd
  product: wazuh
detection:
  selection:
    message|contains: '^error: maximum authentication attempts exceeded'
  condition: selection
tags:
  - attack.t1110
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-5758
  wazuh_level: 8