title: 'McAfee MySQL audit success: $(cmd) statement.'
id: 3e44e58d-83d8-5fc7-9e4a-0492fc3cf414
status: stable
level: low
description: 'McAfee MySQL audit success: $(cmd) statement.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    cmd|re: '^drop|^alter|^insert|^update|^grant|^delete'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-89054
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-89055
  wazuh_level: 5