title: 'McAfee MySQL audit: user logout.'
id: 47d009ee-888c-50cc-8196-cfb25c3c1099
status: stable
level: low
description: 'McAfee MySQL audit: user logout.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    cmd: ^Quit$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-89050
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-89052
  wazuh_level: 3