title: 'McAfee MySQL audit: authentication failure.'
id: 0bd86923-e05e-5690-94ad-7d25b0d36188
status: stable
level: medium
description: 'McAfee MySQL audit: authentication failure.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    cmd: ^Failed Login$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-89050
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-89053
  wazuh_level: 9