title: 'McAfee MySQL audit: authentication attempt.'
id: 9cda81e2-2eab-54c7-b803-4b4ee5cc2f7a
status: stable
level: low
description: 'McAfee MySQL audit: authentication attempt.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    cmd: ^Connect$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-89050
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-89051
  wazuh_level: 3