title: Message failed.
id: 72cc15b2-871e-5885-b477-6bad3887b7f6
status: stable
level: low
description: Message failed.
author: Wazuh, Inc.
logsource:
  service: smtpd
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-53500
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-53501
  wazuh_level: 3