title: Microsoft Security Essentials - Virus detected and properly removed.
id: 26b1c274-7e51-5818-b777-406a6cc349a4
status: stable
level: medium
description: Microsoft Security Essentials - Virus detected and properly removed.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-7704
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-7706
  wazuh_level: 7