title: Microsoft Security Essentials - Service failed.
id: 7928471c-1ad3-5769-9970-1fbfaf91b2b9
status: stable
level: medium
description: Microsoft Security Essentials - Service failed.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-7704
tags:
  - attack.t1489
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-7710
  wazuh_level: 9