title: Microsoft Security Essentials - Definitions update failed.
id: 38f6d640-5442-55fa-8787-54bac561a9c7
status: stable
level: medium
description: Microsoft Security Essentials - Definitions update failed.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-7704
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-7715
  wazuh_level: 8