title: Modsecurity alert.
id: 4923efff-31f9-5a01-bd26-c5b8110d3911
status: stable
level: medium
description: Modsecurity alert.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: '^mod_security-message:'
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-30200
  wazuh_level: 6