title: ModSecurity rejected a query
id: 1e4fd538-04b1-53a8-b673-ac705586e24e
status: stable
level: medium
description: ModSecurity rejected a query
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: with code 403
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-30402
tags:
  - attack.t1083
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-30411
  wazuh_level: 7