title: 'MongoDB: Connection accepted'
id: 203fc423-1d15-53e9-a777-185c1255f409
status: stable
level: low
description: 'MongoDB: Connection accepted'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: connection accepted
    mongodb.component: NETWORK
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-85755
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-85756
  wazuh_level: 3