title: 'MongoDB: Informational message'
id: 2e807bc4-ddae-5330-a7f5-1ad1ff9e3407
status: stable
level: low
description: 'MongoDB: Informational message'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    mongodb.severity: I
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-85750
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-85755
  wazuh_level: 3