title: 'MongoDB: End connection'
id: 299b9e47-95a4-53b4-ad8e-27172436a488
status: stable
level: low
description: 'MongoDB: End connection'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: end connection
    mongodb.component: NETWORK
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-85755
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-85757
  wazuh_level: 3