title: 'MongoDB: Multiple authentication failures.'
id: 891be15b-eef4-5f87-9bd4-02c3ae6efaa6
status: stable
level: high
description: 'MongoDB: Multiple authentication failures.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  - type: aggregation
    by:
      - source.ip
    condition:
      field: event_count
      operator: '>='
      value: 8
  - type: sequence
    parent_rule: wazuh-85759
    enforce_order: true
tags:
  - attack.t1110
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-85760
  wazuh_level: 10