title: 'MongoDB: Warning message'
id: 05fbf4f0-aadb-5f85-ab7e-deabadabf083
status: stable
level: low
description: 'MongoDB: Warning message'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    mongodb.severity: W
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-85750
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-85753
  wazuh_level: 4