title: 'MongoDB: Error message'
id: da78f069-2f14-5983-bc2a-4a655901733f
status: stable
level: low
description: 'MongoDB: Error message'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    mongodb.severity: E
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-85750
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-85752
  wazuh_level: 5