title: 'MongoDB: Fatal message'
id: 67fc1a6f-5cec-59a2-9617-15bc5d1623f0
status: stable
level: medium
description: 'MongoDB: Fatal message'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    mongodb.severity: F
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-85750
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-85751
  wazuh_level: 9