title: 'MongoDB: Execute commands without the necessary privileges'
id: e2ab6ee1-915e-5524-ba74-ca370d25c844
status: stable
level: medium
description: 'MongoDB: Execute commands without the necessary privileges'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|re: Unauthorized not authorized on \S+ to execute command
    mongodb.component: ACCESS
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-85755
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-85761
  wazuh_level: 7