title: 'Monitored: A security event was monitored; however, it was not blocked, due to the current configuration.'
id: ff678a30-9507-506a-8bf0-4b2d08839989
status: stable
level: low
description: 'Monitored: A security event was monitored; however, it was not blocked, due to the current configuration.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    fw_action: Monitored
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64220
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64227
  wazuh_level: 4