title: 'MS-DHCP: Bad Address.'
id: 4af129a6-dbed-56d4-a6e8-d0b63cb884a1
status: stable
level: medium
description: 'MS-DHCP: Bad Address.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-6350
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-6365
  wazuh_level: 7