title: 'MS-DHCP: Database cleanup begin.'
id: 40c0004c-0b7c-5823-a6f0-3e4406a2f52b
status: stable
level: informational
description: 'MS-DHCP: Database cleanup begin.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-6350
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-6371
  wazuh_level: 2