title: 'MS-DHCP: A lease request could not be satisfied because the scope''s address pool was exhausted.'
id: 06fd9aff-143e-5d5c-b17b-a2169103f186
status: stable
level: high
description: 'MS-DHCP: A lease request could not be satisfied because the scope''s address pool was exhausted.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-6300
tags:
  - attack.t1489
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-6308
  wazuh_level: 12