title: 'MS-DHCP: Service authorized in AD.'
id: 609cd713-09a2-50bf-b0d8-736718322f64
status: stable
level: low
description: 'MS-DHCP: Service authorized in AD.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-6350
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-6374
  wazuh_level: 3