title: 'MSSQL Injection attempt (/ur.php, urchin.js)'
id: bacb9c35-4d78-5ca0-8b2e-d22be5b490f2
status: stable
level: medium
description: 'MSSQL Injection attempt (/ur.php, urchin.js)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|re: '%2Bchar\(\d+\)%2Bchar\(\d+\)%2Bchar\(\d+\)%2Bchar\(\d+\)%2Bchar\(\d+\)%2Bchar\(\d+\)'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-31100
tags:
  - attack.t1190
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-31109
  wazuh_level: 6