title: Multiple Microsoft Security Essentials AV warnings detected.
id: e912f7cc-db2e-5918-bb37-039a1cb47c23
status: stable
level: high
description: Multiple Microsoft Security Essentials AV warnings detected.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  - type: aggregation
    window:
      maxspan: 240s
    condition:
      field: event_count
      operator: '>='
      value: 8
  - type: sequence
    parent_rule: wazuh-7702
    window:
      maxspan: 240s
    enforce_order: true
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-7719
  wazuh_level: 10