title: Multiple web server 501 error code (Not Implemented).
id: e8489453-9127-520c-8cf3-b7e323e66948
status: stable
level: high
description: Multiple web server 501 error code (Not Implemented).
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  - type: aggregation
    window:
      maxspan: 120s
    by:
      - source.ip
    condition:
      field: event_count
      operator: '>='
      value: 14
  - type: sequence
    parent_rule: wazuh-31121
    window:
      maxspan: 120s
    enforce_order: true
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-31161
  wazuh_level: 10