title: Multiple pfSense firewall blocks events from same source.
id: 849ba425-0f8f-5ba7-9a14-a09c3e4544a4
status: stable
level: high
description: Multiple pfSense firewall blocks events from same source.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  - type: aggregation
    window:
      maxspan: 45s
    by:
      - source.ip
    condition:
      field: event_count
      operator: '>='
      value: 18
    ignore_window: 240s
  - type: sequence
    parent_rule: wazuh-87701
    window:
      maxspan: 45s
    enforce_order: true
tags:
  - attack.t1110
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87702
  wazuh_level: 10