title: 'MySQL: User disconnected from database.'
id: 4c9c089a-266a-55d5-9fea-e571ae87a36c
status: stable
level: low
description: 'MySQL: User disconnected from database.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|re: '^MySQL log: \d+ \S+ \d+ Quit'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-50100
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-50108
  wazuh_level: 3