title: 'Netscreen firewall: Multiple alert messages from'
id: f34d3f36-4ede-5846-b01a-1e1af6da9687
status: stable
level: high
description: 'Netscreen firewall: Multiple alert messages from'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  - type: aggregation
    window:
      maxspan: 180s
    by:
      - source.ip
    condition:
      field: event_count
      operator: '>='
      value: 6
    ignore_window: 60s
  - type: sequence
    parent_rule: wazuh-4513
    window:
      maxspan: 180s
    enforce_order: true
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-4552
  wazuh_level: 10