title: netscreen detected a SYN flood.
id: 6d3d812d-c063-5826-8cb4-ac0cc6771db6
status: stable
level: low
description: netscreen detected a SYN flood.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: 'SYN flood!'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-4500
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-4560
  wazuh_level: 3