title: 'Netscaler: Multiple UI/API login failed'
id: 21a914c0-efc9-52a1-9135-6388a5dbcc1a
status: stable
level: high
description: 'Netscaler: Multiple UI/API login failed'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  - type: aggregation
    by:
      - source.ip
    condition:
      field: event_count
      operator: '>='
      value: 8
  - type: sequence
    parent_rule: wazuh-80139
    enforce_order: true
tags:
  - attack.t1110
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80140
  wazuh_level: 10