title: Netscreen critical/alert message.
id: 95f9d8fb-9845-50f5-878e-7521b046843b
status: stable
level: low
description: Netscreen critical/alert message.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-4500
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-4503
  wazuh_level: 5