title: Netscreen warning message.
id: 639718e5-8dab-5dc4-90ec-bbebee641224
status: stable
level: low
description: Netscreen warning message.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-4500
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-4502
  wazuh_level: 4