title: NextCloud INFO message.
id: fef17121-b67d-515d-b0bd-a1cb0e9f5d7f
status: stable
level: informational
description: NextCloud INFO message.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    level: ^1$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-88200,88201
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-88208
  wazuh_level: 2