title: NextCloud FATAL message.
id: 5c2e01ca-b09a-59da-8ede-3fd7ce5d8500
status: stable
level: medium
description: NextCloud FATAL message.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    level: ^4$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-88200,88201
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-88205
  wazuh_level: 8