title: NextCloud ERROR message.
id: c07415cf-54b7-5b3c-8f48-df4425a0e982
status: stable
level: low
description: NextCloud ERROR message.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    level: ^3$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-88200,88201
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-88206
  wazuh_level: 4