title: NextCloud WARN message.
id: 1bece504-6578-577a-8097-0c584dcacb3b
status: stable
level: low
description: NextCloud WARN message.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    level: ^2$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-88200,88201
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-88207
  wazuh_level: 3