title: NextCloud DEBUG message.
id: b3a717c8-78cc-5f43-8f50-227de878f0a1
status: stable
level: informational
description: NextCloud DEBUG message.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    level: ^0$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-88200,88201
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-88209
  wazuh_level: 1