title: 'OpenSCAP: $(oscap.check.title) (not passed)'
id: 55b1649b-7aac-5d81-8965-d6b9ec6fa74e
status: stable
level: medium
description: 'OpenSCAP: $(oscap.check.title) (not passed)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    oscap.check.severity: medium
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-81529
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-81530
  wazuh_level: 7