title: 'OpenSCAP: $(oscap.check.title) (not passed)'
id: 85069fa3-c35f-5aa5-9b7f-bb4a658db298
status: stable
level: medium
description: 'OpenSCAP: $(oscap.check.title) (not passed)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    oscap.check.severity: high
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-81529
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-81531
  wazuh_level: 9