title: 'OpenSCAP: $(oscap.check.title) (error)'
id: b37cb99b-c6a1-59ff-a578-8b67238f8bf4
status: stable
level: low
description: 'OpenSCAP: $(oscap.check.title) (error)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    oscap.check.result: error
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-81520
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-81526
  wazuh_level: 3