title: 'OpenSCAP Report overview: Score less than 50'
id: ac0b82f6-00f8-5815-8840-6e7e24a2beef
status: stable
level: medium
description: 'OpenSCAP Report overview: Score less than 50'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    oscap.scan.score|re: '4\d.|3\d.\d+'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-81540
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-81543
  wazuh_level: 7