title: 'OpenSCAP: $(oscap.check.title) (not passed)'
id: f3860bdb-5b3f-5d79-9090-4eb1120104bc
status: stable
level: low
description: 'OpenSCAP: $(oscap.check.title) (not passed)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    oscap.check.result: fail
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-81520
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-81529
  wazuh_level: 5