title: 'OpenSCAP Report overview: Score less than 50'
id: 61630360-e4ed-5938-9d06-0896a3fb1b4a
status: stable
level: medium
description: 'OpenSCAP Report overview: Score less than 50'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    oscap.scan.score|re: '4\d.|3\d.\d+'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-81560
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-81563
  wazuh_level: 7