title: 'OpenSCAP: $(oscap.check.title) (unknown)'
id: bf38263b-67ac-570c-9b81-c4b431afc283
status: stable
level: low
description: 'OpenSCAP: $(oscap.check.title) (unknown)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    oscap.check.result: unknown
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-81520
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-81527
  wazuh_level: 3