title: 'OpenSCAP: $(oscap.check.title) (not passed)'
id: 4b29ebcb-1072-52ae-a8f4-c7721540748b
status: stable
level: medium
description: 'OpenSCAP: $(oscap.check.title) (not passed)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    oscap.check.result: fail
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-81550
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-81552
  wazuh_level: 7