title: 'OpenSCAP Report overview: Score less than 90'
id: 760b2ab3-a0af-5ed3-ab8e-2683a1488fee
status: stable
level: low
description: 'OpenSCAP Report overview: Score less than 90'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    oscap.scan.score: 8\d.
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-81560
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-81561
  wazuh_level: 4