title: 'OpenSCAP Report overview: Score less than 90'
id: 84934845-7cf5-59eb-ab68-67ab46f148be
status: stable
level: low
description: 'OpenSCAP Report overview: Score less than 90'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    oscap.scan.score: 8\d.
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-81540
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-81541
  wazuh_level: 4