title: 'OpenSCAP: $(oscap.check.title) (informational)'
id: 0b900504-3391-59cb-9b87-41da57ccd9b1
status: stable
level: informational
description: 'OpenSCAP: $(oscap.check.title) (informational)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    oscap.check.result: informational
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-81520
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-81525
  wazuh_level: 1