title: Origin of zone and owner name of SOA do not match.
id: cb1481b5-55de-5824-be5c-e0a3f02d69eb
status: stable
level: informational
description: Origin of zone and owner name of SOA do not match.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|re: 'loading from master file \S+ failed: not at top of zone$'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-12100
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-12122
  wazuh_level: 1