title: osCommerce login.php bypass attempt.
id: 2f4fc1e1-849b-50cb-b25e-f013cd0ea162
status: stable
level: medium
description: osCommerce login.php bypass attempt.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|re: '"POST /\S+.php/login.php?cPath='
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-31100
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-31503
  wazuh_level: 6