title: 'osquery: $(osquery.pack) $(osquery.subquery): Browser plugin $(osquery.columns.name) is disabled'
id: cc85f56d-ed2b-595b-b569-48efc3838352
status: stable
level: low
description: 'osquery: $(osquery.pack) $(osquery.subquery): Browser plugin $(osquery.columns.name) is disabled'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    osquery.name: browser_plugins
    osquery.columns.disabled: 1
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24300
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24307
  wazuh_level: 4