title: 'osquery: $(osquery.pack) $(osquery.subquery): ACPI table $(osquery.columns.name) size is $(osquery.columns.size)'
id: 08eb02d8-e1d9-5af5-a69e-43ce3beef8c6
status: stable
level: low
description: 'osquery: $(osquery.pack) $(osquery.subquery): ACPI table $(osquery.columns.name) size is $(osquery.columns.size)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    osquery.name: smbios_tables
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24400
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24403
  wazuh_level: 4