title: 'osquery: $(osquery.pack) $(osquery.subquery): Application Layer Firewall for OSX service exceptions path $(osquery.columns.path)'
id: 0d6113ec-5563-5221-bba5-7d1b57e2e3d6
status: stable
level: low
description: 'osquery: $(osquery.pack) $(osquery.subquery): Application Layer Firewall for OSX service exceptions path $(osquery.columns.path)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    osquery.name: alf_exceptions
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24100
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24107
  wazuh_level: 4