title: 'osquery: $(osquery.pack) query result'
id: 23c1bfc9-5836-564e-aadf-a559c7022e87
status: stable
level: low
description: 'osquery: $(osquery.pack) query result'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    osquery.pack: ^osquery-monitoring$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24010
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24020
  wazuh_level: 4