title: 'osquery: $(osquery.pack) query result'
id: 83b462db-2230-5e97-a2a1-c9f82ccd5e85
status: stable
level: low
description: 'osquery: $(osquery.pack) query result'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    osquery.pack: ^unwanted-chrome-extensions$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24010
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24800
  wazuh_level: 4