title: 'osquery: $(osquery.pack) $(osquery.subquery): Windows device $(osquery.columns.device_name) driver is being used'
id: ce875f90-5626-52a8-8ccc-f6bb8f9d4341
status: stable
level: low
description: 'osquery: $(osquery.pack) $(osquery.subquery): Windows device $(osquery.columns.device_name) driver is being used'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    osquery.name: windows_drivers
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24100
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24130
  wazuh_level: 4