title: osquery error message
id: 2cdc76b9-7826-5d50-9e0a-01555255ff73
status: stable
level: low
description: osquery error message
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|re: ^E\d\d\d\d
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24001
  wazuh_level: 5