title: 'osquery: $(osquery.pack) $(osquery.subquery): Chrometana Chrome extension malware detected'
id: 7af85da2-e210-5d3f-9e64-c86f1e40705f
status: stable
level: low
description: 'osquery: $(osquery.pack) $(osquery.subquery): Chrometana Chrome extension malware detected'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    osquery.name: Chrometana
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24800
tags:
  - attack.t1176
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24802
  wazuh_level: 4