title: osquery message
id: cbe452c7-20e4-562c-aac3-90b30efe0997
status: stable
level: low
description: osquery message
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24000
  wazuh_level: 3