title: osquery information message
id: 7441d352-fea1-5be6-b735-f7641161b312
status: stable
level: informational
description: osquery information message
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|re: ^I\d\d\d\d
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24003
  wazuh_level: 2