title: 'osquery: $(osquery.pack) query result'
id: 777c04b1-df16-5ee8-8b90-f1af5f123f2d
status: stable
level: low
description: 'osquery: $(osquery.pack) query result'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    osquery.pack: ^it-compliance$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24010
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24100
  wazuh_level: 4