title: 'osquery: $(osquery.pack) $(osquery.subquery): Firefox addon $(osquery.columns.name) type is $(osquery.columns.type) and the user that owns it is $(osq'
id: e31eeee6-b491-5198-bde5-7a9650d38117
status: stable
level: low
description: 'osquery: $(osquery.pack) $(osquery.subquery): Firefox addon $(osquery.columns.name) type is $(osquery.columns.type) and the user that owns it is $(osquery.columns.uid)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    osquery.name: firefox_addons
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24100
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24117
  wazuh_level: 4