title: 'osquery: $(osquery.pack) $(osquery.subquery): MacOSInstallCore Chrome extension malware detected'
id: bb9d4f75-6843-5d06-9768-b4cc6d5d8d50
status: stable
level: low
description: 'osquery: $(osquery.pack) $(osquery.subquery): MacOSInstallCore Chrome extension malware detected'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    osquery.name: MacOSInstallCore
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24800
tags:
  - attack.t1176
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24811
  wazuh_level: 4