title: 'osquery: $(osquery.pack) $(osquery.subquery): Windows Registry key $(osquery.columns.key) value is $(osquery.columns.data)'
id: df99665f-530b-5912-9c50-8878d2fa0a2b
status: stable
level: low
description: 'osquery: $(osquery.pack) $(osquery.subquery): Windows Registry key $(osquery.columns.key) value is $(osquery.columns.data)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    osquery.pack: ^windows-hardening$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24010
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24600
  wazuh_level: 4