title: 'osquery: $(osquery.pack) $(osquery.subquery): Repository name $(osquery.columns.name), version $(osquery.columns.version), source $(osquery.columns.so'
id: 4cf3dcc3-0949-56ea-be14-57c412b8096f
status: stable
level: low
description: 'osquery: $(osquery.pack) $(osquery.subquery): Repository name $(osquery.columns.name), version $(osquery.columns.version), source $(osquery.columns.source),release name $(osquery.columns.release)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    osquery.name: apt_sources
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24300
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24315
  wazuh_level: 4