title: 'osquery: $(osquery.pack) $(osquery.subquery): SocialFixer Chrome extension malware detected'
id: 901f7288-4a7a-57f0-a8ec-0f94123c7d67
status: stable
level: low
description: 'osquery: $(osquery.pack) $(osquery.subquery): SocialFixer Chrome extension malware detected'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    osquery.name: SocialFixer
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24800
tags:
  - attack.t1176
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24807
  wazuh_level: 4