title: 'osquery: $(osquery.pack) $(osquery.subquery): WebDeveloper Chrome extension malware detected'
id: 6a601860-f5bb-54ff-9ff4-efc459a7ca6e
status: stable
level: low
description: 'osquery: $(osquery.pack) $(osquery.subquery): WebDeveloper Chrome extension malware detected'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    osquery.name: WebDeveloper
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24800
tags:
  - attack.t1176
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24809
  wazuh_level: 4