title: 'osquery: $(osquery.pack) $(osquery.subquery): Mount point $(osquery.columns.path) at with $(osquery.columns.blocks_free) free blocks'
id: fe19ab9e-3788-57cc-8fef-d601ed9c8609
status: stable
level: low
description: 'osquery: $(osquery.pack) $(osquery.subquery): Mount point $(osquery.columns.path) at with $(osquery.columns.blocks_free) free blocks'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    osquery.name: mounts
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24100
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24110
  wazuh_level: 4