title: osquery warning message
id: 70bca834-2d28-5c68-880e-2ac8a658c34f
status: stable
level: low
description: osquery warning message
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|re: ^W\d\d\d\d
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24002
  wazuh_level: 3