title: 'osquery: $(osquery.pack) query result'
id: 02121110-afd6-570c-8a36-4dd7cec3a743
status: stable
level: low
description: 'osquery: $(osquery.pack) query result'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    osquery.pack: ^hardware-monitoring$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24010
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24400
  wazuh_level: 4