title: 'osquery: $(osquery.pack) query result'
id: 630e208f-1f60-5a12-8c55-f0f6fad23e3e
status: stable
level: low
description: 'osquery: $(osquery.pack) query result'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    osquery.pack: ^incident-response$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-24010
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-24030
  wazuh_level: 4