title: 'Palo Alto SYSTEM: $(severity) severity log on $(device_name): $(description)'
id: d0688175-a109-5b29-a8a0-4d62870bcfae
status: stable
level: low
description: 'Palo Alto SYSTEM: $(severity) severity log on $(device_name): $(description)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    severity: low
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64500
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64502
  wazuh_level: 3