title: 'Palo Alto SYSTEM: $(severity) severity log on $(device_name): $(description)'
id: 64ba19c1-78d2-59cf-9082-0c9d1af3f4b2
status: stable
level: low
description: 'Palo Alto SYSTEM: $(severity) severity log on $(device_name): $(description)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    severity: medium
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64500
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64504
  wazuh_level: 5