title: 'Palo Alto SYSTEM: $(severity) severity log on $(device_name): $(description)'
id: 5db11a69-d8b6-5d66-982b-15b2c9b2d285
status: stable
level: critical
description: 'Palo Alto SYSTEM: $(severity) severity log on $(device_name): $(description)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    severity: critical
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64500
tags:
  - attack.t1089
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64506
  wazuh_level: 14