title: 'Palo Alto TRAFFIC: session started log on $(device_name)'
id: 1048a05f-898d-506d-8947-332378a4abfd
status: stable
level: informational
description: 'Palo Alto TRAFFIC: session started log on $(device_name)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    content_type: start
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64507
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64508
  wazuh_level: 2