title: 'Palo Alto SYSTEM: $(severity) severity log on $(device_name): $(description)'
id: eb8977aa-68a2-5466-be81-e7b4fa84a5f4
status: stable
level: informational
description: 'Palo Alto SYSTEM: $(severity) severity log on $(device_name): $(description)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    severity: informational
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64500
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64501
  wazuh_level: 1