title: 'Palo Alto TRAFFIC: session ended  on $(device_name) from $(src_ip) to $(dst_ip). Reason: $(session_end_reason)'
id: 2eab4584-dd92-54bb-8454-f24b858ba669
status: stable
level: informational
description: 'Palo Alto TRAFFIC: session ended  on $(device_name) from $(src_ip) to $(dst_ip). Reason: $(session_end_reason)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    content_type: end
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64507
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64509
  wazuh_level: 2