title: 'PAM: User changed password.'
id: c8089f24-cf2e-5cd8-979d-d3396e00a92c
status: stable
level: low
description: 'PAM: User changed password.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: ': password changed for'
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-5555
  wazuh_level: 3