title: 'Panda Security: Very high severity alert detected! Category: $(Cat)'
id: 28048d65-4882-5336-aa72-080b9199f05f
status: stable
level: critical
description: 'Panda Security: Very high severity alert detected! Category: $(Cat)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    Severity:
      - 9
      - 10
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64200
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64205
  wazuh_level: 14