title: 'Panda Security: The file is corrupted or defective.'
id: 2abc4eaa-a058-5bec-9950-2ac504c8bb01
status: stable
level: medium
description: 'Panda Security: The file is corrupted or defective.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    Broken: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64200
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64208
  wazuh_level: 7