title: 'Panda Security: High severity alert detected. Category: $(Cat)'
id: 1d78d222-20ae-5ff8-b792-eba1c325c3aa
status: stable
level: high
description: 'Panda Security: High severity alert detected. Category: $(Cat)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    Severity:
      - 7
      - 8
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64200
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64204
  wazuh_level: 12