title: 'Panda Security: Low severity event detected. Category: $(Cat)'
id: aa3ff538-a01d-5acd-b58e-6d97dbad2a51
status: stable
level: low
description: 'Panda Security: Low severity event detected. Category: $(Cat)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    Severity:
      - 3
      - 4
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64200
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64202
  wazuh_level: 4