title: 'Panda Security: The parent process is corrupted or defective.'
id: 23536294-ffa0-578a-923d-6879ccb284c5
status: stable
level: medium
description: 'Panda Security: The parent process is corrupted or defective.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    ParentBroken: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64200
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64207
  wazuh_level: 7