title: 'Panda Security: The child process is corrupted or defective.'
id: 81f9c3db-014f-5538-b5be-5d5fc13fb162
status: stable
level: medium
description: 'Panda Security: The child process is corrupted or defective.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    ChildBroken: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64200
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64206
  wazuh_level: 7