title: 'Panda Security: Medium severity event detected. Category: $(Cat)'
id: 41ffc062-c3dc-5eeb-ac17-a021e35fa8f2
status: stable
level: low
description: 'Panda Security: Medium severity event detected. Category: $(Cat)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    Severity:
      - 5
      - 6
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64200
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64203
  wazuh_level: 4