title: 'Percona audit failed: $(audit_record.command_class) statement.'
id: ba1f8df8-b5c6-5785-aa4f-bdc4acd16f50
status: stable
level: low
description: 'Percona audit failed: $(audit_record.command_class) statement.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit_record.name: ^Query$
    audit_record.command_class|re: '^drop|^alter|^insert|^update|^grant|^delete'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-88006
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-88007
  wazuh_level: 5