title: 'Percona audit: user logout.'
id: e791d6c0-852a-5fa2-981c-fd3ac9ee8d78
status: stable
level: low
description: 'Percona audit: user logout.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit_record.name: ^Quit$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-88000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-88002
  wazuh_level: 3