title: 'Percona audit success: $(audit_record.command_class) statement.'
id: eccdcb5a-49a1-5e22-b0a1-8ab114abedb1
status: stable
level: low
description: 'Percona audit success: $(audit_record.command_class) statement.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit_record.name: ^Query$
    audit_record.status: ^0$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-88000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-88004
  wazuh_level: 3