title: 'Percona audit failed: $(audit_record.command_class) statement.'
id: aaed4234-a2a9-5429-a1d6-765d16d7671f
status: stable
level: low
description: 'Percona audit failed: $(audit_record.command_class) statement.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    audit_record.name: ^Query$
    audit_record.status: ^1
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-88000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-88006
  wazuh_level: 3