title: 'PIX: User created or modified on the Firewall.'
id: 14aae3bb-3e8e-58f2-a565-b727a43fd401
status: stable
level: medium
description: 'PIX: User created or modified on the Firewall.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-4314
tags:
  - attack.t1089
  - attack.t1133
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-4342
  wazuh_level: 8