title: 'PIX: Attempt to connect from a blocked (shunned) IP.'
id: ad7cb416-5e25-5fc1-8a9e-f23dbae82a6d
status: stable
level: medium
description: 'PIX: Attempt to connect from a blocked (shunned) IP.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-4313
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-4326
  wazuh_level: 8