title: 'PIX: The PIX is disallowing new connections.'
id: 1553be19-5cb5-5834-aa44-645f0eb8f4fd
status: stable
level: medium
description: 'PIX: The PIX is disallowing new connections.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-4312
tags:
  - attack.t1133
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-4337
  wazuh_level: 8