title: 'PostgreSQL: Multiple database errors.'
id: a1c43501-c6cd-5310-ba41-558a8ea1508f
status: stable
level: high
description: 'PostgreSQL: Multiple database errors.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  - type: aggregation
    window:
      maxspan: 120s
    condition:
      field: event_count
      operator: '>='
      value: 8
    ignore_window: 60s
  - type: sequence
    parent_rule: wazuh-50504
    window:
      maxspan: 120s
    enforce_order: true
tags:
  - attack.t1499
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-50580
  wazuh_level: 10