title: 'PostgreSQL: Database authentication success.'
id: 415aad10-84a5-58f5-9c24-cb8e3394d26f
status: stable
level: low
description: 'PostgreSQL: Database authentication success.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: connection authorized
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-50501
tags:
  - attack.t1078
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-50511
  wazuh_level: 3