title: 'proftpd: FTP server Buffer overflow attempt.'
id: 45198540-355e-5ab8-a564-29f70107c3f3
status: stable
level: high
description: 'proftpd: FTP server Buffer overflow attempt.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: Reallocating sreaddir buffer
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-11200
tags:
  - attack.t1499
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-11219
  wazuh_level: 12