title: 'proftpd: Attempt to login using a non-existent user.'
id: dc514302-0348-5165-a350-7647cd769d18
status: stable
level: low
description: 'proftpd: Attempt to login using a non-existent user.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: no such user
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-11200
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-11203
  wazuh_level: 5