title: Proxmox VE authentication succeeded.
id: 15f5a2af-0d2d-5211-80f7-6b0b8754137a
status: stable
level: low
description: Proxmox VE authentication succeeded.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: successful auth for user
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87200
tags:
  - attack.t1078
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87203
  wazuh_level: 3