title: 'Puppet Master: not run - address in use'
id: 78094fa3-9e82-5d46-83f7-117d605fec0c
status: stable
level: medium
description: 'Puppet Master: not run - address in use'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: '^Could not run: Address already in use'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80006
  wazuh_level: 7