title: Puppet Master stopped
id: bb3839a3-688c-5078-a6e5-7015195a190c
status: stable
level: low
description: Puppet Master stopped
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains:
      - ^Processing
      - ^Caught
    message|re: \.+stop
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80003
  wazuh_level: 5