title: 'Puppet Agent: Certificate - Could not request certificate'
id: 28b6fdde-7d1a-5c68-94cb-49c089ecadc4
status: stable
level: informational
description: 'Puppet Agent: Certificate - Could not request certificate'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: ^Could not request certificate
    message|re: master does not match the agent
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80001
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80052
  wazuh_level: 2