title: 'Quarantine: The IP source address of the connection was quarantined.'
id: 35a1a301-0a5e-5dbf-80ef-bd3c4d10d98b
status: stable
level: medium
description: 'Quarantine: The IP source address of the connection was quarantined.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    fw_action: Quarantine
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64220
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64237
  wazuh_level: 7