title: 'racoon: VPN authentication failed.'
id: 01f264b4-507c-5096-bbbe-d10551bcd4c4
status: stable
level: low
description: 'racoon: VPN authentication failed.'
author: Wazuh, Inc.
logsource:
  service: racoon-failed
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-14101
  wazuh_level: 5