title: 'Redis: started'
id: 49823fc8-74f4-599a-913c-c960d8d39d64
status: stable
level: informational
description: 'Redis: started'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: Server started
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-81300
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-81301
  wazuh_level: 1