title: Registry Key Integrity Checksum Changed
id: a95fde2d-bee9-502e-87f3-dd14f8d49590
status: stable
level: low
description: Registry Key Integrity Checksum Changed
author: Wazuh, Inc.
logsource:
  service: syscheck_registry_key_modified
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection
tags:
  - attack.t1492
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-594
  wazuh_level: 5