title: Registry Value Entry Added to the System
id: cf29a407-a1f8-5c18-9916-c4428740f031
status: stable
level: low
description: Registry Value Entry Added to the System
author: Wazuh, Inc.
logsource:
  service: syscheck_registry_value_added
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-752
  wazuh_level: 5