title: Registry Key Entry Deleted.
id: 5368fbc5-128b-5eb0-aab2-b6c66d1cf153
status: stable
level: low
description: Registry Key Entry Deleted.
author: Wazuh, Inc.
logsource:
  service: syscheck_registry_key_deleted
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection
tags:
  - attack.t1107
  - attack.t1485
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-597
  wazuh_level: 5