title: Registry Value Integrity Checksum Changed
id: 7cf4cc29-00d2-5b01-bc3b-214cfeffce6e
status: stable
level: low
description: Registry Value Integrity Checksum Changed
author: Wazuh, Inc.
logsource:
  service: syscheck_registry_value_modified
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection
tags:
  - attack.t1492
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-750
  wazuh_level: 5