title: Registry Key Entry Added to the System
id: 12e22f3b-8e9f-52c2-b1b2-68118dfcf89f
status: stable
level: low
description: Registry Key Entry Added to the System
author: Wazuh, Inc.
logsource:
  service: syscheck_registry_key_added
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-598
  wazuh_level: 5