title: Registry Value Entry Deleted.
id: 0166ff5b-a8d2-508d-bdea-f031b92a60f6
status: stable
level: low
description: Registry Value Entry Deleted.
author: Wazuh, Inc.
logsource:
  service: syscheck_registry_value_deleted
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection
tags:
  - attack.t1107
  - attack.t1485
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-751
  wazuh_level: 5