title: 'Reject: Prohibit a packet from passing. Send an ICMP destination-unreachable back to the source host.'
id: d132bf22-a147-5422-95d0-b8049115af3d
status: stable
level: medium
description: 'Reject: Prohibit a packet from passing. Send an ICMP destination-unreachable back to the source host.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    fw_action: Reject
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64220
tags:
  - attack.t1095
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64223
  wazuh_level: 9