title: Remote upgrade finished successfully.
id: cb61e85b-016f-5878-80b3-44e93fa87f75
status: stable
level: low
description: Remote upgrade finished successfully.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-210
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-214
  wazuh_level: 3