title: 'SCA summary: $(sca.policy): Score: $(sca.score)'
id: d222fbe9-a009-54bc-a2ce-f35f18c28bd7
status: stable
level: low
description: 'SCA summary: $(sca.policy): Score: $(sca.score)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    sca.type: ^summary
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-19000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-19001
  wazuh_level: 3