title: Serial number from master is lower
id: 5a731aa1-3455-5d55-8321-fc04033b10ad
status: stable
level: medium
description: Serial number from master is lower
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|re: ^zone \S+ serial number \S+ received from master
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-12110
  wazuh_level: 8