title: 'Serv-U: SFTP (SSH) Permission denied'
id: 58017e64-f42a-5c49-ae99-ca00915b8fdf
status: stable
level: low
description: 'Serv-U: SFTP (SSH) Permission denied'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: Permission denied
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80500
tags:
  - attack.t1110
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80523
  wazuh_level: 4