title: 'Serv-U: Directory deleted'
id: 1401f4c4-f9c5-56e8-a41f-4e440956c56a
status: stable
level: low
description: 'Serv-U: Directory deleted'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: Directory deleted
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-80500
tags:
  - attack.t1107
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-80516
  wazuh_level: 3