title: Shellshock attack attempt
id: 13f5e54b-f7e2-55ad-ac89-b5fe21644ce1
status: stable
level: medium
description: Shellshock attack attempt
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|re: '"\(\)\s*{\s*_;\.*}\s*>_[\$\(\$\(\)\)]\s*{'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-31101, 31120
tags:
  - attack.t1068
  - attack.t1190
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-31167
  wazuh_level: 6