title: Shellshock attack detected
id: 7a2b8627-1aa1-5294-89f5-24e36a9ba248
status: stable
level: critical
description: Shellshock attack detected
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|re: '"\(\)\s*{\s*_;\.*}\s*>_[\$\(\$\(\)\)]\s*{'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-31108
tags:
  - attack.t1068
  - attack.t1190
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-31169
  wazuh_level: 15