title: 'Solaris: Login session succeeded.'
id: e9500f75-e718-5831-8307-0409265b0567
status: stable
level: low
description: 'Solaris: Login session succeeded.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: ^login
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-6102
tags:
  - attack.t1078
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-6103
  wazuh_level: 3