title: 'Solaris: Login session failed.'
id: a6e3afb0-7c29-5f4a-aaca-54b64454f782
status: stable
level: low
description: 'Solaris: Login session failed.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: ^login
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-6101
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-6104
  wazuh_level: 5