title: 'SonicWall: Multiple firewall warning messages.'
id: 304f07a7-476f-549d-b153-47454d543fc8
status: stable
level: high
description: 'SonicWall: Multiple firewall warning messages.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  - type: aggregation
    window:
      maxspan: 120s
    condition:
      field: event_count
      operator: '>='
      value: 8
    ignore_window: 60s
  - type: sequence
    parent_rule: wazuh-4804
    window:
      maxspan: 120s
    enforce_order: true
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-4850
  wazuh_level: 10