title: SonicWall critical message.
id: 5997cf57-b92b-5672-9a98-97be3f74bef4
status: stable
level: medium
description: SonicWall critical message.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-4800
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-4802
  wazuh_level: 8