title: SQL injection attempt.
id: a61dcbaa-1b17-575f-8432-090ff00f727b
status: stable
level: medium
description: SQL injection attempt.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-31100,31108
tags:
  - attack.t1190
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-31103
  wazuh_level: 7