title: SQL Server process ID.
id: 4bae0ed8-ef50-59b6-9da4-6209e815235f
status: stable
level: low
description: SQL Server process ID.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: Server process ID is
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-85000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-85003
  wazuh_level: 3