title: 'sshd: connection reset'
id: 79ff96b2-990b-550e-92ad-9b23a656b6ca
status: stable
level: low
description: 'sshd: connection reset'
author: Wazuh, Inc.
logsource:
  product: macos
detection:
  selection:
    message|contains: Connection reset
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-64250
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-64259
  wazuh_level: 4