title: 'sshd: SSHD is not accepting connections.'
id: d99322be-c760-5086-abe8-6f02bd367cb5
status: stable
level: low
description: 'sshd: SSHD is not accepting connections.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|re: 'error: connect to \S+ port \d+ failed: Connection refused'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-5700
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-5730
  wazuh_level: 4