title: Successful login during weekend.
id: 66ba7edc-4f89-5020-b85b-d40e20e55e22
status: stable
level: medium
description: Successful login during weekend.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_group: authentication_success
tags:
  - attack.t1078
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-17102
  wazuh_level: 9