title: Successful login during non-business hours.
id: a4291f75-3574-57f2-8d9a-b51b9b6df812
status: stable
level: medium
description: Successful login during non-business hours.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_group: authentication_success
tags:
  - attack.t1078
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-17101
  wazuh_level: 9