title: 'Suricata: Alert - $(alert.signature)'
id: 3c4b24d6-c9e7-52fc-af05-24158cd28dbb
status: stable
level: low
description: 'Suricata: Alert - $(alert.signature)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    event_type: ^alert$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-86600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-86601
  wazuh_level: 3