title: Suspicious URL access.
id: 84ca06d0-2ada-5531-a471-5e3865793284
status: stable
level: medium
description: Suspicious URL access.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-31100
tags:
  - attack.t1055
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-31516
  wazuh_level: 6