title: 'Symantec-WS: Admin Login success to the web proxy.'
id: 0248ee10-e379-5180-87f2-6af7777706b3
status: stable
level: low
description: 'Symantec-WS: Admin Login success to the web proxy.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-7415
tags:
  - attack.t1078
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-7420
  wazuh_level: 3