title: 'Symantec-WS: Login success accessing the web proxy.'
id: ddfe7cc3-5474-5b2f-8394-fcebf5d465d8
status: stable
level: low
description: 'Symantec-WS: Login success accessing the web proxy.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-7400
tags:
  - attack.t1078
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-7415
  wazuh_level: 3