title: 'The file limit set for this agent is $(file_limit). Now, $(file_count) files are being monitored.'
id: 9795b018-9899-5bbe-839b-05b507e5ee91
status: stable
level: low
description: 'The file limit set for this agent is $(file_limit). Now, $(file_count) files are being monitored.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    alert_type: normal
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-230
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-234
  wazuh_level: 3