title: The quarantine has been purged
id: 99b6d3e6-06c3-5c94-90f0-7e3ad6d70b28
status: stable
level: low
description: The quarantine has been purged
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    win.system.eventID: ^4142$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-60600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-90538
  wazuh_level: 4