title: The start of the software update controller failed
id: b7c6abc9-aa5e-50bc-b173-4ce5aeb810f7
status: stable
level: low
description: The start of the software update controller failed
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    win.system.eventID: ^4116$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-60600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-90518
  wazuh_level: 5