title: The audit log was cleared
id: fcd37b0e-60b0-51e0-a292-d6d163cce06e
status: stable
level: low
description: The audit log was cleared
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-18101
tags:
  - attack.t1070
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-83200
  wazuh_level: 5