title: The transfer of one or more threatNet files failed
id: 23e4edc8-40bb-5c5f-b2f5-8bbdb0710d87
status: stable
level: low
description: The transfer of one or more threatNet files failed
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    win.system.eventID: ^4102$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-60600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-90505
  wazuh_level: 5