title: 'Trend: Virus scan passed by found potential security risk.'
id: 1cb40767-282e-5d22-b332-dee5fd76a67e
status: stable
level: low
description: 'Trend: Virus scan passed by found potential security risk.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-7600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-7613
  wazuh_level: 5