title: 'TSIG Signature Failure with source IP $(gcp.jsonPayload.sourceIP) from $(gcp.resource.labels.location), severity $(gcp.severity)'
id: 4aa07993-cc3e-59df-9834-21b76081e0c1
status: stable
level: medium
description: 'TSIG Signature Failure with source IP $(gcp.jsonPayload.sourceIP) from $(gcp.resource.labels.location), severity $(gcp.severity)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    gcp.jsonPayload.responseCode: ^BADSIG$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-65002,65003
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-65031
  wazuh_level: 7