title: 'Unable to interpret query with source IP $(gcp.jsonPayload.sourceIP) from $(gcp.resource.labels.location), severity $(gcp.severity)'
id: fa0216ae-7529-5a49-bccf-c6c1796b14c6
status: stable
level: low
description: 'Unable to interpret query with source IP $(gcp.jsonPayload.sourceIP) from $(gcp.resource.labels.location), severity $(gcp.severity)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    gcp.jsonPayload.responseCode: ^FORMERR$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-65002,65003
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-65021
  wazuh_level: 5