title: 'Unable to resolve domain name with source IP $(gcp.jsonPayload.sourceIP) from $(gcp.resource.labels.location), severity $(gcp.severity)'
id: ceb554ec-bdce-588b-8573-1ee34b2e6cc8
status: stable
level: low
description: 'Unable to resolve domain name with source IP $(gcp.jsonPayload.sourceIP) from $(gcp.resource.labels.location), severity $(gcp.severity)'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    gcp.jsonPayload.responseCode: ^NXDOMAIN$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-65002,65003
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-65019
  wazuh_level: 5