title: Unable to perform zone transfer.
id: 75f56018-3388-5dd3-bca6-38e65803246f
status: stable
level: medium
description: Unable to perform zone transfer.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|re: ^transfer of \S+ from \S+ failed while receiving \S+ REFUSED
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-12111
  wazuh_level: 8