title: 'Unbound: Notice grouping.'
id: a63af0fe-ac7d-5767-acb1-c10cb5a6eaaa
status: stable
level: informational
description: 'Unbound: Notice grouping.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: 'notice:'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-500000
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-500001
  wazuh_level: 1