title: Unexpected error while resolving domain.
id: 82f11578-4ccf-519f-b8ee-f8a88bb94d5f
status: stable
level: low
description: Unexpected error while resolving domain.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: unexpected RCODE
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-12100
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-12105
  wazuh_level: 4