title: URL too long. Higher than allowed on most
id: e67f7205-37c8-5622-b482-4486e7585079
status: stable
level: critical
description: URL too long. Higher than allowed on most
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-31100
tags:
  - attack.t1499
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-31115
  wazuh_level: 13