title: Vipre was unable to complete the check for threat definitions updates
id: 08774108-2f41-51ae-bc97-032726e331b6
status: stable
level: low
description: Vipre was unable to complete the check for threat definitions updates
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    win.system.eventID: ^4123$
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-60600
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-90521
  wazuh_level: 4