title: 'VirusTotal: Alert - No records in VirusTotal database'
id: 5357b10e-d3e2-5bc7-a102-154d0955533e
status: stable
level: low
description: 'VirusTotal: Alert - No records in VirusTotal database'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    virustotal.found: 0
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87100
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87103
  wazuh_level: 3