title: 'VirusTotal: Error: Public API request rate limit reached'
id: 7d7a2a36-f29a-563c-ae8e-8f5cdaa79cef
status: stable
level: low
description: 'VirusTotal: Error: Public API request rate limit reached'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    virustotal.error: 204
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87100
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87101
  wazuh_level: 3