title: 'VirusTotal: Alert - $(virustotal.source.file) - No positives found'
id: 2070d7fa-4ee7-5176-b924-e5a491bbb643
status: stable
level: low
description: 'VirusTotal: Alert - $(virustotal.source.file) - No positives found'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    virustotal.found: 1
    virustotal.malicious: 0
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87100
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87104
  wazuh_level: 3