title: 'VirusTotal: Alert - $(virustotal.source.file) - $(virustotal.positives) engines detected this file'
id: 61eb6f11-8a31-5e78-9966-bcbd7998e72d
status: stable
level: high
description: 'VirusTotal: Alert - $(virustotal.source.file) - $(virustotal.positives) engines detected this file'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    virustotal.malicious: 1
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87100
tags:
  - attack.t1203
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87105
  wazuh_level: 12