title: 'VirusTotal: Error: Check credentials'
id: 9c358bd9-5ede-5e12-82b6-ae0cf935565f
status: stable
level: low
description: 'VirusTotal: Error: Check credentials'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    virustotal.error: 403
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-87100
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-87102
  wazuh_level: 3