title: 'vpopmail: Attempt to login to vpopmail with invalid username.'
id: 3e84a270-26d1-5667-a015-5e817aeaa3bf
status: stable
level: low
description: 'vpopmail: Attempt to login to vpopmail with invalid username.'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: vpopmail user not found
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-9900
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-9902
  wazuh_level: 5