title: 'vsftpd: Multiple FTP connection attempts from'
id: e4630a93-6c7e-5793-8a03-606faad9d52a
status: stable
level: high
description: 'vsftpd: Multiple FTP connection attempts from'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|exists: true
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  - type: aggregation
    window:
      maxspan: 60s
    by:
      - source.ip
    condition:
      field: event_count
      operator: '>='
      value: 12
  - type: sequence
    parent_rule: wazuh-11401
    window:
      maxspan: 60s
    enforce_order: true
tags:
  - attack.t1110
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-11452
  wazuh_level: 10