title: VShell user used the maximum number of password attempts.
id: d0e8fa53-323d-5741-8bae-d6d01595c186
status: stable
level: medium
description: VShell user used the maximum number of password attempts.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|re: Maximum authentication retries for user (\w+) exceeded
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-86802
tags:
  - attack.t1110
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-86803
  wazuh_level: 7