title: Wordpress authentication succeeded.
id: 06703579-a295-5f80-b667-7b3b377ba00b
status: stable
level: low
description: Wordpress authentication succeeded.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|contains: User logged in
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-9500
tags:
  - attack.t1078
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-9502
  wazuh_level: 3