title: 'Zeek: SSH Connection'
id: 2cd4fc5e-b838-58cc-8c5f-46ecdbc62a3c
status: stable
level: low
description: 'Zeek: SSH Connection'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    bro_engine: SSH
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-66001
  wazuh_level: 5