title: 'Zeek: Connection detail'
id: 73152329-84de-5c44-bff3-e212f65b4694
status: stable
level: low
description: 'Zeek: Connection detail'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    bro_engine: CONN
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-66004
  wazuh_level: 5