title: 'Zeek: DNS Query'
id: f44caeaf-36d1-52a4-ad1f-2b08b1b49752
status: stable
level: low
description: 'Zeek: DNS Query'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    bro_engine: DNS
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-66003
  wazuh_level: 5