title: 'Zeek: SSL Connection'
id: 5b9c0e86-e0ed-5853-8129-5f1fb5d48e4b
status: stable
level: low
description: 'Zeek: SSL Connection'
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    bro_engine: SSL
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-66002
  wazuh_level: 5