title: Zeus fatal log.
id: 1ef8ec64-eda5-5ad5-87e8-5c2f6eefebfc
status: stable
level: high
description: Zeus fatal log.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|re: '^[\S+ \S+] FATAL:'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-31200
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-31204
  wazuh_level: 12