title: Zeus warning log.
id: 535d3f2f-4285-5ebe-b42b-74e8ed375e68
status: stable
level: low
description: Zeus warning log.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|re: '^[\S+ \S+] WARN:'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-31200
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-31202
  wazuh_level: 4