title: Zone transfer error.
id: 9e71b8d4-0fdf-58d8-bb14-5e15467a3529
status: stable
level: low
description: Zone transfer error.
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|re: '^zone \S+: expired'
  condition: selection
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-12112
  wazuh_level: 4