title: Zone has been removed from a master server
id: 85f295aa-810b-57f4-b550-21efe3e2aba3
status: stable
level: informational
description: Zone has been removed from a master server
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|re: 'zone \S+: \(master\) removed'
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-12100
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-12121
  wazuh_level: 1