title: zone transfer denied
id: d9d079e8-7cf5-514c-93e6-21924e9929bb
status: stable
level: informational
description: zone transfer denied
author: Wazuh, Inc.
logsource:
  product: wazuh
detection:
  selection:
    message|re: zone transfer \S+ denied
  condition: selection

# Sigma+ Extensions (for advanced detection)
extensions:
  parent_rule: wazuh-12100
references:
  - https://github.com/wazuh/wazuh
  - https://documentation.wazuh.com/current/user-manual/ruleset/custom.html
custom_attributes:
  wazuh_rule_id: wazuh-12145
  wazuh_level: 1