title: API access to mailboxes for top N messages via the Microsoft Graph
id: 7117ff36-3cbb-59fd-a658-acb4c56c510c
status: experimental
level: medium
description: Identify when mailboxes are being accessed with requests for N number of messages
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: NETWORK_HTTP
    metadata_product_event_type: Microsoft Graph Activity
    network_http_method: GET
    network_http_user_agent: PowerShell
  condition: selection
custom_attributes:
  original_rule_id: mr_4c2e1d84-5569-4bde-a9ad-d747b6fb84bf
  source_format: chronicle_yaral