title: AWS GuardDuty Cryptocurrency Activity Detected
id: 6059afb7-c6e8-5aa9-a494-09ba47cf38fc
status: experimental
level: high
description: Amazon GuardDuty detects CryptoCurrency activity in Amazon EC2, AWS Lambda or Amazon EKS Runtimes.
author: Google Cloud Security
logsource:
  product: aws
detection:
  selection:
    metadata_vendor_name: AMAZON
    metadata_product_name: AWS GuardDuty
    metadata_product_event_type: CryptoCurrency|CryptoMinerExecuted|BitcoinDomainRequest
  condition: selection
tags:
  - attack.t1496
custom_attributes:
  original_rule_id: mr_be21d1ff-4d2b-4d0b-a928-0fa5d534cba5
  source_format: chronicle_yaral