title: AWS EC2 High Number Of API Calls
id: 3c9bdb12-0d56-5f4b-89e5-37d1739ed4e9
status: experimental
level: low
description: Detect when an EC2 instance makes high number of API calls.
author: Google Cloud Security
logsource:
  product: aws
detection:
  selection:
    metadata_vendor_name: AMAZON
    metadata_product_name: AWS CloudTrail
    principal_resource_type: AssumedRole
    principal_user_userid: \
  condition: selection
tags:
  - attack.t1580
custom_attributes:
  original_rule_id: mr_d19289e1-4385-4757-bf54-0f61e7a789a4
  source_format: chronicle_yaral