title: AWS GuardDuty Malicious Or Suspicious File Executed
id: 1773df3b-7f0c-593f-bf98-f3fda540b2be
status: experimental
level: high
description: |
  Amazon GuardDuty detects a malicious or suspicious file on an Amazon EC2 instance or a container workload.
author: Google Cloud Security
logsource:
  product: aws
  category: file_event
detection:
  selection:
    metadata_vendor_name: AMAZON
    metadata_product_name: AWS GuardDuty
    metadata_product_event_type: MaliciousFile|SuspiciousFile
  condition: selection
tags:
  - attack.t1204
custom_attributes:
  original_rule_id: mr_a5d8f51c-d0de-4169-99e2-d3eaa02b266c
  source_format: chronicle_yaral