title: AWS API Call Outside Of Organization
id: 662e602e-184a-57cd-acb9-d612da03d235
status: experimental
level: high
description: Detects API Calls from AWS accounts that are not part of the organization.
author: Google Cloud Security
logsource:
  product: aws
detection:
  selection:
    metadata_vendor_name: AMAZON
    metadata_product_name: AWS CloudTrail
  condition: selection
tags:
  - attack.t1078
custom_attributes:
  original_rule_id: mr_205120b7-6654-410a-ab6d-e40484e2fafb
  source_format: chronicle_yaral