title: AWS IAM Compromised Key Quarantine Policy Attached
id: b3e17cbb-df62-5b27-b476-3d52036ff76f
status: experimental
level: high
description: |
  Detect when the AWS managed policy AWSCompromisedKeyQuarantine has been attached to a user, role, or group. It is applied by the AWS team in the event that the credentials of an IAM user has been compromised or publicly exposed.
author: Google Cloud Security
logsource:
  product: aws
detection:
  selection:
    metadata_vendor_name: AMAZON
    metadata_product_name: AWS CloudTrail
    metadata_product_event_type:
      - AttachUserPolicy
      - AttachGroupPolicy
      - AttachRolePolicy
    security_result_action: ALLOW
    target_resource_name: AWSCompromisedKeyQuarantine
  condition: selection
tags:
  - attack.t1552
custom_attributes:
  original_rule_id: mr_3ac90268-e8bd-41b7-8fc1-e10ee165df8e
  source_format: chronicle_yaral