title: AWS GuardDuty Bruteforce Activity Detected
id: cf42fd5c-0405-5eef-83f2-6d14391cab6c
status: experimental
level: high
description: Amazon GuardDuty detects a brute force activity in an Amazon EC2 or Amazon RDS instance.
author: Google Cloud Security
logsource:
  product: aws
detection:
  selection:
    metadata_vendor_name: AMAZON
    metadata_product_name: AWS GuardDuty
    metadata_product_event_type: BruteForce
  condition: selection
tags:
  - attack.t1110
custom_attributes:
  original_rule_id: mr_33197748-cb9d-451f-8135-4b61cc5e4ca5
  source_format: chronicle_yaral