title: AWS Successful Console Authentication From Multiple IPs
id: 8ec30116-999f-5503-a2bf-280bcebc77cf
status: experimental
level: medium
description: |
  Detects when an AWS user successfully authenticating from more than one unique IP address within 5 minutes.
author: Google Cloud Security
logsource:
  product: aws
  category: authentication
detection:
  selection:
    metadata_vendor_name: AMAZON
    metadata_product_name: AWS CloudTrail
    metadata_event_type: USER_LOGIN
    metadata_product_event_type: ConsoleLogin
    security_result_action: ALLOW
  condition: selection
tags:
  - attack.t1586
custom_attributes:
  original_rule_id: mr_4a221c43-1059-4247-a7a6-69d8ce4dca2c
  source_format: chronicle_yaral