title: AWS GuardDuty Penetration Testing Activity Detected
id: 89713dcf-a71e-5565-8150-59bb86f95d06
status: experimental
level: high
description: |
  Amazon GuardDuty detects penetration testing activity from known offensive security distros such as KaliLinux, ParrotLinux or PentooLinux.
author: Google Cloud Security
logsource:
  product: linux
detection:
  selection:
    metadata_vendor_name: AMAZON
    metadata_product_name: AWS GuardDuty
    metadata_product_event_type: PenTest
  condition: selection
tags:
  - attack.t1588
custom_attributes:
  original_rule_id: mr_7dac6e7c-9d35-4093-9b85-4b0175e8bee7
  source_format: chronicle_yaral