title: AWS Delete VPC Flow Logs
id: 0dd6319c-ddc0-5210-bb62-8a82867ee7b0
status: experimental
level: low
description: Detects when AWS VPC FLow Logs are deleted.
author: Google Cloud Security
logsource:
  product: aws
  category: file_event
detection:
  selection:
    metadata_vendor_name: AMAZON
    metadata_product_name: AWS CloudTrail
    metadata_product_event_type: DeleteFlowLogs
    security_result_action: ALLOW
  condition: selection
tags:
  - attack.t1562
custom_attributes:
  original_rule_id: mr_b833ecbb-a3fb-4ea6-97dd-2c861c92620b
  source_format: chronicle_yaral