title: AWS Lateral Movement Using IAM Session Token
id: 1249ea57-bc6d-56c4-8b27-e15fce48bf34
status: experimental
level: low
description: Detect when an IAM session token is created and used from a different IP.
author: Google Cloud Security
logsource:
  product: aws
detection:
  selection:
    metadata_vendor_name: AMAZON
    metadata_product_name: AWS CloudTrail
    metadata_product_event_type: GetSessionToken
    security_result_action: ALLOW
  condition: selection
tags:
  - attack.t1550
custom_attributes:
  original_rule_id: mr_ac0df875-fe5b-49af-bf2a-3da341177754
  source_format: chronicle_yaral