title: AWS EC2 Get Windows Admin Password
id: 260006cd-e884-538d-aede-542d78c4f724
status: experimental
level: high
description: |
  Detects a successful attempt to retrieve the encrypted Administrator password for a Windows EC2 instance.
author: Google Cloud Security
logsource:
  product: windows
  category: authentication
detection:
  selection:
    metadata_vendor_name: AMAZON
    metadata_product_name: AWS CloudTrail
    metadata_product_event_type: GetPasswordData
    security_result_action: ALLOW
  condition: selection
tags:
  - attack.t1555
custom_attributes:
  original_rule_id: mr_92364192-b3c7-4e5d-a1a1-eb7b3adbd0e4
  source_format: chronicle_yaral