title: AWS CloudTrail Logging Tampered
id: 01b7ad0e-8ce9-5515-9780-9244dc9319a9
status: experimental
level: high
description: Detects when CloudTrail logging is updated, stopped or deleted.
author: Google Cloud Security
logsource:
  product: aws
detection:
  selection:
    metadata_vendor_name: AMAZON
    metadata_product_name: AWS CloudTrail
    metadata_product_event_type:
      - UpdateTrail
      - StopLogging
      - DeleteTrail
      - PutEventSelectors
    security_result_action: ALLOW
  condition: selection
tags:
  - attack.t1562
custom_attributes:
  original_rule_id: mr_86f08675-4130-4b47-8978-067c18c8cb55
  source_format: chronicle_yaral