title: AWS Password Policy Change
id: 385000b5-84f8-5c91-9813-6bc95455c96d
status: experimental
level: medium
description: Detects when an existing password policy is updated or deleted in an AWS account.
author: Google Cloud Security
logsource:
  product: aws
  category: authentication
detection:
  selection:
    metadata_vendor_name: AMAZON
    metadata_product_name: AWS CloudTrail
    metadata_product_event_type:
      - UpdateAccountPasswordPolicy
      - DeleteAccountPasswordPolicy
    security_result_action: ALLOW
  condition: selection
tags:
  - attack.t1201
custom_attributes:
  original_rule_id: mr_2e66b918-acfc-46ea-b625-58732558005d
  source_format: chronicle_yaral