title: AWS Successful API From Tor Exit Node
id: 3724c17f-e475-5292-896f-61344dcd061a
status: experimental
level: high
description: Detects successful API executions from a Tor exit node.
author: Google Cloud Security
logsource:
  product: aws
detection:
  selection:
    metadata_vendor_name: AMAZON
    metadata_product_name: AWS CloudTrail
    security_result_action: ALLOW
  condition: selection
tags:
  - attack.t1204
custom_attributes:
  original_rule_id: mr_17232c2a-188e-4d6e-85b6-836cdc779655
  source_format: chronicle_yaral