title: AWS GuardDuty Black Hole Traffic Detected
id: b1578cbd-5e06-5746-8205-f2a8b92b2b7a
status: experimental
level: high
description: |
  Amazon GuardDuty detects an Amazon EC2 instance or a container attempting to communicate with a black hole IP address.
author: Google Cloud Security
logsource:
  product: aws
detection:
  selection:
    metadata_vendor_name: AMAZON
    metadata_product_name: AWS GuardDuty
    metadata_product_event_type: BlackholeTraffic
  condition: selection
tags:
  - attack.t1071
custom_attributes:
  original_rule_id: mr_8ac55f38-9c11-4f51-89cd-c40e9b6238b3
  source_format: chronicle_yaral