title: AWS GuardDuty Command And Control Activity Detected
id: f509fae7-d90a-5a66-93cb-a9a9b2d1ac5e
status: experimental
level: high
description: |
  Amazon GuardDuty detects Command and control activity in Amazon EC2, AWS Lambda or Amazon EKS Runtimes.
author: Google Cloud Security
logsource:
  product: aws
  category: process_creation
detection:
  selection:
    metadata_vendor_name: AMAZON
    metadata_product_name: AWS GuardDuty
    metadata_product_event_type: C&CActivity
  condition: selection
tags:
  - attack.t1071
custom_attributes:
  original_rule_id: mr_dc0c33c7-35e3-44e2-b149-99212f3e54c6
  source_format: chronicle_yaral