title: AWS GuardDuty Denial Of Service Activity Detected
id: f60f04ce-ceb3-5fbb-863d-bbf194335aa8
status: experimental
level: high
description: Amazon GuardDuty detects a Denial of Service (DoS) activity in an Amazon EC2 instance.
author: Google Cloud Security
logsource:
  product: aws
detection:
  selection:
    metadata_vendor_name: AMAZON
    metadata_product_name: AWS GuardDuty
    metadata_product_event_type: DenialOfService
  condition: selection
tags:
  - attack.t1498
custom_attributes:
  original_rule_id: mr_63e3f20f-95f5-4caa-b471-ec53d5de2d28
  source_format: chronicle_yaral