title: AWS GuardDuty Tor Network Activity Detected
id: 2f4bd5ce-1bd8-54ba-9871-f6ddcfd2c125
status: experimental
level: high
description: Amazon GuardDuty detects Tor Network activity in an AWS account.
author: Google Cloud Security
logsource:
  product: aws
  category: network_connection
detection:
  selection:
    metadata_vendor_name: AMAZON
    metadata_product_name: AWS GuardDuty
    metadata_product_event_type: TorIPCaller|TorRelay|TorClient
  condition: selection
tags:
  - attack.t1090
custom_attributes:
  original_rule_id: mr_abbc8f85-d4a3-4579-b444-19e6944f49d1
  source_format: chronicle_yaral