title: AWS GuardDuty DGA Domain Activity Detected
id: 3da8849a-35d4-5202-977c-82b3ac93f3eb
status: experimental
level: high
description: |
  Amazon GuardDuty detects an Amazon EC2 instance or a container querying algorithmically generated domains (DGA).
author: Google Cloud Security
logsource:
  product: aws
detection:
  selection:
    metadata_vendor_name: AMAZON
    metadata_product_name: AWS GuardDuty
    metadata_product_event_type: DGADomainRequest
  condition: selection
tags:
  - attack.t1568
custom_attributes:
  original_rule_id: mr_52851fd2-be35-4eda-82b3-541edc5c2196
  source_format: chronicle_yaral