title: Base64 Encoded PowerShell Command Detected
id: 17e77ece-d629-5aee-b0f6-39db8b6d2bd3
status: experimental
level: high
description: |
  Detects usage of the \"FromBase64String\" function in the commandline which is used to decode a base64 encoded string
author: Florian Roth (Nextron Systems)
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_frombase64string.yml
custom_attributes:
  original_rule_id: mr_a3603334-35e3-4050-b94e-f79aeccb899a
  source_format: chronicle_yaral