title: ConvertTo-SecureString Cmdlet Usage Via CommandLine
id: 983387a3-ca8d-58b2-abcc-18477b9478eb
status: experimental
level: medium
description: |
  Detects usage of the \"ConvertTo-SecureString\" cmdlet via the commandline. Which is fairly uncommon and could indicate potential suspicious activity
author: Teymur Kheirkhabarov (idea), Vasiliy Burov (rule), oscd.community, Tim Shelton
logsource:
  product: gcp
  category: process_creation
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
    src_process_file_full_path:
      - powershell.exe
      - pwsh.dll
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_cmdline_convertto_securestring.yml
custom_attributes:
  original_rule_id: mr_e637bcef-5047-4ef6-a51d-2108ce1ee0b5
  source_format: chronicle_yaral