title: Cred Dump Tools Dropped Files
id: 50f964d8-a94c-5fbf-a095-6c396f1daea2
status: experimental
level: high
description: |
  Files with well-known filenames (parts of credential dump software or files produced by them) creation
author: Teymur Kheirkhabarov, oscd.community
logsource:
  product: gcp
  category: file_event
detection:
  selection:
    metadata_event_type: FILE_CREATION
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_cred_dump_tools_dropped_files.yml
custom_attributes:
  original_rule_id: mr_1ba84a4c-c6cf-49ee-902d-5e9e6efcaac0
  source_format: chronicle_yaral