title: Credential Dumping Attempt Via WerFault
id: b7a308a6-e6d6-59b3-98b3-acdcd1cce215
status: experimental
level: high
description: |
  Detects process LSASS memory dump using Mimikatz, NanoDump, Invoke-Mimikatz, Procdump or Taskmgr based on the CallTrace pointing to ntdll.dll, dbghelp.dll or dbgcore.dll for win10, server2016 and up
author: Florian Roth (Nextron Systems)
logsource:
  product: gcp
  category: authentication
detection:
  selection:
    metadata_event_type: PROCESS_OPEN
    target_resource_name: 0x1FFFFF
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_access/proc_access_win_lsass_werfault.yml
custom_attributes:
  original_rule_id: mr_b3448ab7-b1a2-41f7-9cd4-151c3cb2e2d6
  source_format: chronicle_yaral