title: CurrentVersion Autorun Keys Modification
id: 5cbe398f-052d-573b-8e96-765459675e99
status: experimental
level: medium
description: Detects modification of autostart extensibility point (ASEP) in registry
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin, oscd.community, Tim Shelton, frack113 (split)
logsource:
  product: windows
detection:
  selection:
    metadata_event_type: REGISTRY_MODIFICATION
    target_registry_registry_value_data:
      - (Empty)
      - 'C:\\Program Files\\Opera\\assistant\\browser_assistant.exe'
      - \
      - \
      - 'C:\\Program Files\\Greenshot\\Greenshot.exe'
      - {CFE8B367-77A7-41D7-9C90-75D16D7DC6B6}
      - {A8E52322-8734-481D-A7E2-27B309EF8D56}
      - {C973DA94-CBDF-4E77-81D1-E5B794FBD146}
      - {51EF1569-67EE-4AD6-9646-E726C3FFC8A2}
      - ctfmon.exe /n
      - \
      - \
      - {472083B0-C522-11CF-8763-00608CC02F24}
      - 'C:\\Program Files\\Aurora-Agent\\tools\\aurora-dashboard.exe'
    principal_process_file_full_path:
      - 'C:\\WINDOWS\\system32\\devicecensus.exe'
      - 'C:\\Windows\\system32\\winsat.exe'
      - 'C:\\Program Files\\Microsoft OneDrive\\StandaloneUpdater\\OneDriveSetup.exe'
      - 'C:\\Program Files\\Microsoft OneDrive\\Update\\OneDriveSetup.exe'
      - 'C:\\Program Files (x86)\\Microsoft OneDrive\\Update\\OneDriveSetup.exe'
      - 'C:\\Program Files\\KeePass Password Safe 2\\ShInstUtil.exe'
      - 'C:\\Program Files\\Everything\\Everything.exe'
      - 'C:\\Program Files (x86)\\Microsoft Office\\root\\integration\\integrator.exe'
      - 'C:\\Windows\\system32\\LogonUI.exe'
      - 'C:\\Windows\\system32\\regsvr32.exe'
      - 'C:\\Program Files\\Windows Defender\\MsMpEng.exe'
      - 'C:\\Windows\\system32\\userinit.exe'
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_set/registry_set_asep_reg_keys_modification_currentversion.yml
custom_attributes:
  original_rule_id: mr_711750f0-0bf3-4c89-b771-65a1ed6aad05
  source_format: chronicle_yaral