title: Direct Autorun Keys Modification
id: 1bfc35cb-6550-5e42-a911-588bfceeb854
status: experimental
level: medium
description: Detects direct modification of autostart extensibility point (ASEP) in registry using reg.exe
author: Victor Sergeev, Daniil Yugoslavskiy, oscd.community
logsource:
  product: windows
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_direct_asep_registry_keys_modification.yml
custom_attributes:
  original_rule_id: mr_b031bea5-d00b-43ae-a74c-b4df380262e8
  source_format: chronicle_yaral