title: DNS Query To Recently Created Domain
id: 49f7b7bb-ecbe-5246-87f5-c2b33234c9ea
status: experimental
level: low
description: DNS query to a recently created domain
author: Google Cloud Security
logsource:
  product: gcp
  category: network_connection
detection:
  selection:
    metadata_event_type: NETWORK_DNS
  condition: selection
custom_attributes:
  original_rule_id: mr_a5cff3f1-8092-48a0-b4a3-f3f856299474
  source_format: chronicle_yaral