title: Domain Prevalence
id: c9ac3870-964e-54b0-be81-b6d7aabfa680
status: experimental
level: low
description: Detects DNS events querying domains that have a low rolling max prevalence.
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: NETWORK_DNS
  condition: selection
custom_attributes:
  original_rule_id: mr_cf5dd851-d7e9-42b8-baf9-f4527ab61bf3
  source_format: chronicle_yaral