title: Entra ID Successful Group Deletion
id: 1c666caf-0149-57ca-9453-2e3f84ec4230
status: experimental
level: low
description: Detects when a group is deleted.
author: Google Cloud Security
logsource:
  product: azure
detection:
  selection:
    metadata_event_type: GROUP_DELETION
    metadata_product_event_type: Delete group
    metadata_product_name: Azure AD Directory Audit
    metadata_vendor_name: Microsoft
    security_result_action: ALLOW
  condition: selection
custom_attributes:
  original_rule_id: mr_d6a3162a-3ec5-45c1-a7cd-ff2988582924
  source_format: chronicle_yaral