title: GCP Admin Privileged Roles Added To Service Accounts
id: 5208de39-9ec5-5412-ac5c-021e0f529fd2
status: experimental
level: low
description: Detect when admin privileged roles such as Owner or Editor are added to a Service Account.
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: USER_RESOURCE_UPDATE_PERMISSIONS
    metadata_log_type: GCP_CLOUDAUDIT
    metadata_product_event_type: SetIamPolicy
    security_result_action: ALLOW
  condition: selection
tags:
  - attack.t1098
custom_attributes:
  original_rule_id: mr_9ffebc73-6d73-40bd-8973-2d53a810272f
  source_format: chronicle_yaral