title: GCP Service Account Key Used From Multiple Countries
id: 503990bf-84c9-53e8-85fd-9ea5175fd6de
status: experimental
level: low
description: Detects usage of service account key from multiple countries using Chronicle GeoIP enrichment.
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_log_type: GCP_CLOUDAUDIT
    security_result_action: ALLOW
  condition: selection
tags:
  - attack.t1552
custom_attributes:
  original_rule_id: mr_dbc9cf09-7c2d-4c9e-b9d4-60df60f360a1
  source_format: chronicle_yaral