title: GCP Successful API Call From Tor Exit Node
id: 8f219be3-c996-5b49-a6d9-a0227b3ba38a
status: experimental
level: high
description: Detects successful API executions from a Tor exit node.
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_log_type: GCP_CLOUDAUDIT
    security_result_action: ALLOW
  condition: selection
tags:
  - attack.t1204
custom_attributes:
  original_rule_id: mr_5912e2be-4366-4f34-a770-0ac8358f2cb9
  source_format: chronicle_yaral