title: GCP Excessive Permission Denied Events
id: 78a66758-25e6-5624-89ab-42cd5330363f
status: experimental
level: low
description: Detects excessive PermissionDenied events within an hour timeframe from a user
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_log_type: GCP_CLOUDAUDIT
    security_result_action: BLOCK
    security_result_severity: ERROR
  condition: selection
tags:
  - attack.t1580
custom_attributes:
  original_rule_id: mr_2edbd86a-703a-41a3-b2b2-596dd9dbed8d
  source_format: chronicle_yaral