title: GCP Multiple Secrets Deleted
id: e3a4754f-bc65-563b-b4fa-83b26b01e857
status: experimental
level: high
description: Detect when multiple secrets or secret versions are deleted from GCP Secret Manager.
author: Google Cloud Security
logsource:
  product: gcp
  category: file_event
detection:
  selection:
    metadata_log_type: GCP_CLOUDAUDIT
    metadata_product_event_type:
      - google.cloud.secretmanager.v1.SecretManagerService.DestroySecretVersion
      - google.cloud.secretmanager.v1.SecretManagerService.DeleteSecret
    target_application: secretmanager.googleapis.com
    security_result_action: ALLOW
  condition: selection
tags:
  - attack.t1485
custom_attributes:
  original_rule_id: mr_c91c9fe8-6569-4764-a8d8-9b88dd3b7f77
  source_format: chronicle_yaral