title: GCTI Tor Exit Nodes
id: db544976-c096-5ad0-b174-bacc703eed95
status: experimental
level: high
description: Alert traffic destined for known Tor exit nodes
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: NETWORK_CONNECTION
    security_result_action: ALLOW
  condition: selection
custom_attributes:
  original_rule_id: mr_1d31f0e4-8cd9-4fc2-ae87-e91a435fe34f
  source_format: chronicle_yaral