title: GCTI Remote Access Tools
id: 4856a5bd-ec1f-50e4-b056-ef76059f28ef
status: experimental
level: high
description: |
  Alert process and file create events that are associated with hashes from the GCTI Remote Access Tool list
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type:
      - PROCESS_LAUNCH
      - PROCESS_MODULE_LOAD
      - PROCESS_UNCATEGORIZED
      - FILE_CREATION
  condition: selection
custom_attributes:
  original_rule_id: mr_d838d64d-4a6f-4999-a895-0b5771d02aa6
  source_format: chronicle_yaral