title: GCTI Benign Binaries Contacts Tor Exit Node
id: 6e1a8641-e8a2-5bb1-8e53-b030a5621c2e
status: experimental
level: high
description: Alert on Benign Binary contacting a TOR IP
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: NETWORK_CONNECTION
  condition: selection
custom_attributes:
  original_rule_id: mr_8bb13cf7-d66b-41f2-9bbc-0a1884a77f70
  source_format: chronicle_yaral