title: GeoIP User Login From Multiple States Or Countries
id: 4b8fcf28-ec25-5db4-a1a0-9ca7849a38ea
status: experimental
level: low
description: Detect multiple user logins from multiple states or countries using Chronicle GeoIP enrichment.
author: Google Cloud Security
logsource:
  product: gcp
  category: authentication
detection:
  selection:
    metadata_event_type: USER_LOGIN
    security_result_action: ALLOW
  condition: selection
custom_attributes:
  original_rule_id: mr_3fa832e4-1ac0-42cd-9f0a-357d6b8fb12f
  source_format: chronicle_yaral