title: GitHub Repository Branch Protection Rules Disabled
id: 7554cccf-4bcb-50f9-a345-1c321d2f6676
status: experimental
level: medium
description: Detects when branch protection rules are disabled for a GitHub repository.
author: Google Cloud Security
logsource:
  product: github
detection:
  selection:
    metadata_vendor_name: GITHUB
    metadata_product_name: GITHUB
    metadata_product_event_type: repository_branch_protection_evaluation.disable
  condition: selection
tags:
  - attack.t1562
references:
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise
custom_attributes:
  original_rule_id: mr_6cf2c5d1-3e94-428f-b29c-84d09c209424
  source_format: chronicle_yaral