title: GitHub Repository Visibility Changed To Public
id: fe27fe5e-9e1a-5d11-a318-fc47321ae448
status: experimental
level: high
description: Detects when the visibility for a GitHub repository is changed to public.
author: Google Cloud Security
logsource:
  product: github
detection:
  selection:
    metadata_vendor_name: GITHUB
    metadata_product_name: GITHUB
    metadata_product_event_type: repo.access
  condition: selection
references:
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise
custom_attributes:
  original_rule_id: mr_0f64f779-e61b-4827-9797-9eca5a825780
  source_format: chronicle_yaral