title: GitHub Enterprise Audit Log Stream Destroyed
id: b0e0a490-5161-5ea8-84e2-e3e0b6018b1a
status: experimental
level: high
description: |
  Detects when a GitHub audit log stream is destroyed. An adversary may attempt to destroy audit logs to erase their tracks.
author: Google Cloud Security
logsource:
  product: github
detection:
  selection:
    metadata_vendor_name: GITHUB
    metadata_product_name: GITHUB
    metadata_product_event_type: audit_log_streaming.destroy
  condition: selection
tags:
  - attack.t1562
references:
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise
custom_attributes:
  original_rule_id: mr_f86cc19d-4cbb-4ba5-97ef-1d648d53d06a
  source_format: chronicle_yaral