title: GitHub Secret Scanning Alert
id: 0125546e-e23a-555d-ac81-b905ac689a42
status: experimental
level: high
description: |
  Detects when a secret is found in a GitHub repository. Adversaries may attempt to harvest leaked/exposed secrets to further infiltrate their target's environment, maintain access, or steal data.
author: Google Cloud Security
logsource:
  product: github
detection:
  selection:
    metadata_vendor_name: GITHUB
    metadata_product_name: GITHUB
    metadata_product_event_type: secret_scanning_alert.create
  condition: selection
tags:
  - attack.t1552
references:
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise
custom_attributes:
  original_rule_id: mr_7cd99259-68ef-4b09-96a5-3130f44664b5
  source_format: chronicle_yaral