title: GitHub High Number Of Non Public GitHub Repositories Downloaded
id: 98e383cb-4e77-5338-9c3a-c3dad996de40
status: experimental
level: high
description: |
  Detects when a user downloads a high number of non-public GitHub repositories. An adversary may attempt to steal the contents of several GitHub repositories after compromising a user account.
author: Google Cloud Security
logsource:
  product: github
detection:
  selection:
    metadata_vendor_name: GITHUB
    metadata_product_name: GITHUB
    metadata_product_event_type: repo.download_zip
  condition: selection
tags:
  - attack.t1213
references:
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise
custom_attributes:
  original_rule_id: mr_549561b8-1088-4a08-b1f4-a1029a142919
  source_format: chronicle_yaral