title: GitHub Enterprise Deleted
id: c7e3951f-9a6f-54a3-8440-0c514dbc742a
status: experimental
level: high
description: Detects when a GitHub enterprise is deleted.
author: Google Cloud Security
logsource:
  product: github
  category: file_event
detection:
  selection:
    metadata_vendor_name: GITHUB
    metadata_product_name: GITHUB
    metadata_product_event_type: business.delete
  condition: selection
tags:
  - attack.t1485
references:
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise
custom_attributes:
  original_rule_id: mr_6443a51b-c381-4504-9b45-9d8b5e9531d7
  source_format: chronicle_yaral