title: GitHub User Unblocked From Accessing Organization Repositories
id: c38b9805-7b1c-5dc7-a5c3-4baad33fa288
status: experimental
level: low
description: Detects when a user is unblocked from accessing repositories within a GitHub organization.
author: Google Cloud Security
logsource:
  product: github
detection:
  selection:
    metadata_vendor_name: GITHUB
    metadata_product_name: GITHUB
    metadata_product_event_type: org.unblock_user
  condition: selection
references:
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise
custom_attributes:
  original_rule_id: mr_3a6905e8-e5e1-40af-b911-52bc4918d2ba
  source_format: chronicle_yaral