title: GitHub Secret Scanning Disabled Or Bypassed
id: a58d6036-b8aa-5a90-ad20-794d521da2ea
status: experimental
level: high
description: Detects when components of GitHub secret scanning is disabled for an enterprise or organization.
author: Google Cloud Security
logsource:
  product: github
detection:
  selection:
    metadata_vendor_name: GITHUB
    metadata_product_name: GITHUB
    metadata_product_event_type:
      - secret_scanning.disable
      - secret_scanning_new_repos.disable
      - secret_scanning_push_protection.bypass
      - business_secret_scanning_custom_pattern_push_protection.disabled
      - business_secret_scanning.disable
      - business_secret_scanning.disabled_for_new_repos
      - business_secret_scanning_push_protection_custom_message.disable
      - business_secret_scanning_push_protection.disable
      - business_secret_scanning_push_protection.disabled_for_new_repos
      - org_secret_scanning_generic_secrets.disabled
      - repository_secret_scanning.disable
      - repository_secret_scanning_generic_secrets.disabled
      - repository_secret_scanning_push_protection.disable
  condition: selection
tags:
  - attack.t1562
references:
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise
custom_attributes:
  original_rule_id: mr_982454f3-81ab-491a-b61c-bae718d6028e
  source_format: chronicle_yaral