title: GitHub Personal Access Token Auto Approve Policy Modified
id: f308c32c-0920-5a2c-ba27-ec1d57eab725
status: experimental
level: medium
description: |
  Detects when changes are made to a GitHub organization's fine-grained Personal Access Token approval policy.
author: Google Cloud Security
logsource:
  product: github
detection:
  selection:
    metadata_vendor_name: GITHUB
    metadata_product_name: GITHUB
    metadata_product_event_type:
      - auto_approve_personal_access_token_requests.disable
      - auto_approve_personal_access_token_requests.enable
      - forbid_auto_approve_personal_access_token_requests.disable
      - forbid_auto_approve_personal_access_token_requests.enable
  condition: selection
tags:
  - attack.t1562
references:
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise
custom_attributes:
  original_rule_id: mr_516c8368-2e3c-4585-afa1-c5df49b214ad
  source_format: chronicle_yaral