title: GitHub Organization Removed From Enterprise
id: fde61f66-a303-52e7-ad3e-3086ec68bbd2
status: experimental
level: medium
description: Detects when a GitHub organization is removed from an enterprise.
author: Google Cloud Security
logsource:
  product: github
detection:
  selection:
    metadata_vendor_name: GITHUB
    metadata_product_name: GITHUB
    metadata_product_event_type: business.remove_organization
  condition: selection
tags:
  - attack.t1485
references:
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise
custom_attributes:
  original_rule_id: mr_705af31b-6257-436d-830d-ad9c9e2f052c
  source_format: chronicle_yaral