title: GitHub Outgoing Organization Transfer Initiated
id: dfa2a098-2019-5894-846c-d8eb7d3229c0
status: experimental
level: low
description: |
  Detects when a GitHub organization is transferred to another enterprise account. An adversary may attempt to transfer a GitHub organization to an enterprise account they control in order to steal data.
author: Google Cloud Security
logsource:
  product: github
detection:
  selection:
    metadata_vendor_name: GITHUB
    metadata_product_name: GITHUB
    metadata_product_event_type: org.transfer_outgoing
  condition: selection
tags:
  - attack.t1537
references:
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise
custom_attributes:
  original_rule_id: mr_052eb23f-84de-43a3-b9cb-736f8770cd8d
  source_format: chronicle_yaral