title: GitHub User Blocked From Accessing Organization Repositories
id: 28e4576f-973e-599f-9f69-e6170a0ff4ff
status: experimental
level: low
description: Detects when a user is blocked from accessing repositories within a GitHub organization.
author: Google Cloud Security
logsource:
  product: github
detection:
  selection:
    metadata_vendor_name: GITHUB
    metadata_product_name: GITHUB
    metadata_product_event_type: org.block_user
  condition: selection
references:
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise
custom_attributes:
  original_rule_id: mr_f422422c-7a15-47da-accd-b499b8d0b33f
  source_format: chronicle_yaral