title: GitHub Outgoing Repository Transfer Initiated
id: dadd388f-5c92-5ee0-9639-797a74900260
status: experimental
level: high
description: Detects when a GitHub repository is transferred.
author: Google Cloud Security
logsource:
  product: github
detection:
  selection:
    metadata_vendor_name: GITHUB
    metadata_product_name: GITHUB
    metadata_product_event_type: repo.transfer_outgoing
  condition: selection
references:
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise
custom_attributes:
  original_rule_id: mr_28486f60-1be2-467c-a3e6-6105491c3226
  source_format: chronicle_yaral