title: GitHub Enterprise Audit Log Stream Modified
id: cc585021-e68f-5812-a551-b19e13d791a6
status: experimental
level: high
description: |
  Detects when a GitHub audit log stream is modified (e.g. paused, enabled, or disabled). An adversary may attempt to interrupt audit logging to erase their tracks.
author: Google Cloud Security
logsource:
  product: github
detection:
  selection:
    metadata_vendor_name: GITHUB
    metadata_product_name: GITHUB
    metadata_product_event_type: audit_log_streaming.update
  condition: selection
tags:
  - attack.t1562
references:
  - https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise
custom_attributes:
  original_rule_id: mr_6a64250e-df54-4037-80f7-1486775c6f37
  source_format: chronicle_yaral