title: Google Workspace Alerts Aggregated By Severity
id: be08704d-4934-51b2-a6a6-c3cdd444d76b
status: experimental
level: medium
description: Generates alerts based on Google Workspace alerts center and aggregates them based on severity.
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_vendor_name: Google Workspace
    metadata_product_name: Google Workspace Alerts
  condition: selection
custom_attributes:
  original_rule_id: mr_311cc4ab-627b-43a1-a744-8d7aa5e44fbf
  source_format: chronicle_yaral