title: Google Cloud identity low and medium alert escalation
id: 206e62a6-07b9-5c2c-8e04-984fce1eac40
status: experimental
level: high
description: |
  Detects when a Google Cloud identity experiences a low severity event followed by medium severity event within 24 hours.
author: Mo Mohajerani
logsource:
  product: gcp
detection:
  selection:
    metadata_product_name:
      - Security Command Center
      - Security Command Center
  condition: selection
custom_attributes:
  original_rule_id: mr_fafc6c00-aedb-4664-ae1a-5a48f3a7534d
  source_format: chronicle_yaral