title: Google Workspace New Trusted Domain Added
id: 4ff8bd33-650f-5ca0-bb17-3f51fdf1762e
status: experimental
level: high
description: |
  Identifies when a domain is added to the list of trusted domains in Google Workspace. An adversary may attempt to manipulate sharing settings for trusted domains to gain unauthorized access to sensitive files and folders within an organization.
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_vendor_name: Google Workspace
    metadata_product_name: admin
    metadata_product_event_type: ADD_TRUSTED_DOMAINS
  condition: selection
tags:
  - attack.t1562
custom_attributes:
  original_rule_id: mr_319d97c3-6f63-4a6c-9fab-e70cc3f03aaf
  source_format: chronicle_yaral