title: Google Workspace User Unsuspended
id: 66fe2dfe-cdb3-58ff-908e-1512388ee81d
status: experimental
level: medium
description: Identifies when a user account is unsuspended in Google Workspace.
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_vendor_name: Google Workspace
    metadata_product_name: admin
    metadata_product_event_type: UNSUSPEND_USER
  condition: selection
tags:
  - attack.t1078
custom_attributes:
  original_rule_id: mr_6bf3e4c9-b380-4562-9aa8-6416a9126ee1
  source_format: chronicle_yaral