title: Google Workspace Password Policy Changed
id: b45b1981-8c3e-539e-9c00-0ead1389f97b
status: experimental
level: low
description: |
  Identifies when Google Workspace password policy is changed. Security teams can monitor for changes to password policy configuration that may weaken the organization's security posture.
author: Google Cloud Security
logsource:
  product: gcp
  category: authentication
detection:
  selection:
    metadata_vendor_name: Google Workspace
    metadata_product_name: admin
    metadata_product_event_type:
      - CREATE_APPLICATION_SETTING
      - CHANGE_APPLICATION_SETTING
    security_result_category_details: APPLICATION_SETTINGS
    target_resource_name: Password Management
  condition: selection
tags:
  - attack.t1098
custom_attributes:
  original_rule_id: mr_fd63a810-800a-4c55-97d2-080fc8a0e567
  source_format: chronicle_yaral