title: Google Safebrowsing File Contacts Tor Exit Node
id: 16d091d9-9aa9-58d8-9b00-adb496ae6ec7
status: experimental
level: critical
description: A malicious file contacting a known Tor Exit Node.
author: Google Cloud Security
logsource:
  product: gcp
  category: file_event
detection:
  selection:
    metadata_event_type: NETWORK_CONNECTION
  condition: selection
custom_attributes:
  original_rule_id: mr_f6733319-50b3-477e-bad6-96bb4c14c632
  source_format: chronicle_yaral