title: Google Workspace User Ou Changed
id: 554fab31-524b-5077-915e-9fea4c0c2ddd
status: experimental
level: high
description: Identifies when a Google Workspace user account is moved between Organizational Units.
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_vendor_name: Google Workspace
    metadata_product_name: admin
    metadata_product_event_type: MOVE_USER_TO_ORG_UNIT
    security_result_category_details: USER_SETTINGS
  condition: selection
tags:
  - attack.t1098
custom_attributes:
  original_rule_id: mr_e265b499-9a83-4e7d-acf8-ae7674e1c743
  source_format: chronicle_yaral