title: Google Workspace External User Added To Group
id: 730447ab-a1f5-5555-8be9-4670650e6b70
status: experimental
level: medium
description: |
  Identifies when an external user account is added to a group in Google Workspace. Security teams can monitor for unexpected user accounts being added to Google Workspace groups to prevent unauthorized access to data.
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_vendor_name: Google Workspace
    metadata_product_name: admin
    metadata_event_type: GROUP_MODIFICATION
    metadata_product_event_type: ADD_GROUP_MEMBER
  condition: selection
tags:
  - attack.t1078
custom_attributes:
  original_rule_id: mr_c64af222-e029-4add-ac9c-b9285c5eb135
  source_format: chronicle_yaral