title: Google Workspace Malicious File Downloaded
id: e9ca0ddd-0f01-5caf-b395-48c401005194
status: experimental
level: medium
description: Identifies when a user downloads a potentially malicious file from Google Drive.
author: Google Cloud Security
logsource:
  product: gcp
  category: file_event
detection:
  selection:
    metadata_vendor_name: Google Workspace
    metadata_product_name: drive
    metadata_product_event_type:
      - download
      - view
      - copy
  condition: selection
tags:
  - attack.t1204
custom_attributes:
  original_rule_id: mr_72af4504-955b-4c61-9071-bb767c9bae88
  source_format: chronicle_yaral