title: Google Workspace File Shared From Google Drive To Free Email Domain
id: f8b34830-44b9-5804-9233-26e2e4f43a3e
status: experimental
level: high
description: |
  Identifies when a user shares a file on Google Drive with a free email domain, which may indicate data exfiltration.
author: Google Cloud Security
logsource:
  product: gcp
  category: file_event
detection:
  selection:
    metadata_vendor_name: Google Workspace
    metadata_product_name: drive
  condition: selection
tags:
  - attack.t1567
custom_attributes:
  original_rule_id: mr_054c422b-2a42-4dde-b937-e80d063f65e7
  source_format: chronicle_yaral