title: Google Safebrowsing With Prevalence
id: ae7f046d-7431-5ca5-b9b0-7e1c50c6fcb6
status: experimental
level: critical
description: Detect process launch events that correlate to Safe Browsing hash data and have low prevalence
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
custom_attributes:
  original_rule_id: mr_4b77947d-b7a5-4308-b54c-a87b2b1cb80f
  source_format: chronicle_yaral