title: Google Cloud Service Account Key Created or Uploaded
id: b5b7f3fc-2c76-5971-badc-0e4ddf655af7
status: experimental
level: medium
description: Detects when a service account key is created in or uploaded to a monitored Google Cloud project.
author: Google Cloud Security
logsource:
  product: gcp
  category: file_event
detection:
  selection:
    metadata_log_type: GCP_CLOUDAUDIT
    metadata_product_name: Google Cloud IAM
    metadata_product_event_type:
      - google.iam.admin.v1.CreateServiceAccountKey
      - google.iam.admin.v1.UploadServiceAccountKey
    security_result_action: ALLOW
  condition: selection
tags:
  - attack.t1098
references:
  - https://cloud.google.com/iam/docs/best-practices-for-managing-service-account-keys
custom_attributes:
  original_rule_id: mr_751d64b3-2aef-4c5b-bf39-abc6577f6ce8
  source_format: chronicle_yaral