title: Google Safebrowsing File Process Creation
id: fea94296-4e9a-5e19-9e01-316921efd732
status: experimental
level: critical
description: |
  Detection of process/file events that match Safe Browsing hashes, which are files deemed to be malicious
author: Google Cloud Security
logsource:
  product: gcp
  category: process_creation
detection:
  selection:
    metadata_event_type:
      - PROCESS_LAUNCH
      - FILE_CREATION
  condition: selection
custom_attributes:
  original_rule_id: mr_6aa149a9-cae3-4414-b50f-75cf53ac5e11
  source_format: chronicle_yaral