title: HackTool - Mimikatz Execution
id: 6a153ba0-41c5-547d-b192-d5e86a68d833
status: experimental
level: high
description: Detection well-known mimikatz command line arguments
author: Teymur Kheirkhabarov, oscd.community, David ANDRE (additional keywords), Tim Shelton
logsource:
  product: gcp
  category: process_creation
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_mimikatz_command_line.yml
custom_attributes:
  original_rule_id: mr_d173bc90-2dcf-418d-a40c-bb7792f6300a
  source_format: chronicle_yaral