title: HackTool - Generic Process Access
id: 57c817fe-6928-5f0e-b6b4-07f49215094d
status: experimental
level: high
description: Detects process access requests from hacktool processes based on their default image name
author: Nasreddine Bencherchali (Nextron Systems), Swachchhanda Shrawan Poudel
logsource:
  product: gcp
  category: process_creation
detection:
  selection:
    metadata_event_type: PROCESS_OPEN
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_access/proc_access_win_hktl_generic_access.yml
custom_attributes:
  original_rule_id: mr_1e8861fd-060a-4162-8e00-fa2b2a27e1e2
  source_format: chronicle_yaral