title: HackTool - Dumpert Process Dumper Default File
id: b6deb745-33cf-5cfa-a669-ba20ed32cb0e
status: experimental
level: critical
description: |
  Detects the creation of the default dump file used by Outflank Dumpert tool. A process dumper, which dumps the lsass process memory
author: Florian Roth (Nextron Systems)
logsource:
  product: gcp
  category: process_creation
detection:
  selection:
    metadata_event_type: FILE_CREATION
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_hktl_dumpert.yml
custom_attributes:
  original_rule_id: mr_13ac04a7-8853-42c9-a243-9da5dc05cb66
  source_format: chronicle_yaral