title: Hash Prevalence
id: 0df08b9f-4d3f-529f-ad0b-47f6d28090fd
status: experimental
level: low
description: Correlate process events with hashes that have a low rolling max over the past 10 days
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
custom_attributes:
  original_rule_id: mr_abaa155b-f4ce-4fb2-b525-3eed59bca6d1
  source_format: chronicle_yaral