title: High Risk User Download Executable From Macro
id: 3b6f1665-87d7-5d3c-ab6e-73a9c51977cf
status: experimental
level: high
description: Executable downloaded by Microsoft Excel by user with GCP entity relationship
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: NETWORK_HTTP
    target_url: .*\.exe$
  condition: selection
custom_attributes:
  original_rule_id: mr_352c77a7-67b6-4dfb-95e5-75fef8fa4a6c
  source_format: chronicle_yaral