title: Hunt for Office 365 group modification add member success
id: 8f8bfea5-8378-5823-8b04-98f2e92f2ac7
status: experimental
level: low
description: Detects when a user is added to a group in Office 365.
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: GROUP_MODIFICATION
    metadata_product_event_type: Add member to group.
    metadata_product_name: Office 365
    metadata_vendor_name: Microsoft
    security_result_action: ALLOW
  condition: selection
custom_attributes:
  original_rule_id: mr_254a5c85-b248-43b6-a9b2-5118d4c31abb
  source_format: chronicle_yaral