title: Hunt for Office 365 group creation success
id: 35138a56-c2a3-504e-9344-1804ffa75d5e
status: experimental
level: low
description: Detects when a group is created in Office 365.
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: GROUP_CREATION
    metadata_product_event_type: Add group.
    metadata_product_name: Office 365
    metadata_vendor_name: Microsoft
    security_result_action: ALLOW
  condition: selection
custom_attributes:
  original_rule_id: mr_d35822fd-c121-46eb-a232-772f8c1290bd
  source_format: chronicle_yaral