title: Hunt for Office 365 group modification remove member success
id: bd4bd3de-1062-5265-b8df-5a5aad4e9581
status: experimental
level: low
description: Detects when a user is removed from a group in Office 365.
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: GROUP_MODIFICATION
    metadata_product_event_type: Remove member from group.
    metadata_product_name: Office 365
    metadata_vendor_name: Microsoft
    security_result_action: ALLOW
  condition: selection
custom_attributes:
  original_rule_id: mr_fb6fe12b-737b-4d6c-a53f-3832343bc548
  source_format: chronicle_yaral