title: Impacket WMIExec CISA Report
id: cd35deec-bb97-5522-88de-6b4c9965b44b
status: experimental
level: medium
description: Detects the artifacts generally associated with the use of wmiexec.py
author: Google Cloud Security
logsource:
  product: windows
detection:
  selection:
    metadata_event_type:
      - PROCESS_LAUNCH
      - FILE_CREATION
  condition: selection
references:
  - https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF
custom_attributes:
  original_rule_id: mr_ca682bc6-411b-46e5-88ef-1668032b14d1
  source_format: chronicle_yaral