title: IOC Hash Prevalence
id: 81bc8087-f4fd-5549-a5fb-fbb5622208dd
status: experimental
level: high
description: |
  Detect process/file events that match hashes found in our MISP instance and have low rolling max prevalence
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type:
      - FILE_CREATION
      - PROCESS_LAUNCH
  condition: selection
custom_attributes:
  original_rule_id: mr_58c661e3-e609-4df8-ae36-e85480e62a50
  source_format: chronicle_yaral