title: IOC Domain C2
id: c3dd6543-6321-5f83-99c9-32b7256893e8
status: experimental
level: high
description: Detect DNS events that indicate communication to a C2 domain in MISP
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: NETWORK_DNS
  condition: selection
custom_attributes:
  original_rule_id: mr_cb22c45e-b29d-487f-9cf5-1310bfed6d6c
  source_format: chronicle_yaral