title: IOC Domain Internal Policy
id: db0692e4-6723-5314-b358-7b3fe40a5ef6
status: experimental
level: low
description: Detect DNS events that communicate with gaming sites in MISP. These violate policy.
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: NETWORK_DNS
  condition: selection
custom_attributes:
  original_rule_id: mr_853bfafe-3049-43b5-a077-6a5f4a24ea3c
  source_format: chronicle_yaral