title: IOC IP Target
id: e1d5f27d-4b77-50c6-ad62-b44dee2e4346
status: experimental
level: medium
description: Detect network events that indicate communication to a watchlisted IP address
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: NETWORK_CONNECTION
  condition: selection
custom_attributes:
  original_rule_id: mr_cb71b798-5931-47a9-8572-8166db41fc5c
  source_format: chronicle_yaral