title: IOC SHA256 Hash
id: 4d60a7c1-651d-502c-80ea-4beabc940f1b
status: experimental
level: medium
description: Detect file/process events that match watchlisted hashes in MISP
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type:
      - PROCESS_LAUNCH
      - FILE_CREATION
  condition: selection
custom_attributes:
  original_rule_id: mr_82df7e96-1bc3-489d-9e17-ff86e8f6e89b
  source_format: chronicle_yaral