title: IP Target Prevalence
id: 7f5f7053-d9ac-59b8-82f4-75a97b700c44
status: experimental
level: low
description: Detect events that are communicating to IP addresses that have a low rolling max prevalence.
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: NETWORK_CONNECTION
  condition: selection
custom_attributes:
  original_rule_id: mr_0de02f28-2a7d-4128-aa31-02308491e744
  source_format: chronicle_yaral