title: Local Accounts Discovery
id: 227b282f-d9aa-596d-9f02-338b0f145037
status: experimental
level: low
description: Local accounts, System Owner/User discovery using operating systems utilities
author: Timur Zinniatullin, Daniil Yugoslavskiy, oscd.community
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_local_system_owner_account_discovery.yml
custom_attributes:
  original_rule_id: mr_3a6b5c72-8126-4f43-a4ac-9c8bbac7fa72
  source_format: chronicle_yaral