title: Logins From Terminated Employees
id: 63aa2741-5c36-5728-ba0e-297cb724dfba
status: experimental
level: medium
description: Allowed Logins from Terminated Employees
author: Google Cloud Security
logsource:
  product: gcp
  category: authentication
detection:
  selection:
    metadata_event_type: USER_LOGIN
    security_result_action: ALLOW
  condition: selection
custom_attributes:
  original_rule_id: mr_69178541-285b-45cb-b723-e2b5d88f22d3
  source_format: chronicle_yaral