title: Low Prevalence Hash On Process Launch Low Prevalence Domain Accessed
id: 3bcfb351-c180-53fb-9d0a-840585b8c04d
status: experimental
level: low
description: |
  Detects when a low prevalence hash is seen during a process launch event, and a low prevalence domain is accessed within 10m.
author: Google Cloud Security
logsource:
  product: gcp
  category: process_creation
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
custom_attributes:
  original_rule_id: mr_0624f9fb-8c73-4b8c-8651-b88ed736c862
  source_format: chronicle_yaral