title: LSASS Memory Access by Tool With Dump Keyword In Name
id: 7be8b4c6-2467-5a8c-a8f9-14df9f7329ec
status: experimental
level: high
description: Detects LSASS process access requests from a source process with the dump keyword in its image name
author: Florian Roth (Nextron Systems)
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: PROCESS_OPEN
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_access/proc_access_win_lsass_dump_keyword_image.yml
custom_attributes:
  original_rule_id: mr_98164cc1-0051-49c1-b915-421b3c119bfe
  source_format: chronicle_yaral