title: MITRE ATT&CK T1021.002 Windows Admin Share With Asset Entity
id: 79f0d3b0-77dc-5205-81a9-b8e57068cd2f
status: experimental
level: low
description: Net use commands for SMB/Windows admin shares based on asset entity group
author: Google Cloud Security
logsource:
  product: windows
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
    target_process_command_line: net.*use.*(C|ADMIN|IPC)\$
  condition: selection
custom_attributes:
  original_rule_id: mr_7b7fbe57-12a8-4254-ad73-b9e9024cbc8a
  source_format: chronicle_yaral