title: MITRE ATT&CK T1033 Recon Successful Logon Enumeration Powershell CISA Report
id: bc277648-8766-571d-9bcb-737ddf617fe8
status: experimental
level: medium
description: Detects the use of powershell to enumerate successful logins on a specific host
author: Google Cloud Security
logsource:
  product: windows
detection:
  selection:
    metadata_event_type:
      - PROCESS_LAUNCH
      - STATUS_UPDATE
  condition: selection
references:
  - https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF
custom_attributes:
  original_rule_id: mr_db589a2e-0a06-46b5-8479-f8e120ec0405
  source_format: chronicle_yaral