title: MITRE ATT&CK T1021.002 Windows Admin Share With User Enrichment
id: e86ff66a-89a6-567d-934b-d3c2c1ceaf2e
status: experimental
level: low
description: Net use commands for SMB/Windows admin shares focused on UDM enriched user fields
author: Google Cloud Security
logsource:
  product: windows
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
    target_process_command_line: net.*use.*(C|ADMIN|IPC)\$
  condition: selection
custom_attributes:
  original_rule_id: mr_57f52ed2-c7e2-4c8d-b308-2a3238986e98
  source_format: chronicle_yaral