title: MITRE ATT&CK T1570 Suspicious Command PSExec
id: 6b3eead5-ee56-55f8-a910-a7647ceb9940
status: experimental
level: medium
description: Command-line execution of the PsExec tool on Windows
author: Google Cloud Security
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
custom_attributes:
  original_rule_id: mr_b1c34e7b-79c2-4d44-a105-d8166f6fd2c5
  source_format: chronicle_yaral