title: MITRE ATT&CK T1003.003 RW Utilities Associated With Ntds.dit
id: 09967456-347d-5a7f-96d5-407fb726f4de
status: experimental
level: high
description: Detects process launches from processes related to ntds against key servers
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
custom_attributes:
  original_rule_id: mr_03db3339-09ba-4c9c-b3d6-1b81998a1de4
  source_format: chronicle_yaral