title: MITRE ATT&CK T1110.003 RW Windows Password Spray
id: 3a481574-1cf6-5b03-9e99-ef9542426a55
status: experimental
level: medium
description: Detect repeated authentication failure with multiple users indicative of a password spray attack.
author: Google Cloud Security
logsource:
  product: windows
  category: authentication
detection:
  selection:
    metadata_event_type: USER_LOGIN
    metadata_vendor_name: Microsoft
    security_result_action: BLOCK
  condition: selection
custom_attributes:
  original_rule_id: mr_5d6c9686-992f-4caf-bf1b-2fec05925c49
  source_format: chronicle_yaral