title: MITRE ATT&CK T1090 Port Proxy Forwarding CISA Report
id: 044def10-9e7e-5eca-ae65-421e93849063
status: experimental
level: low
description: |
  Detects port forwarding being enabled using netsh command and registry settings created or modified in support of portproxy v4tov4
author: Google Cloud Security
logsource:
  product: windows
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
references:
  - https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF
custom_attributes:
  original_rule_id: mr_4c6f2d66-ed6f-4dda-bd2f-7c545898468b
  source_format: chronicle_yaral