title: MITRE ATT&CK T1140 Encoded Powershell Command
id: 47d19706-7d2f-5411-99d0-f11147f3be0e
status: experimental
level: medium
description: Detects encoded powershell commands
author: Google Cloud Security
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
custom_attributes:
  original_rule_id: mr_c01d7d92-db49-4044-a2c5-5a16c74a141d
  source_format: chronicle_yaral