title: MITRE ATT&CK T1003 RW Mimikatz
id: c6d6facd-974b-5236-a568-8b7b33f78fde
status: experimental
level: critical
description: Detects the process mimikatz being issued from the command line.
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
    target_process_command_line: mimikatz
  condition: selection
custom_attributes:
  original_rule_id: mr_fa96ead4-7f1f-4dbb-bacb-a526f985c12f
  source_format: chronicle_yaral