title: MITRE ATT&CK T1053.005 Windows Creation Of Scheduled Task
id: 516792b3-35cb-56b6-8060-d3f1916ee650
status: experimental
level: medium
description: Creation of scheduled task using command line
author: Google Cloud Security
logsource:
  product: windows
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
custom_attributes:
  original_rule_id: mr_14beda0b-8ef1-4805-a227-df9d8bbc6804
  source_format: chronicle_yaral