title: MITRE ATT&CK T1110.001 Windows Repeated Authentication Failures Before Successful One With User Entity
id: a50792fc-a851-52ff-8a7d-792d8da1edb3
status: experimental
level: medium
description: Detect Multiple Failed Login Attempts followed by Successful Login
author: Google Cloud Security
logsource:
  product: windows
  category: authentication
detection:
  selection:
    metadata_event_type: USER_LOGIN
    metadata_vendor_name: Microsoft
    security_result_action: BLOCK
    metadata_product_event_type: 4625
  condition: selection
custom_attributes:
  original_rule_id: mr_2a9dc1d2-d4b8-4b80-a494-3369c681da60
  source_format: chronicle_yaral