title: Modify User Shell Folders Startup Value
id: 0f18bcc4-8ba9-5095-8d4b-6938db19a676
status: experimental
level: high
description: |
  Detect modification of the startup key to a path where a payload could be stored to be launched during startup
author: frack113
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: REGISTRY_MODIFICATION
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_set/registry_set_susp_user_shell_folders.yml
custom_attributes:
  original_rule_id: mr_bf813e89-427f-46e4-a671-bb3eea037725
  source_format: chronicle_yaral