title: Network HTTP Low Prevalence Domain Access
id: 4e0afbf6-6423-571c-b9a8-423f9d546d60
status: experimental
level: critical
description: Detects network web access to a low prevalence domain
author: Google Cloud Security
logsource:
  product: gcp
  category: network_connection
detection:
  selection:
    metadata_event_type: NETWORK_HTTP
  condition: selection
custom_attributes:
  original_rule_id: mr_c376478e-1c93-4d27-8bea-a56c3c0052f5
  source_format: chronicle_yaral