title: Network Connection First Seen In Past Day
id: 0d1600e6-c129-5dda-87b8-3dceb743477c
status: experimental
level: low
description: |
  Detect network connection to an ip address that was only seen for the first time in the past 24 hours
author: Google Cloud Security
logsource:
  product: gcp
  category: network_connection
detection:
  selection:
    metadata_event_type: NETWORK_CONNECTION
  condition: selection
custom_attributes:
  original_rule_id: mr_c3c9e4d3-eaa5-4f5b-9c64-70ce93247c51
  source_format: chronicle_yaral