title: Network Traffic To Specific Country
id: 9f3ecf09-eede-5e63-abbf-9839034e9c1f
status: experimental
level: low
description: Identify network traffic based on target country
author: Google Cloud Security
logsource:
  product: gcp
  category: network_connection
detection:
  selection:
    metadata_event_type: NETWORK_CONNECTION
    target_ip_geo_artifact_location_country_or_region: France
  condition: selection
custom_attributes:
  original_rule_id: mr_f1ab5184-771f-48dc-82e6-11a72632fcd5
  source_format: chronicle_yaral