title: New RUN Key Pointing to Suspicious Folder
id: e6384d22-badd-523e-9aab-a35797209733
status: experimental
level: high
description: Detects suspicious new RUN key element pointing to an executable in a suspicious folder
author: Florian Roth (Nextron Systems), Markus Neis, Sander Wiebing, Swachchhanda Shrawan Poudel (Nextron Systems)
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: REGISTRY_MODIFICATION
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_set/registry_set_susp_run_key_img_folder.yml
custom_attributes:
  original_rule_id: mr_ffc6cf7a-3eaf-4ca1-8dba-9a2d466f2a3a
  source_format: chronicle_yaral