title: O365 Add User To Admin Role
id: d66b0c8b-2849-534e-a001-184dbe5e7ea5
status: experimental
level: medium
description: |
  Adding users to administrative roles is not malicious, but due to the sensitivity of certain roles, validation should occur when this occurs
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: USER_UNCATEGORIZED
    metadata_product_event_type: Add member to role.
    metadata_product_name: Office 365
    metadata_vendor_name: Microsoft
    security_result_action: ALLOW
  condition: selection
custom_attributes:
  original_rule_id: mr_ee28c257-d2c7-490c-addf-aef35d07f29d
  source_format: chronicle_yaral