title: O365 OneDrive Anonymous File Accessed
id: aef5d8d5-eacb-5431-bfe5-8337f9ee2923
status: experimental
level: medium
description: |
  Anonymous links can be used to export files from OneDrive. While this isn't always a sign of malicious activity, some organizations do not support the use of anonymous links because of the risk of data leakage. This rule detects when anonymous links are used to access files from OneDrive.
author: Google Cloud Security
logsource:
  product: gcp
  category: file_event
detection:
  selection:
    metadata_event_type: USER_RESOURCE_ACCESS
    metadata_product_event_type: FileAccessed
    metadata_product_name: Office 365
    metadata_vendor_name: Microsoft
    principal_user_userid:
      - anonymous
      - '^urn:spo:anon#'
  condition: selection
custom_attributes:
  original_rule_id: mr_f713e2b0-31b1-4165-8764-59a5e2c5eabc
  source_format: chronicle_yaral