title: O365 Entra ID App Client Secret Added, Updated or Deleted
id: d3c6ac4b-0a7e-507a-9cad-237f624c331a
status: experimental
level: medium
description: |
  Secrets added to applications have legitimate purposes, but can also be a method of persistence. This alert will trigger on creation, modification or delete of a client secret
author: Google Cloud Security
logsource:
  product: azure
  category: file_event
detection:
  selection:
    metadata_event_type: USER_RESOURCE_UPDATE_CONTENT
    metadata_product_name: Office 365
    metadata_vendor_name: Microsoft
    security_result_action: ALLOW
    metadata_product_event_type: Update application.*Certificates and secrets management
  condition: selection
custom_attributes:
  original_rule_id: mr_24ac7907-9d86-4089-901c-61f8ff1e7730
  source_format: chronicle_yaral