title: O365 OneDrive Anonymous File Downloaded
id: dd2d58a3-3563-5327-80eb-fc3555fce1d5
status: experimental
level: medium
description: |
  Anonymous links can be used to export files from OneDrive. While this isn't always a sign of malicious activity, some organizations do not support the use of anonymous links because of the risk of data leakage. This rule detects when anonymous links are used to download files from OneDrive.
author: Google Cloud Security
logsource:
  product: gcp
  category: file_event
detection:
  selection:
    metadata_event_type: USER_RESOURCE_UPDATE_CONTENT
    metadata_product_event_type: FileDownloaded
    metadata_product_name: Office 365
    metadata_vendor_name: Microsoft
    principal_user_userid:
      - anonymous
      - '^urn:spo:anon#'
  condition: selection
custom_attributes:
  original_rule_id: mr_f713e2b0-31b1-4165-8764-59a5e2c5eabb
  source_format: chronicle_yaral