title: Office 365 logging is disabled
id: da2bba2e-0d66-50aa-b12f-40019bdd4f36
status: experimental
level: critical
description: Detect when the Unified Audit Log is disabled
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: SETTING_CREATION
    metadata_product_event_type: Set-AdminAuditLogConfig
    metadata_product_name: Office 365
    metadata_vendor_name: Microsoft
  condition: selection
custom_attributes:
  original_rule_id: mr_17a49d19-2ea1-4d7d-9e4d-bbc7ffb07099
  source_format: chronicle_yaral