title: Office 365 group deletion success
id: f63c19dc-fd98-5c1b-b368-2f06410b5110
status: experimental
level: low
description: Detects when a group is deleted.
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: GROUP_DELETION
    metadata_product_event_type: Delete group.
    metadata_product_name: Office 365
    metadata_vendor_name: Microsoft
    security_result_action: ALLOW
  condition: selection
custom_attributes:
  original_rule_id: mr_24a45257-b6b5-4b1d-b301-526dc6a17adf
  source_format: chronicle_yaral