title: Office 365 logging has been enabled
id: 50822f4d-864c-5b66-b0db-ca8fb570c59b
status: experimental
level: critical
description: Detect when the Unified Audit Log is enabled
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: SETTING_CREATION
    metadata_product_event_type: Set-AdminAuditLogConfig
    metadata_product_name: Office 365
    metadata_vendor_name: Microsoft
  condition: selection
custom_attributes:
  original_rule_id: mr_a45012d7-4430-4666-b172-5488a48e9ca6
  source_format: chronicle_yaral