title: Okta ThreatInsight Login Failure With High Unknown Users
id: cfdb639e-42d5-5ce7-9d70-f6c5fa195927
status: experimental
level: medium
description: |
  Okta's ThreatInsight can identify multiple login failures with high unknown users count from the same IP across one or more Okta orgs.
author: Google Cloud Security
logsource:
  product: okta
  category: authentication
detection:
  selection:
    metadata_product_name: Okta
    metadata_vendor_name: Okta
    metadata_event_type: USER_UNCATEGORIZED
    metadata_product_event_type: security.threat.detected
    security_result_category_details: Login failures with high unknown users count
  condition: selection
tags:
  - attack.t1110
references:
  - https://help.okta.com/en-us/Content/Topics/Security/threat-insight/configure-threatinsight-system-log.htm
custom_attributes:
  original_rule_id: mr_41bafd12-7b1d-4b73-adf6-621c0431b538
  source_format: chronicle_yaral