title: Okta User Rejected Multiple Push Notifications
id: 455c43f1-3d52-5aaa-a084-4031324e43db
status: experimental
level: medium
description: Detects when an Okta user rejects more than 2 Push notifications in a 10 minute window.
author: Google Cloud Security
logsource:
  product: okta
detection:
  selection:
    metadata_product_name: Okta
    metadata_vendor_name: Okta
    metadata_event_type: USER_UNCATEGORIZED
    metadata_product_event_type:
      - user.mfa.okta_verify.deny_push
      - user.authentication.auth_via_mfa
    security_result_summary: User rejected Okta push verify
    security_result_action: BLOCK
  condition: selection
tags:
  - attack.t1110
references:
  - https://sec.okta.com/pushfatigueworkflows
custom_attributes:
  original_rule_id: mr_4d8ac05a-0d73-4d81-a5a1-470d2bd7d725
  source_format: chronicle_yaral