title: Okta User Suspicious Activity Reported
id: a4266dac-b321-539f-b55a-4d0e7986778b
status: experimental
level: medium
description: An Okta user reports suspicious activity in response to an end user security notification.
author: Google Cloud Security
logsource:
  product: okta
detection:
  selection:
    metadata_product_name: Okta
    metadata_vendor_name: Okta
    metadata_event_type: USER_UNCATEGORIZED
    metadata_product_event_type: user.account.report_suspicious_activity_by_enduser
    security_result_summary: User report suspicious activity
  condition: selection
tags:
  - attack.t1078
references:
  - https://help.okta.com/en-us/Content/Topics/Security/suspicious-activity-reporting.htm
custom_attributes:
  original_rule_id: mr_09eaaa93-be5e-4b7f-9d6b-8675e63291a0
  source_format: chronicle_yaral