title: Okta ThreatInsight Suspected Bruteforce Attack
id: d87be470-e01d-5414-89fe-de603fe3752f
status: experimental
level: medium
description: Okta ThreatInsight detects multiple login failures from the same IP across one or more Okta orgs.
author: Google Cloud Security
logsource:
  product: okta
detection:
  selection:
    metadata_product_name: Okta
    metadata_vendor_name: Okta
    metadata_event_type: USER_UNCATEGORIZED
    metadata_product_event_type: security.threat.detected
    security_result_category_details: Login Failures
  condition: selection
tags:
  - attack.t1110
references:
  - https://help.okta.com/en-us/Content/Topics/Security/threat-insight/configure-threatinsight-system-log.htm
custom_attributes:
  original_rule_id: mr_9537e888-7af7-491f-a5e2-3623e1798aba
  source_format: chronicle_yaral