title: Okta ThreatInsight Targeted Bruteforce Attack
id: 0db79a29-a5eb-5d8b-b34e-080d936cd312
status: experimental
level: medium
description: Okta ThreatInsight detects access requests from known malicious IPs targeting a specific org.
author: Google Cloud Security
logsource:
  product: okta
detection:
  selection:
    metadata_product_name: Okta
    metadata_vendor_name: Okta
    metadata_event_type: USER_UNCATEGORIZED
    metadata_product_event_type: security.attack.start
  condition: selection
tags:
  - attack.t1110
references:
  - https://help.okta.com/en-us/Content/Topics/Security/threat-insight/configure-threatinsight-system-log.htm
custom_attributes:
  original_rule_id: mr_ce576f12-ee6d-4282-9f7b-f955af183eb7
  source_format: chronicle_yaral