title: Okta User Password and MFA Factor Reset or Deactivated
id: afdfea93-9f6b-5334-bf33-6617d511da3f
status: experimental
level: medium
description: |
  Detects when an Okta user's password is reset and MFA factor(s) are deactivated or reset within a 30 minute time window. This activity may indicate that the user account has been compromised.
author: Drew Pilarski - Tempus AI
logsource:
  product: okta
  category: authentication
detection:
  selection:
    metadata_product_name: Okta
    metadata_vendor_name: Okta
    metadata_product_event_type:
      - user.mfa.factor.reset_all
      - user.mfa.factor.deactivate
  condition: selection
tags:
  - attack.t1556
references:
  - https://developer.okta.com/docs/reference/api/event-types/
custom_attributes:
  original_rule_id: mr_a4344fef-2310-4fed-8f3a-8e76237cfc1f
  source_format: chronicle_yaral