title: Okta User Logins From Multiple Cities
id: b9f5833e-c3a2-56e1-8187-315ebc379748
status: experimental
level: medium
description: Detects user logins for same user from different cities within 24 hours.
author: Google Cloud Security
logsource:
  product: okta
  category: authentication
detection:
  selection:
    metadata_product_name: Okta
    metadata_vendor_name: Okta
    metadata_event_type: USER_LOGIN
    metadata_product_event_type: user.session.start
    security_result_summary: User login to Okta
  condition: selection
tags:
  - attack.t1078
references:
  - https://help.okta.com/en-us/Content/Topics/Security/behavior-detection/logs-behavior-detection.htm
custom_attributes:
  original_rule_id: mr_b607de8a-7988-4f4f-8ecf-e8754de6bbae
  source_format: chronicle_yaral