title: Okta Successful High Risk User Logins
id: 193045ec-b906-5657-a22d-78912bbd8728
status: experimental
level: medium
description: Detects successfully authenticated user logins based on Okta's Behavior Detection pattern analysis.
author: Google Cloud Security
logsource:
  product: okta
  category: authentication
detection:
  selection:
    metadata_product_name: Okta
    metadata_vendor_name: Okta
    metadata_event_type: USER_LOGIN
    metadata_product_event_type: user.session.start
    security_result_summary: User login to Okta
    security_result_action: ALLOW
  condition: selection
tags:
  - attack.t1078
references:
  - https://help.okta.com/en-us/Content/Topics/Security/behavior-detection/logs-behavior-detection.htm
custom_attributes:
  original_rule_id: mr_ef123f09-f2ae-4d29-bb69-896d708f6a27
  source_format: chronicle_yaral