title: Okta Multiple User's Logins With Invalid Credentials From The Same IP
id: 925bdd0e-7824-5e98-a36e-2b43e69343e5
status: experimental
level: medium
description: Detects multiple user logins with invalid credentials from a single IP.
author: Google Cloud Security
logsource:
  product: okta
  category: authentication
detection:
  selection:
    metadata_product_name: Okta
    metadata_vendor_name: Okta
    metadata_event_type: USER_LOGIN
    security_result_action: BLOCK
    security_result_category_details: INVALID_CREDENTIALS
  condition: selection
tags:
  - attack.t1078
references:
  - https://help.okta.com/en-us/Content/Topics/Security/threat-insight/configure-threatinsight-system-log.htm
custom_attributes:
  original_rule_id: mr_09e08430-0704-4411-b3a1-29d05bcd4e13
  source_format: chronicle_yaral