title: Okta ThreatInsight Suspected Password Spray Attack
id: f0d80d9d-5386-579f-b015-275ca8639626
status: experimental
level: medium
description: Okta's ThreatInsight can identify Password Spray attacks.
author: Google Cloud Security
logsource:
  product: okta
  category: authentication
detection:
  selection:
    metadata_product_name: Okta
    metadata_vendor_name: Okta
    metadata_event_type: USER_UNCATEGORIZED
    metadata_product_event_type: security.threat.detected
    security_result_category_details: Password Spray
  condition: selection
tags:
  - attack.t1110
references:
  - https://help.okta.com/en-us/Content/Topics/Security/threat-insight/configure-threatinsight-system-log.htm
custom_attributes:
  original_rule_id: mr_4d081db5-7ea3-4300-8e0f-d7c7fcc1f662
  source_format: chronicle_yaral