title: potential_lsass_process_dump_via_procdump
id: d32c4252-2992-5268-84e7-8792be32cdfc
status: experimental
level: high
description: |
  Detects suspicious uses of the SysInternals Procdump utility by using a special command line parameter in combination with the lsass.exe process. This way we are also able to catch cases in which the attacker has renamed the procdump executable. Procdump dump of lsass using minidump or memory dump options. Covers atomic tests 1 and 8
author: Florian Roth (Nextron Systems)
logsource:
  product: gcp
  category: process_creation
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_procdump_lsass.yml
custom_attributes:
  original_rule_id: mr_f7efb1a2-866c-4505-947e-3b06d4240262
  source_format: chronicle_yaral