title: Potential Credential Dumping Via LSASS SilentProcessExit Technique
id: eb970c65-d77b-598b-8522-79662bed4021
status: experimental
level: critical
description: |
  Detects changes to the Registry in which a monitor program gets registered to dump the memory of the lsass.exe process
author: Florian Roth (Nextron Systems)
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    metadata_event_type: REGISTRY_MODIFICATION
    metadata_product_event_type: 13
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_event/registry_event_silentprocessexit_lsass.yml
custom_attributes:
  original_rule_id: mr_bc2279f0-9b27-485d-b392-ff6f13ae68df
  source_format: chronicle_yaral