title: Potential Credential Dumping Activity Via LSASS
id: 92303bce-57df-5821-93dc-86ef8f5cd043
status: experimental
level: medium
description: |
  Detects process access requests to the LSASS process with specific call trace calls and access masks. This behaviour is expressed by many credential dumping tools such as Mimikatz, NanoDump, Invoke-Mimikatz, Procdump and even the Taskmgr dumping feature.
author: Samir Bousseaden, Michael Haag
logsource:
  product: gcp
  category: authentication
detection:
  selection:
    metadata_event_type: PROCESS_OPEN
    target_resource_name: 0x103800
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_access/proc_access_win_lsass_memdump.yml
custom_attributes:
  original_rule_id: mr_33474568-9a0a-4588-ba79-144ab7908f8e
  source_format: chronicle_yaral