title: PowerShell Web Download
id: 3fc17232-b84b-5585-a1cd-0ea7a6f9217d
status: experimental
level: medium
description: Detects suspicious ways to download files or content using PowerShell
author: Florian Roth (Nextron Systems)
logsource:
  product: windows
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_download_cradles.yml
custom_attributes:
  original_rule_id: mr_942ed146-8046-4623-bae9-03bb4aaaf7d7
  source_format: chronicle_yaral