title: PowerShell DownloadFile
id: ab12fd04-38b5-544e-a517-5bbb83fed17d
status: experimental
level: high
description: |
  Detects the execution of powershell, a WebClient object creation and the invocation of DownloadFile in a single command line
author: Florian Roth (Nextron Systems)
logsource:
  product: windows
  category: file_event
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_susp_ps_downloadfile.yml
custom_attributes:
  original_rule_id: mr_aabbd11f-06fb-41fb-a15c-a226a4bf20e2
  source_format: chronicle_yaral