title: PrintBrm ZIP Creation of Extraction
id: f7ac029c-0490-5290-974a-3c4cf0f819ba
status: experimental
level: high
description: |
  Detects the execution of the LOLBIN PrintBrm.exe, which can be used to create or extract ZIP files. PrintBrm.exe should not be run on a normal workstation
author: frack113
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_printbrm.yml
custom_attributes:
  original_rule_id: mr_3d3036d7-f2f8-4037-ab33-f4cef1e1f4b5
  source_format: chronicle_yaral