title: Process Memory Dump via RdrLeakDiag.exe
id: bdc7a3ad-91d0-5be2-b511-2a6707dba14b
status: experimental
level: high
description: |
  Detects the use of the Microsoft Windows Resource Leak Diagnostic tool rdrleakdiag.exe to dump process memory
author: Cedric MAURUGEON, Florian Roth (Nextron Systems), Swachchhanda Shrawan Poudel, Nasreddine Bencherchali (Nextron Systems)
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
    src_process_file_full_path: RdrLeakDiag.exe
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rdrleakdiag_process_dumping.yml
custom_attributes:
  original_rule_id: mr_89eca7b6-5b7e-4bd1-978e-156bd00f5324
  source_format: chronicle_yaral