title: Process Memory Dump Via Comsvcs.DLL
id: 226625d5-eea2-5558-a082-af622c0806e9
status: experimental
level: high
description: Detects a process memory dump via comsvcs.dll using rundll32, covering multiple different techniques
author: Florian Roth (Nextron Systems), Modexp, Nasreddine Bencherchali (Nextron Systems), Swachchhanda Shrawan Poudel (Nextron Systems)
logsource:
  product: gcp
  category: process_creation
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
    src_process_file_full_path: RUNDLL32.EXE
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_process_dump_via_comsvcs.yml
custom_attributes:
  original_rule_id: mr_ad21bd09-c624-48c8-a949-a82a40fbb88c
  source_format: chronicle_yaral