title: PUA - Nimgrab Execution
id: 7f33577a-f6f8-5b36-b0d0-f140cf21c5fb
status: experimental
level: high
description: |
  Detects the usage of nimgrab, a tool bundled with the Nim programming framework and used for downloading files.
author: frack113
logsource:
  product: gcp
  category: process_creation
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_nimgrab.yml
custom_attributes:
  original_rule_id: mr_70b5f0f8-6bd3-42ab-be2f-928084b09942
  source_format: chronicle_yaral