title: Purple Knight Tool Execution Detected
id: 6f66ea4d-453e-558c-a4fb-24129d03ffb9
status: experimental
level: medium
description: |
  This detection rule identifies the execution of the Purple Knight tool, a free Active Directory security assessment utility developed by Semperis. Purple Knight is designed to scan for AD vulnerabilities, misconfigurations, and common attack paths. While it is a legitimate tool used by defenders, its execution in production environments may also indicate red team activity or unauthorized reconnaissance by adversaries attempting to map domain weaknesses.
author: Georg Lauenstein - suresecure GmbH
logsource:
  product: gcp
  category: process_creation
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
    target_process_file_full_path: \\PurpleKnight\.exe$
    principal_process_file_full_path: \\PurpleKnight\.exe$
    principal_process_command_line: PurpleKnight
  condition: selection
custom_attributes:
  original_rule_id: mr_69e428bb-c946-4e3f-abb8-0e28316f2389
  source_format: chronicle_yaral