title: Recon Suspicious Commands CISA Report
id: e27ea46d-93b3-58fe-9c12-412e8c3b0791
status: experimental
level: low
description: |
  Detects suspicious commands as identified in CISA Living off the Land pdf. Alone they may be normal but in concert, they may be worth looking into
author: Google Cloud Security
logsource:
  product: gcp
  category: process_creation
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
references:
  - https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF
custom_attributes:
  original_rule_id: mr_66edb4f7-a7e2-4ce6-a247-d09319b7eeea
  source_format: chronicle_yaral