title: Recon Credential Theft CISA Report
id: 76fac100-3505-5674-83dd-b73a4d5450b3
status: experimental
level: low
description: |
  Detects suspicious credential access commands as identified in CISA Living off the Land pdf. Alone they may be normal but in concert, they may be worth looking into
author: Google Cloud Security
logsource:
  product: gcp
  category: authentication
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
references:
  - https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF
custom_attributes:
  original_rule_id: mr_90b80326-d559-4e82-b5da-613e5406127a
  source_format: chronicle_yaral