title: Reg Add Suspicious Paths
id: 26d4463d-abb7-5f53-af24-be0ded472125
status: experimental
level: high
description: Detects when an adversary uses the reg.exe utility to add or modify new keys or subkeys
author: frack113, Nasreddine Bencherchali (Nextron Systems)
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
    src_process_file_full_path: reg.exe
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_susp_paths.yml
custom_attributes:
  original_rule_id: mr_f9cc16b8-8177-483a-acb6-ce30cdd02181
  source_format: chronicle_yaral