title: Renamed CreateDump Utility Execution
id: 86f1d3ce-c83a-57ee-a4e7-005accbd4d8d
status: experimental
level: high
description: Detects uses of a renamed legitimate createdump.exe LOLOBIN utility to dump process memory
author: Florian Roth (Nextron Systems)
logsource:
  product: gcp
  category: process_creation
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
    src_process_file_full_path: FX_VER_INTERNALNAME_STR
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_createdump.yml
custom_attributes:
  original_rule_id: mr_d680d855-18b0-4a96-9844-1a1e41a239c9
  source_format: chronicle_yaral