title: RestrictedAdminMode Registry Value Tampering
id: cd79cc90-ed51-5647-99f6-e6b2a4ba57ab
status: experimental
level: high
description: |
  Detects changes to the \"DisableRestrictedAdmin\" registry value in order to disable or enable RestrictedAdmin mode.\nRestrictedAdmin mode prevents the transmission of reusable credentials to the remote system to which you connect using Remote Desktop.\nThis prevents your credentials from being harvested during the initial connection process if the remote server has been compromise
author: frack113
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    metadata_event_type: REGISTRY_MODIFICATION
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_set/registry_set_lsa_disablerestrictedadmin.yml
custom_attributes:
  original_rule_id: mr_c996dba7-ebc0-4472-849c-d6ddebffa601
  source_format: chronicle_yaral