title: Safebrowsing Process Creation Hashes Seen More Than 7 Days
id: 9090b0ab-8dfc-5673-a338-567dcf3be391
status: experimental
level: medium
description: |
  Identify process and file creation using safe browsing hashes where the first and last seen are more than 7 days apart
author: Google Cloud Security
logsource:
  product: gcp
  category: process_creation
detection:
  selection:
    metadata_event_type:
      - PROCESS_LAUNCH
      - FILE_CREATION
  condition: selection
custom_attributes:
  original_rule_id: mr_9970945d-45cf-44ed-887a-ff876d5a072b
  source_format: chronicle_yaral