title: Session Manager Autorun Keys Modification
id: a95f9da1-7f2e-5ee4-a76a-902b7c7a8927
status: experimental
level: medium
description: Detects modification of autostart extensibility point (ASEP) in registry
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin, oscd.community, Tim Shelton, frack113 (split)
logsource:
  product: windows
detection:
  selection:
    metadata_event_type: REGISTRY_MODIFICATION
    target_registry_registry_value_data: (Empty)
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_set/registry_set_asep_reg_keys_modification_session_manager.yml
custom_attributes:
  original_rule_id: mr_4ec3053f-3617-4262-93ae-838dc542610c
  source_format: chronicle_yaral