title: ShimCache Flush
id: 2223cefa-d3e8-58b3-96d2-a0b5a7b4f89a
status: experimental
level: high
description: Detects actions that clear the local ShimCache and remove forensic evidence
author: Florian Roth (Nextron Systems)
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_susp_shimcache_flush.yml
custom_attributes:
  original_rule_id: mr_5f6699e1-0518-4664-85aa-9a716f0d4dd6
  source_format: chronicle_yaral