title: Suspicious Curl.EXE Download
id: f8e8e335-af96-5e40-9177-1fa73ee86529
status: experimental
level: high
description: |
  Detects a suspicious curl process start on Windows and outputs the requested document to a local file
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
logsource:
  product: windows
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
    target_asset_software_description: The curl executable
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_curl_susp_download.yml
custom_attributes:
  original_rule_id: mr_51da61c3-b1c7-4dd1-ad4c-ab5dfc96e075
  source_format: chronicle_yaral