title: Suspicious ASN
id: 1e22ec2e-23e8-591e-a79b-87395d4083a7
status: experimental
level: low
description: Identify network traffic based on a specific ASN
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: NETWORK_CONNECTION
    target_ip_geo_artifact_network_asn: 12741
  condition: selection
custom_attributes:
  original_rule_id: mr_da77bdeb-38fc-43c8-8be4-b6c6baa8e92a
  source_format: chronicle_yaral