title: Suspicious Powershell In Registry Run Keys
id: d76d483d-a9bd-50f4-9d7c-9f5ffac420a5
status: experimental
level: medium
description: Detects potential PowerShell commands or code within registry run keys
author: frack113, Florian Roth (Nextron Systems)
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    metadata_event_type: REGISTRY_MODIFICATION
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_set/registry_set_powershell_in_run_keys.yml
custom_attributes:
  original_rule_id: mr_ad75681b-474a-4022-9e35-d6beffcf9a4a
  source_format: chronicle_yaral