title: Suspicious ASN Watchlist
id: 73f63670-a5f4-52ba-88ae-800915cc1cee
status: experimental
level: low
description: Identify any network connections to a list of ASNs
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: NETWORK_CONNECTION
  condition: selection
custom_attributes:
  original_rule_id: mr_4b4311e2-8505-4758-8435-dbd951d2ee0d
  source_format: chronicle_yaral