title: Suspicious Invoke-WebRequest Execution
id: 9486f7d5-22d3-5022-b68f-966a739fc4bd
status: experimental
level: high
description: |
  Detects a suspicious call to Invoke-WebRequest cmdlet where the and output is located in a suspicious location
author: Nasreddine Bencherchali (Nextron Systems)
logsource:
  product: gcp
  category: process_creation
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
    src_process_file_full_path:
      - powershell.exe
      - pwsh.dll
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_invoke_webrequest_download.yml
custom_attributes:
  original_rule_id: mr_62fb3b3f-e99f-4ab3-9d5b-21994ba25ebe
  source_format: chronicle_yaral