title: Suspicious Windows Service Installation Detected
id: 9a1b63b3-a2b5-5095-b57e-9227ba779902
status: experimental
level: medium
description: |
  This detection rule identifies the creation of a Windows service with a suspicious or known malicious name, as logged by Windows Event ID 7045 (`A service was installed in the system`). Threat actors, including those associated with ransomware and other advanced persistent threats (APTs), often create services to achieve persistence, lateral movement, remote execution, or privilege escalation. Detection of such activity is critical for identifying early-stage post-compromise behavior.
author: Georg Lauenstein - suresecure GmbH
logsource:
  product: windows
detection:
  selection:
    metadata_event_type: SERVICE_CREATION
    metadata_product_name: Service Control Manager
    metadata_product_event_type: 7045
  condition: selection
references:
  - https://github.com/mthcht/awesome-lists/blob/main/Lists/suspicious_windows_services_names_list.csv
custom_attributes:
  original_rule_id: mr_965f922f-7a20-4579-a9df-1b1dea70672e
  source_format: chronicle_yaral