title: Unauthorized KMS Decryption
id: 11ef6b0b-0a33-554c-a175-785f3305e5be
status: experimental
level: medium
description: |
  Detects when a Key Management Service (KMS) decryption operation is carried out by a service account that's not in the allowlist. This behavior may indicate unauthorized access to information.
author: Drew Pilarski - Tempus AI
logsource:
  product: gcp
  category: authentication
detection:
  selection:
    metadata_product_name: Google Cloud Platform
    metadata_vendor_name: Google Cloud Platform
  condition: selection
references:
  - Internal Security Policy" // Include link to your organization's internal documentation if available
custom_attributes:
  original_rule_id: mr_90cd5b0d-60a7-4028-bc41-dce0947fbafd
  source_format: chronicle_yaral