title: Uncommon or Suspicious RMM Tool Execution Detected
id: cd33eaaf-f8f7-567b-aeee-dbb17ff7226c
status: experimental
level: medium
description: |
  This detection rule identifies uncommon or suspicious Remote Monitoring and Management (RMM) tools, leveraging intelligence from the LOL-RMM (Living Off the Land RMM) project. While RMM tools are widely used for IT administration, remote support, and network management, they are also frequently abused by attackers, initial access brokers (IABs), and ransomware operators to establish persistent remote access, execute malicious commands, or deploy additional payloads. This rule detects RMM softwar
author: Georg Lauenstein - suresecure GmbH
logsource:
  product: gcp
  category: process_creation
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
references:
  - https://lolrmm.io/
custom_attributes:
  original_rule_id: mr_f5681a0f-215f-4055-80c7-864ee39bcfb8
  source_format: chronicle_yaral