title: VT Relationships File Contacts Tor IP
id: 28f848b3-336b-5b5c-8f1a-beb29fcb4765
status: experimental
level: critical
description: Alert on known Hash contacting Tor IP with VT Relationships.
author: Google Cloud Security
logsource:
  product: gcp
  category: file_event
detection:
  selection:
    metadata_event_type: NETWORK_CONNECTION
  condition: selection
custom_attributes:
  original_rule_id: mr_a6f8b114-8fdb-4f39-8820-8961dcbb1079
  source_format: chronicle_yaral