title: VT Relationships File Executes File
id: e1826353-ad55-5616-a3c8-93ce61e326c8
status: experimental
level: high
description: Alert on known File Hash executing known File Hash with VT Relationships.
author: Google Cloud Security
logsource:
  product: gcp
  category: file_event
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
custom_attributes:
  original_rule_id: mr_9250a0b5-b671-4c63-bb78-d7fda0ac2cf4
  source_format: chronicle_yaral