title: VT Relationships File Contacts Domain
id: 6504f5eb-b46f-5246-90d3-331d31968a1b
status: experimental
level: high
description: Alert on known Hash querying a known hostname with VT Relationships
author: Google Cloud Security
logsource:
  product: gcp
  category: file_event
detection:
  selection:
    metadata_event_type: NETWORK_DNS
  condition: selection
custom_attributes:
  original_rule_id: mr_42ee37ba-cb36-49f2-b784-05ca0bd55b9f
  source_format: chronicle_yaral