title: VT Relationships File Downloaded From URL
id: f5d2c26f-9bfe-5c52-b199-8e3b1d085cc0
status: experimental
level: critical
description: Alert on downloading a known file hash from a known IP with VT Relationships.
author: Google Cloud Security
logsource:
  product: gcp
  category: file_event
detection:
  selection:
    metadata_event_type: NETWORK_HTTP
  condition: selection
custom_attributes:
  original_rule_id: mr_2890216d-6106-4841-b714-177f55ecc837
  source_format: chronicle_yaral