title: VT Relationships File Downloaded From IP
id: 1b78360f-7435-5077-ad05-1cff887187e6
status: experimental
level: high
description: Alert on downloading a known file hash from a known IP with VT Relationships.
author: Google Cloud Security
logsource:
  product: gcp
  category: file_event
detection:
  selection:
    metadata_event_type: NETWORK_HTTP
  condition: selection
custom_attributes:
  original_rule_id: mr_1a62ba21-6f3d-40c7-9278-b1e2d639a10b
  source_format: chronicle_yaral