title: VT Relationships File Contacts IP
id: b36af92f-43b4-59c0-a0ae-6d2ab0af2331
status: experimental
level: high
description: Alert on known Hash contacting known IP with VT Relationships
author: Google Cloud Security
logsource:
  product: gcp
  category: file_event
detection:
  selection:
    metadata_event_type: NETWORK_CONNECTION
  condition: selection
custom_attributes:
  original_rule_id: mr_d6011593-c864-40b2-b300-4275ed163f5d
  source_format: chronicle_yaral