title: W3WP Launching Encoded Powershell
id: f2830c53-aaba-5f2b-a4a3-06c73b333d78
status: experimental
level: medium
description: Detects on the execution of an encoded powershell command with a parent process of w3wp.exe.
author: Google Cloud Security
logsource:
  product: windows
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
  condition: selection
references:
  - https://nvd.nist.gov/vuln/detail/CVE-2025-49706, https://research.eye.security/sharepoint-under-siege/
custom_attributes:
  original_rule_id: mr_83daf64e-25e8-4b6b-8596-3adcc694e781
  source_format: chronicle_yaral