title: Wdigest Enable UseLogonCredential
id: c8b78189-972f-5a34-a285-f2acf9c1519d
status: experimental
level: high
description: |
  Detects potential malicious modification of the property value of UseLogonCredential from HKLM:\\SYSTEM\\CurrentControlSet\\Control\\SecurityProviders\\WDigest to enable clear-text credentials
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
logsource:
  product: gcp
  category: authentication
detection:
  selection:
    metadata_event_type: REGISTRY_MODIFICATION
    target_registry_registry_value_data: DWORD (0x00000001)
  condition: selection
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_set/registry_set_wdigest_enable_uselogoncredential.yml
custom_attributes:
  original_rule_id: mr_b91eeb90-12e0-40f2-878c-a4716fe722bc
  source_format: chronicle_yaral