title: Whoami Execution
id: 34d601ea-62b7-5783-9a75-267d4384c2fc
status: experimental
level: medium
description: |
  Detects the execution of whoami, which is often used by attackers after exploitation to establish what credentials they are logged in under
author: Google Cloud Security
logsource:
  product: gcp
  category: process_creation
detection:
  selection:
    metadata_event_type: PROCESS_LAUNCH
    target_process_command_line: whoami
  condition: selection
custom_attributes:
  original_rule_id: mr_4372a068-1411-449f-b572-dc2b9358b5f4
  source_format: chronicle_yaral