title: WHOIS Expired Domain Accessed
id: c894d1cf-2598-5986-9927-0b5365ff3e1a
status: experimental
level: low
description: |
  Example usage of WHOIS data, detecting an executable file download from a domain that's recently expired
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: NETWORK_HTTP
  condition: selection
custom_attributes:
  original_rule_id: mr_7b487c4f-cbf9-4b11-8b25-632ada3f90a3
  source_format: chronicle_yaral