title: WHOIS Expired Domain Executable Downloaded
id: 5d633c74-7cab-5c31-8b20-9fd28261d83c
status: experimental
level: low
description: Detect web traffic to a recently expired domain followed by an exe file creation event
author: Google Cloud Security
logsource:
  product: gcp
detection:
  selection:
    metadata_event_type: NETWORK_HTTP
  condition: selection
custom_attributes:
  original_rule_id: mr_ce0a1979-ec95-40d4-8107-748ee6d1e93f
  source_format: chronicle_yaral