title: WHOIS Recently Created Domain Access
id: 44fe699e-a40c-519f-9f21-6c570f175620
status: experimental
level: medium
description: Detects access attempts to a newly created domain via WHOIS enrichment.
author: Google Cloud Security
logsource:
  product: gcp
  category: file_event
detection:
  selection:
    metadata_event_type:
      - NETWORK_HTTP
      - NETWORK_CONNECTION
  condition: selection
custom_attributes:
  original_rule_id: mr_209a5ab1-a0ea-473c-bfae-7beb67673e99
  source_format: chronicle_yaral