title: WHOIS DNS Query To Typesquatting Domain
id: a00a8008-379a-5945-9f76-983f70c0c6e9
status: experimental
level: medium
description: |
  Provides example usage of WHOIS data, detecting a DNS query for a domain that contains a specific string and is not registered with the defined domain registrar.
author: Google Cloud Security
logsource:
  product: gcp
  category: network_connection
detection:
  selection:
    metadata_event_type: NETWORK_DNS
    network_dns_questions_name: threatpunter
  condition: selection
custom_attributes:
  original_rule_id: mr_32cd8835-d328-4a89-8265-f19cffe89346
  source_format: chronicle_yaral