title: Windows Short Term Account Use
id: 8511d944-bf84-55d5-812a-d485e8fb50fb
status: experimental
level: medium
description: Detects the creation, login, and deletion of a user account over a predefined timeframe
author: Google Cloud Security
logsource:
  product: windows
detection:
  selection:
    metadata_event_type: USER_CREATION
  condition: selection
custom_attributes:
  original_rule_id: mr_ac28ce76-8197-4354-af0d-d77c5771d9df
  source_format: chronicle_yaral