title: Unauthorized Logon actions by Domain and Account
id: ecc1ff86-9ad7-4ce4-a426-051d7ce91b2f
status: experimental
level: medium
description: |
  KQL detection rule: Unauthorized Logon actions by Domain and Account
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    DeviceLogonEvents
| where isnotempty(FailureReason)
| where FailureReason == "UnauthorizedLogonType"
| summarize count() by AccountDomain, AccountName
| sort by count_
| render columnchart with(title="Unauthorized Logon by Domain and Account")
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
