title: Unauthorized Logon actions by Domain and Account
id: 1ee49ee9-c5b7-428e-b794-3ea24543ac30
status: experimental
level: medium
description: |
  KQL detection rule: Unauthorized Logon actions by Domain and Account
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    DeviceLogonEvents
| where isnotempty(FailureReason)
| where FailureReason == "UnauthorizedLogonType"
| summarize count() by AccountDomain, AccountName
| sort by count_
| render columnchart with(title="Unauthorized Logon by Domain and Account")
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
