title: Visualize FileTypes based on DeviceFileEvents
id: b1b38d16-4833-4ab6-9517-e6458c55a162
status: experimental
level: medium
description: |
  KQL detection rule: Visualize FileTypes based on DeviceFileEvents
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    let TimeFrame = 7d;
DeviceFileEvents
| where Timestamp > ago(TimeFrame)
| extend FileType = tostring(parse_json(AdditionalFields).FileType)
| where isnotempty(FileType)
| summarize Total = count() by FileType
| render piechart with(title="FileTypes used")
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
