title: Visualize the devices in the defined machinegroups
id: c923b797-0dfb-4bd6-a394-0d16992c3ef5
status: experimental
level: medium
description: |
  KQL detection rule: Visualize the devices in the defined machinegroups
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    DeviceInfo
| summarize dcount(DeviceName) by MachineGroup
| sort by dcount_DeviceName
| render columnchart with(title="Total Devices by MachineGroup")
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
