title: Post Dilivery Events
id: 287e817e-34ed-4006-99ae-776951778a62
status: experimental
level: medium
description: |
  This query visualizes the post dilivery events from exchange to view the status of your environment.
author: Bert-JanP
logsource:
  product: office_365
  service: kql
detection:
  _kql_query: |
    EmailPostDeliveryEvents
| summarize TotalEvents = count() by Action
| render piechart with(title="Post Delivery Events")
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
