title: Post Dilivery Events
id: c688c42d-23f8-4ed0-9b4d-32bb12dc8bc7
status: experimental
level: medium
description: |
  This query visualizes the post dilivery events from exchange to view the status of your environment.
author: Bert-JanP
logsource:
  product: office_365
  service: kql
detection:
  _kql_query: |
    EmailPostDeliveryEvents
| summarize TotalEvents = count() by Action
| render piechart with(title="Post Delivery Events")
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
