title: Post Dilivery Events
id: 88fe18d7-5323-416c-a0f2-9aa9190776eb
status: experimental
level: medium
description: |
  This query visualizes the post dilivery events from exchange to view the status of your environment.
author: Bert-JanP
logsource:
  product: office_365
  service: kql
detection:
  _kql_query: |
    EmailPostDeliveryEvents
| summarize TotalEvents = count() by Action
| render piechart with(title="Post Delivery Events")
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
