title: Antivirus Detections by day
id: 09ac8388-46d9-4f51-a4fd-4ced307457a8
status: experimental
level: medium
description: |
  This query visualizes the daily antivirus detections, which can give an indication in anomalous amount of activities that are performed in your environment. 


  ## Defender XDR
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    DeviceEvents
    | where Timestamp > ago(30d)
    | where ActionType == 'AntivirusDetection'
    | summarize count() by bin(Timestamp, 1d)
    | render linechart with(title="Antivirus Detections by Day")
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
