title: ASR Executable Content triggered
id: cfbe2e5f-c64d-42ad-8b52-6b4ac970b783
status: experimental
level: medium
description: |
  The ASR rule in this query has the following description: This rule blocks the following file types from launching from email opened within the Microsoft Outlook application, or Outlook.com and other popular webmail providers:

  - Executable files (such as .exe, .dll, or .scr)
  - Script files (such as a PowerShell .ps1, Visual Basic .vbs, or JavaScript .js file)

  This query uses the ASR trigger as input and joins that with the available email information. This can then be used the find the source of the mail, which can then be blocked. Adverseries may use this technique to trick users into opening executable files that give the attacker initial access.
author: Bert-JanP
logsource:
  product: office_365
  service: kql
detection:
  _kql_query: |
    DeviceEvents
    | where ActionType in ("AsrExecutableEmailContentBlocked", "AsrExecutableEmailContentAudited")
    // join the information from the email attachment
    | join kind=inner (EmailAttachmentInfo
     | project NetworkMessageId, FileName, SHA256, FileSize)
     on $left.FileName == $right.FileName
    // join the email information     
    | join kind=inner (EmailEvents
     | project SenderFromAddress, Subject, NetworkMessageId)
     on $left.NetworkMessageId == $right.NetworkMessageId
    | project-reorder SenderFromAddress, Subject, FileName, FileSize, SHA256
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
