title: AutoIR High Impact Alert
id: 6387e710-45ce-4acc-bb55-127e24bc62f9
status: experimental
level: medium
description: |
  This rule can be deployed in your environment as NRT rule to deal with high severity alerts. This detection can be mapped against the response actions to always contain an incident when Ransomware, Hands-on-keyboard or RunMRU is mentioned in the commandline. This rule can help to reduce the time to contain.

Only implement this if you are sure that the rules in the list will not cause business impact on legitimate activities (or at least have a 90% or above TP ratio).
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    AlertEvidence 
| where EntityType in ('Machine', 'user')
| where Title has_any ('Ransomware', 'Hands-on-keyboard', 'RunMRU')
| where Severity == 'High'
| project-reorder Timestamp, Title, AlertId, Severity, DeviceId, DeviceName, AccountObjectId
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
