title: Blocklist.de All IP addresses that have attacked one of our customers/servers in the last 48 hours
id: 136a874d-a1cc-4c84-ad8c-bbb91c170bf9
status: experimental
level: medium
description: |
  KQL detection rule: Blocklist.de All IP addresses that have attacked one of our customers/servers in the last 48 hours
author: Bert-JanP
logsource:
  product: microsoft_threat_hunting
  service: kql
detection:
  _kql_query: |
    let ThreatIntelFeed = externaldata(DestIP: string)[@"https://lists.blocklist.de/lists/all.txt"] with (format="txt", ignoreFirstRecord=True);
    let IPRegex = '[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}';
    let MaliciousIP = materialize (
       ThreatIntelFeed
       | where DestIP matches regex IPRegex
       | distinct DestIP
        );
    DeviceNetworkEvents
    | where RemoteIP in (MaliciousIP)
    | extend GeoIPInfo = geo_info_from_ip_address(RemoteIP)
    | extend country = tostring(parse_json(GeoIPInfo).country), state = tostring(parse_json(GeoIPInfo).state), city = tostring(parse_json(GeoIPInfo).city), latitude = tostring(parse_json(GeoIPInfo).latitude), longitude = tostring(parse_json(GeoIPInfo).longitude)
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
