title: Certutil Remote Download
id: b0798e2f-c1b0-444e-8def-72d424ff5b5d
status: experimental
level: medium
description: |
  Adversaries may transfer tools or other files from an external system into a compromised environment. Tools or files may be copied from an external adversary-controlled system to the victim network through the command and control channel or through alternate protocols. The living of the land binary certutil is know to be misused by adversaries to remotely collect malicious tools.

Malicious Examples (Sources, see references):
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    #### Risk
An adversary transfered tools to the local device for execution.

#### References
- https://lolbas-project.github.io/lolbas/Binaries/Certutil/
- https://www.huntress.com/blog/slashandgrab-screen-connect-post-exploitation-in-the-wild-cve-2024-1709-cve-2024-1708

## Defender XDR
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
