title: Cloud Discovery Performed by User At Risk
id: 1f27bf3f-b33f-432a-8f55-ba21da77f04b
status: experimental
level: medium
description: |
  This query detects discovery events that have been performed by a user at risk, this is done based on the subset DiscoveryEvents. You can add other items to the list if you feel the need to do so, because the list is currently limited. If you think additions are needed please raise a pull request. 

  The discovery events are related to downloading group members and getting tenant information, which would be a logical step for an attacker if he gained access to your Azure tenant.
author: Bert-JanP
logsource:
  product: azure_ad
  service: kql
detection:
  _kql_query: |
    // Define DiscoveryEvents, list can be appended with other events or your choosing
    let DiscoveryEvents = dynamic(["Export", "Download group members", "Get tenant details", "Download Users", "Download Devices"]);
    let RiskyUsers = AADRiskyUsers
     | where TimeGenerated > ago(90d)
     | summarize arg_max(TimeGenerated, *) by Id
     // Only user active risky users. If you want to look for all users that have been risky, remove the line below.
     | where RiskState in~ ('atRisk', 'confirmedCompromised')
     | distinct UserDisplayName;
    AuditLogs
    // Filter only on the RiskyUsers defined
    | where Identity in~ (RiskyUsers)
    // Filter on DiscoveryEvents
    | where OperationName has_any (DiscoveryEvents)
    | project TimeGenerated, Identity, OperationName, Category, ResultDescription, Result
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
