title: Command & Control intel Feeds (Domain Based)
id: 1cccd559-0dff-4e45-b24b-e045fdd8f687
status: experimental
level: medium
description: |
  KQL detection rule: Command & Control intel Feeds (Domain Based)
author: Bert-JanP
logsource:
  product: microsoft_threat_hunting
  service: kql
detection:
  _kql_query: |
    // Collect Remote data
    let C2IntelFeeds = externaldata(Domain: string, ioc:string, path:string, IP:string)[@"https://raw.githubusercontent.com/drb-ra/C2IntelFeeds/master/feeds/domainC2swithURLwithIP.csv"] with (format="csv", ignoreFirstRecord=True);
    // Generate list that can be used to filter DeviceNetworkEvents
    let DomainList = C2IntelFeeds
    | distinct Domain;
    DeviceNetworkEvents
    // Filter only on C2 Domains
    | extend ToLowerUrl = tolower(RemoteUrl)
    | where RemoteUrl has_any (DomainList)
    // Join the C2IntelFeed information, this might skew the results, therefor they have been filtered.
    //| join C2IntelFeeds on $left.RemoteIP == $right.IP
    | extend GeoIPInfo = geo_info_from_ip_address(RemoteIP)
    | extend country = tostring(parse_json(GeoIPInfo).country), state = tostring(parse_json(GeoIPInfo).state), city = tostring(parse_json(GeoIPInfo).city), latitude = tostring(parse_json(GeoIPInfo).latitude), longitude = tostring(parse_json(GeoIPInfo).longitude)
    | project-reorder Timestamp, DeviceName, RemoteIP, RemotePort, RemoteUrl
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
