title: Custom Detection Disabled
id: 343b1d7e-f70f-4c28-af38-780ed2edc7c0
status: experimental
level: medium
description: |
  This query lists all the custom detections that have been disabled in Defender For XDR. The information is available in the *CloudAppEvents* table. This allows you to audit custom detection rule status changed and alert on disable activities (from unknown users).
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    CloudAppEvents
    | where ActionType == "ChangeCustomDetectionRuleStatus"
    | where RawEventData.IsEnabled == "false"
    | extend RuleName = tostring(parse_json(RawEventData.RuleName)), Query = tostring(parse_json(RawEventData.Query)), Actor = tostring(parse_json(RawEventData.UserId)), IsEnabled = RawEventData.IsEnabled
    | project-reorder Timestamp, Actor, IsEnabled, RuleName, Query
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
