title: Defense Evasion Alerts Generated by Defender For Endpoint
id: d5e3b2c3-f958-44c1-a9b5-20d9599a68b3
status: experimental
level: medium
description: |
  This query lists the Defense Evasion Alerts Generated by Defender For Endpoint.

## Defender XDR
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    CloudAppEvents
| where ActionType == 'DefenseEvasion'
| extend
     AlertUri = parse_json(RawEventData).AlertUri,
     AlertDisplayName = parse_json(RawEventData).AlertDisplayName,
     AlertSeverity = parse_json(RawEventData).AlertSeverity
| project AlertUri, AlertDisplayName, AlertSeverity
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
