title: Detect when an account has been changed in order for the password to never expire
id: f970ac9f-7ffc-444c-9974-cccf37560ed2
status: experimental
level: medium
description: |
  In Active Directory a password can be set so that it will never expire. This is normaly not desirable, because a password should be changed every x period. This query detects when a useraccount is set to Account Password Never Expires.
author: Bert-JanP
logsource:
  product: microsoft_defender_identity
  service: kql
detection:
  _kql_query: |
    IdentityDirectoryEvents
    | where ActionType == "Account Password Never Expires changed"
    | extend AdditionalInfo = parse_json(AdditionalFields)
    | extend OriginalValue = AdditionalInfo.['FROM Account Password Never Expires'],  NewValue = AdditionalInfo.['TO Account Password Never Expires'], AccountSid = AdditionalFields.TargetAccountSid
    | where NewValue == true
    | project-reorder Timestamp, TargetAccountUpn, AccountSid, OriginalValue, NewValue, ReportId, DeviceName
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
