title: Detect new RDP connections
id: 5dd305e6-4103-46db-8a0b-34f6a7643476
status: experimental
level: medium
description: |
  Detect new RDP connections to devices that have not been established in the past 20 days

  ## Defender XDR
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    let PreviousRDPConnections = materialize (
     DeviceNetworkEvents
     | where Timestamp > ago(20d)
     | where ActionType == "ConnectionSuccess"
     | where not(InitiatingProcessFileName == "Microsoft.Tri.Sensor.exe") 
    // DFI Sensor
     | where RemotePort == 3389
     );
    PreviousRDPConnections
    | where Timestamp > ago(2d)
    | join kind=leftanti (PreviousRDPConnections
     | where Timestamp > ago(1d))
     on DeviceName, InitiatingProcessAccountName
    | project
     Timestamp,
     DeviceName,
     InitiatingProcessAccountDomain,
     InitiatingProcessAccountName,
     InitiatingProcessCommandLine,
     RemoteUrl,
     RemoteIP
    | sort by Timestamp
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
