title: Device Alerts
id: 4e140ed3-3b3b-41f1-8e90-db945746cfb6
status: experimental
level: medium
description: |
  This query lists all the alerts that have triggered based on a specific UPN in the selected *TimeFrame*.

  ## Defender XDR
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    let Upn = 'user@test.com';
    let TimeFrame = 7d;
    AlertEvidence
    | where Timestamp > ago(TimeFrame)
    | where EntityType in~ ('User', 'Mailbox')
    | summarize arg_max(Timestamp, *) by AlertId
    | project AlertId, EntityType
    | join kind=inner AlertInfo on AlertId
    | extend AlertLink = strcat('https://security.microsoft.com/alerts/', AlertId)
    | project-reorder Timestamp, EntityType, Title, Category, Severity, DetectionSource, AlertLink
    | sort by Timestamp desc
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
