title: Device Alerts
id: 3370dd1d-7775-424f-97b1-4bb80da79b6b
status: experimental
level: medium
description: |
  This query lists all the alerts that have triggered from a specific device in the selected *TimeFrame*.

  ## Defender XDR
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    let Device = 'host.domain.tld';
    let TimeFrame = 7d;
    AlertEvidence
    | where DeviceName =~ Device
    | where Timestamp > ago(TimeFrame)
    | where EntityType == 'Machine'
    | summarize arg_max(Timestamp, *) by AlertId
    | project AlertId
    | join kind=inner AlertInfo on AlertId
    | extend AlertLink = strcat('https://security.microsoft.com/alerts/', AlertId)
    | project-reorder Timestamp, Title, Category, Severity, DetectionSource, AlertLink
    | sort by Timestamp desc
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
