title: Executable File Extentions downloaded via HTTP GET
id: cafcc993-8faf-4d8c-8eaa-d7bb8fe17572
status: experimental
level: medium
description: |
  List Executable File Extentions downloaded via HTTP GET

  ## Defender XDR
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    let ExecutableFileExtentions = dynamic(['bat', 'cmd', 'com', 'cpl', 'ex', 'exe', 'jse', 'lnk','msc', 'ps1', 'reg', 'vb', 'vbe', 'ws', 'wsf']);
    DeviceNetworkEvents
    | where ActionType == "NetworkSignatureInspected"
    | extend
     SignatureName = tostring(parse_json(AdditionalFields).SignatureName),
     SignatureMatchedContent = tostring(parse_json(AdditionalFields).SignatureMatchedContent),
     SamplePacketContent = tostring(parse_json(AdditionalFields).SamplePacketContent)
    | where SignatureName == "HTTP_Client"
    | extend HTTP_Request_Method = tostring(split(SignatureMatchedContent, " /", 0)[0])
    | where HTTP_Request_Method == "GET"
    | extend DownloadedContent = extract(@'.*/(.*)HTTP', 1, SignatureMatchedContent)
    | extend DownloadContentFileExtention = extract(@'.*\.(.*)$', 1, DownloadedContent)
    | where isnotempty(DownloadContentFileExtention) and string_size(DownloadContentFileExtention) < 8
    | where DownloadContentFileExtention has_any (ExecutableFileExtentions)
    | project-reorder Timestamp, DeviceName, DownloadedContent, HTTP_Request_Method, RemoteIP
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
