title: Find all attachments that have been send from a compromised mailbox and which devices have opened that attachment.
id: e3f0f13f-a113-41fe-80fb-6532ffaa1c7b
status: experimental
level: medium
description: |
  KQL detection rule: Find all attachments that have been send from a compromised mailbox and which devices have opened that attachment.
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    let CompromisedMailbox = "test@test.com";
    let SearchWindow = 48h; //Customizable h = hours, d = days
    EmailEvents
    | where Timestamp > ago(SearchWindow)
    | where SenderFromAddress == CompromisedMailbox
    | where AttachmentCount > 0
    | join kind=leftouter EmailAttachmentInfo on NetworkMessageId
    | project
     Timestamp,
     NetworkMessageId,
     SenderFromAddress,
     RecipientEmailAddress,
     Subject,
     ThreatTypes,
     SHA256
    | join kind=leftouter DeviceFileEvents on SHA256
    | summarize
     EmailReciepients = make_set(RecipientEmailAddress),
     Subject= make_set(Subject),
     FileOnDevices = make_set(DeviceName)
     by SHA256, NetworkMessageId
    | extend
     TotalReciepients = array_length(EmailReciepients),
     DeviceWithFileInteraction = array_length(FileOnDevices)
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
