title: Find the DFE Antivirus events on compromised devices. FileInfo is stored in JSON format.
id: 08608a40-7a90-4f45-8ac7-d20dd1cf6e2a
status: experimental
level: medium
description: |
  KQL detection rule: Find the DFE Antivirus events on compromised devices. FileInfo is stored in JSON format.
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    let CompromisedDevices = dynamic (["laptop1", "server2"]);
    let SearchWindow = 48h; //Customizable h = hours, d = days
    DeviceEvents
    | where Timestamp > ago(SearchWindow)
    | where DeviceName has_any (CompromisedDevices)
    | where ActionType == "AntivirusDetection"
    | extend FileInfo = pack_dictionary("FileName", FileName, "FileLocation", FolderPath, "SHA1", SHA1, "SHA256", SHA256, "MD5", MD5)
    | summarize TotalDetections = count(), MaliciousFiles = make_set(FileInfo) by DeviceName
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
