title: Find all the connections that have been made by Office from a compromised device.
id: c261a0f2-1dfd-44f5-9bd8-7fb5b4649b11
status: experimental
level: medium
description: |
  KQL detection rule: Find all the connections that have been made by Office from a compromised device.
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    let ConnectionsMadeByOfficeRegKey = @'\SOFTWARE\Microsoft\Office\16.0\Common\Internet\Server Cache';
    let CompromisedDevice = "laptop1";
    let SearchWindow = 7d; //Customizable h = hours, d = days
    DeviceRegistryEvents
    | where Timestamp > ago(SearchWindow)
    | where DeviceName == CompromisedDevice
    | where ActionType == "RegistryValueSet"
    | where RegistryKey contains ConnectionsMadeByOfficeRegKey
    | extend Connection = split(RegistryKey, @"SOFTWARE\Microsoft\Office\16.0\Common\Internet\Server Cache", 1)
    | extend Domain = extract(@"([a-z0-9|-]+\.)*[a-z0-9|-]+\.[a-z]+", 0, RegistryKey)
    | project-reorder Domain, Connection
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
