title: HTTP Request Methods Statistics
id: 37c682a1-9faf-4de7-8f85-22cdfc3f383c
status: experimental
level: medium
description: |
  HTTP Request Methods Statistics

  ## Defender XDR
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    DeviceNetworkEvents
    | where ActionType == "NetworkSignatureInspected"
    | extend
     SignatureName = tostring(parse_json(AdditionalFields).SignatureName),
     SignatureMatchedContent = tostring(parse_json(AdditionalFields).SignatureMatchedContent),
     SamplePacketContent = tostring(parse_json(AdditionalFields).SamplePacketContent)
    | where SignatureName == "HTTP_Client"
    | extend HTTP_Request_Method = tostring(split(SignatureMatchedContent, " /", 0)[0])
    | summarize count() by HTTP_Request_Method
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
