title: Hunt for devices with the most SMB connections
id: 9617d96d-381d-4af3-8a88-46ff6d27c110
status: experimental
level: medium
description: |
  This hunting query lists all the devices and the unique connections they have made with a remote SMB port. Devices with a large number of connected SMB sessions can be interesting to investigate.

  ## Defender XDR
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    DeviceNetworkEvents
    | where RemotePort == 445
    | where ActionType == "ConnectionSuccess"
    // Collect the last event that a device has connected via SMB to a unique remote IP
    | summarize arg_max(Timestamp, *) by DeviceId, RemoteIP
    | summarize RemoteSMBUrls = make_set_if(RemoteUrl, isnotempty(RemoteUrl)), make_set_if(RemoteIP, isempty(RemoteUrl)), TotalConnections = dcount(RemoteIP) by DeviceName
    | sort by TotalConnections
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
