title: Hunt for anomalies in Sentinel
id: ceb00e69-2467-4373-905b-194a2dd73338
status: experimental
level: medium
description: |
  The anomalies table contains anomalies generated by the active Anomaly analytics rules in Azure Sentinel. Those anomalies do not trigger a incident by default (at the moment of writing). This query lists the anomalies and the reaons why they are anomalies.
author: Bert-JanP
logsource:
  product: azure_sentinel
  service: kql
detection:
  _kql_query: |
    let TimeFrame = 7d;
    Anomalies
    | where TimeGenerated > ago(TimeFrame)
    | extend DetailedResultsKQL = ExtendedLinks[0].DetailBladeInputs
    | project-reorder TimeGenerated, Description, UserPrincipalName, RuleName, Tactics, DetailedResultsKQL, Entities
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
