title: Inbound Authentication From Public IP
id: 48634d95-8f05-42ad-b5ce-039beb9e36d7
status: experimental
level: medium
description: |
  This query can be used to identify devices that are publicly disclosed to the internet by monitoring for inbound authentication attempts.
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    let AllowedEntpoints = pack_array('devicename');
    SecurityEvent
    | where EventID in ('4625', '4624')
    | where Computer !in(AllowedEntpoints)
    | where not(ipv4_is_private(IpAddress))
    | summarize arg_min(TimeGenerated, *) by Computer
    | lookup kind=leftouter (DeviceInfo
    | summarize arg_max(TimeGenerated, *) by DeviceId
    | project DeviceName = toupper(DeviceName), DeviceType, PublicIP, ExposureLevel, MachineGroup) on $left.Computer == $right.DeviceName
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
