title: Last Password Change User
id: 38c39ab8-aa94-4bb6-b80d-433fea0a08cc
status: experimental
level: medium
description: |
  This query lists the last PasswordChangeTime based on Active Directory logs. In case you asked a user to perform a password reset, you can confirm using this query if it was actually performed.

  ## Defender XDR
author: Bert-JanP
logsource:
  product: microsoft_defender_identity
  service: kql
detection:
  _kql_query: |
    let UPN = "test@kqlquery.com";
    IdentityDirectoryEvents
    | where ActionType == "Account Password changed"
    | where AccountUpn =~ UPN
    | summarize arg_max(Timestamp, *) by AccountUpn
    | project PasswordChangeTime = Timestamp, Application, AccountDomain, AccountSid, AccountUpn
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
