title: Latest Antivirus Scan Status
id: c23ff6f0-56d3-4004-b4eb-368f8b70ab62
status: experimental
level: medium
description: |
  This query lists the latest completed antivirus scan for each device. The query filters all devices that have performed a successful scan today.
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    DeviceEvents
    | where ActionType == "AntivirusScanCompleted"
    | summarize arg_max(Timestamp, *) by DeviceId
    | extend ScanType = tostring(parse_json(AdditionalFields).ScanTypeIndex), 
    DaysAgo = datetime_diff('day', now(), Timestamp)
    | project DeviceName, ActionType, ScanType, DaysAgo
    // Filter only devices that have not performed a antivirus scan in the last day
    | where DaysAgo > 0
    | sort by DaysAgo
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
