title: List SmartScreen Events
id: 7b1fdab1-a66b-4856-a288-4df672d9747a
status: experimental
level: medium
description: |
  This query lists all SmartScreen related events.
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    DeviceEvents
    | where Timestamp > ago(30d)
    | where ActionType startswith "SmartScreen"
    | extend SmartScreenTrigger = iff(ActionType == "SmartScreenUrlWarning", 
    RemoteUrl, FileName)
    | extend ReasonForTrigger = parse_json(AdditionalFields).Experience
    | project
     Timestamp,
     DeviceName,
     ActionType,
     SmartScreenTrigger,
     ReasonForTrigger,
     InitiatingProcessCommandLine
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
