title: List the top 10 accounts that have the most impersonators
id: 44fbc9e9-a3f9-4515-9422-3e9416369780
status: experimental
level: medium
description: |
  This query lists the top 10 accounts that have performed the most imporsonated users. The definiation for this field is: *Indicates whether the activity was performed by one user for another (impersonated) user*.

  ## Defender XDR
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    CloudAppEvents
    | where IsImpersonated == 1
    | extend
     MailboxOwnerUPN = tostring(parse_json(RawEventData).MailboxOwnerUPN),
     ActionPerformedBy = tostring(parse_json(RawEventData).UserId)
    | where MailboxOwnerUPN != ActionPerformedBy
    | summarize Impersonators = make_set(ActionPerformedBy) by MailboxOwnerUPN
    | extend TotalImpersonators = array_length(Impersonators)
    | top 10 by TotalImpersonators
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
