title: List the devices with the most open ports
id: 126f6881-5cb8-466a-92db-f37d9e7d3d8b
status: experimental
level: medium
description: |
  List the devices with the most open ports.

  ## Defender XDR
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    DeviceNetworkEvents
    | where ActionType == "ListeningConnectionCreated"
    | where LocalPort < 5000 //Remove open TCP ports
    | where LocalIP !="127.0.0.1" // Will generate a lot of false positives
    | summarize TotalOpenPorts = dcount(LocalPort), OpenPortsList = make_set(LocalPort) by DeviceName
    | sort by TotalOpenPorts
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
