title: List all net(1).exe activities on a host
id: 060a6865-cc4b-4026-a6a7-20bb7f9387f8
status: experimental
level: medium
description: |
  KQL detection rule: List all net(1).exe activities on a host
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    let CompromisedDevice = "azurewin2022";
    let SearchWindow = 48h; //Customizable h = hours, d = days
    DeviceProcessEvents
    //| where DeviceName == CompromisedDevice
    | where Timestamp > ago(SearchWindow)
    | where FileName in ("net.exe", "net1.exe")
    | extend NetActionType = case(ProcessCommandLine has "accounts", "ACCOUNTS",
    ProcessCommandLine has "group", "GROUP",
    ProcessCommandLine has "user", "USER",
    ProcessCommandLine has "localgroup", "LOCALGROUP",
    "Other")
    | where NetActionType != "Other"
    | project-reorder Timestamp, ProcessCommandLine
    | sort by Timestamp
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
