title: List Rare Net(1).exe Parameter Executions
id: a27e83ec-57a7-4d2a-b1a4-71f6c9e7e529
status: experimental
level: medium
description: |
  This query lists rare net.exe or net1.exe parameters that are executed. The following parameters can be used:
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    The goal of the query is to determine which parameters are 'rare' in the context of your environment. This is done based on the userinput via the *RareThresholdNetActionType* variable. The default threshold is 10, whcih means that maximum 10 commands with that specific parameter should have been executed in the time between teh *StartTime* and the query execution time. The last part of the query lists all the rare parameters and the commandlines that have been executed.

#### Risk
Adversaries might use parameters that are not often used in your environment.

#### References
- https://learn.microsoft.com/en-us/windows/win32/winsock/net-exe-2

## Defender XDR
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
