title: List Live Response Unsigned Script Setting Changes
id: c0e76618-eea2-4b46-96cc-095a685c4d10
status: experimental
level: medium
description: |
  This query lists all changes to the Live Response Unsigned Script settings in the Advanced Features in Defender For Endpoint. You want to monitor this because allowing the use of unsigned scripts may increase your exposure to threats.
author: Bert-JanP
logsource:
  product: microsoft_defender_xdr
  service: kql
detection:
  _kql_query: |
    CloudAppEvents
    | where ActionType == "SetAdvancedFeatures"
    | extend SettingName = tostring(parse_json(RawEventData).SettingName), SettingsNewValue = tostring(parse_json(RawEventData).SettingsNewValue)
    | where SettingName == "Live Response unsigned script execution"
    | project-reorder Timestamp, AccountId, ActionType, SettingName, SettingsNewValue
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
