title: Mailitemsaccessed
id: b0730ffb-47a2-4a05-b908-7c40d1277af8
status: experimental
level: medium
description: |
  KQL detection rule: Mailitemsaccessed
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    union OfficeActivity, CloudAppEvents
    | where TimeGenerated > ago(30d)
    | extend Operation = coalesce(ActionType, Operation)
    | where Operation == "MailItemsAccessed"
    | summarize TotalEvents = count(), TotalCloudAppsEvents = countif(Type == "CloudAppEvents"), TotalUALEvents = countif(Type == "OfficeActivity") by bin(TimeGenerated, 1d)
    | extend EqualLogs = iff(TotalCloudAppsEvents == TotalUALEvents, true, false)
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
