title: Most Permissive Entities
id: 519b4386-8908-40bd-8323-e123a8e9cb05
status: experimental
level: medium
description: |
  This query lists the top 100 entities that have the most permissions to perform a certain action on a resource. The query extracts the type of permissions, such as reader, contributor, owner and other (custom) roles. It is good practice to review the users with the most permissions, or put additional monitoring on their accounts. Because they are highly priviliged threat actors can perform a lot of actions once the account has been taken over.
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    // Permission Statistics
    ExposureGraphEdges
    | where EdgeLabel == "has permissions to"
    | extend Type = extract(@'"name":"(.*?)"', 1, tostring(EdgeProperties))
    | where isnotempty(Type)
    | summarize TotalPermissions = dcount(TargetNodeName), ResourceList = make_set(TargetNodeName, 100), PermissionTypeCount = dcount(Type), PermissionTypes = make_set(Type) by SourceNodeName
    | sort by TotalPermissions, SourceNodeName
    | project SourceNodeName, TotalPermissions, PermissionTypeCount, ResourceList, PermissionTypes
    | top 100 by TotalPermissions
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
