title: Nltest Discovery Activities
id: 961b5580-2f63-49af-9979-472f6b5e551a
status: experimental
level: medium
description: |
  The windows utility Nltest is known to be used by adversaries to enumerate domain trusts. This detection is based on Windows Security Event 4688 and triggers if more than 3 nltest queries are executed by a user on the same computer within 30 minutes. You can alter the variables yourself to tailor it to your environment.

  In case you want to detect this behaviour with Defender For Endpoint, using the *DeviceProcessEvents* table, see: [Nltest Discovery](../Defender%20For%20Endpoint/NltestDiscovery.md)
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    let NLTestParameters = pack_array("dclist", "dcname", "dsgetdc", "dnsgetdc", "finduser", "domain_trusts", "dsquerydns");
    let BinSize = 30m;
    let Threshold = 3;
    SecurityEvent
    | where EventID == 4688
    | where tolower(CommandLine) has "nltest.exe"
    | extend ParsedCommandLine = tolower(parse_command_line(CommandLine, "windows")[1])
    | where ParsedCommandLine has_any (NLTestParameters)
    | summarize TotalQueries = count(), TotalUniqueQueries = dcount(CommandLine), Commands = make_set(CommandLine, 100) by Computer, Account, bin(TimeGenerated, BinSize)
    | where TotalQueries >= Threshold
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
