title: Nltest Discovery Activities
id: 1ff031af-e8fc-4f4b-a813-81681a234e56
status: experimental
level: medium
description: |
  The windows utility Nltest is known to be used by adversaries to enumerate domain trusts. This detection is based on the *DeviceProcessEvents* table and triggers if more than 3 nltest queries are executed by a user on the same computer within 30 minutes. You can alter the variables yourself to tailor it to your environment.

  In case you want to detect this behaviour with Windows Security Events, see: [Security Events - Nltest Discovery](../SecurityEvents/NltestDiscovery.md)
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    let BinSize = 30m;
    let Threshold = 3;
    DeviceProcessEvents
    | where ActionType == "ProcessCreated"
    | where tolower(ProcessCommandLine) has "nltest.exe"
    | extend ParsedCommandLine = tolower(parse_command_line(ProcessCommandLine, "windows")[1])
    | where ParsedCommandLine has_any (NLTestParameters)
    | summarize TotalQueries = count(), TotalUniqueQueries = dcount(ProcessCommandLine), Commands = make_set(ProcessCommandLine, 100), arg_max(Timestamp, *) by DeviceName, AccountUpn, bin(Timestamp, BinSize)
    | where TotalQueries >= Threshold
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
