title: Potential Phishing Campaign
id: bea06837-7bc9-41ec-8d20-dfbd4843bf18
status: experimental
level: medium
description: |
  The *EmailClusterId* which can be assigned to a mail is the identifier for the group of similar emails clustered based on heuristic analysis of their contents. Therefore this identifier can be leveraged to find related mails. This can for example be from a different sender or the content of the mail has changed from Hello Bob to Hello Alice but the rest of the contents has stayed the same. This query searches for mails that have the same *EmailClusterId* but have different senders. Furthermore only emails that contain a URL are selected by joining the EmailUrlInfo table.

  This query needs adjustments to fit in your environment, this can be done using the threshold variables *RareDomainThreshold* and *TotalSenderThreshold*.
author: Bert-JanP
logsource:
  product: office_365
  service: kql
detection:
  _kql_query: |
    let RareDomainThreshold = 20;
    let TotalSenderThreshold = 1;
    let RareDomains = EmailEvents
    | summarize TotalDomainMails = count() by SenderFromDomain
    | where TotalDomainMails <= RareDomainThreshold
    | project SenderFromDomain;
    EmailEvents
    | where EmailDirection == "Inbound"
    | where SenderFromDomain in (RareDomains)
    | where isnotempty(EmailClusterId)
    | join kind=inner EmailUrlInfo on NetworkMessageId
    | summarize Subjects = make_set(Subject), Senders = make_set(SenderFromAddress) by EmailClusterId
    | extend TotalSenders = array_length(Senders)
    | where TotalSenders >= TotalSenderThreshold
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
