title: Potential Kerberos Encryption Downgrade
id: cf8ade19-e757-4027-8490-b029da000861
status: experimental
level: medium
description: |
  Adversaries can use older kerberos encryption algorithms which are vulnerable to brute force attacks to crack passwords. This query can be used to detect changes in the support of kerberos encryption standards on domain joined devices. This query will list all changes that are performed after a device has joined the domain. If the results contain older encryption versions it could be an adversary trying to enable older ciphers to perform kerberoasting on a later stage.

  What are weak algoritms? ([source](https://web.mit.edu/kerberos/krb5-latest/doc/admin/enctypes.html))
  - des-cbc-crc	
  - des-cbc-md4
  - des-cbc-md5
  - des3-cbc-sha1
  - arcfour-hmac
  - arcfour-hmac-exp
author: Bert-JanP
logsource:
  product: microsoft_defender_identity
  service: kql
detection:
  _kql_query: |
    IdentityDirectoryEvents
    | where ActionType == "Account Supported Encryption Types changed"
    | extend
    ToAccountSupportedEncryptionTypes = tostring(parse_json(AdditionalFields).['TO AccountSupportedEncryptionTypes']),
    FromAccountSupportedEncryptionTypes = tostring(parse_json(AdditionalFields).['FROM AccountSupportedEncryptionTypes']),
    TargetDevice = tostring(parse_json(AdditionalFields).['TARGET_OBJECT.DEVICE']),
    ActorDevice = tostring(parse_json(AdditionalFields).['ACTOR.DEVICE'])
    // Exclude the devices that did already have a supported encryption enabled. This is mostly due to the deployment of a device.
    | where FromAccountSupportedEncryptionTypes != "N/A"
    | project Timestamp, DeviceName, FromAccountSupportedEncryptionTypes, ToAccountSupportedEncryptionTypes, ActorDevice, TargetDevice
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
