title: Query the installed extensions with the most required permissions
id: 71e9d6eb-ac3e-480e-88b0-567a5d14d0e9
status: experimental
level: medium
description: |
  KQL detection rule: Query the installed extensions with the most required permissions
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    let ExtentionsWithNotification = DeviceTvmBrowserExtensionsKB
     | where PermissionId contains "Notification"
     | summarize make_set(ExtensionId) by ExtensionId;
    DeviceTvmBrowserExtensions
    | where ExtensionId in (ExtentionsWithNotification)
    | distinct DeviceId, ExtensionName
    | summarize TotalInstalledDevices = count() by ExtensionName
    | sort by TotalInstalledDevices
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
