title: Statistics onboarded devices (OS)
id: 4f1cb8b0-9239-412f-99a1-b9030e43b682
status: experimental
level: medium
description: |
  This query lists how many devices have been onboarded per operating system.
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    DeviceInfo
    | where OnboardingStatus == "Onboarded"
    | summarize arg_max(Timestamp, *) by DeviceId
    | summarize TotalDevices = count() by OSPlatform
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
