title: Suspicious RUNMRU Entry
id: e897d3b0-778a-4e20-94c9-20a6a7763469
status: experimental
level: medium
description: |
  This query should be implemented as custom detection, it triggers once a Suspicious Windows RUNMRU entry found on a device. These RUNMRU entries are one of the key indicators for ClickFix.

  The list of *Parameters* and *Executables* is limited, add additional entries according to your risk apetite.
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    let Parameters = dynamic(['http', 'https', 'Encoded', 'EncodedCommand', '-e', '-eC', '-enc', "-w", 'iex']);
    let Executables = dynamic(["cmd", "powershell", "curl", "mshta"]);
    DeviceRegistryEvents
    | where ActionType == "RegistryValueSet"
    | where RegistryKey has "RunMRU"
    | where RegistryValueData has_any (Parameters) and RegistryValueData has_any (Executables)
    | project-reorder Timestamp, DeviceId, DeviceName, RegistryValueData, RegistryKey
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
