title: Suspicious Encoded Powershell
id: 610db5fe-e577-4e33-9de8-bf5eca41f4b3
status: experimental
level: medium
description: |
  KQL detection rule: Suspicious Encoded Powershell
author: Bert-JanP
logsource:
  product: microsoft_threat_hunting
  service: kql
detection:
  _kql_query: |
    let EncodedList = dynamic(['-encodedcommand', '-enc']); // -e and -en can also be added, be aware of FPs
    let TimeFrame = 48h; //Customizable h = hours, d = days
    DeviceProcessEvents
    | where Timestamp > ago(TimeFrame)
    | where ProcessCommandLine contains "powershell" or InitiatingProcessCommandLine contains "powershell"
    | where ProcessCommandLine has_any (EncodedList) or InitiatingProcessCommandLine has_any (EncodedList)
    | extend base64String = extract(@'\s+([A-Za-z0-9+/]{20}\S+$)', 1, ProcessCommandLine)
    | extend DecodedCommandLine = base64_decode_tostring(base64String)
    | where not(isempty(base64String) and isempty(DecodedCommandLine))
    | summarize TotalEncodedExecutions = count() by DeviceName
    | sort by TotalEncodedExecutions
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
