title: The art of Knowing Your SIEM & XDR Data
id: 45bf1bcb-5280-4e43-bc5b-c18b95f84a5a
status: experimental
level: medium
description: |
  KQL detection rule: The art of Knowing Your SIEM & XDR Data
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    union * 
    | where TimeGenerated > ago(90d) 
    | distinct Type
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
