title: Threatview IP High Confidence Feed
id: 15540963-837e-4c42-b88c-cde870f42332
status: experimental
level: medium
description: |
  KQL detection rule: Threatview IP High Confidence Feed
author: Bert-JanP
logsource:
  product: microsoft_threat_hunting
  service: kql
detection:
  _kql_query: |
    let ThreatIntelFeed = externaldata(DestIP: string)[@"https://threatview.io/Downloads/IP-High-Confidence-Feed.txt"] with (format="txt", ignoreFirstRecord=True);
    let IPRegex = '[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}';
    let MaliciousIP = materialize (
       ThreatIntelFeed
       | where DestIP matches regex IPRegex
       | distinct DestIP
        );
    DeviceNetworkEvents
    | where RemoteIP in (MaliciousIP)
    | extend GeoIPInfo = geo_info_from_ip_address(RemoteIP)
    | extend country = tostring(parse_json(GeoIPInfo).country), state = tostring(parse_json(GeoIPInfo).state), city = tostring(parse_json(GeoIPInfo).city), latitude = tostring(parse_json(GeoIPInfo).latitude), longitude = tostring(parse_json(GeoIPInfo).longitude)
    | project-reorder Timestamp, DeviceName, RemoteIP, RemotePort, InitiatingProcessAccountName
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
