title: Triggers when a known ransomware extension has been found
id: 6ebe9165-bfab-46e2-a0f8-581803b5951b
status: experimental
level: medium
description: |
  This query triggers when a file with a known ransomware extension has been found.
author: Bert-JanP
logsource:
  product: microsoft_defender_endpoint
  service: kql
detection:
  _kql_query: |
    let RansomwareExtensionsInput  = externaldata(Extension: string)[@"https://raw.githubusercontent.com/eshlomo1/Ransomware-NOTE/main/ransomware-extension-list.txt"] with (format="txt", ignoreFirstRecord=True);
    let RansomwareExtensionAddition = dynamic(['.misingfromabovelist']); // Add your missing / new extensions in this list.
    let RansomwareExtensions = materialize (
     RansomwareExtensionsInput
     | distinct Extension
     | extend RawExtention = substring(Extension, 1, 
    string_size(Extension))
     );
    DeviceFileEvents
    | where FileName has_any (RansomwareExtensions) or FileName has_any (RansomwareExtensionAddition)
    | summarize
     arg_max(Timestamp, *),
     EncryptedFiles = make_set(FileName),
     Locations = make_set(FolderPath)
     by DeviceName
    | extend TotalFileEncrypted = array_length(EncryptedFiles)
    | project-reorder
     Timestamp,
     TotalFileEncrypted,
     EncryptedFiles,
     Locations,
     InitiatingProcessAccountName
    | sort by TotalFileEncrypted
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
