title: Visualize the Threat Intelligence Indicators last 30 days
id: 2b326096-6e5b-4be2-801a-0d7b1137ea20
status: experimental
level: medium
description: |
  This query visualizes the IOCs that have triggerd in the last 30 days. That can for example be Domains, IPs or URLs. THe resuls are rendered in a Piechart. 

  ## Sentinel
author: Bert-JanP
logsource:
  product: azure_sentinel
  service: kql
detection:
  _kql_query: |
    ThreatIntelligenceIndicator
    | where TimeGenerated > ago(30d)
    | extend IOC = iff(isnotempty(DomainName), DomainName, iff(isnotempty(NetworkIP), NetworkIP, iff(isnotempty(Url),Url, "No IOC defined")))
    | summarize count() by IOC
    | render piechart with (title="Threat Intelligence Indicators by IOC last month")
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
