title: Visualisation of operations that have been seen in the Cloud App logs in the last 30 days
id: 36d1a37e-85ee-41d5-95e4-3c463f9e3960
status: experimental
level: medium
description: |
  KQL detection rule: Visualisation of operations that have been seen in the Cloud App logs in the last 30 days
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    CloudAppEvents
    | where Timestamp > ago(30d)
    | extend Operation = tostring(parse_json(RawEventData).Operation)
    | where Operation != "CrmDefaultActivity" //Filter Dynamics 365 activities.
    | summarize count() by Operation
    | render piechart with(title="Operations last 30 days")
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
