title: Visualisation of ActionTypes that have been seen in the Cloud App logs in the last 30 days
id: eed5221a-d0c9-42da-9f6b-7a3e00929c90
status: experimental
level: medium
description: |
  KQL detection rule: Visualisation of ActionTypes that have been seen in the Cloud App logs in the last 30 days
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    CloudAppEvents
    | where Timestamp > ago(30d)
    | summarize count() by ActionType
    | render piechart with(title="ActionTypes triggered last 30 days")
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
