title: Visualize Phishing Detection Reasons
id: e3dd1fce-afa3-40b3-8146-2eabed12ea0b
status: experimental
level: medium
description: |
  This query visualizes the phishing detection reasons in a piechart. This is based on the EmailPostDeliveryEvents table. This table in the advanced hunting schema contains information about post-delivery actions taken on email messages processed by Microsoft 365. Based on this information the differnt detection reasons are visualized.
author: Bert-JanP
logsource:
  product: office_365
  service: kql
detection:
  _kql_query: |
    EmailPostDeliveryEvents
    | where ThreatTypes == "Phish"
    | extend DetectionMethod = tostring(extract(@'Phish":\["(.*?)"]', 1, DetectionMethods))
    | summarize TotalEvents = count() by DetectionMethod
    | render piechart with(title="Phishing Detection Reason Overview")
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
