title: Visualization of successful PIM activiations
id: 153ecd50-c5a6-4107-9448-d2a962fa7207
status: experimental
level: medium
description: |
  This query visualises the PIM activation performed by accounts. A user who has used many different PIM roles may be interesting to examine, it could be that a users always asigns their PIM access rights without needing them all the time. The same goes for PIM roles with high privileges.
author: Bert-JanP
logsource:
  product: azure_ad
  service: kql
detection:
  _kql_query: |
    AuditLogs
| where OperationName == "Add member to role completed (PIM activation)"
| summarize TotalActivations = count() by Identity
| sort by TotalActivations
| render columnchart
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
