title: Vulnerabilities visualized in a Piechart
id: 207c47ae-c7bf-40e9-8946-47db4288105b
status: experimental
level: medium
description: |
  KQL detection rule: Vulnerabilities visualized in a Piechart
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    DeviceTvmSoftwareVulnerabilities
| summarize count() by VulnerabilitySeverityLevel
| render piechart
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
