title: Vulnerabilities Year To Date CISA KEV Release Year
id: 60d70a15-46a8-47a0-ad41-dc5a9c65d2a0
status: experimental
level: medium
description: |
  This query uses the CISA Known Exploited Vulnerabilities Catalog to list the vulnerabilities year to date by year when the vulnerability was released.
author: Bert-JanP
logsource:
  product: microsoft_security
  service: kql
detection:
  _kql_query: |
    let KnowExploitesVulnsCISA = externaldata(CVEId: string, Vendor: 
    string, Product: string, VulnerabilityName: string, DateAdded: datetime, 
    Description: string, RequiredAction: string, DueDate: datetime, 
    Notes: string)
    [@"https://www.cisa.gov/sites/default/files/csv/known_exploited_vulnerabilities.csv"] 
    with (format="csv", ignoreFirstRecord=True);
    KnowExploitesVulnsCISA
    | where DateAdded between (startofyear(now()) .. startofweek(endofyear(now())))
    | extend Year = toint((split(CVEId, "-")[1]))
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
