title: SignIn From Suspicious IP
id: 3913de18-f8a9-42ba-8d56-6e4df13a2668
status: experimental
level: medium
description: |
  This query combines threat intelligence feeds with Entra ID sign-in information.

## Defender XDR
author: Bert-JanP
logsource:
  product: azure_ad
  service: kql
detection:
  _kql_query: |
    let IPs = ThreatIntelligenceIndicator
    | where isnotempty( NetworkSourceIP)
    | where ConfidenceScore > 70
    | distinct NetworkSourceIP;
AADSignInEventsBeta
| where IPAddress in (IPs)
| project TimeGenerated, AccountUpn, IPAddress, Country
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
