title: Sign Ins by UserAgent
id: 912a315c-3030-4c70-bb18-f307b97e12f6
status: experimental
level: medium
description: |
  This query can be used to detect rare UserAgents that are used to sign into your tenant. Those rare UserAgents can be used for malicious acces into your tenant.

The query can be extended by filtering on succesful and failed sign ins. 

## Defender XDR
author: Bert-JanP
logsource:
  product: azure_ad
  service: kql
detection:
  _kql_query: |
    AADSignInEventsBeta
| summarize count() by UserAgent
| sort by count_
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
