title: Total Succesful Sign-Ins by Browser
id: 09740a37-d05d-4413-87de-fd4356a54d0b
status: experimental
level: medium
description: |
  This query lists all the different browsers that are used to succesfully sign in to your Entra ID Tenant. This could be used to detect rare browsers that are used to sign into your tenant.


## Defender XDR
author: Bert-JanP
logsource:
  product: azure_ad
  service: kql
detection:
  _kql_query: |
    ## Sentinel
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
