title: Total Succesful Sign-Ins by Browser
id: b3aa01c0-9576-4d50-8e1f-4b2a8cbe6b84
status: experimental
level: medium
description: |
  This query lists all the different browsers that are used to succesfully sign in to your Entra ID Tenant. This could be used to detect rare browsers that are used to sign into your tenant.


## Defender XDR
author: Bert-JanP
logsource:
  product: azure_ad
  service: kql
detection:
  _kql_query: |
    ## Sentinel
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
