title: Visualization authentication Methods Used
id: b0188367-2fa4-46b8-93eb-4d53e38348ff
status: experimental
level: medium
description: |
  This visualisation shows the authentication methods that have been used based on the selected TimeFrame.
author: Bert-JanP
logsource:
  product: azure_ad
  service: kql
detection:
  _kql_query: |
    let TimeFrame = 30d;
SigninLogs
| where TimeGenerated > ago(TimeFrame)
| where ResultType == 0
| summarize Total = count() by AuthenticationProtocol, bin(TimeGenerated, 1d)
  condition: _kql_query
references:
  - https://github.com/Bert-JanP/Hunting-Queries-Detection-Rules
